{"Wed Apr 17 13:18:28 ": "The stuff that films and novels are made of: Agents Descend on a New York Gallery, Charging Its Owner http://t.co/WNx4xP7xnz #fb", "Fri Apr 19 11:55:39 ": "Third modem reset today. #ultimatefail @TWC", "Sat Apr 20 19:59:56 ": "NY state senator advocates torture for Marathon bombings suspect http://t.co/969QpIuPQI via @NewsdayNY", "Sat Apr 20 01:56:37 ": "--30--", "Fri Apr 19 00:58:37 ": "Superstorm Sandy didn't just shake up NY and NJ -- it literally MOVED the United States. http://t.co/TUVWy3ji6L via @Newsday #fb", "Wed Apr 03 19:48:51 ": "Because you can get roti, rice and beans, falafel and a donut, all from the same food cart @lesleyabravanel #miamivsnyc", "Tue Apr 09 21:29:22 ": "Jay Z and Beyonce's bizarre Cuba adventure, the saga continues http://t.co/8LyVAMMEuj via @damiencave #fb", "Thu Apr 04 14:58:27 ": "@SaraFrederick @lesleyabravanel and I are playing another rousing game of #miamivsnyc Feel free to jump in if you like.", "Thu Apr 18 12:49:41 ": "@popscribblings HuffPo take on green carpet looks http://t.co/Q5oGkXw1ZO", "Sat Apr 20 00:12:49 ": "RT @jmadelman: At midnight tonight, it's likely that 1775 will only rank as the second craziest April 19th in Boston history.", "Sat Apr 20 18:14:24 ": "Bravo (and what a wonderful way to make a point) RT @Slate Our mistakes this week: http://t.co/UsfGNWyduN  #Corrections", "Fri Apr 19 12:09:31 ": "@ArmaghanS wireless has never worked t/out the house which I'm willing to put up with. But this morning a bit cranky from sleep deprivation.", "Thu Apr 18 18:39:29 ": "Photos: Star power at Tribeca Film Fest  http://t.co/MYqMLaL6ix via @NewsdayNY @TribecaFilmFest", "Wed Apr 03 19:50:00 ": "Because at gallery openings, people go to look at the actual art rather than drink the cheap crappy wine @lesleyabravanel #miamivsnyc", "Thu Apr 18 20:48:25 ": "Here's your live probiotics plus some: NY tops nation in yogurt production. http://t.co/lH287OeLkb via @NewsdayNY", "Sun Apr 14 17:06:15 ": "@JillianSed that is awesome. Are you doing to Hudson Valley guide to the stars tour?", "Thu Apr 18 19:11:07 ": "NY Post editor: paper did not ID 2 young men on cover of paper as suspects. Isn't bag men the same? http://t.co/5kGwdAUcTb via @salon #fb", "Wed Apr 17 22:31:57 ": "@Dayngr haha", "Sat Apr 20 11:47:31 ": "RT @NewsdayCrime: Pick up today's #Newsday for complete coverage of the #Boston  bombings. We have a six-person team here. http://t.co/2cLl…", "Sat Apr 20 12:51:36 ": "Columns that epitomized column writing this week @GlobeCullen  Nothing tough about this boxer’s character \nhttp://t.co/AJrhxClqzU", "Sat Apr 20 14:38:27 ": "Funny: The apology the New York Post should have issued http://t.co/O1TqZCnSMT #fb", "Wed Apr 03 19:44:00 ": "Because I only listen to Don Omar when I want to, not when I'm forced to @lesleyabravanel #miamivsnyc", "Fri Apr 19 12:30:52 ": "@ArmaghanS Sleep? what's that? :)", "Thu Apr 04 01:22:47 ": "@jimlefko Every night. :) I even know how to use words like \"rout\" in headlines.", "Thu Apr 18 14:16:25 ": "@BmoreSandlots No idea. But hackers are a concern everywhere it seems, so I'd suspect yes.", "Wed Apr 17 01:02:33 ": "Superbly thoughtful take on acts of mass violence via @Salon http://t.co/O1HaJaGLOL #fb", "Thu Apr 18 12:40:50 ": "Too true @WillMcAvoyACN: How about we trust the authorities to release the photo of the actual suspects instead of trying to scoop everyone?", "Tue Apr 09 23:33:39 ": "Sure Miami your TEAM may be better, but ours sells more jerseys http://t.co/GgBT08UEKE via @espn #fb", "Sat Apr 20 12:42:17 ": "Anyone else seeing error 500 on bit.ly this morning?", "Tue Apr 02 19:09:43 ": "It's anti-semItism. With an \"I\". And yes, it is. @TooMuchMe @lesleyabravanel @vanessamenkes", "Wed Apr 17 23:28:35 ": "Heartbreaking: Partial list of victims of Boston Marathon bombing http://t.co/7xMLKbFnk3 via @BostonGlobe", "Fri Apr 19 22:37:01 ": "@mi_r_a_n_d_a @melfiomier Thanks Ashley. I read. Unfortunately, I'm unable to follow all who follow me. But thanks loads for the follows.", "Wed Apr 03 19:48:07 ": "Because they delightfully believe the power will stay on after a hurricane @lesleyabravanel #miamivsnyc", "Wed Apr 03 19:52:06 ": "Because cannibals are crazed cops rather than bath salt sniffing homeless guys @lesleyabravanel #miamivsnyc", "Tue Apr 16 23:00:12 ": "Letter with ricin sent to senator’s office http://t.co/XgytO5zODV via @washingtonpost", "Sat Apr 20 17:30:08 ": "Denver 420 Day with photos of Snoop Lion (Dog) http://t.co/KTwXbp77OM via @NewsdayNY @SnoopDogg", "Thu Apr 04 12:55:12 ": "LOL RT ‏@clarkspencer Miami Marlins on cusp of baseball history for ineptitude \nhttp://t.co/GJROVYbt78", "Mon Apr 15 16:55:05 ": "Wow a first. Spam text linking to a bit.ly. Maybe Luddites are onto something. #fb", "Thu Apr 18 15:33:32 ": "@popscribblings :) quite the get up.", "Thu Apr 04 15:02:13 ": "Because Soho, unlike SoFi, isn't a made up thing. @lesleyabravanel #miamivsnyc", "Thu Apr 18 17:09:56 ": "@vicequeenmaria love that blog post Ms M.", "Wed Apr 10 12:43:04 ": "Lindsay Lohan on Letterman: 'The interview was like the third step in her 12-step program' http://t.co/6QGipsV80t via @newsday @vernegay", "Sun Apr 21 13:11:40 ": "The week that was in 7 minutes and 7 seconds. Spectacular work by @BostonGlobe  http://t.co/4BNinr14zr #fb", "Thu Apr 04 19:37:58 ": "RIP Roger Ebert. http://t.co/EEOhF6qZPI #fb", "Tue Apr 02 19:15:55 ": "It's not \"offense\" -- it's a strong objection to a blatantly anti-semitic tweet by a news organization @TooMuchMe @lesleyabravanel", "Wed Apr 03 19:46:09 ": "Because I ride the subway rather than drive a Mercedes @lesleyabravanel #miamivsnewyork", "Wed Apr 17 01:47:12 ": "Here's an awww: Video Sweet Caroline at Yankees game http://t.co/1UO0dAn0nb #fb", "Thu Apr 18 23:20:39 ": "@WillMcAvoyACN smack", "Thu Apr 18 16:10:35 ": "RT @NialaBoodhoo: This is a good idea RT @dansinker: Can the United Nations pass some kind of resolution that we all just be really, rea ...", "Thu Apr 04 01:20:43 ": "Who's your all-time favorite Yankee? Vote now. http://t.co/rHZVC3dncC #fb", "Fri Apr 05 20:37:34 ": "NASA's gonna lasso an asteroid. Go get 'em space cowboys. http://t.co/hmPLeg9hff via @NewsdayNY", "Wed Apr 17 23:46:48 ": "RT @markseibel: An outlaw president (drones) and a tone-deaf Senate (background checks). No wonder folks are talking 2016.  http://t.co/ ...", "Fri Apr 19 01:17:11 ": "New 'Psy' video banned by South Korean broadcaster (not just because it is annoying) http://t.co/0ujbRl6q8U", "Wed Apr 10 12:47:15 ": "At what point does FB feel too invasive? FB rolls out an advertising tool based on offline spending \nhttp://t.co/mdD8IF6iUZ HT @lizheron #fb", "Sat Apr 06 15:27:21 ": "Truth, stranger than fiction: \nCouncilman busted in bribery probe was flogged by leaders of his heathen religion http://t.co/nuL5ShSDoO #fb", "Mon Apr 08 01:19:31 ": "No way. Wow. @lesleyabravanel @TooMuchMe: Dude I got attacked from people saying your Mercedes poem was anti-semitic ... Can u believe it?", "Thu Apr 04 15:03:13 ": "@lesleyabravanel then they must be wetting themselves in anticipation of season 3. Time for more Must See TV.", "Tue Apr 02 19:07:08 ": "It's April 2nd, so I fear it is actual anti-semitism as opposed to, you know, the jokey kind. @vanessamenkes @WLRN", "Wed Apr 17 23:33:23 ": "RT @SamSifton: ROLLER COASTER DAY. @Boston_Police FBI has cancelled the 8pm briefing tonight.", "Thu Apr 04 14:56:56 ": "@lesleyabravanel I hope that one doesn't merit me a letter or something.", "Sat Apr 20 18:00:57 ": "@mklopez ha. thanks.", "Mon Apr 15 13:54:15 ": "Pulitzers today. And the guessing game begins. http://t.co/RVMKK1iY3L via @Poynter #fb", "Sat Apr 20 17:51:04 ": "David Ortiz: Boston, this is our (non-bleeped) city ... the video http://t.co/WBh2E0Up7y", "Wed Apr 17 22:38:34 ": "@akolyer We have a great social media person here.", "Tue Apr 16 20:32:16 ": "Mike Piazza trades baseball for Balanchine with @MiamiCityBallet role. http://t.co/ylhDZYuiDk via @NewsdaySports #fb", "Thu Apr 04 12:52:20 ": "Farewell, My Lovely Miami Herald. Glad to have known you when. http://t.co/tpNvRsR94G", "Fri Apr 19 20:14:13 ": "Dzhokhar Tsarnaev, the actual Twitter account (hint: junk food and tv ranked high). http://t.co/fSNU0AKWIN via @intelligencer  @NYMag #fb", "Thu Apr 04 11:08:56 ": "one last one @lesleyabravanel because our cockroaches don't fly #miamivsnyc", "Fri Apr 19 13:30:58 ": "Interview with suspect's father via @AP \nhttp://t.co/FSco5ikY7J #fb", "Thu Apr 18 21:14:10 ": "Indictments handed down in NY bribery probe. http://t.co/3qv6lmZaQl via @NewsdayNY", "Mon Apr 08 01:34:19 ": "@stevecuozzo isn't it great?", "Sat Apr 20 17:55:18 ": "And Hollywood's most hated celebrity is ... http://t.co/qGPwMCRkyn via @NewsdayPopCult", "Thu Apr 18 12:26:19 ": "The real Andrew Cuomo (maybe): The Albany Machiavelli http://t.co/3j58prTh7S #fb", "Sat Apr 20 12:43:39 ": "10 good things that happened this week that you understandably might have missed http://t.co/irDfF8wUPE via @Salon #fb", "Thu Apr 04 14:46:33 ": "RT @lesleyabravanel: @ShelleyA because our refined foodies would eat cockroaches #miamivsnyc", "Fri Apr 19 18:48:29 ": "Diaz-Balart: Grassley’s immigration comments “not appropriate” http://t.co/fn4zwFOaDC via @Salon", "Thu Apr 18 12:38:01 ": "How to break up with Facebook. Or any other social media space where it's not you, it's them. http://t.co/TVoTV5axej", "Sun Apr 14 17:08:55 ": "@JillianSed can't wait to see the t-shirt", "Wed Apr 17 22:23:59 ": "@Dayngr I feel like I've been crowned with a geek tiara. :)", "Thu Apr 18 14:10:58 ": "New Psy video, just as annoying as the old Psy video http://t.co/rmqUQRjrWm #fb", "Thu Apr 18 17:29:46 ": "@vicequeenmaria all good thanks. Good with you?", "Fri Apr 19 23:50:34 ": "RT @NewsdayCrime: Authorities have confirmed they are converging on a house in Franklin St. where there is a boat in the backyard with like…", "Wed Apr 03 19:55:16 ": "Because neither the Mets nor the Yankees offered a Groupon on opening day @lesleyabravanel #miamivsnyc", "Thu Apr 18 17:04:19 ": "Apropos of nothing I totally do not get bitcoin.", "Mon Apr 08 16:25:49 ": "Sometimes you just gotta hate on the haters: Someone hates Roger Ebert: Westboro Baptist http://t.co/v4DhRu5DcL via @Salon", "Tue Apr 09 21:05:47 ": "Whoohoo just six more years till LIRR access from the east side is simplified http://t.co/v9Jtu0b4nF via @Newsday @TomZambito", "Wed Apr 17 22:20:48 ": "Woot. Verified. That is all.", "Fri Apr 19 23:43:29 ": "USA TODAY founder Al Neuharth dies at age 89 http://t.co/6Toqli7uOK via @usat h/t @lisalisaa", "Tue Apr 09 21:10:11 ": "When a Kennedy gets arrested, it isn't all Camelot. http://t.co/vc1K3LeqK0 via @newsdayny #fb", "Sat Apr 20 18:59:03 ": "Ratio of cops to fans to scalpers at Madison Square Garden: 1:1:1 #fb", "Thu Apr 04 01:45:34 ": "@jimlefko You are a cruel man. But I love ya anyways.", "Thu Apr 04 20:39:13 ": "@ArmandoSalguero Thanks for the follow, Armando. Hope it's all good.", "Wed Apr 17 22:40:20 ": "@akolyer No not particularly.", "Wed Apr 03 19:55:30 ": "RT @lesleyabravanel: @ShelleyA because at any A-list party, random bloggers with three readers including their husbands will NOT get in. ...", "Thu Apr 04 14:55:11 ": "Because our real housewives are better than yours. @lesleyabravanel #miamivsnyc", "Wed Apr 03 19:56:50 ": "Because even tho you may think it your bench can't beat our starters @OgleConnie  @lesleyabravanel #miamivsnyc", "Fri Apr 19 12:08:11 ": "Talking heads guessing ONCE AGAIN rather than reporting facts. Oh my media people. Just stop. Now. Facts please. Not fiction.", "Sat Apr 20 17:40:23 ": "@mklopez @hieronymus @JulesBonfante @JenFriel @KorinaBliss Thanks (belatedly) for #todayintwitter ing me", "Fri Apr 19 10:14:17 ": "Boston Globe on how the first suspect was killed, second remains at large http://t.co/SFvP3rDLkz via @BostonGlobe", "Fri Apr 19 12:02:54 ": "@TWC_Help Rebooted three times after pages failed to load. This happens often, but it's a bad morning for it to be happening."}