{"Fri Apr 12 14:45:55 ": "Full text of Army Chief of Chaplains CH (MG) Donald Rutherford's prayer from the White House Medal of Honor ceremony http://t.co/OJgT7obBJI", "Thu Mar 28 17:38:22 ": "Today we're at the Department of Defense All Services Social Media Conference #DODASSMC w/ @gov learning about Twitter best practices!", "Wed Apr 17 15:46:25 ": "April is the Month of the Military Child. How does your #MilitaryChild inspire your service? @chadcott", "Wed Apr 17 15:48:09 ": "Hooah! RT @RevTimBski: Chaplain is on the range http://t.co/predaHZgOV", "Thu Mar 28 19:04:02 ": ".@outriderumt Twitter could be a great channel for our Unit Ministry Teams (UMTs) to reach our #USArmy Soldiers who are already tweeting!", "Fri Mar 29 14:50:26 ": "Check out @USArmyReserve Chaplain's #ReadyandResilient Facebook: http://t.co/55kZwyu898 @chaplainfisher What are your favorite R&amp;R tools?", "Wed Apr 03 15:20:29 ": "We're updating our handle to @ArmyChaplains to clarify the Corps we  represent (vs \"Chap\"). We'll continue to share CH Assistant #56M info!", "Mon Apr 22 13:15:39 ": "RT @MRD_PER_Tm: #USArmy Chaplains, local clergy translate meetings to actions http://t.co/cvwcmF5GJG @LeafChronicle @101stAASLTDIV @ArmyCha…", "Thu Apr 11 18:28:36 ": "Rutherford: “We are humbled by strength &amp; honor of a chaplain who often appeared from nowhere...caring for souls as Battle of Unsan raged”", "Thu Mar 28 18:32:00 ": "RT @DODASSMC: Best practice: Go behind-the-scenes on @Twitter by sharing photos, says @Evins. Photos get 3-5 times more engagement. #DOD ...", "Fri Mar 29 16:47:06 ": "Pre-dawn: boots hit the ground &amp; Soldiers w/ rucksacks begin a hike. It's PT - but also a spiritual journey VIDEO: http://t.co/yG831pdRTN", "Thu Apr 11 17:54:09 ": "RT @USArmy: Why is Chaplain Emil J. Kapaun receiving the Medal of Honor? This video from @1stCavalryDiv explains: http://t.co/HrdNWV38B8 ...", "Thu Apr 04 20:01:58 ": "Unit Ministry Team support to Medal of Honor Hero SSG Clinton Romesha's Unit VIDEO: http://t.co/ysv7u4vB7J #honorthefallen #56M", "Wed Apr 10 12:42:18 ": "Starting Facebook page for your @USArmy org? Check out D.A. SOP! Be sure to add Posting Guidelines (5f): http://t.co/8mBETVWo18 @outriderUMT", "Thu Apr 11 12:35:44 ": "1 of 1st females in combat unit, CH Yanquoi-West is a proud part of CH Kapaun's 8th Cav Reg &amp; inspired by his LDRSHIP http://t.co/AQzvTwp0R5", "Thu Apr 04 15:34:00 ": "Hooah! @RevTimBski How does Chaplain Kapaun's courage inspire your service? #MOHKapaun #ChaplainCourage", "Thu Apr 18 13:52:05 ": "#MilitaryChild @modernonesimus : \"My 2 y/o daughter supports me as Chaplain by hugs &amp; says \"Daddy helps Soldiers when they cry\"", "Wed Apr 03 18:37:52 ": "EXCLUSIVE preview: CH (CPT) Emil Kapaun artifacts sent from his home parish in Pilsen, KS PHOTOS: http://t.co/RizMx3R8CX @USArmy #MOHKapaun", "Fri Apr 19 20:07:52 ": "FRIDAYS IN FOCUS: As we reflect on the events of this past week, we have been witness to both the best and worst humanity has to offer...", "Mon Apr 01 13:27:40 ": "RT @USArmy: #HonorTheFallen MT @ArlingtonNatl: #Easter Sunrise at the Tomb of the Unknown Soldier http://t.co/Q6wrPgSQxm", "Thu Apr 04 16:01:04 ": "RT @modernonesimus: 1 of my main influencers to become @ArmyChaplains: CH (CPT) Madison presents flag to nephew of WWII MIA LT Terpning  ...", "Wed Apr 10 12:26:41 ": "RT @MRD_PER_Tm: Korean war Chaplain to be awarded posthumous Medal of Honor: http://t.co/mdbIh3bjEF @FORSCOM @ArmyChaplains @CatholicNew ...", "Wed Apr 17 15:36:12 ": "Inspiring story of @USArmy Soldiers who completed Boston Marathon w/ rucksacks - &amp; then ran to help after explosions http://t.co/rIOLXSl5t2", "Tue Apr 16 20:40:03 ": "BDE/1st Line Supervisory Chaplains: check out resources at Chaplain Professional Reinforcement Training Support Page: http://t.co/RJGH0m4btx", "Thu Apr 04 13:06:28 ": "Month of the #MilitaryChild - MT \"@RevTimBski: how she supports is simple - I get a hug every day and she tells me she loves me.\"", "Mon Apr 08 18:41:30 ": "\"Military kids are some of the toughest, coolest, most well-traveled &amp; knowledgeable kids you'll find\"-CH(CPT)Nichols http://t.co/HVNqaF4DKj", "Fri Apr 12 18:07:36 ": "Rutherford: \"CH Kapaun’s faith and indomitable spirit inspired the Soldiers around him.\" http://t.co/LoFNW0QwV1", "Mon Apr 15 20:48:31 ": "Photos from CH (CPT) Emil Kapaun Medal of Honor ceremonies on 11 &amp; 12 April http://t.co/SSuB6pmiOu", "Wed Apr 03 20:02:11 ": "@1stCavalryDiv EXCLUSIVE preview CH (CPT) Kapaun artifacts from his home parish in Pilsen, KS. PHOTOS: http://t.co/RizMx3R8CX  #MOHKapaun", "Fri Apr 12 18:39:48 ": "CH Kapaun is inducted into the Pentagon's Hall of Heroes #MOHKapaun http://t.co/gGJP3Feaiv", "Fri Apr 05 19:39:16 ": "Interview w/CH Weathers Unit Ministry Team support to MOH recipient SSG Romesha's unit after combat casualties VIDEO: http://t.co/fh7lwvYnmZ", "Mon Apr 08 18:20:16 ": "RT @JEHutton: Selfless service, devotion to Soldiers define Korean War chaplain's service - http://t.co/QASLmOmGQM #ocpa @usarmy @ovvete ...", "Fri Apr 05 19:08:36 ": "@chaplainandrews Thanks! Please share your thoughts &amp; photos w/ us! This month: celebrate courage of CH Kapaun &amp; Month of the Military Child", "Thu Apr 11 18:30:24 ": "POWs brought back a crucifix made from found materials – a tribute to their friend, CH (CPT) Kapaun, “A shepherd in combat boots” #MOHKapaun", "Thu Apr 18 15:06:24 ": "Fill in the blank: #USArmy Chaplains and Chaplain Assistants demonstrate courage by _____________. #56M", "Thu Apr 11 20:25:08 ": "RT @jimmeysthoughts: Always proud to be a Chaplain but today is special. http://t.co/AmjpD4K2Db @armychaplains", "Fri Apr 12 18:49:06 ": "Ray Kapaun: CH Kapaun died in POW camp but the POWs he cared for and town of Pilson kept his memory alive #MOHKapaun", "Fri Mar 29 16:37:54 ": "FOB Sharana Afghanistan: Chaplain Rabbi Goldstrom promotes spiritual resiliency w/ Passover Seders for RC-E PHOTO: http://t.co/O39E3gw4k6", "Thu Mar 28 19:13:08 ": "Tweet Deck &amp; @hootsuite are 2 ways to manage social media presence &amp; track topics by setting up streams for hashtags &amp; searches #DODASSMC", "Thu Apr 11 14:19:34 ": "Chaplains today follow Medal of Honor recipient's lead - Nurture the Living, Care for the Wounded &amp; Honor the Fallen: http://t.co/f8nIf9J2eQ", "Thu Apr 11 18:39:26 ": "@BarackObama \"A soldier who didn’t fire a gun” wielded powerful weapon: to care &amp; inspire fellow Soldiers #MOHKapaun http://t.co/AQW9urG436", "Thu Mar 28 18:00:12 ": "RT @DODASSMC: Live-tweeting during a televised event results in an increase in followers/engagement. People watch tv w/ devices in their ...", "Wed Apr 03 19:47:03 ": "Chaplain Corps: How do your children support your service? April is the Month of the Military Child - share your photos &amp; stories with us!", "Mon Apr 15 18:26:56 ": "The recording of the \"Dial the Deputy\" teleconference w/ Chaplain &amp; Chaplain Assistant spouses is now available: http://t.co/1WMvL1u7MX", "Thu Apr 11 13:57:00 ": "1950 Korea: Army Chaplain (CPT) Kapaun risked his life to take care of Soldiers, earns the Medal of Honor #MOHKapaun http://t.co/rJlOr5WS69", "Fri Mar 29 15:27:32 ": "#USArmy Chaplain Rabbi leads Passover Seder for Soldiers far away from home in Yongsan, Korea ARTICLE: http://t.co/2TzVnmO9bR", "Thu Apr 11 14:27:06 ": "Kapaun was so beloved that POWs began MOH campaign the day they were released from N. Korean POW camp 60 yrs ago http://t.co/j9FLQfPKPw", "Mon Apr 08 19:40:47 ": "As a 12 y/o Jew fleeing Nazi Germany, Frank Cohn knew what the Statue of Liberty meant. Later served w/ US in WWII http://t.co/EmbRkziBDq", "Fri Apr 12 18:22:14 ": "SECARMY McHugh: CH Kapaun's only weapons were his steely defiance, words of comfort, and purple stole #MOHKapaun http://t.co/pu6rMCekBP", "Fri Apr 19 18:34:26 ": "Deputy Chief of Chaplains CH (BG) Ray Bailey Chaplain views a new CH (CPT) Kapaun Medal of Honor display: http://t.co/27GPJ23aIh", "Mon Apr 08 20:30:12 ": "1950 Korea: Chaplain (CPT) Kapaun ran through enemy fire to provide aid to comrades #MOHKapaun @USArmy @1stCavalryDiv http://t.co/IPbohPqcDv", "Thu Apr 04 15:08:06 ": "@Robnums HOOAH! Connect with us to share #56M photos, thoughts, &amp; advice!", "Thu Apr 04 20:14:25 ": "How does Chaplain Kapaun's courage inspire your service? @RevTimBski 's reflections BLOG: http://t.co/eZPlzlVipg #MOHKapaun", "Thu Apr 04 16:01:27 ": "RT @RevTimBski: @ArmyChaplains His courage comes from one who is greater. I'm inspired to continue to serve no matter what happens. It i ...", "Thu Mar 28 17:39:57 ": "There are 200 MILLION @Twitter users &amp; 400 million tweets sent each day", "Thu Mar 28 19:09:11 ": ".@outriderumt Army Slideshare is a great resource for UMTs &amp; chaplains looking to get started on Twitter! LINK: http://t.co/4W6zsefSMb", "Fri Apr 12 18:14:17 ": "@GENRayOdierno: CH Kapaun was a hero of the battle of Unsan and the many days that followed", "Thu Apr 11 13:38:23 ": "LIVE @ 2PM ET: @USArmy @1stCavalryDiv Chaplain (CPT) Emil J. Kapaun will be posthumously awarded Medal of Honor: http://t.co/gtiOzBxSdZ", "Fri Apr 19 15:32:58 ": "RT @chadcott: @ArmyChaplains My 3 kids joyfully \"share\" me w/ the Army. They sacrifice willingly as their way to serve Soldiers! http://t.c…", "Mon Apr 01 13:23:33 ": "Chaplain leads Financial Peace University MT @outriderumt: @DaveRamsey Chaplain Degn &amp; FPU class in San Fernando, CA http://t.co/gNQBhiODaK", "Fri Apr 12 17:00:18 ": "The Pentagon prepares for the next Kapaun MOH celebration! Watch the webcast LIVE at 2 p.m.: http://t.co/lDltGEswsR http://t.co/MuI8JRDFdK", "Fri Apr 12 18:36:33 ": "RT @DoDLiveMil: #SECDEF: The acts (of Chaplain Kapaun) that were cited today are tremendous acts by any measurement. #MOH", "Fri Apr 12 12:58:53 ": "In case you missed it: video of the Chaplain Kapaun Medal of Honor ceremony http://t.co/A0F8NYbO8g", "Mon Apr 08 18:36:10 ": "#MilitaryChild : \"I appreciate every sacrifice they have made so I can do my ministry &amp; serve God &amp; Country\" -CH (MAJ) James Foster...", "Tue Apr 16 12:37:59 ": "RT @ken_stice: #MOHKapaun @ArmyChaplains short video of a chaplain's perspective on CH Kapaun's formation and legacy http://t.co/lthb4nhvox", "Thu Apr 11 18:43:49 ": "Chaplain (CPT) Kapaun was “A Soldier that could turn a mud hut into a cathedral” -@BarackObama at Medal of Honor Ceremony #MOHKapaun", "Fri Apr 19 20:10:11 ": "Despite disaster &amp; dismay, we find hope in inspiring acts of others. The Army Chaplain Corps nurtures the living through word &amp; action.", "Fri Apr 05 12:51:01 ": "RT @CSAPAO: Korean Chaplain to receive #MedalofHonor http://t.co/pQvTdJ9NFs @USArmy", "Thu Apr 04 15:16:15 ": "CH (CPT) Madison presents flag to nephew of WWII MIA LT Terpning, honored at @arlingtonnatl PHOTO http://t.co/Shgbhzuu72 #honorthefallen", "Thu Apr 11 18:27:12 ": "Army Chief of Chaplains CH (MG) Rutherford delivers White House Medal of Honor ceremony invocation #MOHKapaun http://t.co/3Dzr1nnQsI", "Fri Apr 12 12:31:47 ": "RT @whitehouse: The President &amp; @FLOTUS meet Chaplain Kapaun's family before awarding him the Medal of Honor posthumously at the WH: ...", "Fri Mar 29 14:29:25 ": "RT @RevTimBski: @ArmyChapCorps #56M do so much for us. Mine just came back from WLC. Amazed at what he does for me everyday. More gratef ...", "Thu Apr 04 14:57:20 ": "#56M Congratulations to 15 Chaplain Assistants selected for promotion to Sergeant First Class! LINK: http://t.co/qk5XbQ8eiw", "Fri Apr 19 20:10:26 ": "How you have encouraged others this week - or who has inspired you? How will you nurture others in the week to come?", "Thu Mar 28 18:31:15 ": "RT @stefaniepidgeon: Ppl w/o a Twitter acct can still get your tweets via text message by texting 40404 \"follow (username)\" #twittergov  ...", "Wed Apr 03 19:51:21 ": "@EYielding April is the Month of the Military Child - how do your children support your service? Share your photos &amp; stories with us", "Tue Apr 16 12:35:13 ": "RT @ken_stice: #chaplains CH Julie Rowan shares with new @ArmyChaplains practical advice to be themselves and follow their calling http: ...", "Thu Apr 04 13:02:30 ": "RT @ken_stice: I know as @ArmyChaplains know I owe my tenacity to the fuel of my #MilitaryChild - all 3 daughters' love as AWESOME &amp; ...", "Thu Mar 28 18:04:56 ": "RT @DoDLiveMil: #SecDef and @Martin_Dempsey brief at the Pentagon today @ 2:30 p.m. we will live Tweet, watch live: http://t.co/RhSn3j0o78", "Thu Apr 18 18:57:12 ": "Our Chaplain Corps children are forces of love &amp; encouragement behind our Chaplains &amp; CH Assistants! http://t.co/dh5WLS9405 #MilitaryChild", "Mon Apr 01 15:38:19 ": "Easter card from CH Kapaun. The chaplain would inspire hope in fellow Soldiers during Korean War. PHOTO: http://t.co/G0i2Y931jV #MOHKapaun", "Fri Apr 12 18:05:51 ": "Army Chief of Chaplains CH (MG) Rutherford delivers Pentagon Medal of Honor ceremony invocation #MOHKapaun", "Thu Apr 11 14:39:16 ": "Across fox holes, Kapaun would crack a joke, hand over a peach &amp; say a little prayer w/ nervous Soldiers http://t.co/j9FLQfPKPw #MOHKapaun", "Thu Apr 11 18:44:45 ": "Kapaun “reminds us of the good we can do each and every day regardless of the most difficult of circumstances” -President Obama #MOHKapaun", "Fri Apr 12 18:12:46 ": "@GENRayOdierno: In the midst of battle, CH Kapaun cared for his Soldiers regardless of their faith.", "Thu Apr 11 16:48:50 ": "WATCH LIVE @ 2pm ET: @BarackObama will award Korean War Army hero Chaplain (CPT) Emil J. Kapaun the Medal of Honor: http://t.co/gtiOzBxSdZ", "Fri Apr 12 18:46:16 ": "CH Kapaun's nephew Ray gives remarks during the Hall of Heroes ceremony http://t.co/KelNK4kz9y", "Thu Apr 11 16:07:04 ": "Honoring Korean War Vets, including those held as POWs or listed as MIA for their service &amp; sacrifice http://t.co/Ny9o1fNYTj @pow_mia_us", "Thu Apr 11 13:28:10 ": "#MOHKapaun RT @nprnews 'He Saved Hundreds': Army Chaplain To Get Medal Of Honor http://t.co/tHVCb8RAsl", "Wed Apr 10 14:50:22 ": "New photos: Medal of Honor recipient CH (CPT) Kapaun's selfless service in Korea http://t.co/mb5EJu2SDn @USArmy #MOHKapaun", "Wed Apr 03 20:00:13 ": "@chaplainandrews April is the Month of the Military Child - how do your children support your service? Share your photos &amp; thoughts with us", "Fri Apr 12 18:28:19 ": "SECARMY: CH Kapaun was an amazing man who continues to inspire us today #MOHKapaun", "Fri Apr 12 17:52:37 ": "RT @DeptofDefense: WATCH LIVE at 2pm ET: Medal of Honor recipient @USArmy Chaplain Kapaun will be inducted into the Hall of Heroes http: ...", "Wed Apr 03 19:58:33 ": "@RevTimBski April is the Month of the Military Child - share your photos &amp; thoughts on how your child supports your service with us!", "Fri Apr 12 18:10:56 ": "@GENRayOdierno speaks at CH Kapaun Medal of Honor ceremony. CH Kapaun \"epitomized the essence of a Soldier\" http://t.co/fSWkkDQVzG", "Mon Apr 01 15:45:21 ": "@jovimprevot thank you for writing &amp; sharing a great article highlighting so many of our U.S. Army chaplains! LINK: http://t.co/dswdhTEzNk", "Tue Apr 09 20:07:53 ": "\"Under Fire: Chaplains in Korea\"- The Army lost 8 chaplains in combat during the 1st year of the Korean War ARTICLE: http://t.co/DztRppTHAJ", "Wed Apr 03 15:40:38 ": "We've updated our username to @ArmyChaplains ! Thanks for engaging w/ us on Soldier support &amp; #MOHKapaun @USArmy @ArmyCSF2 @1stCavalryDiv", "Fri Mar 29 13:26:17 ": "Proud of our #USArmy Chaplain Assistants, who provide protection &amp; enable religious support! #56M Spotlight PHOTOS http://t.co/bQA3i1Df2x", "Thu Mar 28 18:29:40 ": ".@outriderumt search the hashtag #DODASSMC to see the tweets from this event! Great tips &amp; interesting facts about using Twitter for @gov"}