{"Thu Sep 06 17:44:00 ": "RT @annehelen: i am dying. 20,000 Leagues Under the Sea! Gone with the Wind! // They Had a Tablescape Competition at the Fair http://t.c ...", "Thu Apr 18 20:10:45 ": "Whoops, I got the @girlswritenow mentor application form URL wrong. Here it is: http://t.co/YYj72luo99 #applytoday", "Wed Oct 03 18:27:52 ": "RT @moryan: Disagree. Has to be @PerdHapley! RT @TVMcGee Let Leslie Knope and/or Ron Swanson moderate tonight's presidential debate. #Pa ...", "Wed Sep 12 21:00:02 ": "RT @franklinavenue: Donald Glover is still signed on for season 4 of Community, but after that could star in his own NBC show. http://t. ...", "Mon Oct 08 18:46:30 ": "RT @AltoidLover: @popscribblings Maybe they can bring back Work It, if only to cancel it again. That deserved to be crushed beneath the  ...", "Thu Aug 23 12:50:37 ": "@jbakernyc Very true. If \"qzxh\" could be a word that would be super helpful too. #WordsWithFriends", "Mon Oct 08 18:05:57 ": "@mediajorge You're welcome! Impressed by how many people he's worked with.", "Mon Sep 10 17:33:17 ": "RT @onlyONscripting: Why did we wait so long to add \"Rihmix\" to the lexicon of pop music to describe a remixed Rihanna track?", "Wed Oct 03 15:40:38 ": "My interview with @carlyrosemusic about her @TheXFactorUSA audition, why she admires @kelly_clarkson &amp; more: http://t.co/aFcwqzAP #newsdayny", "Tue Jul 17 20:46:45 ": "RT @mediajorge: [It's the Love Boat for Hipsters. Sadly, no Charo on the bill.] From Desert to Cruise Ship: Coachella Heads to Sea http: ...", "Tue Jul 17 21:34:54 ": "Bunheads: Seinfeld 2.0? Sort of. http://t.co/YbD3Ds9Z", "Tue Sep 11 23:05:26 ": "Just had to acknowledge dissonance of my work day: Blogged about the Kardashians, then interviewed the legendary Pete Seeger. #thatshowIroll", "Wed Jul 18 20:12:18 ": "RT @JillianSed: 91 degrees and hailing in NYC. Is this what Hell freezing over feels like?", "Fri Sep 07 02:15:50 ": "Nooooooo! Refuse to believe that Amy Poehler and Will Arnett are separating. Simply put: Boo times Infinity. http://t.co/YGxeatKW", "Thu Jul 19 16:16:55 ": "Our @NewsdayNY roundup of Hudson Valley stars who scored Emmy nods, including @jimmyfallon &amp; @iamgreenfield: http://t.co/aXHNgz5r", "Wed Oct 10 17:07:19 ": "Now on @NewsdayNY: @NewsdayChris talks to @haydenpanettier about her new show “Nashville.” (Can’t wait to see it!) http://t.co/pNaHjCwO", "Wed Oct 03 16:26:10 ": "RT @Memles: Mandy Patinkin wore jeans to the 25th Anniversary screening of The Princess Bride? What a hero. #Holla", "Wed Jul 18 21:47:03 ": "RT @NewsdayChris: Now on @NewsdayNY: I ask Charlie Murphy (@cmurphycomedy) about Eddie Murphy, Dave Chappelle &amp; being a \"real comedi ...", "Wed Oct 10 19:07:38 ": "Really like this piece about the joys of reading aloud: http://t.co/fyLQL1CY", "Fri Sep 28 16:17:05 ": "A great read about the original production of \"Who's Afraid of Virginia Woolf\": http://t.co/N7Bwlxrv", "Tue Jul 17 21:32:25 ": "@mediajorge Of course! :)", "Thu Jul 19 17:36:54 ": "@SnarkysMachine No, just tweeting about it. I wish though!", "Wed Jul 18 21:55:08 ": "Wonder if Rosie O and Demi would reprise their roles? RT @vulture ABC Family developing Now and Then TV series http://t.co/VjYyVvIP", "Sat Sep 29 16:02:08 ": "Today's a special day -- @girlswritenow introduces mentors to the mentees. Such a fun, joyous time! #GWN15Orientation", "Thu Aug 23 14:30:24 ": "Ever wonder what it's like to write an advice column? A round table interview w/ four of the best. http://t.co/GXmxQdk0  (h/t @thehairpin)", "Mon Oct 08 18:33:45 ": "With all the good news for new fall shows like Mindy Project, Go On, New Normal, etc., kinda surprised no shows have been axed yet...", "Mon Sep 17 16:37:23 ": "RT @ShelleyA: The Winklevii just won't take no for an answer. RT @Salon: The Winklevoss twins' new investment: It's a  social network ht ...", "Thu Jul 19 16:22:05 ": "RT @franklinavenue: That may be the funniest Tweet from a network ever. Well played, CW. RT @CW_network: #Emmy nomination day! Or as we  ...", "Thu Apr 18 20:21:17 ": "“Sheri took out a medieval tool and pinched...the tiny soft eyelashes of each eye.” Sharon Olds’ poem “Vogue Shoot.”  http://t.co/7iUK4Plh0g", "Wed Apr 17 21:36:04 ": "Now on @NewsdayNY: All about this weekend’s Woodstock Writers Festival, featuring @CherylStrayed, Lydia Davis &amp; more. http://t.co/vQnPJCzzKc", "Wed Oct 03 17:48:54 ": "Always enjoy @TheAVClub’s Inventory lists, like this one. Who knew Gilligan’s Island cast reunited on ALF &amp; Roseanne? http://t.co/EcAtdcaB", "Tue Sep 11 23:35:33 ": "Watching \"Go On\" tonight? Check out @TylerJamesWill's thoughts on the show, March Sadness &amp; growing up in Yonkers: http://t.co/k7W503XL", "Thu Apr 18 15:22:58 ": "@SnarkysMachine  Seeing the numbers break it down like that was shocking, although perhaps it shouldn't have been. And hey back to you :)", "Wed Aug 22 15:11:03 ": "\"It will be before I'm in a nursing home.\" Kristen Bell on a making Veronica Mars movie. #yay http://t.co/zvpqf4J6", "Mon Sep 17 19:02:18 ": "After #eastwooding, kinda funny to see Clint kick a coffee table in the “Trouble with the Curve” ads. What does he have against furniture?", "Tue Apr 16 22:31:28 ": "At the Riverkeeper's Fishermen's Ball in Manhattan tonight -- Robert F. Kennedy Jr. has just arrived. #NewsdayNY http://t.co/vRjEHXvpNx", "Mon Oct 08 18:09:05 ": "RT @NewsdayChris: Now on @NewsdayNY: Allow @JayZ to reintroduce himself (to an older woman on the R train). http://t.co/EcE6Yl9r", "Mon Sep 10 18:20:37 ": "It’s so good! He even talks about Criminal Minds. RT @sepinwall Excellent Mandy Patinkin profile by @willapaskin http://t.co/7jTyHBoJ", "Wed Oct 03 15:35:29 ": "Goop-tastic news: Gwyneth Paltrow wants to make a Go-Gos musical: http://t.co/o8cjaHDH", "Thu Sep 06 20:02:39 ": "I’ve never seen Newsroom, but I bet yes. RT @splitsider Is 'The Newsroom' Really Just an Unfunny Remake of 'NewsRadio'? http://t.co/xjaYRgOO", "Wed Jul 18 22:40:35 ": "@SnarkysMachine Good point! I'd love for the original cast to come back (although Christina Ricci can play the adult version of herself now)", "Tue Jul 17 18:04:44 ": "RT @NewsdayNY: Hudson Valley stars @VWOfficial (Vanessa Williams) &amp; @DaveAnnable10 drop by Comic-Con to promote @666ParkAve_ABC. htt ...", "Fri Sep 07 03:09:47 ": "RT @MillerLoLife: If Obama loses the election, he should totally coach the Dillon Panthers next season. #DNC", "Thu Sep 06 18:20:31 ": "The Cloud Atlas trailer is a good reminder that I need to read the book before the movie comes out. http://t.co/HOPjmIQ2 #toomanybadwigs", "Tue Oct 02 19:25:00 ": "RT @popcultini: \"The Smiths are never, ever, ever\" getting back together. Who knew Morrissey was repped by Taylor Swift? http://t.co/FKR ...", "Wed Jul 18 15:45:00 ": "RT @SnarkysMachine: Rotten Tomato comments suspended after Nolanites go ape on negative reviewers:http://t.co/PqDi7eqJ", "Wed Oct 10 17:43:26 ": "RT @jbakernyc: Five dollars for PB&amp;J sandwich from the deli across the street. #Wrong", "Thu Aug 23 13:03:20 ": "@AltoidLover Ha! I'd watch that. With Arrested Development filming new episodes, a Veronica Mars movie actually seems possible these days.", "Wed Oct 03 22:06:05 ": "RT @flavorpill: An A-Z Guide to ‘Beverly Hills, 90210′ Style http://t.co/1Ldbgr75", "Tue Apr 16 23:15:02 ": "Mark Ruffalo, recipient of the Big Fish Award at the Fishermen's Ball, with RFK Jr. &amp; Lyle Lovett #NewsdayNY http://t.co/Cns2t56BPX", "Wed Oct 03 20:34:00 ": "@crsbecker I thought so too. Her fragility is almost palpable. A really sad story, I hope things get better for her.", "Wed Jul 18 20:49:24 ": "My @NewsdayNY interview with Snooki and JWOWW (which includes a small dig at Kim Kardashian): http://t.co/d3BDK0MK", "Mon Sep 10 16:07:26 ": "Now on @NewsdayNY: I chatted with @RickiLake about her new talk show, her dream guest and her Westchester roots: http://t.co/1r92UrGP", "Thu Apr 18 15:26:47 ": "@ShelleyA Too funny! Can't say I completely disagree.", "Fri Sep 28 15:34:18 ": "Now on @NewsdayNY: Chatted with @VWOfficial, @ErikPalladino and @DaveAnnable10 about their new show \"666 Park Avenue\": http://t.co/vGRiwFx1", "Fri Sep 28 17:32:57 ": "My interview with the amazing Pete Seeger about his new albums, Obama &amp; his special request for @stephenathome. http://t.co/gvDSRHoK", "Thu Apr 18 20:08:01 ": "An amazing &amp; worthwhile experience! MT @girlswritenow Are you a woman writer in NYC? Be a #mentor: hp://bit.ly/XpMV4T", "Thu Jul 19 16:47:03 ": "Paging Homer Simpson. RT @NewsdayNY NY State Fair to feature Big Kahuna Donut Dog: a maple-glazed doughnut around a bacon-wrapped hot dog.", "Thu Apr 18 15:46:04 ": "Ditto. It was an invaluable resource. RT @franklinavenue Sad to see sudden end to TVTattle. The most comprehensive aggregator of TV news.", "Wed Sep 12 19:30:14 ": "RT @NewsdayChris: Now on @NewsdayNY: New @LeoDiCaprio movie films in Ardsley, Martin Scorsese still short (and brilliant). http://t.co/q ...", "Wed Apr 17 22:57:27 ": "RT @franklinavenue: Exclusive: Remember the late 1980s game show WIN, LOSE OR DRAW? Disney Channel is bringing it back: http://t.co/0flj ...", "Tue Apr 16 23:53:01 ": "RT @TheRealRothman: #YokoOno giving the peace sign...#iconic at the Riverkeeper event http://t.co/airb00GFbz", "Wed Aug 29 14:25:38 ": "@onlyONscripting The latter reaction! I can't believe they want to reboot Fame again. I guess the show really does want to live forever.", "Tue Jul 17 15:33:58 ": "All great choices &amp; yes to Megan Hilty! RT @TheAtlanticENT Who deserves an Emmy nomination but probably won't get one: http://t.co/8mr9xEd1", "Mon Sep 10 13:35:45 ": "\"I can go head to head with the best white male comedy writers out there.\" Go @mindykaling! Her @vulture profile: http://t.co/k4Di9NNz", "Tue Jul 17 18:39:21 ": "Now reading: @vulture’s Tom Cruise analysis (http://t.co/sHyvTnRh), then @TheAVClub Dawson’s Creek recap. (http://t.co/2vxHRnJ7) #tomkatyeah", "Mon Sep 10 14:03:18 ": "One of life's hard questions. RT @jezebel If Nutella and Bacon Were Running for President, Who Would You Vote For? http://t.co/QtR29lcQ", "Fri Apr 19 15:30:51 ": "RT @TVMoJoe: Went to bed 6 hrs ago watching one awful real-life episode of 24. Just woke up and seem to be in a whole other season. Pls  ...", "Wed Oct 03 19:09:20 ": "The lead photo is absolutely stunning. And the article rocks, of course. Can't wait for part 2: http://t.co/4tL4NDPS", "Tue Jul 17 22:30:41 ": "@mediajorge Awesome. And your next iced coffee is on me!", "Wed Apr 17 21:09:25 ": "Out of 125 dramas, only 18 are violence-free. RT @nymag Good Luck Finding a Decent TV Drama Without Rape or Killing http://t.co/C5CHazuTk1", "Mon Sep 17 16:20:01 ": "Must-read: @NewsdayChris breaks the news to JJ Abrams that was once a Razzie nominee. They also talk “Revolution.” http://t.co/gUpOtEqh", "Wed Jul 18 21:09:50 ": "@jbakernyc @mediajorge @SnarkysMachine Thanks guys!", "Mon Sep 17 19:39:32 ": "This is why TV shows should be allowed to reach their natural end point. RT @vulture Everything Nancy Has Done on Weeds http://t.co/toUKdKOT", "Mon Sep 17 16:27:46 ": "Cupcake Justice! MT @nprmonkeysee I have unlocked the entire secret of American television, and it only took 25 words. http://t.co/9dd0SRNg", "Mon Oct 08 17:44:59 ": "RT @mediajorge: My chat w/ Adrian Sherwood's up. Thx, RT @magnetic_mag Hey @onusherwood thx again for the chat.... http://t.co/P9ydy0CY  ...", "Mon Aug 27 14:31:59 ": "Flight of the Conchords + adorable kids = \"Feel Inside (And Stuff Like That)\" http://t.co/I27FPEUM #happymonday", "Mon Sep 10 23:09:33 ": "Our @NewsdayNY fall TV preview features shows starring @VWOfficial, @TylerJamesWill, @haydenpanettier and so many more: http://t.co/vcrUK5wz", "Wed Jul 18 15:50:08 ": "Julianna Margulies, Steve Buscemi &amp; Glenn Close among Hudson Valley stars likely to score Emmy nods. http://t.co/YsAokN6h via @NewsdayNY", "Tue Oct 02 20:01:18 ": "Fun, educational and cute illustrations too! RT @The_Rumpus Where Letters Come From http://t.co/1w3f7ftK", "Tue Sep 11 23:21:15 ": "“@annkpowers: Here's what I wrote last year about live music right after 9/11 http://t.co/z6o831jL” Remember reading this then. Great piece!", "Wed Aug 29 14:37:18 ": "RT @NewsdayNY: Students share tips for freshmen at @SarahLawrence @ionacollege @SUNY_Purchase ‏@Vassar @WestPoint_USMA @paceuniversity h ...", "Thu Aug 23 20:47:11 ": "The multi-talented @MyFrugalnomics on shopping for back-to-school fashions in the Hudson Valley. http://t.co/Gg3QwkFv #NewsdayNY", "Tue Jul 17 19:16:47 ": "RT @girlswritenow: RT @nprmonkeysee: You are entitled to be wrong, to feel embarrassed, to feel like a jerk, and to keep writing anyway. ...", "Fri Sep 28 16:48:24 ": "@SnarkysMachine I'm looking forward to it too, I think it'll be a lot of fun. Glad to have O'Quinn back on TV too.", "Tue Sep 11 22:21:28 ": "Love that @slate is celebrating the 20th anniversary of \"Sneakers\" with these series of blog posts: http://t.co/OUiedsJH CC @NewsdayChris", "Mon Oct 08 18:14:35 ": "My interview with @ThisIsRobThomas on joining @NBCTheVoice and what he’d sing at a reality show audition: http://t.co/z9F9pzHG #newsdayny", "Tue Sep 11 21:09:05 ": "RT @jbakernyc: Eleven years since it happened. And #NYC has changed lots. Hoping elections this year can help us move forward to positivity.", "Fri Sep 28 15:23:19 ": "#FridayReads: \"Cloud Atlas\" by David Mitchell (Determined to finish this book before the movie comes out at end of Oct.)", "Wed Sep 12 19:32:31 ": "Can’t get Cougar Town’s “We’re Back” song out of my head, and I’m kinda okay with that: http://t.co/uX32qOVN #nothingrhymeswithTuesday", "Mon Aug 27 22:29:55 ": "Can you guess the mystery celeb based on their yearbook photo? We'll have a new pic every day this week! http://t.co/gY7flen2 #NewsdayNY", "Wed Aug 22 15:01:30 ": "Once Spy Daddy and Vaughn meet up, the trifecta of unofficial Alias reunions will be complete. http://t.co/GANdKwTd", "Mon Oct 08 17:37:16 ": "Wow, Behind the Music is 15 years old! A really interesting look back: http://t.co/bSNxcedf", "Mon Aug 27 14:16:31 ": "An article about the amazing work done at the Refugee Youth Summer Academy (led by my cousin, who is the headmaster): http://t.co/YxnVolJa", "Fri Sep 28 15:53:56 ": "Please take out Mob Doctor first. RT @TheCancelBear NBC's Thurs night looks like an \"all you can eat\" buffet for the bear. #fearthebear", "Tue Oct 02 21:24:16 ": "RT @NewsdayChris: .@NEWSDAYNY MULTIMEDIA: Celebs dine in Hudson Valley. Story: http://t.co/1MbXKS4n • Video: http://t.co/wG3W6zcq • Pics ...", "Wed Apr 17 22:23:05 ": "A welcome distraction from past few days -- reliving Hildi’s crazy “Trading Spaces” makeovers. http://t.co/qCCLh5qoTO", "Thu Sep 06 18:05:05 ": "So much fun: Hudson Valley celebs’ yearbook pics, w/ @jimmyfallon, @iamdiddy, @KeithOlbermman &amp; more: http://t.co/wcHZPTri #newsdayny", "Wed Jul 18 16:44:14 ": "My day is 100% better now that @thehairpin posted @annehelen’s latest Scandals of Classic Hollywood! http://t.co/uyM8VMVR", "Wed Aug 22 14:31:29 ": "\"Why isn't sug a word?  It would make a great word - sounds like a halfway shrug.\" #thoughtswhileplayingwordswithfriends"}