{"Fri Apr 12 17:53:36 ": "Check out the official track list for #ActionReaction ...out May 7th! http://t.co/tu07Rj40GW", "Wed Jan 30 16:02:50 ": "CONGRATULATIONS to winner of my \"Super Super Bowl Party\" Sweepstakes.... CONNIE KMIEC!\n\nPlease email... http://t.co/7ixT2MBW", "Thu Jan 31 20:37:00 ": "In honor of this weekends big game, I decided to put a little twist on my song \"Doorbell Party\". Check it out ;)\nhttps://t.co/vaAcCGFz", "Wed Nov 28 15:50:34 ": "WIN A $100 VISA GIFT CARD! Visit my Facebook for details and to enter!!!\nhttps://t.co/xKjrohrz http://t.co/CgjOOqjx", "Fri Apr 19 16:18:13 ": "Continued prayers for Waco and Boston.", "Fri Nov 09 16:49:37 ": "Happy Friday! xo Julie http://t.co/ZZU6GLTY", "Mon Apr 08 15:43:32 ": "Congrats to all of last night's ACM Award Winners!", "Tue Feb 19 22:15:59 ": "Hope you all have been having a great Tuesday so far :) New music coming very soon! xo Julie", "Tue Feb 05 17:50:32 ": "These last couple weeks had been so fun! I also was able to attend the SAG awards! http://t.co/sxN4cg16", "Fri Mar 22 16:08:40 ": "My official website had a little bit of a makeover...check it out!:\nhttp://t.co/C1OgqWfnRL http://t.co/SwQEat0NrU", "Mon Mar 04 21:25:33 ": "Shooting some footage in Mexico for a new music video. Loving life! xo Julie", "Mon Feb 25 17:53:54 ": "Thank you to Indie Music Sampler for adding \"Doorbell Party\" to their playlist! http://t.co/IIkNPzHMid", "Wed Dec 19 17:11:05 ": "Christmas parties are definitely one of my favorite things about the holidays. What's yours? \nhttp://t.co/ITNz8LUR", "Mon Feb 11 15:47:06 ": "Did you watch the Grammy's last night? Who was your favorite performer?!?", "Tue Nov 20 16:58:02 ": "What are your plans for Thanksgiving this year?", "Tue Nov 06 17:13:37 ": "#Vote today! Be an American &amp; make each vote count, because it don't matter where you come from or who you are, it's the American Dream.", "Tue Feb 12 16:30:50 ": "I posted a new photo to Facebook http://t.co/q7xOupOk", "Fri Feb 01 16:55:20 ": "@CountryMusicBiz Check out my fun new song #SuperBowlParty!! https://t.co/vaAcCGFz", "Fri Feb 01 17:03:29 ": "#SuperBowlParty #football #countrymusic https://t.co/vaAcCGFz", "Wed Oct 31 15:14:00 ": "Happy Halloween Everyone!!!!", "Tue Jan 01 19:12:39 ": "Happy New Year everyone! Looking forward to seeing what 2013 will bring! xo Julie", "Wed Dec 12 20:06:25 ": "Here is a slideshow to the song the inspired my contest, \"Best Christmas Yet\". Check it out!... http://t.co/DdJvpFl2", "Tue Dec 04 16:36:14 ": "What is something you're looking forward to this Christmas?", "Wed Mar 06 16:57:47 ": "Here is a photo from last night's BEAUTIFUL sunset in Mexico http://t.co/ApToBJ39LY", "Mon Nov 26 16:48:24 ": "Hope yall had a great Thanksgiving! I know I did! I traveled to Switzerland to see my good friend Kris Kristofferson! http://t.co/hpV7zrCY", "Thu Dec 20 15:49:51 ": "Thanks to everyone that commented in my \"Best Christmas Ever\" contest.  We had so many wonderful stories.  The... http://t.co/bPlVlx4E", "Mon Apr 15 20:57:31 ": "My thoughts and prayers go out to those in Boston.", "Mon Feb 04 18:01:09 ": "Had a blast at yesterdays game!!! #superbowl http://t.co/aEXR07vS", "Thu Mar 28 21:26:27 ": "Hope you all have been enjoying your Thursday! Who's ready for the weekend?!", "Thu Jan 24 20:18:53 ": "Happy Thursday! Check out my first single off my new album, \"Doorbell Party\"..thanks! xo Julie\nhttps://t.co/9FHA5Wke", "Thu Oct 18 19:49:32 ": "I posted 6 photos on Facebook in the album \"Performance with The Marine Corps Band\" http://t.co/92NZZ3Pl", "Mon Mar 04 21:38:16 ": "RT @PTML: Hear Julie Ingram (@thejulieingram) do \"Doorbell Party\" on podcast 313 at http://t.co/rWGiqS5Q5e", "Fri Feb 15 19:41:04 ": "It's Friday, y'all! Who's ready to party?\nhttps://t.co/9FHA5Wke http://t.co/qcpXzAMS", "Wed Jan 30 14:48:10 ": "The Super Super Bowl Sweepstakes has officially ended! Thank you again to everyone who has entered! Stay tuned... http://t.co/byIm9UpC", "Fri Dec 07 16:31:25 ": "Thinking about covering a classic Christmas song, but having trouble deciding which one. Whats your favorite Christmas song?", "Fri Jan 04 17:05:20 ": "Happy Friday everyone!\nhttps://t.co/UX0NCv54", "Tue Apr 23 14:18:04 ": "My friends are in 14th place....they still have a chance to win a ring and get engaged ON stage at WMZQ Fest... http://t.co/Xye7kTVLTE", "Fri Feb 01 17:01:16 ": "@SuperBowl Check out my fun new song #SuperBowlParty!! https://t.co/vaAcCGFz", "Mon Dec 03 17:17:28 ": "Again, you all have such wonderful Christmas stories! Thank you so much for sharing! I have some Christmas music... http://t.co/RKxhQ0kX", "Tue Mar 12 16:40:50 ": "Back from Mexico and already missing it! http://t.co/tMtjmxTVlr", "Tue Jan 29 16:39:31 ": "Last day to enter my Super Super Bowl Party Sweepstakes! And thank you to everyone who has entered... http://t.co/Ro2BSnH0", "Wed Jan 23 16:39:01 ": "WOW! Thank you to everyone who has entered my \"Super Super Bowl Party\" Sweepstakes! Because of the amazing... http://t.co/N29GPjwa", "Fri Feb 08 17:01:15 ": "Happy Friday! Any exciting plans for the weekend?", "Tue Dec 18 15:15:52 ": "Only 3 more days left of my \"Best Christmas Ever\" giveaway! Thank you to everyone who has shared their stories, I... http://t.co/IiAnCq7c", "Thu Nov 29 16:15:42 ": "Have you submitted your Christmas story yet? Remember, by sharing, you could win a $100 VISA gift card! http://t.co/0QncdOfc", "Wed Apr 24 15:32:12 ": "Check out my page on http://t.co/Czl57sfXKl!\nhttp://t.co/G5xSLrrgj2", "Fri Nov 30 17:33:45 ": "Wow nearly 100 entry's for my \"Best Christmas Ever\" giveaway...and such great stories!!! http://t.co/0QncdOfc", "Mon Nov 05 17:35:21 ": "Happy #MusicMonday http://t.co/w7eaITci", "Sat Feb 02 20:57:05 ": "Havin a great time in New Orleans!!! http://t.co/4uuLow8k", "Tue Apr 16 15:14:49 ": "Vote for my friends to win a ring and get engaged on stage at WMZQ Fest 2013! Click the link to vote now! http://t.co/z97lUFufxb", "Fri Feb 01 17:01:58 ": "@SuperbowlWatch Check out my fun new song #SuperBowlParty!! https://t.co/vaAcCGFz", "Tue Apr 16 15:14:19 ": "Help my friends out and vote for them to win a ring and get engaged ON stage at WMZQ Fest 2013!! All you have to... http://t.co/EdvCqXnW08", "Thu Mar 21 16:06:51 ": "\"For every action, there is a reaction. For every action, there is an attraction\" \nhttps://t.co/nYuJ0bqE9E", "Wed Feb 27 17:04:40 ": "I'm excited to announce my first single coming soon to a country radio near you...\"Action/Reaction\" \nhttps://t.co/nYuJ0bqE9E", "Thu Jan 17 15:45:14 ": "Having such a great time in the studio this week! http://t.co/5oNeqFWP", "Wed Mar 20 17:05:41 ": "If you could travel to one place right now, where would it be? I would definitely love to return to Mexico! http://t.co/zWHbEpw2YG", "Tue Nov 13 16:41:43 ": "New Holiday music coming soon, stay tuned ;) xo Julie", "Thu Feb 07 17:51:12 ": "New Album almost done y'all http://t.co/9gykajqh", "Mon Apr 22 15:44:00 ": "#HappyEarthDay! http://t.co/vpW3LqJZA5", "Fri Apr 05 15:39:56 ": "Happy Friday friends!\nhttp://t.co/C1OgqWfnRL http://t.co/0LuAvyrqyt", "Fri Mar 01 15:45:10 ": "HAPPY FRIDAY!\nhttps://t.co/nYuJ0bqE9E http://t.co/2030jN4TgT", "Fri Nov 02 13:57:12 ": "Congrats to all the #CMAaward winners!!! Did you guys watch them last night?", "Wed Dec 05 20:04:03 ": "Check out my new Christmas song, \"Doorbell Party\"\nhttp://t.co/lzzSGnAx http://t.co/4Eff3UtR", "Thu Nov 15 16:20:22 ": "New holiday music for all of you AND a contest in the works as well!  Check fb for more info! https://t.co/xKjrohrz http://t.co/NC9IUuso", "Wed Apr 10 20:10:50 ": "Hope you all are having a great day! http://t.co/1zO0CdjJ9K", "Fri Jan 25 22:42:08 ": "Hope everyone has a nice weekend! I have a lot of exciting things coming up, so stay tuned! xo Julie", "Thu Feb 14 15:05:18 ": "Happy Valentines Day!!!\nhttps://t.co/yucy69yd http://t.co/FsrmM40V", "Tue Nov 27 18:58:18 ": "Exciting contest announcement coming soon...stay tuned!", "Tue Feb 12 16:30:55 ": "I posted a new photo to Facebook http://t.co/wtQW75S1", "Mon Dec 24 18:02:07 ": "Congratulations to our \"Best Christmas Ever\" giveaway winner, Millie McClave! Thank you so much to everyone who... http://t.co/hMesMiFS", "Fri Jan 18 20:04:18 ": "Win a $25 VISA GIFT CARD! Enter at my Facebook page now! https://t.co/xKjrohrz http://t.co/MICGV2AB", "Tue Oct 30 14:11:40 ": "I hope and pray all my east coast fans are safe and doing well after yesterday's storm. \nLove, Julie", "Sun Nov 11 17:03:26 ": "\"Adversity makes a hero , we must never forget his loyalty..\nhe died for you and me. He died for the USA\" \n\nGod... http://t.co/ITq7FXAf", "Mon Feb 18 21:24:50 ": "LA ---&gt; Nashville!", "Tue Jan 08 19:18:01 ": "Excited to be flying to Nashville Thursday to finish recording my new album!", "Fri Nov 16 16:55:48 ": "You can now download Julie's music right here on Facebook! Click on the iTunes tab at the top of Julie's page and... http://t.co/HRqmN2Yv", "Mon Jan 28 16:48:59 ": "Happy Monday Everyone! Is there a special song you're listening to today? xo Julie", "Mon Nov 19 17:34:43 ": "Thanksgiving in T-minus 4 days! Which Thanksgiving dish are you most excited to indulge in?", "Mon Apr 01 21:10:34 ": "Back in Nashville putting the final touches on my new album. Happy Monday yall!... http://t.co/ZkK8UG0Uwp", "Tue Dec 11 15:58:59 ": "Get into the Christmas spirit and check out my fun new music video for \"Doorbell Party\"...let me know what you think!\nhttp://t.co/ITNz8LUR", "Thu Mar 14 19:29:14 ": "Posted a few pics from my photo shoot in #Mexico....check 'em out! https://t.co/bInPnyQBJc", "Wed Feb 20 17:23:14 ": "Make today great! http://t.co/NnHq26Vt", "Tue Feb 12 16:30:53 ": "I posted a new photo to Facebook http://t.co/Eu9LE9wp", "Fri Feb 01 16:47:49 ": "Have you listened to my song \"Super Bowl Party\" yet?! https://t.co/vaAcCGFz #superbowlparty", "Thu Feb 28 20:32:07 ": "Back in Nashville after another fun weekend in LA for the Oscars! http://t.co/pYkonIAmJq", "Tue Nov 06 21:44:48 ": "Just joined @gigmaven and ready to book gigs online! Check out my new profile at http://t.co/TNCBYcOr", "Mon Mar 04 21:38:32 ": "@2012knights08 Thank you Rickard!", "Tue Oct 30 15:09:15 ": "Heading to #Nashville for the #BMIAwards. Love this city!", "Fri Jan 11 15:04:28 ": "Hope you all have a wonderful Friday! http://t.co/wBsf7eqn", "Wed Apr 17 16:03:41 ": "Help out my friends by clicking the link below! http://t.co/7RnBfCmPD9", "Tue Feb 12 16:30:52 ": "I posted a new photo to Facebook http://t.co/XKNleaHD", "Tue Mar 26 15:56:25 ": "Very excited to announce my new album will be coming out in MAY! Stay tuned for more details!", "Fri Feb 01 21:37:58 ": "You can now download \"Super Bowl Party\" for free at:\nhttp://t.co/h2wTfS6m", "Wed Feb 06 19:32:25 ": "What do yall think about my first single off my new album?!\nhttps://t.co/9FHA5Wke", "Mon Dec 10 19:35:09 ": "All my Christmas songs are available to purchase on iTunes! Click the iTunes tab right here on my page to visit my store xo Julie", "Wed Oct 17 16:43:04 ": "I posted a new photo to Facebook http://t.co/yQiZwCAz", "Mon Mar 18 18:48:54 ": "Happy Music Monday Everyone! What are you listening to today?", "Fri Mar 08 17:51:58 ": "Look who I saw in Mexico...The US Skydiving Team! How cool is that?! http://t.co/RnfnKk9W1l", "Tue Feb 26 19:21:32 ": "I'll be premiering the first single coming to country radio tomorrow morning! Stay tuned ;) xo Julie", "Mon Jan 14 15:51:05 ": "There was such an amazing response to my \"Best Christmas Yet\" giveaway, I'm thinking it's time for another contest! More details soon!"}