{"Mon Apr 15 16:12:49 ": "M: Jason Hartmann (USA) crosses the finish line in fourth - that's back-to-back fourth place finishes for Hartmann", "Mon Apr 15 15:02:35 ": "W: Caballero turns in a 17:26 5k split at 25k, running 1:27:42. Felix has closed the gap to six seconds.", "Mon Apr 15 15:43:29 ": "W: Flanagan went through 35k in third at 2:03.44 and Goucher in sixth at 2:03.45. The Americans both ran a 17:34 5k split. #bostonmarathon", "Mon Apr 15 21:25:00 ": "Baggage update:\n\nFor runners looking to claim their bags - baggage claim is now open on Berkeley Street between... http://t.co/2Z7ps4tWOk", "Tue Apr 16 00:17:39 ": "Statement from the Boston Athletic Association Monday, April 15, 2013 8:00 p.m. ET\n\nThe Boston Athletic... http://t.co/LrhGOvd2Gk", "Sat Apr 20 23:07:58 ": "Okay, you asked for it and so we have been working around the clock to give this special offering a wider reach... http://t.co/9iFdgK4EPA", "Mon Apr 15 15:27:36 ": "W: Flanagan (USA) went through 30k in sixth place, running 1:46.11. Second through eighth separated by eight seconds.", "Mon Apr 22 14:04:44 ": "Boston Marathon baggage claim, as well as medal distribution for those who were unable to receive one after the... http://t.co/fRdo7S5nRc", "Mon Apr 15 15:17:20 ": "M: 15 mile update - Watson (CAN) leads pack split time 5:07 total time 1:14:29. Watson holds 7-10 second lead on chase pack", "Mon Apr 15 14:57:09 ": "W: Felix is pulling away from the chase pack trying to run down Callabero.", "Sat Apr 20 01:24:32 ": "The B.A.A. joins all citizens of the Commonwealth of Massachusetts in thanking the federal, state and city law... http://t.co/QttWG6UrVN", "Mon Apr 15 21:52:08 ": "Busses from Boston to Hopkinton are running. They are picking up on Stuart Street between Clarendon and Dartmouth.", "Wed Apr 17 21:57:58 ": "Runners still picking up their bags can cross a replica of the 2013 finish line here at @B_A_A_ headquarters. http://t.co/psk0lHz31U", "Mon Apr 15 15:13:05 ": "W: Felix pacing the women through 17 miles at 1:35.46. Last split was 5:32.", "Mon Apr 15 15:37:40 ": "M: 30K, Chumba (KEN) leads 1:32:42, Desisa (ETH), Gebremariam (ETH), Matebo (KEN), Kogo (KEN) and Merga (ETH) round out lead pack", "Mon Apr 15 15:49:34 ": "W: Flanagan is seven seconds behind the lead three, Jeptoo, Sharon Cherop (KEN) and Meseret Hailu Debele (KEN), at mile 24 at 2:15.15.", "Mon Apr 15 16:13:53 ": "W: Jeptoo's fastest split came during the 35-40k, running 17-flat.", "Mon Apr 15 15:42:16 ": "M: 20 mile update - 5 minute split, 1:39:27 total time. Lead pack down to five runners", "Mon Apr 15 16:11:36 ": "M: 23 year old Lelisa Desisa (ETH) wins #BostonMarathon", "Mon Apr 15 16:11:24 ": "W: Places 7-10: Madai Perez (MEX) 2:28:59, Diane Nukuri-Johnson (BDI) 2:29.54, Ana Dulce Felix (POR) 2:30.05 and S. Mockenhaupt 2:30.09.", "Mon Apr 15 16:00:55 ": "W: The temperature at the finish line of the 2013 #bostonmarathon is 30 degrees cooler than it was in 2012 (84 degrees).", "Thu Apr 18 14:51:13 ": "Members of the B.A.A. staff attend the Interfaith Service at the Cathedral Of The Holy Cross. Top photo is (L to... http://t.co/oQCdxKkP8P", "Mon Apr 15 15:21:31 ": "W: Flanagan (USA) and Caballero holding strong in the chase group.", "Mon Apr 15 15:51:38 ": "M: 35K update, 1:48:40, Wesley Korir making his move to rejoin lead pack", "Mon Apr 15 15:54:24 ": "M: Korir rejoins lead pack of Kogo, Chumba, Gebremariam, Desisa, Matebo", "Mon Apr 15 14:56:32 ": "M: unofficial 11 mile update - men running 4:50 miles total time 54:11. Levy Matebo (KEN) leads a pack of nine", "Mon Apr 15 16:10:24 ": "M: Desisa leads with one block to go.", "Mon Apr 15 14:55:37 ": "WC: McFadden at mile 24 in 1:36.07.3, eyeing the $15,000 purse for first place.", "Tue Apr 16 00:39:52 ": "Correction on baggage claim: Runner's bags can now be picked up on Berkeley Street, between St. James and... http://t.co/gcppGQ7HH2", "Mon Apr 15 15:56:20 ": "W: Jeptoo pulling away as she nears Boylston St.", "Mon Apr 15 19:47:08 ": "There were two bombs that exploded near the finish line in today's Boston Marathon. We are working with law... http://t.co/JsiK3JSLjw", "Mon Apr 15 20:40:54 ": "The Family Meeting Area has been moved to Boston Common. Runners are being directed there to meet friends and... http://t.co/hojXW7AFCi", "Mon Apr 15 15:44:24 ": "W: The chase pack is 24 seconds behind Felix, who went through mile 23 in 2:09.46.", "Mon Apr 15 16:06:53 ": "W: The top three finishers were Rita Jeptoo (KEN) at 2:26:25, Meseret Hailu (ETH) at 2:26.58 and Sharon Cherop (KEN) in 2:27.01.", "Sun Apr 21 19:10:55 ": "One Fund Boston, Mayor Menino, and Governor Patrick Call for Moment of Silence at 2:50 p.m. ET on Monday... http://t.co/mwhjAgJy3I", "Mon Apr 15 15:47:25 ": "W: Jeptoo earned her only WMM win at Boston in 2006 in 2:23.38, which stood as her PR until taking second in Chicago last year in 2:22.04.", "Mon Apr 15 15:27:13 ": "Total starters in all three #BostonMarathon waves: 23,181", "Mon Apr 15 15:10:54 ": "M: American Fernando Cabada slips behind lead pack - favoring right foot.", "Mon Apr 15 15:32:00 ": "M: At 18 miles in Newton Hills, pack opens up. Chumba (KEN) and Desisa (ETH) lead. Hartmann and Watson out of lead pack.", "Mon Apr 15 15:57:20 ": "W: Flanagan in fourth, chasing Cherop and Debele.", "Mon Apr 15 15:07:55 ": "WC: Tatyana McFadden (Clarksville, Md.) has officially won the 2013 Boston Marathon Female Wheelchar in 1:45.25.", "Mon Apr 15 15:53:54 ": "W: Jeptoo stretching the gap at 40k, running 2:19.38 with a 16:57 5k split.", "Mon Apr 15 16:23:44 ": "M: Top three U.S. finishers - Jason Hartmann (Boulder, CO) 2:12:12, Daniel Tapia (Castroville, CA) 2:14:30, Craig Leon 2:14:38 (Eugene, OR)", "Mon Apr 15 21:00:19 ": "Streets within the Back Bay, including those of our post-race area remain under lock down. If you're a runner in... http://t.co/wi3H1nIoWz", "Mon Apr 15 15:38:55 ": "M: Last years winner Wesley Korir (KEN) falls 11seconds behind lead pack", "Mon Apr 15 15:34:52 ": "Current temp at finish line, 51 degrees, 42% humidity, wind 2 mph out of the east", "Mon Apr 15 16:19:58 ": "W: Goucher's sixth place finish is her fourth top 10 placing at WWM. She has now finished third ('09), fifth ('11) and sixth ('13) in Boston", "Mon Apr 15 14:59:13 ": "MC: Top three - Hiroyuki Yamamoto (JPN) 1:25:33, Ernst Van Dyk (RSA) 1:27:12, Kota Hokinoue (JPN) 1:27:13", "Mon Apr 15 15:20:01 ": "W: Felix hits 30k in 1:44.57, running a 17:15 5k split.", "Mon Apr 15 14:57:44 ": "WC: McFadden hits 40k in 1:39:23.1.", "Mon Apr 15 15:47:59 ": "M: 21 mile mark total time 1:44:26 - five runners hanging in lead pack", "Sat Apr 20 14:12:07 ": "FOR OUR SUPPORTERS IN THE UNITED KINGDOM:\nThe product is live on the UK shop site at http://t.co/RjckXZqirn... http://t.co/I6pvJitsuq", "Thu Apr 18 14:52:42 ": "To all Boston Marathon Participants:\n\nThe Boston Athletic Association has yet to issue official times for all... http://t.co/ftwlTSWRKW", "Mon Apr 15 15:32:15 ": "W: Felix holding strong at mile 20 (1:52:33), running 5:41 split. Felix's best Marathon Major finish was fourth in NYC in 2011 (2:25.40).", "Mon Apr 15 15:22:38 ": "W: 30k Weather Update: 60 degrees, 36% humidity and 1 mph breeze from the southeast. Last year the temperature was 83 degrees at 30k.", "Tue Apr 16 15:51:59 ": "We have a few important details for our runners at this time...\n\nFirst, we again want to express our sympathy to... http://t.co/I8Z31jh2Em", "Thu Apr 18 16:25:22 ": "Boston stands as one\n\nThank you to all our Facebook fans for your outpouring of support.  So many of you have... http://t.co/dnwHmWJSbd", "Mon Apr 15 15:58:44 ": "W: Jeptoo wins her second Boston Marathon in 2:26.25 (unofficial).", "Mon Apr 15 15:40:02 ": "W: The field is visible at a distance over Felix's shoulder, who still lead at 35k in 2:02.38 (17:42 5k split).", "Mon Apr 15 15:14:13 ": "RT @USATrack_Field: @JasonRHartmann continues to run in the chase pack. Follow the race live at http://t.co/c1F81bcf7f. #bostonmarathon", "Mon Apr 15 18:44:19 ": "Runners! Celebrate your accomplishment @bostonmarathon #mile27 presented by @SamuelAdamsBeer. Ticket in ur bib packet. 6-11. No tix @ door.", "Mon Apr 15 15:33:56 ": "W: Felix turned in negative splits each mile since the gun, but all alone at mile 21 splits at 5:59. Total time 1:58.31.", "Mon Apr 15 15:11:20 ": "WC: Sandra Graf (Gais, Switzerland) and Amanda McGrory (Champaign, Ill.) round out the top three in 1:46.54 and 1:49.19 respectively.", "Mon Apr 15 17:35:11 ": "Jason, Shalane, Wesley and Kara at the post race press conference. http://t.co/SxLzlZAFcj", "Mon Apr 15 16:08:21 ": "M: 25 mile update 2:05:40 Kogo, Grebremariam, Deisisa running stride for stride", "Fri Apr 19 11:39:39 ": "UPDATE: Friday, April 19, 7:30am  -  Due to recent news involving the incident that occurred last Monday, and as... http://t.co/Ufl0EoMBpg", "Mon Apr 15 15:10:05 ": "M: Dickson Chumba (KEN) leads pack of 8  after half. Total time 01:04:54, projected finish 02:09:48", "Mon Apr 15 15:03:31 ": "W: Felix has surged into the lead.", "Mon Apr 15 16:09:29 ": "W: Places 4-6 were Shalane Flanagan (Ore.) at 2:27.08, Tirfi Tsegaye (ETH) at 2:28:09 and Kara Goucher (Ore.) 2:28.11. #bostonmarathon", "Mon Apr 15 15:23:01 ": "M: Hartmann (USA) regains place in lead pack through Newton Lower Falls. Watson (CAN) regains lead.", "Mon Apr 15 15:17:33 ": "W: Felix running a 5:38 split at mile 18. Leading the field in 1:41:23.", "Mon Apr 15 15:04:00 ": "WC: finish line temp 50 degrees, 43% humidity, cloudy.", "Mon Apr 15 15:13:23 ": "M: 14 mile update - Robin Watson (CAN) extends a 20 foot lead on pack.", "Wed Apr 17 21:30:11 ": "Volunteers helping runners retrieve their race baggage, as well as distributing finisher medals. http://t.co/w4DGEXJHrk", "Mon Apr 15 16:08:58 ": "M: Desisa makes his move, Gebremariam hanging in there. Kogo falls back.", "Sat Apr 20 12:33:52 ": "UPDATE ON \"BOSTON STANDS AS ONE\" TRIBUTE TEE\nThere has been an overwhelming demand, and we were out of stock... http://t.co/P36N4f9ybe", "Wed Apr 17 16:45:44 ": "Baggage Claim and Medal Distribution Update:\n\nRunners baggage is currently available at 40 Trinity Place, Room... http://t.co/zFCVIDfM7b", "Mon Apr 15 15:58:46 ": "M: Mile 23 update, split 5:07, total 1:55:02 lead pack of three (Desisa, Kogo, Gebremariam)", "Mon Apr 15 15:45:38 ": "W: Felix is overtaken by Rita Jeptoo (KEN).", "Mon Apr 15 21:27:32 ": "Family meeting area - Boston Common. baggage claim is now open on Berkeley Street between Boylston Street and St. James Avenue.", "Mon Apr 15 16:17:01 ": "M: Lelisa Desisa (ETH) wins with time of 2:10:22", "Mon Apr 15 15:40:04 ": "M: At 30K mark temp is 60 degrees with 34% humidity", "Mon Apr 15 16:02:26 ": "W: Kara Goucher crossed the line in sixth place at 2:26.38 (unofficial).", "Mon Apr 15 17:21:23 ": "Jason, Shalane, Wesley and Kara at the post race press conference. http://t.co/bgd6Icmtqo", "Mon Apr 15 15:21:23 ": "M: Hartmann (USA) falls out of lead pack - 16 mile update 1:19:25. Geneti (ETH) leads", "Mon Apr 15 21:48:30 ": "Tonight's Post-Race Party has been cancelled.", "Mon Apr 15 16:20:51 ": "M: Desisa  (ETH) wins with time of 2:10:22 - followed by Kogo (KEN) 2:10:27, Grebremariam (ETH) 2:10:28, and Jason Hartmann (USA) 2:12:12", "Wed Apr 17 11:18:49 ": "Baggage Claim Update:\n\nRunners who still need to claim their runner baggage can do so now at 40 Trinity Place... http://t.co/MGpmi56SGY", "Tue Apr 16 20:38:22 ": "Statement from Thomas Grilk, Executive Director of the Boston Athletic Association Tuesday, April 16, 2013\n\nThe... http://t.co/dw0WHFrkxA", "Mon Apr 15 16:07:43 ": "M: Kogo (KEN), Grebremariam (ETH), Desisa (ETH) turning on Boylston for the final stretch.", "Mon Apr 15 16:15:46 ": "M: Temp at finish line 54 degrees, 39% humidity - that's 30 degrees colder than the temp at the 2012 marathon men's finish.", "Mon Apr 15 16:02:53 ": "M: 24 mile update - Kogo, Desisa, Gebremariam, 1:59:38 - we're in for an exciting finish!", "Mon Apr 15 16:18:05 ": "W: Flanagan's 4th place finish is her second WMM top-five finish in three runs. She took second in New York '10 and 10th in the London Games", "Mon Apr 15 15:42:14 ": "W: Americans Flanagan and Goucher are gaining with the chase pack. #bostonmarathon", "Mon Apr 15 15:05:52 ": "W: Columbia has never produced a women's champion. Rosa Mota of Portugal won Boston three times from 1987-90.", "Mon Apr 15 15:16:17 ": "WC: McFadden's victory marks the first time since 2005 that an American has claimed the olive wreath in back-to-back years.", "Mon Apr 15 16:00:03 ": "W: Flanagan completes her Boston Marathon debut in 2:19.46 (unofficial) for fourth place.", "Mon Apr 15 15:02:55 ": "M: 12 mile update 5:07 split, total time 59:18 - U.S. runner Jason Hartmann returns to lead pack", "Mon Apr 15 15:33:34 ": "M: In Newton Hills, lead pack of six runners set pace.", "Mon Apr 15 14:54:31 ": "WC: McFadden is a three-time World Marathon Major winner, having claimed titles at New York ('10) and Chicago ('11, '12). Her PR is 1:45.03."}