{"Fri Mar 29 19:25:40 ": "@GoatsOfDoom @sevendust @ljspoon @morgan7d Since middle school I have been hooked!", "Sat Mar 23 20:57:41 ": "Good win by Sparty #GoGreen", "Mon Apr 08 00:07:21 ": "@Erick_Brito9 you should have said something, you would not have bothered me at all.", "Mon Apr 01 18:32:54 ": "@dolphan_etown My plant shoe is a 13 and my kicking shoe is an 11 1/2. I wouldn't consider that small, or are you talking the difference?", "Thu Mar 21 20:48:35 ": "@ChrisMcCoy07 I don't think the throat slice would go over to well, but I'll think about it", "Sat Apr 13 17:40:27 ": "RT @BrowardHealth: A few of our awesome #volunteers! #fitfest @ Holiday Park http://t.co/m77JojgLth", "Fri Mar 29 18:20:47 ": "@RevPhillyD ever since I heard \"Denial\" back in the day I was hooked to @Sevendust", "Mon Apr 08 00:08:43 ": "@DFranks29Fan I am doing well, thanks for asking. How was your weekend?", "Sun Mar 24 21:56:02 ": "RT @k2fields: @MiamiHEAT @chrisbosh Happy Bday! It's my 29th bday today too and @b_fields2 is taking me to celebrate it with you in the  ...", "Thu Mar 21 21:09:40 ": "@mrko_84 I'm in the process of receiving my blue check mark", "Sat Mar 23 16:24:33 ": "@TrianaMaggie @68incognito @mikepouncey No, they have kept a tight lid on it, even from the players. #inthedark", "Thu Mar 21 21:59:36 ": "@LebasiBucks to keep them separate from the QBs, kicking balls get broken down pretty fast once Dan and I get ahold of them!", "Sun Mar 24 03:47:35 ": "FYI Wichita State just destroyed my bracket! Anyone Else? #MarchMadness", "Sat Mar 23 22:14:43 ": "@Dashootz ya but all that matters now is to get that \"W\" and move on", "Sun Mar 24 01:05:20 ": "@Dashootz I was a little frozen that game too", "Thu Mar 21 21:31:58 ": "@DjW1GZ Ultra? I'm guessing it's a club on South Beach", "Tue Apr 16 23:03:34 ": "@Phinattic they are the old appearance jerseys from last year, the new logo ones aren't in yet.", "Sun Mar 24 21:58:48 ": "@dolphan_etown Lechler is a good punter who has been doing it for many years and can make the ball fly. #respect", "Thu Apr 11 12:01:08 ": "RT @BrowardHealth: @nbc6sports @CookinAndKickin check out Dan Carpenter &amp; @b_fields2  filming for our #powerfulkids special! http:// ...", "Thu Mar 21 21:04:19 ": "@bridges_mike I didn't see @Weatherford5 on @espn but Steve is a good dude who works hard", "Sun Apr 14 17:45:45 ": "@nashmax73 it was a treat for my father-in-law", "Fri Mar 29 20:19:12 ": "@machew no I haven't but I need to", "Tue Apr 16 21:30:21 ": "Had fun today racing go karts with some kids! @mattmoore_8 and @ryantannehill1 kicked my butt on the track! http://t.co/Au2M9vTepb", "Sun Apr 14 17:49:05 ": "@CunningBurrito mostly walking around, following the Lefty a little bit", "Fri Mar 22 13:50:10 ": "RT @Jtroia13: @b_fields2 an original design! http://t.co/TdfDdazuPt", "Thu Mar 21 21:16:57 ": "@carlock12 Yes, the best way would be to send it to the Dolphins training facility", "Mon Apr 15 23:20:07 ": "RT @k2fields: It's a sad day. My thoughts and prayers are with those affected by this Boston tragedy.", "Fri Apr 05 18:58:29 ": "RT @claudiaizet: My production assistant for today! cc: @b_fields2 @k2fields http://t.co/FlbmVozGeB", "Sun Mar 24 13:53:47 ": "RT @TheSlicee: @b_fields2 I was a punter all my life through school.such an important piece that gets no love..Your the best at it let m ...", "Sun Apr 07 00:14:29 ": "What a great night supporting @BrowardHealth at their annual gala!", "Thu Mar 21 21:08:20 ": "@Phins_Nation absolutely, the best way for me to get it is to send it to the Dolphins training facility", "Sat Mar 23 14:43:43 ": "Celebrating the wifey's birthday weekend @k2fields, out to breakfast now, Alicia Keys concert tonight, Heat tomorrow #truelove #gettingold", "Thu Apr 18 15:23:04 ": "@Steven__Gill @weatherford5 @patmcafeeshow @jhekker @chriswarcraft thanks for the support! No need to go there, they are all good guys.", "Sun Apr 14 17:48:18 ": "@PatMay1 I'm with my father-in-law so I hope he is not entertain any of those kinds of thoughts!!", "Sat Mar 23 22:10:57 ": "@michaelubrown it would be fun to do. I'll keep it in mind for the future.", "Sun Mar 24 13:57:22 ": "RT @MSU_Football: Mike Sadler launches a punt during Friday's spring practice. #Spartans http://t.co/ySuEqvTENp", "Tue Apr 09 01:21:58 ": "I don't know who to root for tonight! I want the Big Ten to win but I can't force myself to cheer for Michigan! #rockandahardplace", "Thu Apr 11 21:27:59 ": "@ukfin_fan not on the golf course. I could work with the grounds crew with the amount of divots I have to fill! #FORE!!", "Thu Apr 11 17:38:52 ": "@ConquistaBoyz Sorry I won't be able to participate in the golf tourney, I am already committed to another event that day", "Thu Mar 21 21:19:00 ": "@zachpagano I'm extremely excited about the new logo, I've been kept in the dark with everyone else #FinsUp", "Sun Apr 14 23:41:37 ": "RT @ryantannehill1: Congrats to Adam Scott! Some clutch shots to bring it home! #respect #Masters", "Thu Mar 21 21:33:54 ": "@miami454 I would love to but I can't, they are not mine to give away #sorry", "Sun Apr 14 17:43:55 ": "Taking a break to eat some lunch. No cell phones or cameras allowed on the course, sorry no pictures. #surreal", "Thu Mar 21 20:33:26 ": "RT @Dashootz: @b_fields2 sparty on!!! Spartans 2013 national champions!!!", "Fri Apr 05 18:58:22 ": "RT @claudiaizet: Thanks to @b_fields2 and @k2fields today. @himmelr and I had fun doing the shoot with you both (and your dogs)!", "Sun Mar 24 01:04:41 ": "RT @mikeventola: @b_fields2 can a former punter/linebacker get a b day retweet from his favorite punter on the future 2013 Afc east cham ...", "Wed Mar 27 00:12:43 ": "RT @k2fields: The first Fields Fit Fest is coming to Broward April 13! Kids grades K-5. Only 100 spots, sign up at http://t.co/3vGhX0dwO8", "Wed Apr 17 16:19:54 ": "RT @DolphinsAcademy: See more photos from @b_fields2 and @k2fields event this past weekend, Fields Fit Fest: https://t.co/2ioXy9aVzM", "Sun Apr 14 17:44:59 ": "@MsMiamiDolphins walking around the whole course, got to take in all the history", "Thu Mar 21 21:06:56 ": "@Nolesbl I was in the Toledo area", "Thu Mar 21 21:38:01 ": "@miami454 it makes it easier when their are multiple identical bags of footballs", "Sat Apr 13 17:39:58 ": "I appreciate everyone who came out today for the first Fields Fit Fest! It was a success even with all the rain. @BrowardHealth @k2fields", "Thu Mar 21 21:58:09 ": "@NickVipperman it's an 11.5 and my normal shoe size is 13", "Wed Apr 17 18:31:15 ": "Well look at that, I found a little blue check mark next to my name! I guess someone actually believed I'm really me! #checkmarkparty", "Thu Apr 18 14:48:27 ": "@SoJewvenile I think we are best friends, or your my long lost identical twin? #PhinsUp", "Thu Apr 11 17:39:46 ": "@Brady_Flanders About 2 months ago. Thanks for the support #FinsUp", "Fri Mar 29 20:32:26 ": "@morgan7d what's going on Morgan? How is the tour going so far? The new album is pretty good, nice work", "Sat Mar 23 16:32:55 ": "@NickVipperman I do a little bit each year during camp. I've never had a problem tackling returners, it's the catching them part that's hard", "Thu Apr 11 17:36:12 ": "Hooray for the first round of the Masters!", "Sat Apr 13 22:34:59 ": "RT @MsMiamiDolphins: @DolphinsAcademy @nfl @b_fields2 my @MiamiDolphins  has the best special teams in the league! ♥", "Thu Apr 18 14:50:39 ": "@Steven__Gill no I'm probable one of the last. I know of @Weatherford5 @PatMcAfeeShow @JHekker @ChrisWarcraft and I'm sure there are others", "Sun Mar 24 22:03:29 ": "Proud to have been able to support the Lauren's Kids Foundation earlier at the stadium, helping raise awareness and stop child abuse", "Sat Apr 13 17:40:22 ": "RT @BrowardHealth: It may have rained, but we're still having fun! #fitfest @ Holiday Park http://t.co/RlxxGVQS9C", "Tue Mar 26 15:37:27 ": "My favorite band @Sevendust released their new album today! Go check it out! @ljspoon @morgan7d #GoodStuff http://t.co/LjiyjjMnKA", "Sun Apr 14 11:47:27 ": "I can feel it already, it's going to be a great day!", "Sun Apr 14 23:41:21 ": "RT @k2fields: And Adammmmmm is the winner!!!!!", "Sun Mar 24 03:40:03 ": "@ocphinfan no problem, I know without fans like you we could not do what we love. That is one reason why I try to give back as much as I can", "Fri Mar 22 13:39:35 ": "@LebasiBucks surprisingly I don't have a favorite", "Sun Mar 24 21:59:16 ": "@StrombergsPhoto I'm with Charles!", "Sat Mar 23 22:07:18 ": "@AJWoodsSr82 @k2fields Ya she does! What would you have thought she listens to? #favoritemusic", "Sat Mar 23 16:23:01 ": "@StrombergsPhoto unfortunately no. I tried to not let my pride pick my bracket #MarchMadness", "Thu Mar 21 20:44:24 ": "@shepdawg25 sorry to hear about the buckeyes but that's ok no one is perfect #gogreengowhite", "Sat Mar 23 16:26:17 ": "@michaelubrown I can't even imagine how much time and how many retakes it took to make that!", "Thu Mar 21 20:16:20 ": "“@hypocritex: @b_fields2 Question. Which excites u more. Booming a HUGE punt? Or downing inside the 10?” Definitely booming a HUGE punt", "Fri Mar 29 19:27:08 ": "@dolphan_etown The left is for support and traction, the right is a smaller soccer shoe for kicking", "Sat Mar 30 01:26:33 ": "@machew absolutely, it won't be a problem at all", "Thu Mar 21 20:40:59 ": "@Brian_Farley7 @brianhartline I don't think your bride-to-be would like the whole team crashing the wedding", "Mon Mar 25 00:00:48 ": "I'm convinced @KingJames mid-range fade away jump shot is going in before he even shoots it! #Heat", "Sun Apr 14 22:14:17 ": "@machew I will be their. Football first!", "Thu Mar 21 20:32:00 ": "@TPain151 I can kick field goals and fill-in in a pinch but I am a lot better at punting", "Sat Mar 23 22:13:52 ": "@RossTheBearJew good luck! #notachance", "Sun Mar 31 18:56:14 ": "Happy Easter!", "Thu Mar 21 21:24:59 ": "RT @Jtroia13: One thing I remember about his game is how good @b_fields2 was that game and was a key part in the victory http://t.co/Q7x ...", "Fri Mar 22 13:27:30 ": "@Jeff722 I lift at least 4 days a week now and kick 2-3 days a week", "Sat Apr 06 00:00:07 ": "RT @indianajg: @b_fields2 of the @miamidolphins at #sparezbowling #giveback #dolphins http://t.co/7LNJyRFESl", "Sat Mar 23 22:05:33 ": "@StrombergsPhoto I just tease her a little since she is a few months older than me", "Sun Apr 14 11:51:59 ": "At the Masters for the first time today! #excitedlikea5yearoldonchristmas", "Sat Apr 13 17:40:31 ": "RT @BrowardHealth: Brandon Fields found a few miniature fans #fitfest @ Holiday Park http://t.co/Hk9fGsZXox", "Fri Mar 22 13:40:45 ": "@PerfectFinz72 I agree #FinsUp", "Mon Apr 01 18:29:10 ": "@michaelubrown You can find them on http://t.co/AwNKWg5JDM. Thanks for the support! #FinsUp", "Thu Mar 21 20:13:37 ": "@ashleyday34 they have a blast splashing around in the pool", "Sun Mar 24 03:42:25 ": "@aliciakeys tonight was amazing! Her vocals are incredible, she definitely made me a fan! #greatshow", "Thu Apr 18 14:54:28 ": "@jarrettcraig what's been happening Craig, haven't talk to you in forever. What's new?", "Tue Apr 09 01:19:17 ": "@DFranks29Fan looks good!", "Sat Mar 23 16:37:23 ": "@Hampton954 @k2fields Heck ya, she knew me before all of that when I was a Titan! #GoTitans", "Thu Mar 21 21:56:40 ": "@chad_hine the left one is a size 13 football cleat, the right one is a size 11.5 soccer shoe. I'm too big to wear a soccer shoe on my left", "Fri Mar 22 13:46:33 ": "@StrombergsPhoto the offseason was good, I spent a lot of time with family and kept myself busy with a few projects. Excited to get rolling!", "Thu Mar 21 20:23:07 ": "@LTVIDAL having fun at the @MiamiDolphins football camp", "Tue Apr 16 14:56:50 ": "RT @DolphinsAcademy: Miami #Dolphins Brandon Fields Hosts Fields Fit Fest http://t.co/2quBcRcvE4 via @miamidolphins", "Sun Apr 07 04:23:09 ": "RT @k2fields: Thanks for a great night @LaurenTannehill @ryantannehill1 All to support a great hospital @BrowardHealth http://t.co/slKdd ..."}