{"Sat Apr 13 00:31:39 ": "@MSGChoir hope I get to sit in with you guys somewhere....meet you on a street corner???? Pop up gorgeous :)", "Wed Apr 17 01:39:01 ": "Some KC trivia for you, Martin Grant is an old Melb buddy of Kate's and designed some her outfits in the \"I'm... http://t.co/4097jxW6Fi", "Thu Apr 18 07:10:53 ": "@Lazonearth amazing memories x", "Mon Apr 15 01:27:06 ": "Listening to lumineers with gypsy! Great autumn mood x she say's he's no Rhianna but she thinks he's a good singer...", "Thu Apr 11 23:56:38 ": "Me and my BROMLEY shadow, lovingly  taken by my husband...:) http://t.co/oBi3fiZhSj", "Fri Apr 19 23:16:55 ": "Just have to say....Tina Arena has one of the MOST beautiful voices on the planet!", "Sun Apr 21 05:50:09 ": "@MCNMG yeah my gma kath used to swear by it for its health benefits, trying to cut down caffeine a bit... But don't hold me to that!", "Sun Apr 14 04:58:05 ": "@anuchristine I will track you down sugar!!!!!", "Sun Apr 21 05:33:05 ": "@deniwen770 thankyou so much, I can thank my friends for that, most of my mates support organics and nutrition", "Sat Apr 20 07:27:34 ": "@lizziec66 thanks Lizzie, lots of love from autumnal Melbourne x", "Tue Apr 16 01:32:25 ": "@kristy_kac ps Alan Joyce is the new boss of qantas and he's lovely x", "Sun Apr 21 09:25:36 ": "Being great role models! That's what it's all about x", "Sat Apr 13 00:29:40 ": "@JenelleWitty okay ms witty, game on fashionista! lets talk installation!", "Thu Apr 11 22:15:57 ": "There will be no hemming or hawing nor crutching or dagging round here this morning....says Ben! Don't ask", "Tue Apr 16 02:09:57 ": "@KateCeberano @kristy_kac I have got verbal dyslexia!!!!!! I'm all discombobulated. I should take a deep breath and start again :)", "Wed Apr 24 22:14:56 ": "@naomi_dyer you should :)How ya going? I've been seeing you flit in and out on my tweet hope you're well", "Tue Apr 23 06:36:52 ": "@bassjammin I think our playlists are synchronized :)", "Tue Apr 16 01:37:26 ": "@lukew82 my senior moment :)", "Wed Apr 17 03:48:59 ": "Check out Kate looking gorgeous at the launch of the new Qantas uniforms. Team KC. http://t.co/vbhrMnSJ0o", "Sun Apr 21 10:16:15 ": "@AngelaCeberano get the freak!!!!!!", "Tue Apr 16 01:34:33 ": "How funny! james Joyce was my boss when I was working for Qantas... Long time ago now, but feels yesterday!", "Tue Apr 16 09:17:54 ": "@LaurenMC love this thankyou so much!", "Tue Apr 16 01:32:07 ": "@kristy_kac I got say its as sexy than the name money penny very YSL or newton helmet!", "Tue Apr 16 05:02:14 ": "@kinsonian baby that shoot took place 15 yrs ago, I was just reminiscing out aloud! I would never be in NYC and not track u down x", "Sun Apr 21 04:53:40 ": "My girlfriends new business! The MOST delicious green shakes http://t.co/2fHE4mKAUW", "Tue Apr 23 06:30:23 ": "Guzzling green shake courtesy of my organic trainer bronte!!!!!!( Melbourne organics ....!my jungle juice", "Tue Apr 23 10:27:50 ": "@kcmorrison1 and griffin had me at Elise...:)", "Wed Apr 24 22:18:16 ": "@MDC_walk_run  you bet :)", "Sun Apr 14 05:10:38 ": "@petstarr that's what I'm listening to as I tweet", "Tue Apr 23 06:34:20 ": "Okay peeps gotta run, see you sweaty and inspired on the otherside of this lazy afternoon...", "Sun Apr 21 04:54:30 ": "Bronte Morrison and I planning my daily blogs for perfect health menu for winter", "Tue Apr 16 01:35:18 ": "I LOVED shooting the qantas ad in NY, highlight of my career actually! I had Brooklyn bridge to myself for a day! Wow", "Tue Apr 16 01:21:48 ": "She is beaming with intelligence and warmth!", "Mon Apr 22 07:23:54 ": "@1992w36 I notice everything :) well, everything I'm interested in...thanks x", "Sat Apr 13 00:30:30 ": "@MSGChoir @festofvoices @darrenpercival @anuchristine @take6official oh yeah babeeeee", "Thu Apr 18 07:10:35 ": "@heartofstkilda @henry @hannahgadsby @fakewoodley proud to be a part of it :)", "Tue Apr 16 03:59:03 ": "@minmin1008 dang! What a set of lungs and they just feel good", "Tue Apr 16 01:24:20 ": "Peter morrissey back stage passes baton. You're a sweetie!", "Thu Apr 18 07:10:19 ": "RT @heartofstkilda: A line-up as diverse as the inhabitants of St Kilda #heartofstkilda @Henry Wagons @Hannahgadsby @FakeWoodley @KateCe ...", "Thu Apr 11 22:01:01 ": "@DJobling @jehealey well that's what my grandma used to say :)", "Sat Apr 20 05:55:56 ": "I do love this photo of Capsis and I! What a golden boy! http://t.co/PxMfLkanqu", "Tue Apr 16 01:27:13 ": "Thankyou James Strong for the invite, I always feel at home travelling qantas!", "Tue Apr 23 06:33:02 ": "@kandrock yeah baby busts a move!!!\nYou want it..... Ps I LOVE Duran Duran", "Fri Apr 19 23:17:42 ": "She never fails to impress , perfect pitch, perfect tone, range for days...! Really beautiful!", "Tue Apr 16 01:43:23 ": "@lukew82 oh god only one or two!!!!", "Sun Apr 21 10:10:26 ": "@AngelaCeberano looks like the Hamptons... Very chic!!!!!!", "Tue Apr 16 01:23:19 ": "One of this proud to be an Australian moment! Deborah Thomas and Melissa hioyer....all the gals. Recalling early days of fashion in melb....", "Tue Apr 16 01:20:10 ": "Oh wonderful!!!!! My dear friend Martin grant reveals the qantas uniforms! So proud. Tres chic! Super chic!", "Fri Apr 12 01:35:56 ": "Trained like a maniac this morning! Thought I was Chita riviera in west side story, but will feel like Joan rivers by 3:00 dang!", "Tue Apr 16 01:25:59 ": "@sandradeebee she exemplifies modern Australia! Fresh, talented and authentic!", "Sun Apr 21 05:52:42 ": "@Prinia @KateCeberano yep I'm diggin it, google it for more deets as I'm no expert...but it feels good in my tummy", "Sun Apr 21 10:21:17 ": "@AngelaCeberano game on!!!!!", "Tue Apr 23 06:33:43 ": "@kandrock gypsy just discovered blondie's rappers delight.... Mummy couldn't be more delighted", "Sat Apr 13 07:36:19 ": "@lke73 wow wow wow! ( I sound like an excited chihuahua! Love that!!!!", "Sun Apr 21 05:33:31 ": "@deniwen770 and we all play the game together. :) can't beat a great support act x", "Sun Apr 21 05:51:45 ": "@RedBeardAgency u new age man you...who knew!!!!!", "Thu Apr 11 21:59:49 ": "RT @DJobling: @KateCeberano @jehealey Don't always sing on demand but when they do... gorgeous! http://t.co/oGoT74ycBY", "Tue Apr 23 06:27:42 ": "I'm upping the anti ! I'm going for run gonna work up a sweat  listening to regatta de blanc and slave to the rythym", "Sun Apr 21 05:48:29 ": "@RedBeardAgency classic :)", "Tue Apr 16 01:28:49 ": "@bassjammin well, so didnt! But I wanted to!!!!", "Sun Apr 21 09:33:45 ": "@CateP36 from the mouth of babes right! Amazing.", "Wed Apr 24 01:54:09 ": "Thankyou to all the lovely responses on fb re Mother's Day classic! Come run/ walk with me", "Sat Apr 20 07:27:01 ": "And God I'm loving this Autumn rose... I think it's called a Rockstar! Appropriate! http://t.co/OgKmgwMXhe", "Tue Apr 23 10:27:23 ": "@fidelcathro @thevoiceau @christie_whelan @marikaaubrey bring it girlfriend x", "Tue Apr 16 01:28:31 ": "@bassjammin yeah I know! Almost sounds like I could be someone...I felt like a rock star and pimped  it up for the papps :)", "Tue Apr 16 01:32:51 ": "@kristy_kac", "Wed Apr 24 10:26:45 ": "@49_smith1 thanks ...that's so sweet I hope so :)", "Sun Apr 21 06:04:44 ": "@hollywoodtrmnt great to meet you too! I'll be looking out for the interview x", "Mon Apr 15 04:46:26 ": "Holy cow Omar Musa!!!!!! Singin my life with your words! I know that \"imitation of a  man \"....collapsed star!", "Sun Apr 21 09:47:32 ": "I'm pretty sure she didn't know what distress meant :)", "Fri Apr 19 23:19:09 ": "Watching her at the Emirates-QANTAS shindig the other night, u forget the power. And Chongs band and arrangements... Amazing", "Sun Apr 14 05:02:03 ": "Simple old fashioned fun! Cider, crepes set in the lawns of Melbourne's own downton abbey http://t.co/NSYXDdpKv1", "Sun Apr 21 04:55:26 ": "@lizziec66 yeah amazing right! Make a beauty!", "Wed Apr 24 01:54:40 ": "Collectively focus on a cure.... That is something we can do about it!", "Tue Apr 16 01:21:30 ": "Met the beautiful and friendly Cate blanchett ( my mother always said I should spell Cate with a C)!!!!!!", "Fri Apr 12 07:43:41 ": "Very pleased to be a part of the Festival of Voices, a festival which celebrates the human voice and brings... http://t.co/5xVvKyYGEF", "Sun Apr 21 10:09:48 ": "@AngelaCeberano OMG you gotta get that dawg an agent ! Too flipping cute x", "Tue Apr 23 10:17:19 ": "This is a family and company that motivates me!!!!  http://t.co/sPSjOYVGsG", "Sun Apr 21 05:43:57 ": "My current secret weapon ssh DONT tell anyone ....but pass it on :) http://t.co/NBFvoCAXMF", "Tue Apr 16 03:45:14 ": "My new favorite! Alabama shakes! I want be in her band!!!!!!", "Sun Apr 14 05:04:13 ": "Boom crash up next... Shit! How old am I?Singer looking damn well preserved! Real sweetie", "Sun Apr 21 09:47:12 ": "I had to explain why they don't have a kids \"voice\", how that could cause a child distress! She said... bring it !", "Sun Apr 21 09:25:20 ": "I'm loving this series of \"the voice\" with my daughter she rates judges ...Joel is quirky, seal soulful, delta pretty and Ricky deep", "Tue Apr 23 06:28:30 ": "Got to move to what you were listening to when you were a teenager, makes your feet lighter", "Sat Apr 13 01:20:21 ": "RT @AdelaideCabaret: Here is @KChenoweth today on @morningshowon7 with @larryemdur and @kyliegillies http://t.co/ejAbCBRhvC", "Wed Apr 24 00:58:15 ": "Each year I take part in the Mother's Day Classic raising funds for National Breast Cancer Foundation and this... http://t.co/gIpljlvGtq", "Sat Apr 13 00:30:18 ": "@jehealey yep she might have been tiny but oh so mighty x", "Sun Apr 14 05:00:11 ": "Can't beat the harvest fest at ripponlea. Just caught up with Sean Kelly! Legend! http://t.co/19oCklHqDc", "Fri Apr 19 23:20:27 ": "Had a great night dressing up, but today attending my favorite concert kids singing at open day Montessori!", "Thu Apr 18 20:26:39 ": "So enjoyed hanging out last night emirates-qantas j'adore!!!!! http://t.co/6esNySUPy6", "Tue Apr 23 06:32:00 ": "Melbourne street organics owned by my girlfriend and famille, Kristin Morrison, google her, she's inspirational", "Sun Apr 21 05:49:00 ": "@kristy_kac aw little munchkin, loving the new material can't wait to share! X", "Tue Apr 16 03:58:20 ": "@gigicd86 thanks :) yep a once in a lifetime kind of experience x", "Tue Apr 16 01:41:09 ": "Oh and the Statue of Liberty too!!!!!! It was the most insane experience xx", "Fri Apr 12 22:26:18 ": "Festival of voices is coming up and I'm so glad I'm a part of it :) wanna come? http://t.co/QxivZAk4mi", "Tue Apr 23 10:18:13 ": "And their shop that's been pumping me with green goodness everyday  x http://t.co/NOkAzWoDyR", "Tue Apr 16 01:25:23 ": "And the return from NY the great Aussie photographer Nick Samartis! God I sound like a giddy teenager... But I love this guy!", "Tue Apr 16 04:12:50 ": "@doondoonian she's gonna love her new clobber, I'd get on the pay roll just so's I could kit up :)", "Mon Apr 22 07:17:20 ": "Like a kick in the chest, my favorite artist suddenly gone! RIP chrissie! There will never be another u x", "Thu Apr 11 22:00:25 ": "@DJobling @jehealey sounds like some Aussie birds I know ( namely me)... lovely x"}