{"Thu Apr 04 22:45:38 ": "@MmeAudubon good for your girl. So magical x", "Fri Apr 05 20:53:02 ": "@nurse_w_glasses to be followed by you is an honour. #personwhoknowswhattheyaretalkingabout.", "Wed Apr 17 22:10:13 ": "@shelliemma nicely said.", "Fri Apr 12 22:49:19 ": "Am doing moonwalk for breast cancer as part of Jen Saunders team @ferrifrump. Plse sponsor if you are able.ThankyouX\nhttp://t.co/liZuRfdyoG", "Thu Apr 04 22:25:06 ": "@StickleyLottie and you work on pupil referral unit which makes you very special X", "Tue Apr 16 15:16:57 ": "RT @mrjakehumphrey: @ProfTanya I'm already on the @C4BedtimeLive set...waiting for you!!! http://t.co/8B8GYHYZnh", "Wed Apr 03 22:13:27 ": "Thanks for all lovely post bedtime live tweets. Sorry can't answer the many individual qu's to me but see advice http://t.co/I58CMwUyXa", "Sun Apr 14 20:17:53 ": "And here's the first page of that bizarre yet faintly comedy Thatcher obit... http://t.co/VVDY7zWz3M", "Thu Apr 04 22:19:16 ": "@L_Bunce not at BPS conf next week as doing #bedtimelive but later on in year will be x", "Wed Apr 17 22:06:50 ": "Excellent as always on Newsnight my dear friend since childhood @giles_fraser. I think Jeremy P hearts you! Ps they well powdered ur face X", "Sun Mar 31 21:41:42 ": "Last letters of the happy Easter chocs x x http://t.co/VXOc6pnhhd", "Thu Apr 04 17:31:56 ": "RT @YoungMindsUK: One in 12 young people deliberately self-harm. Can we get 100 RTs to raise awareness? http://t.co/vegyiukCQI", "Mon Apr 08 23:01:32 ": "@RacheDug44 sorry new to twit and rubbish. Cry it out not great-prefer intermittent reassure with a ssh and leave so know not abandoned X", "Thu Apr 04 22:44:17 ": "@RachelFoxxy0512 and you x", "Fri Apr 05 10:08:44 ": "RT @mrjakehumphrey: Doing voice overs with @proftanya for this weeks #BedtimeLive, Channel 4 on Tuesday 8pm. http://t.co/NOb7bianKp", "Thu Apr 04 21:33:15 ": "@lucyphillips6 cowbells on door to hear them come in then rapid return to bed with calm sssh and leave. Repeat. Kind but non reinforcing x", "Thu Apr 04 23:03:04 ": "@lilymaebyron ❤", "Wed Mar 27 22:27:05 ": "@ferrifrump something I know you'll love!  http://t.co/AbnRxevQaN", "Thu Apr 04 21:40:11 ": "@1desney thank you! I am part of an amazing profession see http://t.co/n8HLZnIJON", "Mon Apr 08 22:37:33 ": "@QuiltingMuriel this wonderful amazing lady follows me. Follow her too. 94 and an inspirational twitter legend. Go Muriel! X", "Wed Apr 03 22:16:26 ": "@mrjakehumphrey don't worry after coaching me on how to do Live TV you have me on speed dial for Flo forever! 👶 x x", "Sun Mar 31 14:03:59 ": "@giles_fraser monster munch clear winner if they didn't require being picked as claggy lump off palate. Happy Easter Gez &amp; Fraser family. X", "Sun Mar 31 23:15:55 ": "@hillman_hayley hey Haley how you and your LOVELY family? X", "Thu Apr 04 22:23:48 ": "@hillman_hayley @EdgeHillUni a good choice! Am very proud chancellor. I will show your girl Em around x", "Fri Apr 19 02:06:44 ": "2nite @Marthalanefox home for @justforkidslaw. This support worthy. I met once homeless young woman now trainee lawyer cos of this charity.", "Fri Apr 19 23:27:23 ": "RT @BetteMidler: Does NRA stand for Nobody Remembers Anything?  How many more of these events will we have to endure", "Tue Apr 09 23:14:07 ": "@pewbarneymcgrew @tiinsky thank you for your wonderful words about my dearest departed dad John Sichel. http://t.co/YhkyNkKPfn", "Fri Apr 05 21:13:20 ": "#George_Osborne take note as well ..... #iamdyslexicandproud", "Fri Apr 05 10:24:56 ": "@caitlinmoran happy birthday super talented gal! Mine tomorrow so we almost twins. Although I was first born twin by about 10 years x x", "Fri Apr 05 14:32:54 ": "Quite right! http://t.co/J4Ze1dfFAF", "Mon Apr 01 14:18:29 ": "RT @PsychTimes: Editor-in-Chief Emeritus of Psychiatric Times writes a blog on his recent NY Times letter... http://t.co/uT0sP8BwSZ", "Thu Apr 04 21:49:52 ": "@Lucyspeed is you just saying this cos you my pal? How's the divine Kitty girl? X x x", "Tue Apr 02 15:05:49 ": "RT @mrjakehumphrey: Tonight, I'm live from this studio with @proftanya. Channel 4 at 8pm https://t.co/uyjVVPO0aH", "Mon Apr 08 21:34:28 ": "@schooltruth hello you! We need meet up soon must please! Looonnngggg day! X", "Tue Apr 09 13:45:08 ": "RT @YoungMindsUK: From Left Foot Forward: Improving access to mental health services - it's time to act now http://t.co/hw7uij0nrq", "Tue Apr 16 11:26:24 ": "@mrjakehumphrey where are you? I am here and waiting for you. Hurry, hurry! X #bedtimelive http://t.co/IjNmFsEIom", "Mon Apr 08 22:17:07 ": "Once upon a time.... http://t.co/mxVfxnb2oV", "Mon Apr 08 23:12:22 ": "RT @lindasgrant: Newsnight managed to find a total of one woman to comment on Thatcher, reflecting the political reality of those times", "Sat Apr 06 09:20:35 ": "Brilliant woman writing brilliantly about another brilliant woman. Excellent piece by Grace Dent. http://t.co/bmSNhnmzmm", "Thu Apr 04 22:44:48 ": "@reevesy747 my girl the beauty!", "Fri Apr 05 21:22:45 ": "@QuiltingMuriel you rock at 94 and just BRILLIANT AND FUNNY", "Tue Apr 09 10:46:32 ": "RT @YoungMindsUK: .@girlguiding sign up to @NoMorePage3 campaign via @bbconline http://t.co/OiHqv7LY5b", "Thu Apr 04 23:08:35 ": "RT @lilymaebyron: @ProfTanya best mama ever... #parsnip", "Mon Apr 08 22:20:59 ": "@icebreezer23 don't I know it. My husb rocks. #dadsunderrated", "Sat Mar 30 13:29:09 ": "RT @AnitaHOConnor: @ProfTanya @AbbiesArmy We 3 mums raising funds for vital research into terminal kids brain cancer-wld u watch &amp; R ...", "Sun Apr 21 00:23:06 ": "Good luck @giles_fraser and all marathon runners. Will be cheering for you x x x", "Thu Apr 04 22:29:54 ": "#jammin with my girl xx http://t.co/EJKOZaFWfM", "Thu Apr 04 22:14:27 ": "Sorry ... My girl Lil (18) intro me to #OneBorn and she and me crying. Great TV.", "Wed Apr 17 21:33:00 ": "Nasty misogyny. Yuk. #wemayhaveavaginabutcalluswomen. Thank you. http://t.co/yvuDpyu3jM", "Thu Apr 04 21:38:39 ": "@reevesy747 TY! Got your text on way to clinic. Shared it with my magnificent team who do the hard work and often get only criticism", "Mon Apr 15 08:20:49 ": "“@rhodri: @proftanya I'm definitely going to be wearing them.” No more curtain anxiety then.", "Fri Apr 05 21:08:09 ": "@CarolWard1973 TY! Humour=sanity. Makes bleak better. But in my clinics there r lives where humour doesn't cut it #George_Osbourne take note", "Mon Apr 01 20:01:26 ": "RT @Shell_Stevenson: @C4BedtimeLive Tried gradual retreat with my 2 year old tonight and succeeded! 8pm bedtime and a story. Asleep by 8 ...", "Fri Apr 12 21:26:39 ": "RT @schooltruth: Is sock darning really in the new National Curriculum? Really?!!", "Thu Mar 28 20:51:58 ": "RT @YoungMindsUK: One in 12 young people deliberately self-harm. Please RT to raise awareness and show your support for our work. http:/ ...", "Sun Mar 31 23:50:47 ": "@BernadetteStric and you xxx", "Sun Apr 21 00:59:38 ": "Woman gives 'mum stare' and breaks up fight. Bloody brilliant &amp; brave. Big respect to Naomi Spencer. Via @ian_beckett\nhttp://t.co/aiZ4zggNG9", "Thu Apr 04 08:39:19 ": "RT @RealMattLucas: I done another song! A little nostalgia for those of you who miss morning assembly... https://t.co/a7Mg81NOG6", "Thu Apr 04 21:41:22 ": "@EmmaWard2206 Emma you are amazing mum and your boys happy and sleeping. Well done to you all. Sleep well. X", "Wed Apr 17 01:37:20 ": "Just to say to you Florence @mrjakehumphrey, your daddy, who taught me to do live TV is a properly brilliant bloke. We did #bedtimelive xx", "Thu Apr 11 20:32:08 ": "RT @mattgriff1968: @ProfTanya thanks for the follow! Thought you might be interested in @youthmusic the charity I run", "Mon Apr 08 22:24:40 ": "RT @ThisisDavina: @ProfTanya ha ha!!", "Mon Apr 08 21:38:30 ": "@MumsnetTowers thank you for the web chat tonight. I love Mumsnet - a virtual hang out with properly interesting and challenging women.", "Mon Apr 08 23:09:33 ": "@RacheDug44 Xxx", "Sun Apr 14 20:15:15 ": "China press Thatcher obit. Hilarious eg of endless to &amp; fro translation = article with naive honesty of a 5 yr old. http://t.co/fvzD8QP5Lw", "Thu Apr 04 21:50:46 ": "@Joeandcamsmummy very hard to witness sweetheart but see other tweet re advice x", "Mon Apr 15 08:15:39 ": "@rhodri if you don't like them you can always fashion them into culottes. Apparently what all be wearing this summer. http://t.co/T5yHcTZLBD", "Mon Apr 08 23:07:04 ": "@RacheDug44 ooooh cry away. Me and my sis used to call it a boofest. Nothing wrong with it so long as you got good pal with u.", "Tue Apr 16 10:43:12 ": "RT @historyweird: 1614: Swiss doctor Felix Platter tells of a patient whose bottom was invaded by a small mole, which did \"much damage\"  ...", "Thu Apr 11 16:44:10 ": "Grim grim reading about bleak future for our kids and teens under austerity measures. We are FAILING them. Please RT http://t.co/jZ9WazGKFp", "Thu Apr 04 21:43:01 ": "@thekatebush happy of it works for you and your family x", "Mon Apr 15 09:33:36 ": "RT @KidsCo_Tweets: Every day, too many children are living in poverty. Text KIDS HELP to 70700 http://t.co/JujMxQQelU #makeitstop", "Sat Apr 20 15:16:52 ": "RT @schooltruth: Gove gets his facts wrong again about longer school days and shorter holidays in the Far East http://t.co/F4IZqtYiXU via @…", "Fri Apr 05 08:08:55 ": "RT @polblonde: My @IndyVoices column - The Vogue Factor: Fashion really isn’t worth dying for http://t.co/R114TH3uYj http://t.co/1eSMkVKn6T", "Mon Apr 01 14:26:01 ": "RT @SirKenRobinson: The continuing, disturbing rise of casually diagnosed ADHD. How long before everyone has a version? http://t.co/2W8p ...", "Fri Apr 05 22:04:05 ": "RT @gritts1: @ProfTanya Hi Tanya, trying to bring my boys up to respect women. This may help http://t.co/QHfiyPpmX4 #newsnotboobs #endth ...", "Fri Apr 05 21:23:07 ": "RT @QuiltingMuriel: Just took a fun online brain test. Says my brain age is 60. Damn. I thought I was much younger than that.", "Fri Apr 05 21:16:00 ": "Or would that be @George_Osborne ? #dyslexicandtiredandofftobed x", "Thu Apr 11 16:49:55 ": "RT @joblanchard42: @ProfTanya I work daily with vulnerable young people &amp; its heartbreaking when they tell me 'can't afford to eat m ...", "Thu Apr 04 21:47:37 ": "@lucyphillips6 go for it girl ! X", "Thu Apr 04 22:11:57 ": "Just home from clinic and my girl Lil", "Mon Apr 08 23:11:47 ": "@SimonNRicketts new to twitsphere and enjoying you most.", "Mon Apr 01 00:05:31 ": "RT @nypost: Kids haven't become sicker these days - we're just over-medicating and over-diagnosing them http://t.co/eJJ0xbijc8", "Sat Apr 06 09:21:17 ": "RT @gracedent: My fan letter to Mrs Justice Thirlwall: The one woman Philpott couldn't defeat. http://t.co/xbkLBh2ALI", "Fri Apr 19 23:50:06 ": "@rhodri turn off the telly and fashion your curtains into culottes as a more useful venture.", "Tue Apr 16 00:56:04 ": "@mrjakehumphrey Flo will a real difference in this world as will my kids Lils &amp; Jack &amp; many others of their generation #nextgenerationbetter", "Thu Apr 11 20:27:54 ": "“@ferrifrump: who plays Angel in VIVA FOREVER! http://t.co/mtTLizaNCV #VivaForever”", "Fri Apr 19 02:09:57 ": "@Marthalanefox you rock xxx", "Fri Apr 19 23:10:30 ": "RT @staceymeyer75: @PsychToday @ProfTanya wrk in child social care,early intervention.many diagnosed ADHD more due 2 environmental factors#…", "Fri Apr 12 21:37:43 ": "“@schooltruth: Put the world to rights tonight with @ProfTanya .” Love having this amazing brilliant woman as a friend #inspirationallady", "Thu Apr 04 21:48:13 ": "@reevesy747 can you run the health service please? X", "Fri Apr 12 15:25:43 ": "RT @YoungMindsUK: .@Rethink_ have produced this excellent guide to the benefits changes. If affected it is definitely worth a look http: ...", "Sun Apr 14 19:21:44 ": "RT @Sectioned_: Despite sharp increase in demand, 2,000 psychiatric beds (12%) were closed last year. Some areas have no beds. http://t. ...", "Thu Apr 04 21:45:44 ": "@Joeandcamsmummy we are managing night terrors. See bedtime live website for advice and Prof Gringras with me on this weeks show &amp; show 5 x", "Fri Apr 05 20:43:57 ": "Yep I get this .... http://t.co/QDqHsWjvFO", "Fri Mar 29 00:23:46 ": "@ben_whitby1 wet wipes x", "Mon Apr 08 22:33:36 ": "RT @PsychToday: \"Rates of ADHD diagnosis are skyrocketing for adolescents and for girls. How come?\" http://t.co/jr08fF39Pm", "Fri Apr 19 21:15:58 ": "Dear twitterers plse sponsor me (if you can) as a member of Jen Saunders Moonwalk team 2 raise ££ 4 breast cancer.\nhttp://t.co/liZuRfdyoG", "Fri Mar 29 00:12:23 ": "@EmmaSweetJanes hello hello lovely Emma brilliant sleep specialist with me on #bedtimelive X", "Tue Apr 16 00:44:18 ": "RT @giles_fraser: Many will be running the London Marathon this Sunday in solidarity with the people of Boston. Tomorrow will find a Red ..."}