{"Thu Apr 11 19:59:45 ": "i picked up a penny for good luck then immediately sanitized my hands. all money is dirty money. but i still want lots of  it.", "Wed Jan 02 22:35:04 ": "when you get a feather &amp; glitter headband &amp; titty tassels for your son's 1st birthday from 2 different people, you've done something right.", "Fri Nov 02 01:36:11 ": "Tune into @sunnymailbag tonight for the next chapter in the Charlie/waitress saga! Love? Lust! Murder...? #sunnyfx", "Wed Apr 17 18:27:43 ": "YEEEEEEESSSSS! but what will i do after this?! The final 8 eps of #BreakingBad air starting Sun, Aug. 11th. luv @BryanCranston @aaronpaul_8", "Mon Apr 15 03:45:15 ": "@TotallyLaime you should have covered your foot in booze or cocaine if you were gonna put it in your mouth. that always helps a hangover.", "Wed Jan 16 06:44:44 ": "just felt like sharing tonight i guess. and i leave you with this: http://t.co/uwYKjsWi", "Tue Nov 20 15:45:26 ": "woke in the middle of the night with this realization from a dream: you're a BABY. you can't drink beer.", "Fri Apr 19 19:58:54 ": "watched a scene w/ @kaitlin_olson as Sweet Dee &amp; @rajskub as Gail The Snail on the set of @alwayssunny today. just u wait! #hilariousladies", "Mon Apr 15 21:17:55 ": "Boston, my thoughts are with you. This is horrible.", "Tue Apr 16 02:45:10 ": "the good news in the face of tragedy is that we humans also have an enormous capacity for love. http://t.co/8Z4RDRmDHc", "Sun Apr 14 03:15:55 ": "we watched \"alien\" last night. that shit holds up. #scary any suggestions for a follow up tonight? (\"aliens\" being perhaps too obvious?)", "Sun Dec 23 06:03:39 ": "love you louis. happy holiday dears! http://t.co/WWNiI66h", "Sat Oct 06 04:47:51 ": "@ChivasCasual mmmm-people already mistake me with pam anderson like all the time.", "Tue Feb 19 20:29:54 ": "http://t.co/vYjlnlP7 mississip y'all. it's this kinda day.", "Mon Dec 17 04:56:08 ": "and this is pretty rad too. http://t.co/JObiO2IR", "Thu Jan 17 06:32:31 ": "@dbattah16 aw. thank you.", "Thu Apr 11 04:03:57 ": "this is exciting to share. come to a taping of my pilot! http://t.co/BbWxnojLv4 i look a lot like @ohsnapjbsmoove in the promo pic.", "Wed Apr 17 16:52:02 ": "greg garcia pilot last night w/ @beaubridges1 @margomartindale @arnettwill @MichaelRapaport @ohsnapjbsmoove Dir: jimmy burrows. i'm in love!", "Sat Apr 13 02:59:46 ": "@HappyEndingsABC fans, a confession: i once called @Shmartemis the c word in a game night rage. sorry art! R u ever a total jerk 2 ur #bff ?", "Sat Oct 13 21:37:31 ": "12:30 am woke to someone pounding on my door! called police. 40 yr old man who hit a pole by our house. leave a note dude! it's 12:30 am!!!", "Fri Feb 15 18:03:26 ": "meant to send yesterday for vday. hpe it was grand. love. http://t.co/450oXmjy", "Wed Nov 07 04:58:02 ": "RT @Glenn_Howerton: Rock Flag and Eagle baby. #OBAMA", "Wed Feb 27 22:39:25 ": "thanks guys, i'm pretty pumped! Mary Elizabeth Ellis To Star In CBS’ Greg Garcia Pilot, http://t.co/t64aBpYGOU via @nikkifinke", "Sun Apr 14 04:34:38 ": "watching cloud atlas now. and i'm tweeting. does that tell you something? i'm about to start coloring. \n#idonthavethefocusforthisrightnow", "Mon Mar 04 21:06:06 ": "love is paradise. thx for 7 amazing years, cpd. http://t.co/cB3hJ8dBG4 enjoy the beautiful michelle williams.", "Sat Dec 08 22:31:46 ": "@nataliemorales thank you pretty lady. you are great!", "Wed Jan 16 05:40:31 ": "yes. http://t.co/bY07CHnU", "Sat Mar 16 21:26:53 ": "is there an itunes type thing for short stories? i'm kinda addicted.", "Wed Oct 31 17:32:38 ": "I'm going as a Newport cig smoker 4 Halloween b/c w/ their racially diverse friends, they have the most fun! You? #boo  http://t.co/QRQc0SGj", "Mon Dec 10 16:26:34 ": "Just wrapped the movie i was shooting in nyc #thetruthaboutlies. it was a good time. hope it turns out well!!!!", "Sat Oct 06 04:48:12 ": "@DimitriDrums you should get my arm on your face.", "Wed Mar 06 04:00:22 ": "@samwalks128 thanks!!! we're making another movie soon. judy greer is attached!", "Fri Apr 05 05:16:17 ": "thanks for all the short story tips kids! can't wait to tear into 'em.", "Mon Dec 17 04:33:41 ": "a year ago yesterday the person i grew erupted forth from inside me! He's absolutely the best person ever in the world. ever. ever. ever.", "Sat Oct 06 04:46:19 ": "@robgonzo my dad could.", "Fri Apr 05 05:10:49 ": "\"so sorry i'm late, but i brought you a little gift. it's an apache tear from a wizard in san francisco.\" #overheardinsilverlake", "Fri Apr 12 05:17:57 ": "my character daphne returns! (for a split second) ALL NEW episodes of #HappyEndings TOMORROW NIGHT, starting at 8/7c pm!!!! On #ABC !!!", "Wed Jan 16 05:42:00 ": "@TotallyLaime who has kkds long enought to have to reheat them? nazis. are you a nazi, laime?", "Sat Oct 13 04:58:42 ": "@renesugar @lizzwinstead @GranholmTWR @LadyPJustice I'm honored to be included in this group. Hope you had a great show!", "Wed Jan 09 06:31:38 ": "every time my son's toy plays \"nick nack patty wack\" my brain always finishes \"i still got the biggest sack, so put ur gun away run away...", "Sun Oct 14 17:39:15 ": "@lennonparham @RespectTheOpr8r yeah- i just ended up looking at all the retouched celebrity photos. and let me just say...shocking.", "Tue Oct 09 04:04:53 ": "@LexThomasAuthor At least one. Let's go visit them soon!", "Thu Dec 06 23:46:53 ": "i'm on \"up all night\" tonight! and also, on the streets of manhattan. a girl's gotta work.", "Tue Nov 06 20:23:23 ": "RT @natashaleggero: Vote this http://t.co/iBmx689J", "Tue Nov 06 21:23:59 ": "RT @thomaslennon: Turns out you ARE allowed to yell \"Suck it, mer-man ghost of Bin Laden!\" when you cast your ballot.", "Sat Apr 20 02:36:05 ": "http://t.co/uI347Ditm4 this is incredible. until it comes to life and eats us all. which is actually incredible in it's own way as well.", "Sat Dec 08 19:22:16 ": "Watch @nbcsnl tonight for a possible glimpse of ur favorite illiterate rat killer! Along w/ hilarious @iamjamiefoxx I'm pretty pumped! #SNL", "Sun Apr 14 23:49:41 ": "Sunday in the park. Nothing is sadder than one guy in a drum circle. #whereyourfriends?", "Tue Oct 02 03:41:39 ": "RT @voguemagazine: Actress @OliviaWilde opens up on her role in the new documentary, Half the Sky, airing tonight on PBS: http://t.co/J3 ...", "Tue Nov 13 05:18:28 ": "@thecgreenwood against state? definitely! hotty toddy! and geaux tigers.", "Thu Dec 13 23:15:27 ": "tune n 2 \"up all night\" on nbc 2night- i make out w/ luka jones! a week of makeouts for 30 min of tv. my job is weird. &amp; hot. @NBCUpAllNight", "Wed Jan 16 17:46:19 ": "@talkin_goat23 no. that is the flu. or, &amp; i don't want to freak you out, probably throat cancer. smoke a couple cigs. that should kill it.", "Tue Oct 09 03:33:46 ": "i have a new favorite thing; met him at the zoo. http://t.co/cpU2p5ip Like something from a guillermo del toro film! u gotta c 4 urself!", "Sat Oct 06 04:47:26 ": "@ruunyi yes- maybe a glass of wine on my palm. i like. it really says \"i like wine\".", "Thu Apr 18 03:15:26 ": "c'mon, m.e., you're in a show w/ big time guys like @MichaelRapaport &amp; @arnettwill don't try too hard...nailed it! http://t.co/gj4EpgYBv5", "Fri Sep 28 04:11:56 ": "When my human baby is sleeping my habit baby comes out to play. #dontmixupyourbabies http://t.co/LmbkAwtl", "Sat Oct 06 04:49:05 ": "@Deesdoubledrop that looks like a \"my name is sticker\" on my chest. you know some asshole out there thought that'd be a great idea.", "Wed Nov 07 07:01:30 ": "\"we are greater than our individual ambitions.\" i'm excited 2 see the great things we can do 2gether. put your flag in your hair &amp; let's go!", "Fri Apr 05 05:24:37 ": "played @jormataccone 's wife in a @thelonelyisland video 2day! other than maybe having stomach flu those 3 dudes r str8 rad. #dreamcometrue", "Sun Apr 14 03:29:11 ": "thx! so many good suggestions for movie night. prometheus is intriguing.... we have a screener for cloud atlas. thoughts?", "Tue Nov 20 05:09:50 ": "pregnant mom: the decaf isn't ready. 3 yr old kid: what's that? m: the coffee mommy drinks. k: that's bullshit. (pause) m: that is bullshit.", "Thu Oct 25 03:11:43 ": "Just, yeah. I mean, it was 2pm. http://t.co/DRbrhLuR", "Fri Mar 08 04:32:59 ": "my best friend is one helluva dancer. @Shmartemis  http://t.co/i4mX3BtVMr #iloveartemis", "Wed Jan 16 06:01:54 ": "@KT_Borton i concur.", "Tue Nov 06 03:50:25 ": "RT @iamrashidajones: Ladies, this is our election. DON'T TAKE YOUR RIGHTS FOR GRANTED. Old dudes want to control your bodies w/laws. Don ...", "Wed Jan 16 05:41:08 ": "@wayansjr see you thursday. #cahavesome?", "Wed Jan 16 17:43:53 ": "@CourtneyFarrel9 @AlwaysSunnyFX @aspen_dryman  it is a great question. a question for the ages.....", "Thu Feb 28 03:05:28 ": "@TotallyLaime wanna get a drink?", "Sat Oct 06 04:22:13 ": "i want another tattoo. thoughts? ps- please don't tell my parents. yeah, i'm a 33yr old mother. SO?!", "Fri Dec 07 17:57:02 ": "u know when u burn food in ur residency hotel &amp; set off the fire alarms? embarrassing. u know the 2nd time u do it in a week? #iamadummy", "Fri Mar 15 20:12:30 ": "children's motrin smells exactly like cake mix. which is so disturbing. &amp; also why i keep liking my son's face &amp; may seem very out of it.", "Sun Apr 21 02:45:59 ": "we just ordered delivery sushi. enough beer should kill anything dangerous, right? sigh. if i never tweet again, you know why. #deathbysushi", "Thu Oct 11 19:06:48 ": "to quote waiting for guffman: it is the day of the show, y'all. got a good one for ya! #sunnyfx @sunnymailbag", "Tue Mar 05 22:13:13 ": "#ivoted and you should too, LA! Who our mayor is is a BIG DEAL!  http://t.co/0nOehNAWdS", "Sun Apr 14 03:09:04 ": "literally no one responded to my last tweet. apparently i'm the only asshole on twitter to ever call her bf the worst thing you can think of", "Wed Apr 17 19:23:26 ": "@christung15 @BeauBridges1 @MargoMartindale @arnettwill @MichaelRapaport @ohsnapjbsmoove the crew was awesome!", "Thu Apr 11 04:19:47 ": "@RMcElhenney woohoo! i'll be there soon! you can't stop me. not even with your karate dancing.", "Fri Sep 28 04:06:40 ": "@bryanmcintyre_  that looks like peepee pickle juice. but it also looks kinda like beer. so i'll drink it.", "Wed Jan 16 05:55:34 ": "@TotallyLaime eat 6 krispy kremes and say 6 hail marys. http://t.co/mB3TZjRW", "Sat Oct 06 04:46:41 ": "@heyapm i can not argue with this.", "Sat Oct 06 04:45:35 ": "@micaross i may get your precious kid's face tattooed on mine. weird for any/all involved? yes, and also hard to hide from my parents.", "Tue Nov 06 19:56:27 ": "GO VOTE! (for OBAMA) It's your right &amp; privilege as an American. Ladies- vote to retain your rights to choose for yourself. #election2012", "Wed Jan 16 06:18:23 ": "oh shit. http://t.co/r8SB4lWf", "Tue Jan 08 03:51:20 ": "can't stop thinking about portlandia premiere in nyc! got to meet the incomparable @Carrie_Rachel at natural history museum. #dreamscometrue", "Wed Jan 16 05:52:29 ": "watched new @lenadunham's @girlshbo &amp; @PortlandiaTV 2nite while drinking santa margherita &amp; shopping for toddler toys online. #thisisthelife", "Mon Apr 08 04:02:08 ": "@JoeHanstad gotta see if it tests well before they tell us that... we'll jut shoot the pilot first. fingers crossed!", "Mon Apr 08 03:31:28 ": "can't wait to start work 2moro w/ Greg Garcia @arnettwill @MichaelRapaport @ohsnapjbsmoove @BeauBridges1 @MargoMartindale ! #1stdayofschool", "Thu Jan 17 06:33:01 ": "@ellieshechet that is very nice of you to say.", "Sun Apr 14 06:29:12 ": "you guys, no. #cloudatlas i'm sorry.", "Fri Apr 19 19:55:06 ": "@nataliemorales ha ha! amazing.", "Sat Oct 06 04:46:08 ": "@gavin_lee13 how do you know my political alignments so well?", "Thu Apr 18 03:05:15 ": "@pint_ette @BryanCranston @aaronpaul_8 i know honey, but \"it's always sunny in philadelphia\" has one more season.", "Wed Jan 16 05:53:16 ": "@OhMeredith loved seeing you too! happy belated bday!", "Tue Nov 13 05:16:47 ": "can we get a 30 year ban on \"when a man loves a woman\" so i can like it again at some point? cuz damn i'm sick of that song.", "Wed Oct 10 16:57:26 ": "sunny season 8 premiere party last night. Ep was HILARIOUS! just you wait. See you THUR night! #sunnyfx http://t.co/IZ7d4Mh4", "Thu Nov 08 22:45:13 ": "just voted for my friend's business, SUD DE SUR, to win $25,000 from FedEx. #fedexgrantcontest http://t.co/ienSLCeX proud of y'all!", "Wed Jan 16 06:08:19 ": "i just got in a real 2pac mood. (yes, still buying toddler toys) i ain't mad at cha. got nuthin but love for you. http://t.co/ObaMoSeN", "Tue Jan 22 05:58:19 ": "things are new and then they're not. time passes. memories are more than that. time exists forever in certain space. http://t.co/oh8OOJN0", "Tue Jan 01 06:29:05 ": "happy new year darlings! hope you're warm on ur hands &amp; inside your hearts. this can be the best year ever. we can make it so. best wishes!", "Mon Jan 07 06:09:51 ": "i never got to have a stripper phase, so i'm thinking of filling the void by becoming a professional mourner for a while. #bestfuneralever"}