{"Thu Jan 12 15:14:11 ": "Buys having great fun locked up with Anders Bagge and the Apollo Drive guys in Bagge's studio west of Stockholm...", "Sat Apr 14 10:59:55 ": "Greek heterosexuality never looked more sensual in one of the strangest fan videos ever made. Fabulous! http://t.co/0DGvJJCs", "Wed Mar 14 13:36:22 ": "RT @Bardissimo: Gravitonas \"Call Your Name\" video now on You Tube. Enjoy! http://t.co/yselCSCk", "Mon Nov 14 21:55:48 ": "Daylight is almost gone, Scandinavia moving into permanent darkness, time to write songs with sublime drama and beauty.", "Tue Feb 28 18:04:03 ": "RT @ajkeen: just Skyped with the great Alexander Bard. He told me that the Internet has replaced God as our metaphysical belief system.  ...", "Sat Dec 31 09:03:31 ": "Monasteries isolated in mountain valleys are naturally the best places to exercise shamanism. Far away from crowds.", "Fri Dec 02 07:13:05 ": "Sweet morning performing live at TV4's Nyhetsmorgon followed by great day shooting fashion with bellaobastian in Borås. Long Thursday!", "Fri Mar 22 14:53:56 ": "Check out brand new U.S. remix of Gravitonas \"Incredible\" from Jody den Broeder now available on promo release! http://t.co/7iKd5S9DvB", "Thu Dec 15 07:54:18 ": "‎\"We Never Give Up\" with Kiss-My-Ft2, written by a certain Andreas Öhrn from Gravitonas, enters Japanese Singles Chart straight in at #1!", "Tue Feb 14 15:23:13 ": "Why leave the cosyness of the studio with Per QX for the Grammy Awards? We are not.", "Mon Nov 28 10:55:58 ": "So the specialists claim to have solved the puzzle of the Copiale Cipher, but have they really? Gravitonas have! http://t.co/2kXZquF9", "Wed Dec 14 16:01:05 ": "Thank you, Unistar in Belarus, for supplying the first radio #1 for Gravitonas \"Lucky Star\": http://t.co/GoiDiH08", "Mon Oct 24 08:46:28 ": "Thank you everybody at Artefact and Mercedes Benz Fashion Week for the great party at the GQ Bar last night. A pleasure to perform there!", "Sun Aug 12 19:23:27 ": "Gravitonas \"Call Your Name\" enters the Billboard Club Chart Breakout Rotation list at #5 this week! http://t.co/IXtZ8p1P", "Mon Dec 19 13:41:55 ": "And you thought the Arab spring would be confined to the Arab World? Just look at what's happening in Kazachstan and Congo this week.", "Wed Oct 12 20:08:10 ": "There is just too much chatter. There is not enough silence. We need to build a new safe house with thick concrete walls.", "Sun Apr 21 12:50:01 ": "We are happy to announce #Gravitonas have entered the Billboard Club Chart in the U.S. with \"Incredible\" at #46! http://t.co/ll3FypwqFI", "Mon Nov 21 20:02:02 ": "Where Moscow fascinates with cold boldness, Kiev fascinates with irratic charm. Guess which of the two places we would rather live in?", "Sat Sep 29 07:54:53 ": "RT @myfizzypop: http://t.co/CDyYNO8q … review of amazing new single, Incredible by @gravitonas @Bardissimo @andreosaurus @soforecords GL ...", "Tue Jan 17 12:47:51 ": "Expect prophecies in literary form from the Gravitonas guys soming out on @StockholmText later his year!", "Mon Sep 26 09:02:38 ": "Did you see a guy with a huge egg in his hands walking down into the lake and disappearing under the surface? The Oracle just did!", "Mon Oct 03 08:00:20 ": "Welcome to the Twittersphere, @NataliDulce, when will we see you join the Gravitonasphere with your lyricalisms too? http://t.co/Gkamv1f1", "Wed Feb 29 16:22:35 ": "Bard & Söderqvist \"The Futurica Trilogy\" now available in English, globally and online! http://t.co/tpcA3f0h via @StockholmText", "Wed Nov 02 09:40:55 ": "So has dear @polyxenia found similarities yet between beloved Muse and new love Gravitonas? ;-)", "Fri Mar 16 06:04:51 ": "@Bardissimo And the Oracle of Gravitonas responds by saying hurrah to popfizzy Paul Reynolds, the long sought after Messiah of pop blogs!", "Mon Mar 18 12:06:56 ": "RT @Bardissimo: Hahaha, @LarryFlick, @Stephen_Neal, let's just say #ArmyOfLovers and #Gravitonas don't need to be pretentious. We starte ...", "Thu Apr 26 04:44:37 ": "Gravitonas \"Call Your Name\" climbs to #17 in the Ukraine music video charts! Voila!!! http://t.co/L3HtJ9zK", "Thu Mar 01 09:29:47 ": "The lawmakers of St Petersburg, Russia STINK! Stop their fascist idiocy now!\nhttp://t.co/OPzdgJAo", "Mon Jan 16 08:16:33 ": "Double studio sessions this week: Cooking up new tunes and soundscapes in both Stockholm and the Austrian Alps. 2012 will be busy!", "Wed Mar 07 10:59:42 ": "RT @Bardissimo: There's no way you can avoid that demanding rock star stare! Trousers off! http://t.co/dgpKtwuq", "Fri Dec 09 00:09:39 ": "Moscow really is a happening place these days. Great parties Wednesday night, but the real buzz is Saturday and demo against election fraud!", "Fri Mar 08 09:32:09 ": "Feel welcome to enjoy the U.S. release of #Gravitonas new single \"Incredible\": http://t.co/ItJaSVTOJd", "Wed Apr 11 12:59:44 ": "RT @Bardissimo: Armand Mirpour does a really sweet job with the niqabs in his brand new video \"Lady Luck Hotshot\". Fresh! http://t.co/8X ...", "Wed Feb 27 14:18:53 ": "We're very proud to announce the kickstart of the U.S. promo campaign for the new Gravitonas single \"Incredible\". http://t.co/nUPGOfDhb6", "Thu Dec 22 08:56:55 ": "Beards are back and they are back to stay. Who wants to look like a German banker when you can look like a Nietzschean hipster?", "Tue Nov 01 10:18:40 ": "Inspired to write new great songs by latest books from Swedish writers Fredrik Härén, Martin Tistedt, and Mikael Fant.", "Wed Jan 04 01:08:08 ": "There are four human drives: Hunger, thirst, shelter, and intoxication. Only idiots fight them. Clever men handle them with outmost care.", "Wed Mar 13 16:35:05 ": "You're most welcome to check out the brand new U.S. club remixes of Gravitonas \"Incredible\"! http://t.co/0SvmDFQUu6", "Wed Feb 29 07:40:48 ": "Tech Celebrities Bard & Söderqvist Foretell the Future in \"The Futurica Trilogy\": http://t.co/tILie3N0 via @SeattlePI", "Mon Sep 17 19:29:45 ": "RT @Bardissimo: Roby Garcia from @promotionlift has interviewed Alexander Bard from @Gravitonas on the status of pop culture in 2012. ht ...", "Fri Nov 25 14:56:57 ": "Gravitonas are rehearsing as a complete five-man band... This is not just a sect, this is a whole damn orchestra.", "Wed Oct 17 13:07:10 ": "RT @myfizzypop: http://t.co/HFpmxoCH review of the brilliant new EP Hyperborea by those always talented @Gravitonas chaps @Bardissimo @s ...", "Fri Sep 28 15:03:50 ": "RT @Bardissimo: Please feel welcome to check out the brand new video for Gravitonas \"Incredible\" on the Tribe of Gravitonas website: htt ...", "Sun Nov 13 18:58:52 ": "The Oracle is pleased to see latest Gravitonas collaborator @KallaySaundersA in the twittersphere!", "Tue Sep 27 07:36:45 ": "Alexander Bard is waging a war on TV4 against Twitter The Corporation over its abysmal handling of fake identities: http://t.co/WXKUuCL2", "Wed Nov 16 17:57:05 ": "Why isn't everybody in the twittersphere as attractively dressed as our new favorite @makisemman?", "Fri Mar 23 19:02:29 ": "Thank you £GayTimes for a great review of the Call Your Name single and video! http://t.co/pmE5ab5W", "Tue Oct 02 15:07:45 ": "RT @Bardissimo: SoFo Records (Gravitonas, Alex Saidac, and others) now has its own permanent playlist on Digster and Spotify! Feel f… ht ...", "Sat Sep 01 08:38:23 ": "Gravitonas \"Call Your Name\" enters the Billboard Club Chart Top 50 in the Uinited States at #43 next week! Fabulous!", "Tue Jan 10 22:02:38 ": "Dear @otterluver, please explain to this confused Oracle what an NSFW is. I don't dare to ask the boys, being busy in the studio all night.", "Tue Feb 28 18:10:53 ": "The world's most sophisticated book trailer - The Futurica Trilogy: http://t.co/LLCJ7Rb6 via @youtube", "Fri Dec 23 06:21:01 ": "Now, where is that infamous global plastic bottle vortex located? In the Pacific, the Atlantic, or the Indian Ocean?", "Sat Oct 22 08:34:14 ": "Lufthansa know how to deliver bodies point to point. Delivering checked-in luggage however is not their thing. Lost and not found.", "Sun Nov 27 00:02:55 ": "Cooking electro in Kiev basements, The Oracle heralds @kruglov1212 and his/her entry to the tittersphere!", "Tue Feb 21 10:01:41 ": "What is going wrong with the once beautiful city of St Petersburg? http://t.co/9HnGzBwW", "Wed Oct 19 09:17:38 ": "How do you get out of Santorini if ferries and flights are on strike? Resign to your fate and stay in paradise?", "Wed Dec 07 07:21:17 ": "Performing at the Universal Russia Winter Party in Moscow tonight - then off to the Top Hit Ru Party for a Roma Kenga duet...", "Wed Nov 23 15:21:04 ": "At least one half of Gravitonas will do  sectarian things in Malmö this weekend with @BehKian and friends.", "Thu Nov 10 22:19:52 ": "Thanks to NRJ Fashion Awards in Helsinki for hosting Gravitonas this year. Hope to see you soon again, we love cool gothic Finland!", "Mon Feb 27 19:34:25 ": "Ooohhh, nice to find @tasos_freak here in the twittasphere too!", "Fri Apr 12 05:22:32 ": "RT @Bardissimo: The NORD remixes of Gravitonas \"Incredible\" are out now on promo release in the U.S. http://t.co/2Kh1rbazPp", "Thu Oct 06 08:55:50 ": "Did you wonder why the slaughtering of the bull was a sacred ritual around the Mediterranean since ancient times? Keep guessing!", "Sun Nov 06 17:09:10 ": "Separate nations this week for Gravitonas, but Alexander cries his heart out for the passion of the music in Aftonbladet the paper edition.", "Tue Feb 28 18:23:45 ": "RT @ajkeen: here is Alexander Bard's vid for his Futurica Trilogy http://t.co/oDCyqKyM  the world's most sophisticated book trailer? Pro ...", "Wed Mar 14 01:37:52 ": "RT @Bardissimo: So Gravitonas have a new little music video out for \"Call Your Name\". Enjoy! http://t.co/1TXDTGI0", "Sun Oct 02 08:55:33 ": "Alexander off to Spain with Henrik and Andreas in the Alps, Gravitonas are songwriting this week. Like king and queen, laboring separately.", "Sat Apr 13 07:57:34 ": "RT @GuenaLG: @spyridonkagkas @Gravitonas @Bardissimo Haha! We gave Greece strength to move on, and you know, everything is brighter!", "Tue Nov 08 21:08:57 ": "If arty means doing pop culture with some kind of substance, with not everything being blatantly obvious, then I guess arty is what we are.", "Wed Nov 02 09:49:42 ": "@PRoM_LibelDept, equally inspired in return!", "Mon Mar 05 10:14:45 ": "Video for Call Your Name launched next week. More news soon. Twin video for rock ballad The Pain We Love To Hide coming end of the month.", "Tue Jan 10 23:54:28 ": "Support the people of Syria against the brutal dictatorship of the Assad regime! http://t.co/lampTI9Q", "Wed Dec 19 06:18:45 ": "RT @Bardissimo: Have a first free listen to new collaboration \"Brighter\" with Guena LG featuring Gravitonas, released late Jan 2013 http ...", "Thu Mar 01 11:05:22 ": "Back in the studio, why the hell is this sooo much fun, we're the envy of the world!", "Sat Sep 29 09:16:49 ": "You just have to watch Lee Hirsch's amazing documentary \"Bully\". See and expose the inside of today's childhood hells! http://t.co/MOtkiKPC", "Sun Jan 08 14:41:09 ": "Dearest @liubadyomkina - we started Gravitonas since we love making music together, and because we believe the world needs music like ours.", "Wed Feb 01 08:14:29 ": "Why must there be a single followed by a video followed by an album followed by a tour? Formats are a prison. Break the spell!", "Sat Feb 04 01:07:31 ": "There are so many things you can do with fur that haven't been done that itäs absolutely annoying. Have you heard the sound of fur?", "Fri Mar 16 11:17:24 ": "You're most welcome to check out the new updated Tribe of Gravitonas home page, all you Gravitonians out there! http://t.co/OKkdv69D", "Tue Apr 17 08:25:04 ": "RT @Bardissimo: Stepford pop is a Scandinavian invention: Donkeyboy, Alphabeat, Le Kid. Happy, happy, happy, agggressively happy. Sooo v ...", "Sun Jan 08 13:16:48 ": "The Gravitonas boys are hopefully soon to find out what they have in common with @Saturos79 - besides the beards...", "Mon Feb 13 11:35:14 ": "Exhausted after a full weekend's double video shoot, but it's going to look amazing! Thank you crew, totally!", "Thu Feb 09 07:25:57 ": "There is a large crew working their asses off day and night on a double video project promising to be something rather different.", "Thu Apr 11 22:21:58 ": "RT @GuenaLG: Big thanks to Music Fm 89.2 in Greece bringing Brighter feat. GRAVITONAS straight away at #2 in their playlist... http://t. ...", "Wed Apr 25 13:05:38 ": "Really enjoy working with Per QX in the studio in Stockholm. With the 1990s revival soon at its peak, seems time to revive the millennium!", "Sun Oct 30 16:21:49 ": "There is only solution to world problems: Reclusivity! Fortunately Scandinavia is full of isolated haunted houses for inspiration.", "Thu Nov 24 05:53:04 ": "The Oracle of Gravitonas is very happy to Greet His Twittership @IsaakGeorge, here's a toast to future Swedish-Greek collaborations!", "Mon Dec 19 09:51:23 ": "Thanks for the add, @AllureOfSounds! Gay men have great taste so we put a gay man behind the computers in Gravitonas!", "Fri Dec 30 18:14:40 ": "Now we know for a fact that Bangalore has the best bars in India.", "Fri Jan 27 21:53:55 ": "Sooo nice to host Skyradio Estonia in Stockholm tonight. Weird and wicked studio story with the boys will be online at their website soon.", "Mon Mar 05 20:03:53 ": "Forthcoming Gravitonas hip-hop collaborator Rebstar has his own album \"Bad Karma\" out on Spotify today. Check it out! http://t.co/vDgfidSb", "Sat Sep 15 10:52:20 ": "RT @Bardissimo: October sees flood of @Gravitonas releases. \"Incredible\" is follow-up to current Billboard Top 30 hit \"Call Your Name\"!  ...", "Fri Oct 14 15:28:08 ": "The boys should need the pecs of @HWiklund in Greece this week. How will they get out of the country otherwise with strikes all around?", "Thu Nov 03 14:57:29 ": "If a book could be summarized in one interview only, dear @isobelsverkstad, it would indeed be a horribly bad book!", "Sun Dec 30 04:08:30 ": "RT @Bardissimo: Big pop blogger @myfizzypop ranks Gravitonas #14 among 20 best albums in the world in 2012. Thank you! http://t.co/4RuhI ...", "Sun Nov 13 13:27:55 ": "Andreas lovebombed by Alexander 11 minutes into this Swedish TV interview: http://t.co/5IeVZ4tX", "Mon Apr 23 12:09:53 ": "Thank you, Finnish Idol, for having Gravitonas on stage at last night's show. What a delightful little TV show you have there!", "Wed May 23 08:10:06 ": "RT @Bardissimo: Warmest congratulations to Compact Disco, Gravitonas' best friends in Hungary, for making it to the final round of Eurov ...", "Tue Apr 09 13:13:32 ": "#Gravitonas are soon to shoot an überhot video for forthcoming duet single \"Signed On My Tattoo\" with #ArmyOfLovers http://t.co/oja6uWnThK", "Fri Nov 11 21:15:58 ": "Gravitonas are enchanted to find @unistartop20 in the twittersphere, our favorite Belarusian radio station!", "Sun Nov 27 00:06:13 ": "So Alexander was seen brunching at Malmö Konsthall with @Alex_Esser and @BehKian - new surprising music and tech collabs coming up in 2012?"}