{"Mon Feb 25 22:26:33 ": "finally got my Facebook page looking half decent with a black &amp; white photo an' all. http://t.co/TT3cGnBgYq", "Thu Jan 31 22:52:44 ": "Love this place already http://t.co/b6EagSYh", "Wed Feb 06 12:24:09 ": "Really pleased to be able to finally say that in March I'm starting a label. Its called POLY KICKS &amp; first up is this   http://t.co/PgGR5qB7", "Sat Mar 23 17:33:20 ": "Last night was an absolute cracker. Although I think there should be a restraining order between alcohol and white noise generators", "Sun Mar 10 16:48:55 ": "Only thing they took were my MOLDED earplugs. Worth £150 to me and not a penny to them... good one", "Thu Feb 28 00:02:41 ": "RT @STHLDNORDNCE: @TesselaMusic \"Your band stole my daughter's name..... She was born before you guys!\"", "Sun Mar 10 17:08:47 ": "@sam_binga Mindless goons :/", "Thu Feb 07 12:16:59 ": "RT @Photek: Playing @dogmanotts with @TesselaMusic on March 5 https://t.co/ImIlPqrE", "Sun Mar 10 16:47:29 ": "Someone decided to steal my jacket last thursday from behind the dj booth.Realizing I've not got expensive taste they dumped it by the exit", "Sat Apr 20 10:12:43 ": "Poland bound.\nMyslef, Randomer, Benji B, Roska, Addison Groove and more playing in Wroclaw tonight.", "Fri Feb 01 18:17:32 ": "RT“@clouds: @TesselaMusic best club on the planet”\nTruth!", "Sun Mar 10 14:46:51 ": "@thejoeFarr oh reily? Yeah you can't update to mountain lion which is a real pain as I need to do a complete reinstall on my computer.", "Mon Feb 04 17:46:30 ": "@rubadub_glasgow Was great to finally check it out! hoping to get it up and running this evening with a bit of luck :)", "Fri Mar 22 10:32:51 ": "RT @kowton: Playing Recall in Bath tonight with @gramrcy and some bloke called Ed.", "Sat Mar 02 06:01:38 ": "Fabric was a great laugh, out to @gramrcy for walking from Fabric to Victoria", "Thu Feb 07 12:34:38 ": "I had a quick chat with Andrew Ryce over at Resident Advisor about the new label, Poly Kicks \n \n http://t.co/6w4WVSrR", "Thu Mar 21 18:26:35 ": "wow, this Gerry Read album is absolutely mental", "Tue Apr 09 20:15:35 ": "@rannerstaylor ha, thought you might have. Will do, hopefully see ya in the very near future! X", "Sat Mar 16 13:55:03 ": "It's a horrible feeling leaving a city with none of the music you had when you arrived", "Fri Mar 22 11:46:08 ": "@imposta_dj yep", "Mon Feb 04 17:55:20 ": "@kowton cheers for having me mate, enjoyed it! Yeah, tbh not sure I could handle another hangover like last time. See you sunday ;)", "Mon Feb 04 17:55:59 ": "@shaw_kenneth no worries mate, good to see you. Catch you on Sunday!", "Sat Feb 02 21:16:16 ": "If you live in Bath, @PaulWoolford is playing at Moles tonight for the Recall lads. A rare treat indeed", "Thu Feb 07 09:58:37 ": "@midlandsound I use matt white printable CD's. Whole front face is blank, plenty of room to write directly on the CD", "Fri Mar 08 23:28:45 ": "@skunkrock_ ah didn't know that. Well f you change your mind let me know ;)", "Sat Mar 16 14:19:28 ": "*rub", "Mon Apr 08 20:52:48 ": "5 long days in Amsterdam have really taken it out of me", "Wed Mar 06 03:32:10 ": "@Photek you too man, good seeing you  briefly!", "Fri Feb 01 18:41:16 ": "Was great to check out @rubadub_glasgow as well. Although entering a shop selling studio gear when sleep deprived/half pissed has its risks", "Wed Jan 30 11:08:34 ": "@thejoeFarr yeah, going to be doing my best to string together some music appropriate for sunday afternoon. either that or clearing the pub", "Tue Mar 19 21:49:27 ": "This weekend was a lot of fun RT@TourDeVybz: IRELAND @TesselaMusic @Truss_101 @AnDmusik1 @tiraquon http://t.co/65bnYy9g4M", "Mon Apr 08 20:12:44 ": "@rannerstaylor wahaaaaay. Sorry I didn't come and see you last week, ended up being a bit hectic. I'm up again soon though so be ready x", "Sun Mar 03 20:20:33 ": "RT @kowton: On the @Numbers show on @RinseFM tonight with @SpencerNMBRS 11 til 1 am http://t.co/Fct3Syj6vZ", "Sat Mar 16 14:13:13 ": "Cross country trains have decided to run some salt in by charging me an extra £35 for my ticket", "Thu Feb 28 00:18:43 ": "@marinafairfax haha, are you coming? Probably not going to get there till really late. Also think theres only about 3 of us going now :/", "Wed Apr 10 16:12:25 ": "Dublin tonight! I'm on from 1 at the Lost Society. \n\nhttp://t.co/5NOpA2EE6w", "Mon Feb 18 13:11:35 ": "RT @PlexLondon: go for a quiet drink they said", "Fri Feb 01 20:12:14 ": "@STHLDNORDNCE are we??? Mines pretty shady. Two carriages and apology notices in the the toilets because they're so rank. Sound familiar?", "Thu Apr 11 20:29:53 ": "Coming on strong with the breakbeats. RT @pearsonsound \"Live on Rinse FM\"", "Sun Mar 17 11:55:31 ": "@gramrcy yep. Wankers", "Sat Feb 02 00:35:34 ": "@thejoeFarr you're a shrewd businessman Mr Farr. I'll need time to consider but I'm fairly confident I can meet your requests", "Sat Apr 06 12:57:50 ": "@BTYCLL the beer to foam ratio is way off in my book", "Mon Feb 04 14:59:26 ": "Monday getting off to a predictably sluggish start though", "Wed Feb 06 14:24:03 ": "Big thanks for all the support everyone. Some proper info coming tomorrow courtesy of @residentadvisor", "Sun Mar 17 11:37:43 ": "Not even through departure lounge and I've already been fined £130. Even on St Patricks day Ryan Air insist on being utterly unreasonable", "Fri Mar 29 19:29:24 ": "Last night was brilliant, great to finally catch Levon Vincent. Big thanks to the @WaxxxWaxxx crew for having me.", "Fri Feb 01 20:15:02 ": "@KevinMcPhee you in bristol?", "Sun Feb 03 16:30:54 ": "Anyone know what time biblos shuts? @kowton @Hodgebristol ?", "Sun Mar 10 14:41:21 ": "@thejoeFarr not sure but Mackie are really slack with updating their drivers and I really need to update my OS! shame as it as a great desk", "Tue Jan 29 17:20:35 ": "@thejoeFarr ah ok. You about this Sunday? Boundary Object at the Bell if your interested?", "Sat Mar 16 15:36:53 ": "@BAKEGLA still not sure to be honest mate. Not sure if my cd wallet was stolen or what. Pretty gutted though to be honest", "Sat Mar 16 13:57:55 ": "@robbooth still not sure really. Put my cd's in my bag last night. Gone today . And couldn't get back Into the club to check this morning", "Tue Mar 05 20:16:46 ": "@JCMDenyer 1:45-3", "Thu Jan 31 15:30:47 ": "Can't wait to check out Glasgow's legendary subclub tonight. Myself and dj supreme @BAKEGLA  playing 2hrs each.... http://t.co/I6fWUPMZ", "Wed Apr 10 13:16:47 ": "Anyone know if they sell Sennheiser HD25 headphones at Bristol Airport?", "Wed Apr 03 09:49:47 ": "Clip of my remix for @alexcoulton http://t.co/XidIA5Kehw", "Sat Apr 06 12:29:07 ": "not sure I'll ever understand the dutch way of pouring a pint", "Thu Mar 28 11:48:03 ": "Liverpool tonight for Waxxx Fair with @loefah @Boddika  and @levonvincent !", "Wed Apr 17 19:11:04 ": "Can't stop listening to the new Airhead single", "Sat Mar 16 15:41:21 ": "RT @TB2Bristol: Hackmann and Tessela tonight looking like a \"belter\"!!! You know where it's at !!!", "Fri Feb 01 18:15:12 ": "Glasgow was absolutely wicked last night, had a lot of fun.  Big shouts to the @Rubixglasgow lads. Norwich tonight for a b2b with SLO", "Sat Mar 16 20:00:56 ": "@Burlish_ that would be great if you could please mate. Promoters haven't seen it ufortunately", "Sun Feb 24 15:35:06 ": "@MackieGear any news on when the 1640i mac drivers will be updated?", "Thu Feb 07 14:09:49 ": "RT @residentadvisor: news -- Tessela gets his Poly Kicks: The Bath producer will launch his own label with Hackney Parrot/Helter Skel... ...", "Fri Mar 01 20:03:28 ": "Can't wait for tonight. Room 3 @fabriclondon with Neil Landstrumm and more. I'm on 2:30-3:30", "Mon Feb 11 10:26:23 ": "@Hodgebristol aaargh, really want to go", "Mon Mar 04 18:38:51 ": "Every time, @pangaeauk with the craaazy basslines", "Fri Mar 08 12:05:28 ": "POLY001 Pre Order now up.\nShips next week \nhttp://t.co/Ba70r7OW7q", "Fri Mar 22 14:57:24 ": "Going to play some music tonight with @Kowton and @gramrcy. In Bath at the Porter. 10-3, free all night", "Wed Apr 03 10:02:31 ": "RT @residentadvisor: review -- Alex Coulton - Too Much Talk http://t.co/77qutiU7kF", "Wed Feb 06 16:19:13 ": "wow, some really old 'press shots' of me floating around", "Sat Mar 16 15:40:41 ": "@PalemanUK no worries man, yeah was goodfun although I've left without my cd's not sure if they were lost or stolen, peeved to say the least", "Tue Mar 05 21:32:05 ": "Myself and @Photek tonight in Nottingham. I'm on 1:45-3", "Fri Mar 08 18:25:25 ": "Tonights looking lively. Tom Demac, @_LockedGroove and myself at  'The Garage' Leeds for Selective Hearing \nhttp://t.co/yqiUmdkfn6", "Fri Feb 08 19:48:29 ": "I'm at The Audio Room, Cork tonight. 12:45-2:15", "Fri Mar 22 10:33:30 ": "RA review http://t.co/6kdKvfR0qm", "Tue Feb 26 19:07:39 ": "RT @stholdings: STH News: Tessela Launches ‘Poly Kicks’ label @TesselaMusic http://t.co/JingPnair7", "Fri Mar 08 21:46:10 ": "@skunkrock_ rats, you up in Leeds?", "Sat Feb 09 17:19:53 ": "Goldbaby should make a classic drum breaks pack. \n cc. @Hugo_Tichborne", "Thu Jan 31 13:23:56 ": "@sophie_GJ yep! Especially when you're trying to get to the airport", "Sat Mar 16 15:38:08 ": "@Burlish_ yo man, it was cool. Had to reign it in a bit, but that was to be expected I think. But yeah gutted about my cd's!", "Thu Mar 07 21:30:34 ": "Basing House - East London tonight for VRYBDY. I'm on 11:30-1 http://t.co/NVTA4hEtKY", "Fri Feb 01 20:09:16 ": "@STHLDNORDNCE gettin close, think my train gets in at 8:20", "Fri Feb 01 20:14:10 ": "@STHLDNORDNCE wicked, I'm starving. Lets get some grub asap 🍔👀", "Tue Apr 09 19:32:08 ": "@thetonewrecker cheers Paul!", "Mon Feb 04 14:58:51 ": "Last night was good fun as always RT @shaw_kenneth\n\"@TesselaMusic at @boundary_object http://t.co/a8aHjfQB\"", "Tue Apr 09 09:51:09 ": "@RohanRandomer I've got one of these http://t.co/3nf8ElQCfG\nAmazing desk butcheck the system requirements, currently unable to upgrade my OS", "Sat Mar 16 21:28:25 ": "RT @TourDeVybz: First trip to Ireland tomorrow with @TesselaMusic  and @Truss_101 for St.Patricks day. I shall be documenting it P.O.V o ...", "Sun Mar 10 14:34:25 ": "Anyone know somewhere that does part exchange on studio gear?", "Fri Feb 01 18:32:07 ": "@thejoeFarr Sub club, Glasgow. Amazing place. What you saying bout boundary object then? ;)", "Fri Feb 01 20:22:47 ": "@KevinMcPhee brilliant. Well do drop me a line when you're about. Also got some new music you might be into. Will send after the weekend", "Thu Apr 11 20:32:45 ": "@JamieGrind Ha, yeah. Turns out they don't sell them.", "Mon Apr 08 20:11:14 ": "RT @RohanRandomer: For anyone that missed it, you can preview my next release RNDMR001 EP at FACT magazine: http://t.co/HcIXwA0Wlr", "Sat Apr 20 11:29:49 ": "@addisongroove @mrroska via Munich? From bristol? I'm going from Stansted with mr @RohanRandomer", "Sun Feb 03 16:33:39 ": "@kowton gonna get there about 6 if that's cool? Think Gram's up there now", "Thu Apr 04 18:51:02 ": "@pangaeauk I was close! Hyde park road. Thoroughly regret not getting more involved", "Thu Jan 31 13:19:54 ": "Aargh, mad train delays", "Mon Mar 04 18:05:44 ": "RT @Photek: Tuesday 5 March : Dogma Nottingha\n- Photek + @TesselaMusic Tickets £4 - http://t.co/GImW5OWxQC", "Sat Mar 16 14:03:39 ": "@kasracritical not sure really. Either someone has stolen my cd wallet or it fell out my bag. Luckily there wasn't anything too 'sensitive'", "Sun Mar 10 14:37:24 ": "@thejoeFarr my mixing desk. Mackie 1640i."}