{"Sun Apr 14 13:24:50 ": "@OneMike84 😂😂😂😂😂😂😂😂😂 \nYou know why.", "Sat Apr 13 15:23:21 ": "@thedawsonzim I wanna see it sooo badly!", "Thu Apr 18 21:27:51 ": "I wish people made up random chants and cheers for me as I ate like they do on Man Vs Food #PowerSnacker", "Sun Apr 21 02:27:43 ": "@RepChrist24 the iron giant...", "Thu Apr 18 16:58:37 ": "Hey @Weatherford5 can a brother get your ab workout routine? You are a beast!", "Sat Apr 13 01:34:30 ": "10 hours later, I am finally in the plane to St. Louis! #GoRams", "Fri Apr 12 20:33:24 ": "Travel day from hell.....6 hours to kill in Phoenix...Help me out followers! What to do?", "Tue Apr 16 22:36:19 ": "@TheYount Yount...If you have ever had St. Louis style pizza you will know how bad the need for a change up is. Haha", "Tue Apr 16 22:43:43 ": "@StevenRyan_ I am a sucker for eating challenges! Consider myself gifted with a fork.", "Tue Apr 09 22:31:08 ": "Happy birthday to my main man. @b_curry23 You are a beast! Hope you have a great one. Love you bro.", "Mon Apr 15 18:57:36 ": "Operation #BlueCheckHekk may be complete today...keep your fingers crossed", "Thu Apr 18 03:55:04 ": "RT @RepChrist24: Praying for West, TX.", "Fri Apr 19 23:18:56 ": "@Nmartin55 I'm in St. Louis already playa! Wish I could be there! #GoRams!", "Fri Apr 12 06:28:10 ": "RT @G00G3Y: @JHekker I'm gonna keep tweeting till you come to #nyc for the #NFLDraft !!!! #gettheHEKKtoNYC", "Fri Apr 12 20:51:55 ": "I'm really upset with @USAirways whole operation today. Definitely just made my personal do not fly list.", "Sun Apr 21 15:19:19 ": "Getting the car detailed at Waterway! She was looking mangy off of the shipping truck. These guys are making magic happen. #ZeroToHero", "Sat Apr 20 04:32:45 ": "RT @makms09: Praise Jesus anyways! Wasn't the strongest ending to my career, but my gosh it has been one heck of a ride! Once a Beaver, alw…", "Wed Apr 17 03:34:50 ": "@EidemKyle love you KE!", "Fri Apr 19 00:07:31 ": "A little golf lesson for GZ. Step right up, see the amazing golf ball whacker guy. http://t.co/bYJNVx17aK", "Fri Apr 05 19:17:52 ": "Shout out to @Waymeg67 for having an awesome name! #MegoYougoWeallgo", "Thu Apr 18 18:14:41 ": "Nap time...that workout today was something serious! #SchoolOfRock coach Rock is the man. 💪💪😴😴😴", "Thu Apr 11 01:48:42 ": "Last night in Corvallis. Of course I spend it with my lady :) makms09 😍 http://t.co/JxEb0ySx1W", "Fri Apr 12 23:54:39 ": "@NickBarnett I had a flight delayed 2 hours this morning with everyone on the plane out of Seattle. I think today is just one of those days", "Mon Apr 15 23:44:56 ": "Gonna go hit up the YMCA. Shoot some hoops, maybe swim a little...battle boredom to the death. #IWin", "Sat Apr 06 00:26:47 ": "@JOEL9ONE %SWAG", "Fri Apr 12 20:59:00 ": "@BenEshleman I have 5 hours to kill! Lets roll", "Sat Apr 06 04:02:47 ": "RT @OSUBeaversFB: We out here trying to function! “@Coach_Riley: Check out the video from practice today with @djcloud_n9ne! http://t.co ...", "Tue Apr 16 23:52:25 ": "Didn't end up going with blackthorn... @kdemoff suggested la pizza in U city. Had to listen to the boss. Great pizza! Blackthorn next time!", "Wed Apr 17 02:39:27 ": "I run stuff around here...Dog sitting for young GZ and Charlie's gon' learn today!!! http://t.co/LP4qZ3bOLp", "Thu Apr 11 03:17:46 ": "Liking your own pics on Instagram... -_______- #IDoThat", "Tue Apr 16 22:15:50 ": "I'm looking for a good pizza place here in St. Louis. I like big crust and I can not lie. I'm looking for the opposite of Imo's pretty much", "Sun Apr 07 01:41:55 ": "RT @oliviavivian: @mellyjay90 and @makms09 have two of the most stunning floor routines I've ever witnessed. #chills #love #gobeavs", "Fri Apr 19 20:46:30 ": "Just had an awesome meeting with @darrenK_jackson! I'm pumped to get to started impacting lives at @MissionStLouis", "Sun Apr 14 21:51:34 ": "Great round of golf today at old hickory. One of the tougher courses I've ever played. Fun to play with GZ and some coaches. 😀⛳😫", "Sat Apr 13 00:54:45 ": "RT @MarcSMulholland: I'm bringing back the casual sweater tied around the waist.. Also, jorts.", "Wed Apr 10 18:47:18 ": "@Joe_Fann it got stolen and stripped for parts in Seattle... @GoToHekk is to blame for that one.", "Sat Apr 06 00:22:44 ": "I want another tattoo... @JOEL9ONE you have any advice?", "Sat Apr 06 01:44:27 ": "“@J_Poyer14: Them workouts today got me on stuck mode right now... Dont wanna move thooo” no joke...Colin and I are struggling.", "Tue Apr 09 02:35:40 ": "RT @JJJansen44: Spike has literally put Michigan on his back. Don't worry though, he's been training! http://t.co/AYtscgxwNk", "Sat Apr 06 00:34:01 ": "“@JColeWrld: @JHekker OSU on your neck!” Front of the neck with the S on the Adam's apple...like a real crazy person", "Fri Apr 05 23:25:32 ": "@Nick_Mitchell03 congrats on your commit to OSU. I know you will do good things there. #GoBeavs", "Fri Apr 19 16:39:36 ": "Oh the things you find in the back of @J_Hull56's truck. Warning: dead animal. #HuntinMan http://t.co/PM80zkGhTJ", "Tue Apr 16 22:01:38 ": "@BobbyErskine42 BIG BOB! Thanks brother. I hope all is well with you too stud. You in for Tahoe 4th of July?", "Thu Apr 11 02:15:51 ": "@R_Allen86 when are you getting here?!", "Mon Apr 22 18:11:38 ": "Never a dull moment around Rams park...everyone knows where we are headed as a program. The will to dominate is infectious. #GoRams", "Fri Apr 19 00:53:49 ": "Whenever I'm done with a piece of gum, I always do the ceremonial spit out to gum punt. #PunterMove", "Fri Apr 05 22:35:59 ": "“@KCamat52: I need a f****ng drink in the worst way right now” Capri Sun? Sunny D? Cool-aid Jammers?", "Wed Apr 17 03:06:51 ": "RT @brittylovey: @JHekker http://t.co/Ug47SnsVVh", "Sat Apr 13 00:01:50 ": "@TimMasthay #ToiletTweets count for roughly 60% of all tweets by my speculation.", "Fri Apr 12 13:52:31 ": "@JoshScobee10 You know it's bad when you are using a range finder on your putt.", "Sat Apr 06 22:53:20 ": "Go Beavs! Excited to see my girl @makms09 kill it today in regionals. http://t.co/pf4GUzZvAF", "Tue Apr 16 22:31:59 ": "I've had Pi a couple times! It is very good but I am looking to broaden my crust filled horizons. It's looking like black thorn it will be.", "Mon Apr 08 18:37:40 ": "Watching an old episode of crocodile hunter..Steve Irwin is now catching sea snakes...SEA SNAKES!!!!! #NowhereIsSafe 🌊🐍🌊", "Fri Apr 12 22:04:21 ": "@TheEliDozier all links are already clicked...been on it all day.", "Mon Apr 08 19:46:23 ": "@BrettCL5 I dunno...I would say the same guy that got impaled trying to swim with sting rays... #TooSoon", "Sat Apr 20 22:55:59 ": "Going to black thorn to get that pizza! Big shout to all you who recommended it! #NomNom", "Tue Apr 09 19:29:15 ": "Blasting the guns today...You already know it's gonna be good! @JamesDockery31 @J_Poyer14 @twheat002 @WWDrewDo @princec82", "Wed Apr 17 21:00:36 ": "About to go play some golf...wish me luck!", "Mon Apr 15 23:21:06 ": "Wanna go shoot some hoops...where do I go?", "Fri Apr 12 21:04:50 ": "RT @USAirways: @JHekker I'm sorry Johnny for your experience today and I understand your frustration. We appreciate your patience! Thank ...", "Mon Apr 22 18:16:16 ": "RT @Coach_Riley: Spread the word and be there Friday night with the @pac12, @YogiRoth, and @MarcusGores DJing! #GoBeavs http://t.co/ltXKDNd…", "Fri Apr 12 21:19:03 ": "@MarquetteKing man I texted you the other day and got nothing back!!! Hope all is well with you brother.", "Tue Apr 16 20:14:26 ": "Need to play some ping pong soon...reeeal soon!", "Sat Apr 06 00:38:22 ": "@JColeWrld I'm trying to be the birdman of the Headbustaz", "Tue Apr 09 19:25:43 ": "@seattlerams I am gonna be back in St. Louis already for workouts. Wish I could be there though!", "Fri Apr 12 13:51:17 ": "Back to St. Louis today! Can't wait for Monday to roll around so we can get back at it as a team.", "Sat Apr 06 04:03:22 ": "Judge a man not by the depth of his v neck but by the content of his character", "Fri Apr 19 18:19:11 ": "HUGE shout out to my girl @makms09 at nationals today! I know you are going to kill it out there. Go Beavs! #Philippians413 #FlipFlopGirl", "Sat Apr 20 02:01:20 ": "Watching the NCAA gymnastics championships at UCLA and I think I just spotted @TheYount in the stands. http://t.co/G9fcHd2KwR", "Fri Apr 12 16:58:34 ": "And an hour and a half later...we're ready to fly! US Airways is sooooo in the dog house still. 🐶🏠", "Fri Apr 12 21:19:59 ": "@Nick_Lanman16 working on it my dude...it will happen when it happens. I'm not worried about any fake punter accounts haha.", "Tue Apr 16 21:19:40 ": "@L_Hurd thanks Lamar! Hope all is well with you and your promising career in broadcasting as well as your pursuit of that WR spot.", "Sat Apr 13 21:04:09 ": "RT @NFLONFOX: Rams P @JHekker tweeted about his flight delay to US Airways. And Raiders P @MarquetteKing had a great response &gt;&gt; h ...", "Mon Apr 15 15:29:43 ": "Day one in the books! Lift 💪 Punt\n🏈 Run 🏃 Now waiting to eat some @SeoulTaco! My favorite place in St. Louis", "Wed Apr 17 02:49:42 ": "@brittylovey she!!!! Really does haha, way more energy though. I'm working with her.", "Tue Apr 09 03:08:56 ": "@OregonJR trysting tree of course!", "Tue Apr 16 18:29:09 ": "#BlueCheckHekk Yesssss!!!! \nToday a blue check \nTomorrow...the world!!!!\nThanks to all my friends that helped me get here.", "Tue Apr 09 01:50:14 ": "Just finished a round of golf! Or as I like to call it, anger management therapy.", "Fri Apr 12 15:17:14 ": "RT @Bradford_888: @JHekker best of luck this season! As a fan haven't been this excited in years! Can't Wait! #ramsnation", "Sat Apr 06 18:32:35 ": "You want a free million dollar idea? Take sriracha and mix it with ketchup, bottle it, sell it, rake in the money. You are welcome.", "Wed Apr 17 19:50:23 ": "RT @NWoodie: And the surprise is...Washington Elem is recipient of @stlouisrams 2013 Playground Build. #RamsCommunity Coming 6/13 http:/ ...", "Thu Apr 18 02:17:53 ": "If you haven't had Mochi ice cream you haven't lived. Dyn-o-mite 👍😋", "Sun Apr 21 15:39:26 ": "@JohnMarecek amazing! Best pizza I've had out here no doubt. Hands down.", "Fri Apr 12 23:36:11 ": "Why am I not verified....Aktualy Iz Dolan.", "Thu Apr 11 04:15:50 ": "I hope to be remembered for telling it like it is. Nobody likes a fake person.", "Thu Apr 18 13:09:17 ": "People that constantly retweet parody accounts are the worst. You are probably retweeting some old lady, not frank ocean #ThatsGottaStop", "Mon Apr 15 23:24:12 ": "@GramaDrama They have a good rec center? I'm in!", "Wed Apr 10 16:53:31 ": "Lord help me bless others today. We are all blessed to be a blessing. Never let me forget that.", "Sun Apr 21 01:26:36 ": "Black thorn pub...best pizza in St. Louis! Just my opinion of course, no more important than anyone else's.", "Mon Apr 15 15:56:32 ": "Stay tuned today followers...I was informed that today will be a big day for my twitter account.", "Wed Apr 10 02:09:05 ": "RT @brittylovey: Punter to pitcher in no time @JHekker http://t.co/6sp1cOuUH8", "Mon Apr 15 04:16:17 ": "@BrittanyHarris_ @makms09 who is he? I'll break his legs!", "Sun Apr 21 02:30:25 ": "@RepChrist24 I was a really sensitive kid...the giant was his best friend, got taken away and blown up by the military! 😭😭😭", "Fri Apr 12 15:59:32 ": "Flight is having technical issues...half an hour more of Kardashian talk by the ladies next to me and I'm walking to St. Louis! -__________-", "Tue Apr 16 00:11:08 ": "@LuckyLee34 man...I really thought today was going to be the day. That's what I was told. I was bamboozled. #BlueCheckHekk", "Mon Apr 15 18:03:35 ": "@JOEL9ONE even kickers?!", "Sat Apr 06 19:20:06 ": "Lets go @OregonStateGym @makms09 @mcg_steph @HannahCasey3 @hailssyeahhh @mellyjay90 @K_blalock2 @TaylorKeeker @eirhead2 @BrittanyHarris_", "Wed Apr 10 03:09:25 ": "The Mariners might lose by 100 tonight... #LordHelpUs", "Fri Apr 12 14:28:46 ": "Happy birthday to @C_Ham89 Hope today is a great day! #Iced", "Wed Apr 10 18:45:21 ": "Cars are good for two things...getting you from A to B, and INFURIATING YOU!!!"}