{"Tue Mar 26 13:46:03 ": "RT @MPSWandsworth: Registering your phone on http://t.co/wOGFbH9N9n can make it easier for police to trace if it gets stolen. DCI Bob Ma ...", "Mon Apr 15 19:29:28 ": "Follow up to #CasualtyFGM. Just wrote to all MPs as Chair #FGM All Party Gp inc. key facts, Govt guidelines, campaign gps, what MPs can do.", "Sat Apr 13 17:17:47 ": "RT @DaughtersofEve: Hope you will be watching @bbccasualty tonight to see p2 of the #Fgm story line &amp; pls use hashtag #CasualtyFGM t ...", "Mon Apr 22 20:20:57 ": "Good to meet Lockwood Smith, new New Zealand High Commissioner, at Australia &amp; NZ All Party Group event earlier. Discussed NZ visa issues.", "Thu Apr 11 22:39:07 ": "@FGMsilentscream Thanks for the invitation, will if I can. As soon as you have the draft prog let me know. It's going to be a busy weekend..", "Wed Apr 17 13:01:41 ": "@SaveShaker Debate on #ShakerAamer ePetition confirmed for 9.30am-11am on Wed 24 April in Westminster Hall. Thx to @CommonsBBCom and Speaker", "Wed Apr 03 14:05:41 ": "RT @wandbc: If you have any concerns about your child's speech or simply want some advice come to a drop-in session - http://t.co/UcjXPNiagm", "Mon Apr 22 13:14:16 ": "RT @GdnGlobalDevPro: New: UK's £35m fund to help eliminate #FGM should strengthen existing projects http://t.co/ws6lTVdIBx from Efua Dorken…", "Wed Apr 17 13:40:12 ": "@CommonsBBCom 29th?", "Tue Apr 02 23:24:04 ": "@FarazShibli As with any constituent, happy to meet to discuss it properly. Please drop me an email with your contact details if interested.", "Sat Apr 20 17:11:49 ": "Local businesses got our #NorthcoteRoad Consumer Survey results this w/end http://t.co/sWRDMBHC5W Hope it's useful. http://t.co/SMQY6kiGlb", "Mon Apr 08 18:29:57 ": "A sad day, an amazing life ends. But on that day in 1979 a generation of girls realised that a woman could do anything. Thank you Lady T.", "Mon Mar 25 23:26:31 ": "@DoddGarden Many congrats to all on the #bigdig, a great communal effort. (Hope the rosemary plants are as hardy as the gardeners!)", "Mon Apr 22 12:36:22 ": "RT @WandsworthLPT: MP Jane Ellison meeting some of the Wandsworth Probation Team following her tour of the office @janeellisonmp http://t.c…", "Sun Apr 14 20:31:23 ": "@NoFGM1 @nimkoali Sounds good, will set the wheels in motion. J", "Wed Apr 17 12:40:57 ": "@ayestotheright Indeed, though I have known this moment was coming for a while. As a constituency MP you have to do your best to respond.", "Sun Apr 14 09:59:11 ": "RT @28TooMany: Great to hear @janeellisonmp talking about the need to record #FGM in health records on @bbc5live Very impt to do this #c ...", "Thu Apr 18 16:09:36 ": "@HWWands On it's way to you. Sorry for the delay!", "Fri Apr 05 10:17:57 ": "@emmaforbes4 cc. @MPSBatterseaSgt sorry for delay. Yes. Now know more re police's work on these commercial burglaries and iPhone thefts.", "Mon Apr 15 19:47:01 ": "@28TooMany Good idea. Will adapt (not the same constituency issues obviously) and send to Peers tomorrow. Baroness Cox has been in touch.", "Thu Apr 04 18:09:39 ": "@MPSBatterseaSgt Good you're working on it. Will help get crime prev. advice out to #Battersea small businesses. Calling on many next week.", "Fri Apr 05 23:01:42 ": "Great #Justice4Shaker campaign tonight helps @AlistairBurtFC who's following it. UK Govt policy is SA back to UK. Over to you @BarackObama?", "Thu Apr 11 21:56:43 ": "Great @Spearcourse graduation at St Mark's, #SW11. Impressive stats, 75% of young people still in work/ed 1 yr on. http://t.co/AF2HhrGwsy", "Sun Apr 07 15:49:09 ": "@TheDessertDeli Laura, your apple pie was enjoyed by all last night. Supporting local businesses should always taste that good. Thanks!", "Tue Apr 16 16:38:02 ": "Need for v urgent debate on #ShakerAamer fully understood by @CommonsBBCom Will be able to confirm date and more info tomorrow. #SaveShaker", "Sat Apr 13 20:35:43 ": "Front line professional watching @bbc #Casualty on #fgm? Link to multi-agency Govt guidelines (issued Feb '11) http://t.co/JhJ4vd2C3A Pls RT", "Tue Apr 02 10:15:11 ": "RT @UKParlOutreach: What is the relationship between Parliament &amp; Government? Find out at free Open Lecture by Andrew Lansley on 24  ...", "Wed Apr 17 12:56:51 ": "@ayestotheright Didn't take it as criticism at all! Like the rest of the Ctte I really appreciate your consistent interest in what we do.", "Fri Apr 05 08:42:03 ": "@jmccabe09 Thanks, please drop me an email if you're a constituent, and I will respond. JE", "Wed Apr 10 19:42:07 ": "Quite a day in Parliament. @David_Cameron spot on, @Ed_Miliband really good too, got tone just right. Sir Malcolm Rifkind warm and v witty.", "Sat Mar 23 13:47:54 ": "RT @WandsworthRKing: Great morning campaigning on Shaftesbury estate with @jamescousins  and about 40 others. Shaftesbury folk are a rea ...", "Sat Apr 06 23:16:30 ": "RT @NSPCC: Anyone affected by issues raised in tonight’s episode of @BBCCasualty can call us on 0808 800 5000 or email help@nspcc.org.uk ...", "Sat Apr 06 18:57:03 ": "RT @NimkoAli: I hope you will all be watching @bbccasualty tonight, as the part1 of 2 of a storyline abt #FGM will be airing. So proud t ...", "Sun Mar 24 20:54:31 ": "RT @Essentiallocal: 1st Balham named one of top places to live in London. Now Sunday Times names SW11 one of the best for families in UK ...", "Mon Mar 25 20:23:26 ": "RT @wandbc: Check out our new-look website for young people. Information, advice, things to do http://t.co/gJq3oXoBuz", "Wed Apr 17 12:20:18 ": "Debate on #ShakerAamer ePetition confirmed for 9.30am-11am on Wednesday 24 April in Westminster Hall. Thanks to @CommonsBBCom and Speaker.", "Wed Mar 27 21:53:51 ": "RT @Up_the_Junction: RT @MessandMusic: Family fun this Mon at the Messy Easter Fete. Face painting, Easter egg hunt, cakes &amp;amp; cra ...", "Sat Apr 13 20:49:31 ": "@NimkoAli Me too, it's almost unbearably sad.", "Wed Mar 27 11:01:17 ": "@SurreyLanePO Thanks for the message, on the estate regularly - most recently last Friday - but v happy to meet for a chat some time.", "Thu Apr 11 22:01:11 ": "@SpanishPirate1 What about @wandbc Big Society Fund?http://t.co/XZInnUBpKm - apply by May 13 for this round. Need a local Cllr supporting.", "Thu Apr 18 23:48:30 ": "@thefishclub Already in the diary but a few other things going on locally that day so let me know times. Keen to Feast Fabulously with you!", "Sun Apr 07 00:38:35 ": "@equalitynow Your years of campaigning have done so much to bring #FGM out of the shadows. Hope #casualtyFGM saves some of our girls #vawg", "Mon Apr 22 21:09:56 ": "@SaveShaker Am happy to brief any MP ahead of #ShakerDebate and House of Commons Library has produced good background document.", "Sat Apr 13 20:44:06 ": "RT @NSPCC: If you’re watching @BBCCasualty and want to know more about ‘cutting’ or #FGM we have more info here http://t.co/IweqZoYh7i", "Sun Apr 21 17:44:18 ": "@NickyMorgan01 Well done Nicky, you look remarkably composed after 26 miles! (Home-Start such a great cause, am Patron of Wandsworth H-S).", "Sat Apr 13 20:19:09 ": "#CasualtyFGM At risk girls going abroad carry 'UK Declaration Opposing #FGM' Download here http://t.co/Th5wZk8uCX other languages available", "Fri Apr 05 23:07:59 ": "@ZekeJohnsonAi @amnesty thanks for RT. UK, a trusted ally, want to help the President, UK Govt officially wants SA back here.", "Sun Apr 14 12:47:21 ": "@NoFGM1 MPs and Councils must do more to back grass-roots activity. Am going to write to all MPs tomorrow urging them to engage on issue.", "Tue Mar 26 16:10:58 ": "@MFM_Wandsworth Hi Alex, can't respond properly on important local issues and casework via Twitter. Do email me if you are a constituent.", "Mon Mar 25 23:12:07 ": "RT @tmsproducer: Our @SportSJA award is dedicated to our much loved and much missed colleague CMJ. We raise a glass to Christopher #tms  ...", "Sun Apr 14 12:39:48 ": "@NoFGM1 Under no illusions long way to go, much to do in and out of Parliament, but raising awareness is a start. CPS and Ofsted will help.", "Tue Mar 26 14:06:03 ": "Listening to Home Sec's Parliamentary Statement on UKBA with interest. #Battersea has a much bigger than average UKBA caseload.", "Sat Apr 13 21:03:35 ": "Thank you to all behind tonight's #Casualty. #FGM out of the shadows now in the UK and it becomes everyone's responsibility to end it.", "Sat Apr 06 23:16:08 ": "RT @DaughtersofEve: We as adults should be safeguarding children. #FGM is child abuse, #vawg #casualtyFGM", "Wed Mar 27 21:26:47 ": "@LouLouK Good meeting this evening. I have lots to follow up with @wandbc and Nine Elms Dev Board. Chairman of Res has details. Jane", "Sat Apr 20 20:08:57 ": "RT @Waris_Dirie: My friends, watch the award-winning short film \"Silent Scream\" about FGM!!!\n\nhttp://t.co/YXr5Lln0", "Sat Mar 23 15:44:19 ": "Good to speak privately with Shaker Aamer's wife + children at @SaveShaker event. Reminder that behind the politics is one family's trauma.", "Fri Apr 05 09:23:38 ": "RT @Number10gov: New research shows 1 in 7 would consider #adoption. Is this you? Find out more: http://t.co/tWWtSylon7 0300 222 0022 Pl ...", "Tue Apr 23 12:23:34 ": "Spoke to @AlistairBurtFCO earlier; pleased to hear he is Minister responding to #ShakerDebate in Westminster Hall, 9.30-11am tomorrow, 24th.", "Fri Apr 05 08:52:15 ": "@TheDessertDeli yes, lots of interesting stats. Incidents in London -36% on 10 yrs ago, so firefighters doing great prevention work too", "Sat Apr 06 23:17:50 ": "RT @DaughtersofEve: Please tweet, email &amp; tell your MP to watch tonight's @bbccasualty cause girls across the Country are suffering  ...", "Wed Apr 10 19:51:44 ": "Good luck Wandsworth @PrincesTrust Team 50 for final presentations tomorrow. Hope our practice session helped a bit. http://t.co/z3phP7YNUN", "Sat Apr 13 21:32:30 ": "@creatingequalz Long way to go but much has been happening behind scenes eg NSPCC/Home Office roundtable with Ministers from HO, DH and DFE", "Sat Apr 06 19:07:30 ": ".@DaughtersofEve Proud we've got the campaign to end #FGM into mainstream. Well done to you + @NSPCC on input to tonight's BBC #casualty", "Thu Mar 28 15:33:46 ": "Many congrats to #Battersea constituent Jai Mallett who proposed to Ivana at the top of Big Ben today. She said Yes! http://t.co/jWGMET8oyy", "Sat Mar 23 21:46:24 ": "With @charlestannock at     Ahmadiyyan Muslim 10th Peace Symposium, Baitul Futuh Mosque. 800+ people heard thoughtful speeches.", "Mon Apr 15 13:24:42 ": "@StJohnsHill @LoveBattersea1 Yes but they got the date wrong \"which will take place on Saturday April 18, when...\". Can they correct online?", "Sun Apr 14 12:51:55 ": "@NoFGM1 Things have moved on a lot in last 6 months. Easier to chat than tweet, email me and come in for a coffee?", "Thu Apr 18 22:09:04 ": "Thought-provoking evening at St Mark's, #Battersea Rise with great Global Action gp. Watched 'Desert Flower', talked about ending #FGM.", "Thu Apr 04 17:58:46 ": "RT @MPSBatterseaSgt: .@janeellisonmp visited Lavender Hill Police Station today to discuss local policing with Inspector James Ellis. ht ...", "Thu Apr 18 07:15:00 ": "@ZekeJohnsonAi Thanks Zeke. Everyone here in the UK Parliament has worked hard to make this happen including the FCO Minister responding.", "Tue Apr 02 17:51:32 ": "@ShutGuantanamo Aware of h/strike but conflicting info on SA. Spoke at #SaveShaker meeting on 23/3, advised SA not on strike. Will ask FCO.", "Sat Apr 06 11:58:41 ": "@Andrew4Pendle Good to hear you've had a good morning, we did too in sunny Balham. Best wishes as ever to the great Pendle Tory team.", "Sat Apr 13 00:17:19 ": "#SaveShaker ePetition. Applied for debate today, on Backbench Committee agenda on Tues 16 April. Well done to all, a great campaign effort.", "Sat Apr 06 13:27:23 ": "@WandsworthRKing Thanks Russell. Too embarrassed to RT but much appreciated! And now I have to go and do the shopping...", "Mon Apr 15 14:37:53 ": "Great 'Struck Out' report by Richard Tracey AM on Tube strike law http://t.co/3FQMAyybVA @lbc973 discuss at 4pm, sure to get London talking.", "Thu Mar 28 00:05:12 ": "News for #Battersea community gps from @wandbc about Big Society Fund - http://t.co/XZInnUBpKm - Applications by May 13 for this round.", "Mon Apr 15 14:24:40 ": "Inspiring launch of new @stormempower base with @wandbc Leader. Marie Hanson + team changing lives for the better. http://t.co/cYOnUIRp8f", "Thu Apr 04 20:42:18 ": "All #Wandsworth fire stations to be retained, confirmed at this evening's public mtg. London Fire Brigade's plans v professional, as ever.", "Sun Mar 24 21:11:22 ": "Great evening at The Eagle, SW11 with @CastleSupporter team. Castle pub listed as Asset of Community Value + #beerdutyescalator scrapped!", "Tue Apr 02 22:56:59 ": "RT @MatthewdAncona: A must-follow: @matthewparris3", "Sat Apr 06 09:05:57 ": "Out in sunny Balham this morning talking to residents. Cllr @WandsworthRKing is bearer of good news on big Council prog of pothole repairs!", "Sat Apr 13 21:26:05 ": "@IfBChristine Thanks. Hearing the voices of young people affected is transforming the UK debate on #fgm and making it impossible to ignore.", "Fri Apr 12 08:30:52 ": "@SpanishPirate1 Happy to have a look at any bid. Seeing Cllrs later so will mention. I could add something about interest in bees campaign?", "Sat Apr 13 21:37:01 ": "@creatingequalz Drop me an email, would be useful to talk. Will add you to APPG emailing list, some useful info on various initiatives.", "Sat Apr 06 13:41:49 ": "@JamesAnnapurna Thx, no matter how people vote, I'm their MP + will try to help. On which note, I may carry extra recycling bags next week!", "Sat Apr 13 00:02:14 ": "@CllrSimonHogg I got the debate application today, confirmed on agenda for HoC Backbench Business Committee, 3pm Tues 16 April #SaveShaker", "Mon Apr 22 20:10:44 ": "@WandsworthLPT Thanks for today's Probation Trust visit. Very interesting and informative. Raised issues we discussed with Minister.", "Thu Apr 04 18:03:44 ": "Detailed mtg this aft with Insp James Ellis @MPSWandsworth. Agenda inc. police response to spate of #Battersea small business burglaries", "Tue Apr 02 23:13:00 ": "Esp #ShakerAamer supporters might be interested to know how @CommonsBBCom handles e-petitions: http://t.co/73bT2fnCmc (NB I am on this Ctte)", "Wed Mar 27 21:35:41 ": "Good catch up on casework in HofC today, heading home now after constructive meeting with Elm Quay Ct residents re Vauxhall/Nine Elms devpts", "Sat Apr 13 00:06:26 ": "RT @DFID_UK: BBC's Casualty takes on female genital mutilation &gt; Blog from @NimkoAli http://t.co/mQ4k63LTEN #endFGM #FGM @Daughtersof ...", "Sat Apr 20 20:09:40 ": "RT @SaveShaker: The #Shaker e-petition has finally closed at 117,359 signatures. Thank u everyone for ur support, plz stay with us for the …", "Fri Apr 19 17:39:02 ": "Visited wonderful @trinityhospice, good luck to nurse Kimberley St John for London Marathon http://t.co/anSfyb8iKU http://t.co/gAVKUZwqQq", "Sat Apr 13 20:21:05 ": "RT @DaughtersofEve: A child is seeking to protect her sister, when it should be us adults doing it. #CasualtyFGM", "Tue Apr 16 17:04:07 ": "@Tiffewins Looking forward to it too. Very timely given #FGMCasualty.  Will bring briefing info and suggestions on action we can all take.", "Tue Mar 26 00:32:16 ": "@SpanishPirate1 Nice to meet you too Mark, I enjoyed our chat. And, bending someone's ear just a little in a pub is not unheard of...", "Mon Apr 15 17:53:47 ": "@ZekeJohnsonAi Seeing the Ctte which allocates time tomorrow, debate timing hard to predict as this Parliamentary session is nearly over.", "Sun Apr 14 10:20:11 ": "Multi-agency Govt guidelines about #fgm (issued Feb '11) for front line professionals @bbc5live #CasualtyFGM http://t.co/JhJ4vd2C3A", "Sat Apr 13 00:26:45 ": "RT @equalitynow: \"FGM has been in the shadows here in this country,\" -- Efua Dorkenoo, OBE, along with @NimkoAli @DaughtersofEve #FGM ht ..."}