{"Thu Apr 18 07:53:35 ": "@SamiBrookesXfac @MissEmmaLouise_ Well thanks for your great comments, I am very glad to see that, have fun in your new Ka. ^GT", "Wed Apr 17 12:00:52 ": "@Chelsea_Pereen Don't blame you for wanting the new Ka, It's Fab! Why not design your own here: http://t.co/OEIN8i2lqB and get prices. ^GT", "Wed Apr 17 12:07:51 ": "@SamiBrookesXfac @MissEmmaLouise_ Aw how sweet, glad to see your in love with your new car. Great choice Samantha, I love the Ka too. ^GT", "Mon Apr 22 08:11:50 ": "@IanLovellUK Morning Ian, I would recommend you pop to your local Ford dealership, they will be able to advise you on the work needed. ^GT", "Wed Apr 17 16:02:58 ": "@psmith37 Hi Paul, i have sent you a PM on Facebook. I am currently looking into this for you. ^GT", "Mon Apr 22 09:27:22 ": "@BecciHadzi I struggled naming my Ka, What about Kaci the Ka. It took me weeks to come up with a name. #hard ^GT", "Fri Apr 19 08:14:47 ": "@7amab7 I'm good thank you, how about you? Please send me a DM so I can discuss this further with you. ^GT", "Mon Apr 22 08:56:17 ": "@courtneymelody_ Great choice with the Ford Ka Grand Prix Courtney, how you getting on with it? ^GT", "Mon Apr 22 13:26:09 ": "@mariobalde Sorry to hear this Mario, have you been to your local Ford dealership with this concern? ^GT", "Mon Apr 22 09:12:38 ": "@charlgallagher Did you get your Ford Ka over the weekend Charley? ^GT", "Wed Apr 17 15:59:58 ": "@BuddaPSL Not specific to the UK market. The RS500 edition was released to Europe with increased power above the standard RS though. ^MB", "Fri Apr 19 08:29:20 ": "@KingMELESHA It's such a brilliant car to drive too. ^MB", "Fri Apr 19 15:43:49 ": "@haayl_eyy Very nice car though Hayley! What colour and spec do you have? ^MB", "Mon Apr 22 09:29:13 ": "@robmperry84 Sorry to hear this Rob, have you been to your local Ford dealer with this concern? ^GT", "Thu Apr 18 07:51:47 ": "@suzybeth Let me know how you get on! Here's a link for our brochures; something might take your fancy. http://t.co/mnyER9jo0I ^MB", "Thu Apr 18 07:30:18 ": "@Laur_Bradnick You're not the only one! I love the new shape. Why not take a look at the brochure? http://t.co/mnyER9jo0I ^MB", "Thu Apr 18 08:44:14 ": "@Jadeyb_123 Oh dear, couldn't be a better excuse now to have your test drive Jade. Why not book one here: http://t.co/zFLdSsgLy3. ^GT", "Mon Apr 22 07:45:31 ": "@stuiehoff Kuga is a beautiful car both to drive and look at, great choice. Take a look at the brochure here: http://t.co/mnyER9jo0I. ^GT", "Mon Apr 22 09:07:59 ": "RT @TomJones0810: @FordService_UK you guys have made the start of my day perfect!", "Fri Apr 19 07:27:31 ": "@OllieTreend @forduk Hi Ollie. If you would like to DM me your reg and contact details, I can call you to discuss your concerns. ^MB", "Fri Apr 19 09:03:46 ": "@Sirus6767 Unfortunately this colour is now longer avaliable, but we have many to choose from. Take a look here: http://t.co/Svyoop2B07. ^GT", "Fri Apr 19 09:55:54 ": "@Sirus6767 Sorry to hear this, speak to your local Ford dealer for information on the extras, or our brochure: http://t.co/lAJgSEAREQ. ^GT", "Fri Apr 19 10:53:00 ": "@AngieB1969 Sorry to hear this Angela, please DM me your contact details I would like to discuss this further with you. ^GT", "Fri Apr 19 07:21:03 ": "@blahblahsean Hi Sean. There's not currently a specific date available but there will be one available later this year. ^MB", "Fri Apr 19 09:35:05 ": "@sarahstewartxo @M1k3_Q Happy birthday Sarah! You both have good taste. Good luck with the test drive. Let me know how you get on. ^MB", "Mon Apr 22 13:32:12 ": "@Sophie_Downer Lady bird is a really cute name @BecciHadzi Let us know when you do come up with a name, i would love to hear it. ^GT", "Mon Apr 22 09:10:59 ": "@DBR284 Nothing wrong with radio 2, i love listening to it on a Sunday morning, and great choice on a Mondeo. Best way to drive around. ^GT", "Mon Apr 22 08:09:16 ": "@Tux889 Couldnt agree more William, the Ford Focus is a luxury car, thanks for the great comments. How you getting on with yours? ^GT", "Mon Apr 22 08:26:48 ": "@DrEmmaWilcox Thanks for the great comments, glad to see your a fan of the S-Max. @mr_spoon the S-max is an ideal 6-7 seat car for you. ^GT", "Mon Apr 22 13:20:06 ": "@chrisdonnelly1 How are you getting on with the Mondeo as a hire car chris? ^GT", "Thu Apr 18 07:48:27 ": "@SBorbely Sorry to hear this, please DM me your contact details and reg Sam, and i will look into this for you. ^GT", "Wed Apr 17 13:30:34 ": "@suzybeth Sorry to hear about Simon Suzybeth. Hope you are ok. What car are you going for next? ^MB", "Mon Apr 22 15:20:47 ": "@chrisdonnelly1 Glad to hear that Chris, thanks for the great comments. ^GT", "Mon Apr 22 08:20:28 ": "@georgia_clark2 @eamonnamro @TomJones0810 How could you not want a Ka, they are great cars to drive. Glad to see you love yours Abbie. ^GT", "Fri Apr 19 08:11:17 ": "@DudleyIan Not a bad car to be coming home to Ian. Hope you had a safe trip. ^MB", "Wed Apr 17 15:48:15 ": "@w3xf0rd Unfortunately it can't be fitted after sale, However the new Modeo has this great extra. check is out: http://t.co/0Lb973v0vF. ^GT", "Fri Apr 19 08:31:09 ": "@LouisaaMae Glad to see your Ka has done you proud, and is still going strong. Maybe you should buy a Ford @garywillerton. ^GT", "Mon Apr 22 14:36:54 ": "@kel_mufc @wombatkx Glad to see your both fans of the Ford Ka, couldn't agree with you more, what colour did you get Kirsty? ^GT", "Mon Apr 22 08:46:09 ": "@7amab7 Morning, a DM is a direct message, there is a message button on the homepage. Hope this helps. ^GT", "Wed Apr 17 11:42:26 ": "@neilalexander Who can blame you? They are fantastic looking cars and lovely to drive. Have you driven one yet? ^MB", "Fri Apr 19 15:53:43 ": "@BeckiJaneT Who can blame you Becki? Take a look at the brochure and see what extras are available for it http://t.co/mnyER9jo0I ^MB", "Mon Apr 22 08:25:45 ": "RT @DrEmmaWilcox: @mr_spoon I have had a Toyota verso and ford smax. Would recommend both", "Thu Apr 18 08:40:13 ": "@Rosiekiins Let us know what you decide on Rosie, they are two great colours’ to choose from. Tough decision. Keep us updated. ^GT", "Wed Apr 17 12:21:19 ": "@lucy_dyton Congratulations on your new Ford Ka Lucy, what colour did you get? They are such lovely cars to drive, bet your excited. ^GT", "Wed Apr 17 14:10:01 ": "@gabrielliejenny Is this a new purchase for you Gabriellie? ^MB", "Mon Apr 22 14:41:36 ": "@jjbeany Sorry to hear you no longer have your old Ka, are you looking at a new one Jamie? ^GT", "Wed Apr 17 13:38:27 ": "@jarben The C-Max is a great family car. How are you getting on with it Jo? ^MB", "Fri Apr 19 16:08:50 ": "@Liam_KWM I am obsessed too i think they are amazing cars. So nice to drive, once you test drive you will never want to get out Liam! ^GT", "Mon Apr 22 14:43:44 ": "@steliosrides Congratulations on the purchase of your Mondeo Nigel, what colour have you gone for. Bet you can't wait for it to arrive. ^GT", "Fri Apr 19 10:40:27 ": "@PinkBeth86 They are great cars. Sorry to hear that. Where's the rust occurring? ^MB", "Wed Apr 17 12:09:45 ": "@ambbbbb_xo Phil shouldn't hate you, a Ford Ka is a great choice of car. You have great taste. ^GT", "Wed Apr 17 13:42:36 ": "@BuddaPSL @speedmonkeycouk Very similar to the Mondeo I think! ^MB", "Fri Apr 19 15:56:39 ": "@jwsmith1995 It's pretty smart Joshua! One for the wish list? ^MB", "Fri Apr 19 15:45:23 ": "@008jamesjon @forduk The lucky winner will me emailed by 6pm tonight Jonathan! Good luck. ^MB", "Wed Apr 17 12:02:41 ": "@LMiller9 Congratulations on your new purchase Lucy, I agree that is a great way to spend your student loan. What colour have you got? ^GT", "Wed Apr 17 11:37:15 ": "@SarahOliviaMaxi Glad to hear this Sarah! If only the weather was a bit better so you could really enjoy it. ^MB", "Wed Apr 17 14:47:51 ": "@ajwilcox3 You could always try your local Ford Dealership to arrange a test drive? http://t.co/zFLdSsgLy3 ^MB", "Mon Apr 22 09:01:16 ": "@jessicahill_95 The Ka is deceiving, its surprising how much shopping you can get it, I fill mine to the brim. Did you get it all in? ^GT", "Fri Apr 19 14:10:12 ": "@PinkBeth86 Well I will keep my fingers crossed for her Beth! Feel free to tweet us if you need any help in the future. ^MB", "Fri Apr 19 07:34:59 ": "@PixieUK Hi Jovi. If you DM me your contact and vehicle details, I'd be happy to call you to discuss this further. ^MB", "Fri Apr 19 09:37:22 ": "@PinkBeth86 Glad to see your 12 year old KA is still going strong Beth. Are you a fan of the new shape? ^MB", "Mon Apr 22 07:48:49 ": "@rachelemilyspry @laureenlouisaaa Glad to see your both fan's of Ford, don't blame you. Both the fiesta and the Ka are lovely cars. ^GT", "Fri Apr 19 10:07:58 ": "@driveenquires Wow what lucky students, bet they can't wait to get behind the wheel. Great colour as well! Wish i had this to learn in. ^GT", "Wed Apr 17 13:57:39 ": "@volatilemedic Sit tight, the winner will be announced by the 6pm on the 19th April 2013 by email. Good luck! ^GT", "Fri Apr 19 08:24:16 ": "@stuiehoff Brilliant car and cruise control makes a long journey a bit more pleasurable! What are you looking to get next? ^MB", "Mon Apr 22 09:08:37 ": "@TomJones0810 Thanks Tom, glad to hear that. I hope you do have a perfect day. ^GT", "Mon Apr 22 08:51:06 ": "@Kayteastevens @forduk I am sorry to hear this Kaite, please DM me to discuss this further. ^GT", "Fri Apr 19 10:33:01 ": "@Stuartowwfc It can vary depending on which Dealers you visit, as they have their own costings. May be worth calling a few in the area? ^MB", "Fri Apr 19 10:25:59 ": "@OllieTreend @forduk Hi Ollie. I have sent you a DM. If you would like me to call you you discuss this, let me know. ^MB", "Fri Apr 19 07:30:56 ": "@mikeyb1969 Hello Mike. I've looked into this for you and unfortunately, we do not have a copy of this. ^MB", "Wed Apr 17 12:28:42 ": "@seemypls That sounds good. Let us know how you get on! ^MB", "Wed Apr 17 13:59:37 ": "@MissEmmaLouise_ You're welcome Emma! Follow @forduk too, for all the latest products. ^MB", "Wed Apr 17 11:52:40 ": "@JakeyT_96 Lucky you Jake, bet your looking forward to that, let us know how you get on. The S-Max is great to drive. ^GT", "Mon Apr 22 08:18:11 ": "@sammyjo1122 I think you should get a Ford Ka, have you had a test drive in one yet Samantha. They are lovely to drive. ^GT", "Mon Apr 22 08:16:03 ": "@vickyweaver7 @lil_miss_tomsky Good luck on your next test Vicky, great choice on a new Ka. They are lovely cars. ^GT", "Mon Apr 22 08:59:21 ": "@BecciHadzi Congratulations on your first car Becci, what name did you decide on in the end then? It's so tough to name a car. ^GT", "Fri Apr 19 07:55:02 ": "@Liam_KWM The new Mondeo is a great car. Have you had a test drive of the new one Liam? Take a look here: http://t.co/0Lb973v0vF. ^GT", "Wed Apr 17 13:50:33 ": "@bethlouiseox123 Why not download the brochure for the new Ka here: http://t.co/mnyER9jo0I and see all the fab options available. ^GT", "Wed Apr 17 13:51:35 ": "@ZombiePinUpGeek Yay! Why not arrange a test drive? http://t.co/zFLdSsgLy3 Or take a look at our brochure? http://t.co/mnyER9jo0I ^MB", "Mon Apr 22 09:15:31 ": "@_Breakwater How you getting on with the Mondeo? Have you considered purchasing one? ^GT", "Mon Apr 22 09:43:24 ": "@jpfyfe Morning Joshua, It all depends if you were looking for a new or used Ford vehicle. DM me for more information. ^GT", "Mon Apr 22 13:09:43 ": "@Hockey_Keeper I am sorry to hear this, please DM me your reg and contact details, as i would like to discuss this further with you. ^GT", "Wed Apr 17 13:03:06 ": "@georgesalmon08 Congratulations on your new Ford Fiesta Zetec, good choice! Such a great car. How you getting on with it George? ^GT", "Mon Apr 22 07:42:01 ": "@jwsmith1995 It's a great future car then Joshua, one to place on your list. ^GT", "Fri Apr 19 07:36:33 ": "@rebeccuur How exciting Becca! What colour and spec did you go for? ^MB", "Fri Apr 19 09:08:40 ": "@Yanners86 Hi Luke. The Ford Centenary book states a 1.25 MK4 Fiesta does 47.08mpg. Hope this helps. ^MB", "Thu Apr 18 08:04:49 ": "@BuddaPSL You're welcome Budda. ^MB", "Mon Apr 22 09:31:48 ": "@sammyjo1122 Well good luck with passing Samantha. Why not have a play with designing your perfect car here: http://t.co/OEIN8i2lqB #Fun ^GT", "Fri Apr 19 09:25:04 ": "@Stuartowwfc It may be worth visiting a local Ford Dealer to see if they can disable it. The Dealer locator: http://t.co/KtCTIsFeWh ^MB", "Wed Apr 17 12:56:48 ": "@bethlouiseox123 Ford Ka is a great choice Beth, couldn't think of a better car to buy. What colour are you thinking? ^GT", "Wed Apr 17 13:56:54 ": "@ajwilcox3 That's because they are such great cars Alex. Do you have one yourself? ^MB", "Fri Apr 19 10:17:56 ": "@2e1bts Morning Adrian, if you would like to send me a DM i will be able to discuss this further with you. ^GT", "Wed Apr 17 11:45:51 ": "@grant_juli We love the Ford Mondeo too! You have good taste Juli, such a great car. ^GT", "Wed Apr 17 15:24:10 ": "@neilalexander It is great car. Test drive is a must! You will fall in love. Book yourself a test drive here: http://t.co/zFLdSsgLy3. ^GT", "Wed Apr 17 12:59:14 ": "@steutd2007 Sorry I don't know the part number, the dealership would be able to provide you with that, and you could order through them. ^GT", "Thu Apr 18 07:47:29 ": "@KurtClarke94 Congratulations on your new car! When will you be getting it? ^MB", "Fri Apr 19 09:06:42 ": "RT @garywillerton: @LouisaaMae @FordService_UK hahaha, I'm on it for my next car. All down to such awesome marketing.", "Fri Apr 19 09:12:48 ": "@marknemo @garylilley88 I think you should listen to your friend. He seems to know what he's talking about Gary. Very good taste! ^MB", "Fri Apr 19 09:08:48 ": "@LouWardd Sorry to hear about your poor Ka Lousie. Hope you are okay. ^GT", "Fri Apr 19 15:50:52 ": "@Phil_Gardner @theo_e_young I love the new look,  I think it's given the new shape Fords that extra wow factor. Hope you agree. ^GT"}