{"Wed Apr 17 04:39:06 ": "3) Lawrence Frank, the head coach of the Detroit Pistons, was my teammate on our high school soccer team.", "Wed Apr 17 05:07:07 ": "@gregg_caserta He was a little older, but we worked out together. I just talked to him last week!", "Sat Apr 13 21:51:16 ": "@Jesster80 Think I could have taken him?", "Wed Apr 17 04:47:49 ": "@rudy19k Hmmm. Was it himself?", "Fri Apr 12 19:15:32 ": "@andrewbullen24 I see Cousins a little different only in that when you charge you only have one goal. To fight the pitcher.", "Wed Apr 17 05:04:48 ": "@samue17orman I saw you..... walking in the rain...... :)", "Fri Apr 19 00:26:05 ": "Well it is safe to say the #BlueJays baserunners are keying off of #WhiteSox Sale. Great jumps. No fear.", "Fri Apr 12 14:17:16 ": "@Zullo_Nation7 @bbtn @mlb Thanks! I hope to get that opportunity.", "Wed Apr 17 05:01:07 ": "The correct answer is #2. Piano it is! @dougglanville @CoopandtheCoach @harrypav", "Sat Apr 13 21:49:46 ": "Only two beings have the strength to go deep on a neck-high Strasburg fastball. The Abominable Snowman and #Braves Evan Gattis. WOW.", "Mon Apr 22 02:48:25 ": "@TNC_Kyle That is my own personal exaggerated math. :) I think he is 6' 8\".", "Sat Apr 13 21:50:47 ": "@theaceofspaeder That is what people expected but I actually pushed him off the mound and then it was a blur. I did keep my helmet on. :)", "Mon Apr 15 17:46:39 ": "@bhholley Sustainability is the problem at that point. Certainly exec is not the only issue. I think they are doing a lot actually.", "Mon Apr 22 13:02:00 ": "@dmelendi @jtttccolonel I am not sure what the solution is but to really work it probably has to be more dramatic and standardized.", "Fri Apr 12 04:18:18 ": "RT @adnanESPN: Coming up in 3 mins on @SportsCenter @dougglanville and I break down the brawl between #Dodgers #padres", "Fri Apr 12 14:16:40 ": "Unfortunately for Dodgers, could be a while... RT @oldgransker: @dougglanville Suspend him for as long as Greinke is out.", "Mon Apr 15 03:04:14 ": "@IBiGGiIE Hmmm. Bert Blyleven? Darryl Kile? Gregg Olsen?", "Mon Apr 22 13:00:50 ": "@TNC_Kyle Adnan made the same calculation on air. Somehow 6' 15\" sounds bigger. :)", "Mon Apr 22 02:15:48 ": "@jeffpearlman Wow.", "Wed Apr 17 04:36:27 ": "To prove I am me. Here are 4 things that only I would know. Which one is true? 1) I am fluent in French and spent a year abroad in France", "Mon Apr 22 02:17:32 ": "RT @brianmctaggart: #Astros manager Bo Porter a firm believer in benefits of infield shifts. http://t.co/HZh0nI4itr", "Sun Apr 21 12:28:55 ": "We need a Segura Stolen Base stat. SSB. Stealing the base your just stole from. Then a stat for re-stealing the base you just stole. Cont..", "Wed Apr 17 04:26:25 ": "@Samantha__Costa Sam, was it at a Penn event around the engineering board meeting? .", "Wed Apr 17 04:57:37 ": "@mfahid2 This is true", "Thu Apr 11 16:59:52 ": "On @TSN1050Radio this morning. Halladay, race and baseball, A-Rod. \nhttp://t.co/29sdzVHe64  @toronto_life  #Phillies #bluejays", "Wed Apr 17 05:04:19 ": "I also went to high school with one of the members of the rap group, Das EFX. They had a great run when I was in the minors.", "Wed Apr 17 04:33:10 ": "@DCPhillySports I think I only played their once during an exhibition. Not a memorable surface. I am sure it was like the other astrophalt.", "Fri Apr 12 13:36:06 ": "@andysmith111 @bbtn @ac13alex @bulldogbeing It is possible with El Oso Blanco. He will get his share of starts.", "Sat Apr 20 13:18:23 ": "@mklubok He no doubt is the real deal. Now let's real deal an entire season. I am sure he will.", "Sun Apr 21 12:43:30 ": "@jarrodspiga Overload. I don't blame it.", "Wed Apr 17 04:57:53 ": "@YankeeMegs Cousins", "Fri Apr 12 14:12:22 ": "@AcunaAndrew Ha!", "Mon Apr 15 16:13:09 ": "@957thegame Everyone wearing 42 in football would be a problem. :)", "Thu Apr 18 01:47:47 ": "@RonKoff I know him and always did as Lawrence", "Sat Apr 20 12:40:06 ": "Class gesture last night by #Angels fans to recognize the hustle and contribution of #Tigers @toriihunter48. Well deserved. #fiveyears", "Wed Apr 17 04:24:18 ": "@Dimpl3s4U @OKBee33 @dougglanville I have crossed the road ... and met the chicken. #verified", "Wed Apr 17 05:34:26 ": "@CoopandtheCoach Cooooooooooop!", "Fri Apr 12 13:43:58 ": "An interesting punishment for #Padres Quentin. Suspend him for all remaining #Dodgers games. It prevents escalation. @BBTN Thoughts? @MLB", "Wed Apr 17 05:10:13 ": "@IBiGGiIE I hit better in the big leagues. :) Glad it worked that way instead of the other way around.", "Sat Apr 13 21:54:15 ": "@ExtremeSquirrel I think it will hold its own! I think my website has 12 ways to order it. :) I can sign it if you send it my way.", "Sun Apr 21 12:36:30 ": "@TomHasOpinions Yeah. Someone would walk or do something but you could rack up a few! :)", "Fri Apr 12 15:46:02 ": "@trabogoesyard I imagine that may happen.", "Mon Apr 15 03:01:12 ": "@theaceofspaeder :) Pound for pound!", "Mon Apr 15 16:11:50 ": "@Go_GoSox Ouch", "Wed Apr 17 04:23:05 ": "@iam_THATDUDE I think you can get verified before you even join twitter if you just have it like that. #havingjuice", "Sun Apr 21 12:51:11 ": "@MikeGianella Well when Braun went back, it sometimes is an option to go back a base to try and keep both runners safe. Risky.", "Tue Apr 16 18:00:50 ": "@IBiGGiIE Wow. That many?", "Sun Apr 21 12:35:41 ": "@JoshK_i_am Fair point. :)", "Fri Apr 12 15:44:32 ": "@dougie_smooth95 Just getting thoughts out there. Any ideas?", "Sat Apr 13 21:44:57 ": "I did in Double-A! RT @mlanderson: @dougglanville ever charge the mound, Doug?", "Sun Apr 21 12:33:33 ": "Then we need a stat for getting caught stealing the base your just stole. Cookie Jar Caught Stealing? CJCS? Estate Caught Stealing? ECS?", "Fri Apr 19 00:24:37 ": "@Everybody_Hits @broadstphanatic I promise no walks which seems to be part of the issue right now. :)", "Wed Apr 17 05:09:05 ": "@samue17orman Sending you math vibes via twitter. #youcandoit", "Fri Apr 12 14:10:04 ": "Everything he narrates is delightful. RT @bethrenaldi: @dougglanville Vin Scully's narration of the brawl is delightful.", "Wed Apr 17 04:46:57 ": "@YankeeMegs Not sure. I just kind of made that up. Seemed like the top of the hour made sense. :)", "Fri Apr 12 15:44:09 ": "@FiggynSmitty @bbtn @mlb Fair question. Too severe? Or maybe that is how the cookie crumbles. :)", "Wed Apr 17 04:38:12 ": "2) I played piano up until I was 14. During ten years of playing, I earned four gold cups for performing for judges.", "Mon Apr 15 18:00:41 ": "Bringing back an article I wrote last year on Jackie Robinson. The legacy.  http://t.co/QktN0MUnmR", "Fri Apr 12 15:58:01 ": "@fnwaypark @oldgransker Funny enough. I bet Lee would throw a pitch at Nettles in a parking lot even today. :)", "Sat Apr 20 12:55:31 ": "What I learned from #Brewers Segura last night is that you could steal second an infinite number of times in one inning. #leadleague", "Sat Apr 13 21:52:52 ": "RT @Stars5Steve: @dougglanville I was at the AAA game when Quentin charged mound. It was a lopsided game. Josh Newman of Sky Sox hit him ...", "Thu Apr 18 01:49:58 ": "@Samantha__Costa Ok. I was way off. Thanks for the love. Saw your blog. Very cool. You either ice skated or played hoops. #bighops", "Fri Apr 12 15:45:40 ": "@Mojostarz @bbtn @mlb At least he didn't use pitching arm.", "Fri Apr 12 15:44:44 ": "@GreenMonstaFan :)", "Mon Apr 22 02:43:23 ": "@dmelendi Dave. In case you missed it. :) \n\nhttp://t.co/VEE9Oj7BgR", "Mon Apr 15 03:06:17 ": "@Gattis24_7 @bulldogbeing Now I understand the bat flip. :)", "Wed Apr 17 04:42:35 ": "Oh.. Answer in 20 minutes. :) Thanks for indulging me.", "Wed Apr 17 04:45:45 ": "@LundaraTM Fair point. I guess you fire a guess and see. Maybe someone actually knows one of these answers. :)", "Thu Apr 11 20:20:50 ": "@_keepitabean_ How do you donate? Email me at my website under the contact tab. Can go from there.", "Sun Apr 21 12:42:27 ": "@ADayInTheLock Jones was the best I ever saw. Hard to see yourself. :)", "Wed Apr 17 05:08:20 ": "@roccman1991 I feel you on that. So close.... Great night for me.", "Wed Apr 17 05:05:27 ": "@roccman1991 Loved my time in Chicago. Great town! Fans were great to me...", "Wed Apr 17 05:01:43 ": "I did grow up with Pistons coach, Lawrence Frank, but we played baseball and basketball together. Tough one. :)", "Fri Apr 19 06:49:39 ": "@andysmith111 @bulldogbeing @ajcbraves @gondeee @mlbbowman Great stuff. Gotta love the Oso Blanco!", "Wed Apr 17 05:35:14 ": "@mfahid2 Ha!", "Mon Apr 15 17:49:00 ": "@bhholley I also think AA and Latin baseball challenges in diversity are very different.", "Sat Apr 13 21:45:23 ": "@ScottSegerstrom RIP HK!", "Mon Apr 15 16:12:27 ": "@alivadsirhc Don't mess with Hawk. Lose an arm or two. :)", "Sat Apr 20 13:16:16 ": "Good point. Why didn't I? RT @grantjess: @dougglanville why didnt Rickey Henderson figure this out?", "Fri Apr 12 14:11:23 ": "@JakeMHS Maybe but if the days fit the violation. Maybe not. Not sure if injuring someone adds more to it.", "Fri Apr 12 13:31:42 ": "@Stars5Steve According to him... Zero. I think he mentioned a AAA situation.", "Sun Apr 21 12:51:38 ": "@MikeGianella I don't think he thought about it really.", "Wed Apr 17 04:41:48 ": "@IngramNick310 This is very verifiable. :)", "Wed Apr 17 01:50:58 ": "@ohkiv Wow. Quite a game.", "Wed Apr 17 01:54:13 ": "As we cross this 21K follower platform, I thank you. I am officially verified. I therefore exist not just in body but in twitter. #humbled", "Fri Apr 12 15:39:51 ": "@mosborne704 Interesting. Should that be part of the penalty? Hurt your team?", "Sun Apr 21 12:39:50 ": "Stealing second a second time is going back to the scene of a crime. The stat could also be... CSI-SB. Investigative base stealing.", "Wed Apr 17 01:58:27 ": "Pinching my own arm. Wait...my arm just sent me a direct message. RT @pkmonaghan: @dougglanville Congrats. You're really you! *whew*", "Fri Apr 12 13:32:24 ": "@DbackFanChris Third time he hit him.", "Fri Apr 12 15:57:02 ": "@andrewbullen24 @bbtn @mlb Fair point. Think injury should matter?", "Wed Apr 17 04:40:11 ": "4) In Little League, I switch hit for a week, I also switch pitched and threw 4 innings left-handed", "Mon Apr 22 02:30:35 ": "Shocked the wall stayed up after #padres 6' 15\" LF Blanks crashed into it, I continue my rant against the warning track and non-flip shades.", "Mon Apr 15 17:48:23 ": "@bhholley I did say that the game was 25% AA in 70s with no front office diversity, so not direct. But leadership diversity is important.", "Sun Apr 21 12:40:50 ": "@shanekelley66 Wondering where stealing first ranks in your list....", "Wed Apr 17 04:27:43 ": "You got me there. Did I play baseball? RT @therealMikeHoch \n@dougglanville prove it. What's something only Doug Glanville would know", "Wed Apr 17 04:31:42 ": "I was mistakenly detained by the Johannesburg PD RT @therealMikeHoch @dougglanville prove it.What's something only Doug Glanville would know", "Mon Apr 15 03:04:48 ": "Good question. RT @jverskine: @dougglanville Don Baylor never rushed the mound, or did he?", "Tue Apr 16 18:26:36 ": "@tweetjhood Define \"diversity.\" Jackie Robinson's legacy is much more than in black and white.", "Sat Apr 13 21:44:30 ": "@jverskine :)", "Fri Apr 19 06:48:44 ": "@ZacharyGBrown Ah some good days."}