{"Wed May 18 09:50:50 ": "sure do love these guys right now http://fb.me/Yb2i6RPF", "Wed May 18 00:46:08 ": "never tire of them http://fb.me/thjowkQj", "Mon Aug 08 08:12:04 ": "Had a great time at the Dranouter Festival - SO very much love being in Flanders!", "Thu May 03 11:45:05 ": "Hey all you LOVELY people - sorry I've been so silent, I'm just working away on the second album, getting closer... http://t.co/mVq5HIHT", "Wed May 11 18:40:31 ": "Я добавил 40 фотографии в Facebook в альбом \"Ireland, England, Scotland, Norway, Sweden\" http://fb.me/MZsnC9mY", "Mon Jul 18 11:00:14 ": "Come to \"JOHN GRANT SUMMER DATES\" Friday, July 22 at 8:30 pm until &lt;br /&gt;Sunday, September 11 at 11:00 pm.  Fri... http://fb.me/KRrbitGQ", "Wed Apr 27 23:50:16 ": "Tack Göteborg, det var verkligen en mycket bra kväll!", "Sun May 08 10:54:53 ": "Tree planted by Queen Elizabeth http://fb.me/QuhWtsqk", "Sat May 14 07:04:43 ": "love this music http://fb.me/Z5ASw4Bw", "Tue May 24 20:22:09 ": "Come to \"John Grant, featuring Heidi Spencer and Alessi's Ark\" Wednesday, June 8 from 9:30 pm to 12:30 am. Tickets... http://fb.me/YCvsDPAe", "Mon May 23 06:21:31 ": "New Gus Gus today - fantastic! http://fb.me/YuCckCm4", "Wed May 09 23:08:23 ": "hello beautiful folks - an old favorite of mine... http://t.co/0F3aEwe6", "Mon Sep 05 16:41:01 ": "Hi everybody, really enjoying the shows and talking to you - hope to see you at the Royal Festival Hall gig on... http://t.co/6eX1CM3", "Tue Jun 14 11:51:21 ": "played a song Set Your Sights Low by Sally Sunbeam on @myspace http://lnk.ms/PGKQF", "Tue Oct 04 19:08:58 ": "this looks fanstastic as well! http://t.co/GDA3aWaS", "Sun May 01 10:20:21 ": "Geez, i'm getting behind here - it's such a whirlwind sometimes - Stockholm was magnificent as usual and I got to... http://fb.me/EjNFvnqq", "Thu Aug 25 14:52:16 ": "played the song 'Toy Mellotron' by TOY on @myspace http://t.co/gZPaQDw", "Sat May 14 07:02:40 ": "One of my favorites http://fb.me/z9PSVkq7", "Wed Mar 13 17:55:44 ": "Pale Green Ghosts is out now on CD/vinyl and digital download. Tour dates at http://t.co/BS8ArygQbL You can... http://t.co/sgIm9xYBX4", "Tue Jun 21 08:52:59 ": "Just saw the documentary \"Senna\" - that shouldn't be missed - amazing", "Tue May 24 20:26:05 ": "Come to \"John Grant in NYC, featuring Alessi's Ark and Heidi Spencer\" Thursday, June 9 from 9:30 pm to 12:30 am.... http://fb.me/13lNUjzTB", "Fri Jul 27 00:25:13 ": "Hello Lovelies! Getting closer to finishing the record. Sinead O'Connor is going to be singing with me on a few... http://t.co/Jtuds1FD", "Wed Nov 16 18:18:35 ": "Istanbul is an amazing place!!!!!", "Fri Sep 09 22:25:49 ": "Thanks Halifax for an amazing evening!!!!", "Fri Jul 01 14:03:00 ": "Hello all you beautiful people - please vote for me for the Mojo awards - and thank you in advance - just if you... http://fb.me/YeEC9Qoa", "Sun May 27 15:18:08 ": "Всем моим новым русским друзьям: ОГРОМНОЕ вам спасибо за потрясающий вечер в политеатре!!! Я просто без слов. У... http://t.co/7yQkmxek", "Tue Jun 21 00:52:13 ": "Thanks everybody - Madrid was SO amazing - amazing audience", "Sat May 14 18:55:06 ": "so f***ing good http://fb.me/LqUeHM1H", "Tue Feb 05 08:04:26 ": "On the train to Brussels from Paris. Hope I get to hear some beautiful Flemish today. I was watching Moscow,... http://t.co/mUp2KB4Q", "Wed May 18 01:12:53 ": "it's called out of dawn actually - from their most recent and has some of the best stuff they've done on it in my... http://fb.me/VyvrsuAu", "Fri Oct 21 04:44:54 ": "Was so looking forward to playing in Sintra, it was really frustrating to be struggling with my voice in such a... http://t.co/Vpmw8Qg8", "Fri Jan 25 15:38:53 ": "http://t.co/xEZQMHue http://t.co/1cKq9ASz", "Mon May 23 06:58:32 ": "This album is amazing and this TRACK!!!!! http://fb.me/O81pjzwl", "Mon May 02 09:56:05 ": "Thanks Kilkenny - beautiful evening with you.", "Sat May 14 18:51:42 ": "LOVE http://fb.me/L70iDfiY", "Fri Jun 08 01:47:52 ": "Getting closer everyday to finishing the new record. Biggi and i hope to be done in July! I'm very excited.", "Tue Jan 29 22:01:47 ": "http://t.co/qTRh7KJT http://t.co/jET6y4sV", "Mon Jul 18 11:01:14 ": "Festival appearances across Europe + headline shows. http://fb.me/LBVGLcTy", "Sat May 05 18:55:07 ": "ahhhhhhhhhhhhhhh... http://t.co/DpLlZrC0", "Wed May 11 14:25:51 ": "María del Rosario Pilar Martínez Molina Gutiérrez de los Perales Santa Ana Romanguera y de la Hinojosa Rasten... http://fb.me/Faf4rHmB", "Tue May 31 22:46:08 ": "Um, just two minutes ago, at quarter to midnight I'm being told that my tour of the U.S. has been cancelled and I... http://fb.me/HIDap1bT", "Fri Nov 18 12:55:36 ": "Today is officially the very last show of the Queen of Denmark tour and I want to thank everyone everywhere from... http://t.co/8EDtD6pX", "Tue Jan 29 22:03:11 ": "just to let you all know, the twitter account I use is @megalon68 - because I love Godzilla vs. Meglaon!!!! Duh.", "Sat May 14 10:29:59 ": "Just have to post this again because it is so amazing http://fb.me/QbP4wcHv", "Sat Mar 24 00:55:14 ": "For fans of John Grant, John and some chums going under the name The Czars, released a covers album called 'Sorry... http://t.co/LJNCSIzA", "Wed May 11 14:51:54 ": "Я добавил 27 фотографии в Facebook в альбом \"Ireland, England, Scotland, Norway, Sweden\" http://fb.me/sLgkcitx", "Sat May 14 18:29:28 ": "strange looking things http://fb.me/X6FBj3mA", "Sat May 14 18:33:49 ": "So incredibly beautiful, my favorite of last year and of all-time - this blew my mind when i heard it last summer... http://fb.me/LhXHnStu", "Thu Oct 20 04:51:35 ": "Ahhhh, thank you lovely Fins, I had a wonderful time with you at the Savoy and can't wait to return next year! Much love to you.", "Fri Jan 25 15:37:38 ": "http://t.co/5o4Rlzvy http://t.co/L47Mb6WR", "Tue Jun 14 10:49:04 ": "Edinburgh is shockingly beautiful - it's really quite absurd", "Tue May 10 10:29:17 ": "just fyi - the song is TC and Honeybear, there is no \"his\" in the title - I keep hearing tc and his honeybear - no, no, no - : )", "Wed Oct 05 07:18:03 ": "one of my favorite movies http://t.co/8awOlCwg", "Thu Dec 13 03:36:33 ": "Hey Everybody, thank you for your words and for listening to  Pale Green Ghosts and checking out the video. I'm... http://t.co/j1aBOar5", "Tue May 24 00:41:30 ": "one of my fave pics i've tookeded - love palm trees http://fb.me/tQgC3jC8", "Tue Jul 26 15:30:05 ": "played a song Appointment In Samarra by Paul Thomas Saunders on @myspace http://lnk.ms/NjM3Z", "Tue Nov 15 08:52:18 ": "Thank you lovely Italians for a wonderful mini-tour - see you next year some time!", "Mon Sep 10 23:47:05 ": "I posted a new photo to Facebook http://t.co/R76IknT7", "Sat Jun 04 21:28:59 ": "amazing new song from Beach House from Primavera... http://fb.me/11mfhCms4", "Fri Jun 17 10:43:43 ": "played a song England are gonna do it by The Star Backroom Gang on @myspace http://lnk.ms/QGWdM", "Tue May 24 01:12:34 ": "This video is much better http://fb.me/O46q0Np6", "Fri Oct 28 14:54:56 ": "Trying this out - I've been aware of Tumblr for quite some time but hadn't got around to it yet - once I get my... http://t.co/fz4oOyBv", "Mon Oct 31 21:16:59 ": "in Iceland http://t.co/GK3UQwCg", "Mon Aug 08 08:36:29 ": "Я добавил 28 фотографии в Facebook в альбом \"Berlin, July, 2011\" http://fb.me/1dcGq0zRB", "Mon May 23 01:41:19 ": "Melbourne and Sydney were amazing - way too short! Got to get back there as soon as possible!", "Wed Dec 12 18:25:42 ": "Thrilled to share the video for \"Pale Green Ghosts\", the title track from John Grant's forthcoming album, to be... http://t.co/b6DQTBID", "Mon Sep 05 10:35:30 ": "Come to \"JOHN GRANT AUTUMN EUROPE DATES\" Today from 4:30 pm to 7:30 pm. Sat      15-Oct      Iceland, Reykjavik,... http://t.co/wSbzsE5", "Wed Apr 27 11:32:54 ": "played a song Ancestral Star by Barn Owl on @Myspace http://lnk.ms/MFshF", "Sat Aug 27 20:06:08 ": "Я добавил 18 фотографии в Facebook в альбом \"New Yawk, 27 Август 2011 г.\" http://t.co/Av9UcA5", "Tue Jun 14 11:41:35 ": "Can anyone suggest any good movies - this summer seems particularly bleak thus far although Win Win was fantastic... http://fb.me/yAx3Rzor", "Fri May 20 14:16:54 ": "Tour dates. http://fb.me/YkAccgQ0", "Mon Oct 31 21:15:02 ": "Ciao Italiani! Does anyone know if this is available anywhere in Italy on CD or if it's only on vinyl? Jollymusic... http://t.co/8SJEehgI", "Tue Jan 01 01:59:09 ": "Happy New Year!!! 'nen guten Rutsch wünsche ich euch allen!!! С новым годом, и самого наилучшего всем!!! ¡¡¡¡Feliz... http://t.co/dYYIZIAC", "Tue May 24 00:35:23 ": "Sorry about the horrible video, but the song is amazing http://fb.me/suaRS2u1", "Sun Jan 01 20:37:18 ": "Happy New Year and thank you all for making 2011 an amazing year for me. Can't wait to see you all again in 2012 : )", "Wed May 18 00:48:49 ": "desert-island track for me http://fb.me/XQGW1oQI", "Tue Jan 01 01:56:17 ": "favorite New Year's song http://t.co/xmFEUwhM", "Fri Jul 22 00:15:40 ": "Thanks everybody for making this happen for me!!!!!!!!!!!!, it was an amazing night and for those who don't know,... http://fb.me/zDAM1Mdm", "Tue Oct 04 19:06:11 ": "cannot WAIT for this! http://t.co/4Zo7uqti", "Tue May 03 07:39:11 ": "Oh man, I love this band - so excited about their new record - it's quite beautiful http://fb.me/10fY51T9J", "Wed Sep 14 10:46:04 ": "played the song 'Knock Out' by Airwaves on @myspace http://t.co/h53CckF", "Sat Aug 27 21:37:21 ": "john are you in nyc? please be careful", "Wed Sep 07 23:23:47 ": "Thanks everyone for an amazing amazing night at Royal Festival Hall - it was a truly special experience for me! See you soon and much love!", "Mon May 02 09:56:15 ": "Uschi Blum (Hape Kerkeling) - Moskau 2010 http://fb.me/EJXRCHUB", "Sun May 01 10:22:32 ": "Bergen was amazing. That city is stunning. Flying into Bergen over the mountains in a small plane from Stockholm... http://fb.me/MrOovSbg", "Mon May 23 01:44:06 ": "Saw Insidious tonight, thought it was very good", "Wed Jul 20 10:54:01 ": "The 100 club is such an amazing place. Thanks to everyone who was there and made it such a great night!", "Mon Jul 11 16:53:19 ": "Я добавил 31 фотографии в Facebook в альбом \"some pics 11 Июль 2011 г.\" http://fb.me/BnDl6F5f", "Tue Jun 14 11:43:14 ": "We're working on a John Grant website - which will be more tailored to my \"personality\" : ) than FB will allow -... http://fb.me/ZdgZMMtg", "Sun Nov 27 22:53:52 ": "just saw this and thought it was amazing http://t.co/8ZzuLLBj", "Thu Mar 28 17:22:57 ": "GMF http://t.co/L3CNREgTOl", "Thu Jul 21 15:26:37 ": "played a song GLORYHOLE by TRUST on @myspace http://lnk.ms/LX9hM", "Fri Apr 05 14:11:42 ": "feature here... http://t.co/Ii3qDEv0Zt", "Mon Oct 31 09:46:13 ": "This is SO good - if you feel like laughing, then... http://t.co/Qmbli3rL", "Sat Jun 04 20:31:22 ": "Back in Berlin for a couple of days - not such a bad thing : )", "Tue May 24 00:36:46 ": "Saw movie tonight called \"Win Win\" and really liked it. Hilarious.", "Mon Oct 31 21:12:46 ": "Jollymusic - Radio Jolly (ADULT. De-funked Remix)", "Mon Feb 11 16:07:48 ": "http://t.co/uQdAU46j http://t.co/nqjzjxku", "Wed Aug 10 12:40:40 ": "they are the full package http://fb.me/DMaiwQ2H", "Mon Sep 12 16:48:07 ": "played the song 'Tiny Head' by the Luyas on @myspace http://t.co/tpfw2O4"}