{"Sun Apr 14 22:04:39 ": "I dont know what else to write about..", "Sat Apr 20 18:22:26 ": "did we get jodeci RT\"@msLAS: @CheThinks lol just u wait til Monday...\"", "Fri Apr 19 16:08:00 ": "Remember when there was 120 murders this time last year in chicago? No? Well, it wasn't that big of a story..", "Mon Apr 15 18:02:05 ": "Doors at 830pm tonight for my show @BarMatchless. There will be champagne. Cause, why not? Bring ur cute friend.", "Mon Apr 22 14:48:10 ": "@yannispappas thats hilarious", "Sat Apr 20 21:16:30 ": "I never thought I'd be one of those old folks that complains about how \"back in my day, our Ice Cube was different\"", "Sat Apr 20 13:27:58 ": "REAL weedheads don't celebrate 4/20, cause REAL weedheads don't know the date.", "Mon Apr 15 17:42:44 ": "@mRiah happy birthday lil' lauren", "Fri Apr 19 16:27:52 ": "@WazRas &amp; ur response was to mock Chicago's tragedy?", "Tue Apr 16 02:07:31 ": "Thats fucked up.", "Mon Apr 15 14:43:13 ": "@openAsilver cocksucka? U have another mans name.", "Mon Apr 15 14:01:58 ": "@JordanRock843 sauce money or bleek?", "Wed Apr 17 14:31:56 ": "I'm going to south beach tomorrow. I got the flu today. Life is a motherfucker.", "Fri Apr 19 21:41:35 ": "I thought people buying twitter followers was a myth. Thats like paying for imaginary friends. Ur not really doin that, are you?", "Thu Apr 18 17:35:34 ": "Dear blonde in front of me, im not looking at ur big fake tits cause im a perv. If you had big fake ears or feet Id glance over just as much", "Mon Apr 15 03:03:00 ": "So I did write a joke today. It ain't that funny yet. YET.", "Mon Apr 22 14:40:05 ": "If 283 people show up to the show at #PublicAssembly tonight, I'm buying everybody icees from the Puerto rican dude with a shoppin cart", "Thu Apr 18 12:05:05 ": "Never. RT\"@_StringerBella_: 😂😂😂😂 Che is gonna block me one day\"", "Sat Apr 20 13:25:16 ": "RT @ohheyjesssager: C'mon man, this is where Golden Girls took place. RT @CheThinks There's a lot of old ass in miami. Wasn't really expect…", "Mon Apr 22 14:44:40 ": "U tryna play me? I make more money than both ur fathers put together RT“@ewill9921: @CheThinks i didnt know vh1 played you that well”", "Mon Apr 22 14:45:53 ": "Then we must be the same age RT“@dlemoncomedy: I'm NOT saying I'm old. I'm just too old for certain foamposite colorways.”", "Sun Apr 14 22:06:32 ": "When i get writers block, i get depressed. I could really use a big tittied hug right now", "Wed Apr 17 19:46:59 ": "I can't watch porn while I have sex, but I do watch the food network while I eat", "Sat Apr 20 14:03:47 ": "@Ace_Lib @NathanielsWords I deserve that.", "Sat Apr 20 13:29:29 ": "@Muggletown I will be in sydney in the next year for sure", "Thu Apr 18 23:18:40 ": "My hotel room is alllllll white. Glad I don't pee the bed no more. http://t.co/8a5flDx7B2", "Mon Apr 15 17:51:49 ": "\"I know you better get in the house and do these damn dishes\" - Things I bet my mother misses saying", "Thu Apr 18 17:17:24 ": "Dear blonde in front of me, if u didn't want me to look at ur titties u shouldn't have bought them.", "Mon Apr 22 14:51:17 ": "Son, my last check from @vh1 came on a flatbed, on some will smith shit.. People was like, damn!! $643 on a flatbed?", "Mon Apr 15 02:15:45 ": "hahahaha!! RT\"@jlivebeal: @CheThinks Kim's first time at the rodeo made @BestWeekEver. Boom!\"", "Sat Apr 20 17:12:58 ": "next time I'm booked for @standupny  please let @Ellefab_style know!!", "Sat Apr 20 13:22:43 ": "@Muggletown @mattokine @ronnychieng it happens..", "Thu Apr 18 11:57:18 ": "There's a blue check next to my name. Im officially me now.", "Thu Apr 18 18:23:15 ": "RT @allihoop3: None of my friends have twitter. Wth I need more followers. C'mon I'm interesting! #needmorefollowers #needfollowers", "Sat Apr 20 20:21:52 ": "@andrewschulz @petedavidson there's another half tho", "Thu Apr 18 15:10:17 ": "@seanoconnz haha", "Sat Apr 20 04:11:21 ": "RT @LiveNationCmdy: @CheThinks closing out the free comedy stage on Lincoln Road at @SBComedyFest http://t.co/7wvLkGO0nL", "Fri Apr 19 16:23:43 ": "RT @kylebcomedy: @CheThinks yeah organized and plotted out by someone who had to knock over a gas station for money", "Mon Apr 22 15:07:30 ": "RT @JudahWorldChamp: Watch out Earth, I'm going to do a lot of karate today.", "Wed Apr 17 14:41:44 ": "I'd work with a well tanned Columbian too RT\"@ewill9921: @CheThinks why she gotta be cuban?\"", "Fri Apr 19 16:04:23 ": "RT @FINALLEVEL: Respect for my homie GURU R.I.P. Three years ago today...", "Fri Apr 19 00:04:36 ": "RT @_StringerBella_: “@iAmHeysoos: #TwitpicTheFunniestPictureInYourPhone” http://t.co/HnaFucOTza", "Thu Apr 18 16:07:37 ": "You ever read somebodys tweet and think, when the fuck did i start following you?", "Mon Apr 22 14:46:27 ": "RT @yannispappas: The pretty people always leave their cities for New York, LA or Miami. The rest of the American cities are full of abando…", "Mon Apr 15 14:50:10 ": "@openAsilver alright, well that concludes the portion of the day where somebody responds to you on twitter.", "Fri Apr 19 16:30:10 ": "RT @joestanton: @WazRas @CheThinks yep all those armed bums", "Sat Apr 20 20:41:35 ": "@SpikeLee u look exceptionally ridiculous today.", "Sat Apr 20 20:03:08 ": "I think the cleaning lady is trying to see my peen.", "Thu Apr 18 15:09:39 ": "My fever just keeps comin back yo..", "Sat Apr 20 17:55:15 ": "I don't think so, but maybe RT\"@Ace_Lib: @CheThinks do you do ur 2 minute talk show every episode?\"", "Sun Apr 14 19:19:59 ": "Im doing comedy tonight. Come to my shows.", "Thu Apr 18 15:00:06 ": "When do the results come in for the \"which network is the most concerned about boston\" contest?", "Sun Apr 14 22:08:49 ": "Old jokes. RT“@Home_Halfway: @CheThinks What did you do this weekend?”", "Mon Apr 22 14:18:20 ": "My Monday night show is NOT at Matchless tonight. Its at PUBLIC ASSEMBLY, right down the block! 830pm. FREE.", "Mon Apr 22 15:08:51 ": "Yo @MTV, yall shoulda named that 16 &amp; pregnant show \"awkward\"", "Sat Apr 20 20:12:11 ": "I'll text you a pic RT\"@raesanni: @CheThinks is it really dark?\"", "Tue Apr 16 19:01:20 ": "@anitajewtina this was so cool", "Sat Apr 20 20:16:54 ": "Yo that McDonalds commercial was kinda erotic", "Sat Apr 20 13:08:03 ": "Why am I leaning slightly forward? http://t.co/mOPL0mnbnD", "Sat Apr 20 12:36:04 ": "Thanks love RT\"@VinoCaPisco: .@CheThinks is funny. That's all I wanted to say.\"", "Sat Apr 20 20:05:22 ": "We better not lose to these bums..", "Mon Apr 15 13:58:01 ": "Come witness my grand return to @BarMatchless tonight 830pm! If 130ppl show up, ill perform my new r&amp;b song \"i hit it after ray j\"", "Sat Apr 20 13:51:03 ": "RT @thereal_lenny: @CheThinks oh snap its 420", "Tue Apr 16 19:14:55 ": "@RianacaitlinC god bless em", "Sun Apr 14 22:12:37 ": "I feel a good bomb coming tonight. Maybe 3. If i dont have a promising new joke by the end of the night, i aint shit", "Thu Apr 18 14:44:50 ": "Watching Maury makes me glad i ate all those crayons when i was little and cant have kids.", "Fri Apr 19 16:25:20 ": "RT @WazRas: @CheThinks Sorry! I thought you were mocking Boston's tragedy. Btw, you're awesome!", "Wed Apr 17 18:43:52 ": "...and please dont get me STARTED on \"CNN\"!! Im so mad at them for that bad thing they did today. UGH! so angry.", "Wed Apr 17 14:45:57 ": "RT @yannispappas: I haven't stretched, worked out or sweat in a year. I bust mad nuts though.", "Sat Apr 20 19:56:55 ": "YOU FOUND MY DAD?! RT\"@msLAS: @CheThinks BETTER.\"", "Thu Apr 18 15:28:59 ": "@jermaineFOWLER ur not famous. Stop.", "Sun Apr 21 05:24:34 ": "Really? Wow, thanks RT\"@TwBirthday: @CheThinks Happy 3rd TwBirthday! You've been around since 21 April 2010! http://t.co/gBWR0VkBas\"", "Wed Apr 17 14:43:47 ": "I have $2700 in the bank. I don't need a personality, darling. RT\"@jeffernaut: @CheThinks Well maybe she'll like your personality.\"", "Fri Apr 19 15:45:33 ": "Are any of u really watching CNN? Or do u just wanna fit in by making fun of them?", "Thu Apr 18 17:22:22 ": "Dear blonde, if u wanted a jacket big enough to hide ur tits from me u shoulda wore a jacket big enough to hide ur tits from me", "Sat Apr 20 20:34:19 ": "Damn, they made SIX fast &amp; furious's in like 7 yrs. That's police acedemy numbers", "Thu Apr 18 23:23:04 ": "@joederosacomedy I know right? Feel like Liberace", "Thu Apr 18 11:52:30 ": "RT @Daniel_Siva: @CheThinks i just saw you on tv in Australia and I was in tears. When are you coming back down under?", "Mon Apr 15 14:30:39 ": "@JimNorton someone oughta teach you a lesson on how to treat a lady \"Jim\"", "Tue Apr 16 19:00:59 ": "RT @anitajewtina: ep 3 of \"Questionable Drawings\" with comedian @CheThinks is here! Check it out! https://t.co/jkQ1NMCm49", "Thu Apr 18 16:10:27 ": "People make fun of me for not reading books, but just remember the first person to ever write a book never read a book either", "Mon Apr 22 14:44:51 ": "RT @OhSoKool: @CheThinks give them the GPS son! (jokes)", "Thu Apr 18 11:53:02 ": "@Daniel_Siva next year for the festival", "Thu Apr 18 23:37:33 ": "I don't understand why people who get high everyday are so excited about 4/20", "Mon Apr 22 14:52:13 ": "RT @ewill9921: @CheThinks wow you got jokes ha okay", "Sat Apr 20 21:36:29 ": "Man, I wish I enjoyed anything as much as black people in commercials love McDonalds", "Fri Apr 19 00:02:24 ": "RT @BakerBone: Slap box with ya loved ones! You never know when they might run into Chris Brown or a  drunk professional Athlete", "Sat Apr 20 21:12:32 ": "Hold up, hold up.. does JR Smith have an unfinished haircut?", "Fri Apr 19 02:58:22 ": "#repost @jessicaisgross http://t.co/6yTGRFhXf7", "Sat Apr 20 13:20:36 ": "There's a lot of old ass in miami. Wasn't really expecting that.", "Thu Apr 18 18:32:50 ": "Watching this dude eat a panini with a fork. Just a fork. I'm gonna stab him.", "Wed Apr 17 14:38:29 ": "My chances of finding a thick tittied Cuban girl with a big butt and little skirt are slim to none with this flu", "Sat Apr 20 21:22:40 ": "So the 2 white dudes ask for a girl and a hot tub, and the black dude asks for a damn sandwich? #statefarmcommercial", "Fri Apr 19 16:21:01 ": "@WazRas word..?", "Sat Apr 20 21:43:05 ": "I say in 1yr there will be a #GayCode RT\"@jermaineFOWLER: Oh... @MTV2GuyCode vs @GirlCode marathon is on...\"", "Sun Apr 14 22:13:41 ": "@mikejess1020 my name is mike campbell. This is weird.", "Wed Apr 17 16:43:47 ": "RT @NicksTurners: Hey @BestWeekEver! 8:30pm @UnionHallNY Me and @CheThinks and also Janeane Garofalo and @mrseanpatton and more! Tix: ht ...", "Mon Apr 15 14:28:09 ": "RT @LiIStevieWonder: Qpcpbof qpbbh cncba asd", "Mon Apr 22 14:54:11 ": "RT @ahhhdri: @CheThinks #piraguas for everyone!", "Mon Apr 22 14:33:34 ": "I'm taking over #PublicAssembly tonight @9pm. Hosting all free comedy. Then we buying bottles and rolling Ls for the size of franks"}