{"Fri Mar 01 14:27:34 ": "New song from our latest album on Soundcloud: http://t.co/xxGh182M8b", "Mon Apr 15 12:58:42 ": "It´s now possible to buy our latest music on our Facebook page. http://t.co/UIzjxu7mzJ", "Wed Mar 20 19:43:35 ": "Finally got a media bench for my new record player - it's deep brown, it's got nice wooden textures and it's quite sexy.", "Tue Mar 26 08:06:55 ": "@i_am_your_idea Thank you sir!", "Wed Mar 13 13:07:41 ": "Long since i've listened to \"Future days\" by Can-it's so good! Have fond memories of sitting in the park, smoking &amp; listening to that album!", "Sun Mar 03 16:52:49 ": "Some kids today: \"It´s the guy that´s always there\". You´re god damn right i´m always on my sweet balcony of excellence - balconies rules!", "Thu Jan 31 20:34:38 ": "Our new album is up for sale for $12. Ten songs and a bonus. Choose between MP3 or FLAC. http://t.co/WHgbbInq", "Mon Mar 04 14:02:11 ": "Our previous album \"Trance eloquent wings\" &amp; instrumental EP \"Góra\" is available in our shop. Go and get some kaleidoscopic music!", "Fri Feb 22 19:18:37 ": "TimeZoneTweet: Our new album is streaming at http://t.co/2tlnQSIsB6 this weekend. Digital edition of the album is 25% off. Please share!", "Thu Jan 17 18:37:59 ": "You can now order tickets to our release concert! Run to Tiger in Oslo or hit http://t.co/a8Dq9Hl7", "Mon Feb 25 13:08:48 ": "Sound &amp; Smell", "Wed Feb 27 10:53:38 ": "Have you ever worn a diaper at a crowded festival? Must be a weird experience to let it flush in the midst of the crowd.", "Sun Apr 21 13:34:29 ": "Magnificent Britt. She was thrilled that we could deliver our latest record to her and it was super nice to meet her! http://t.co/j2KZuotLtW", "Sun Feb 10 12:23:13 ": "Hung over? Fancy some reading? We´ve put up our diary of making our new album \"Psyche\". Read at http://t.co/yQnOPZAv", "Tue Apr 23 11:23:46 ": "Got a check from America &amp; went to cash it in. The banker looked at me as I had time-travelled from the 90s when checks were used in Norway.", "Sat Feb 23 18:56:47 ": "An old-school rebus? More of a treasure map perhaps? http://t.co/5Gzs9OMZTR", "Wed Jan 02 19:18:08 ": "We´re almost finished with our new website and we´re looking forwards to unveiling it on the 30th of January! Hooray!", "Mon Jan 28 10:05:37 ": "Practicing lyrics. There certain lyrics of ours that won't stick. Don't know if that's a bad sign or not...", "Thu Jan 03 19:16:19 ": "Maybe we´re a little behind on this, but Anthony Newley is magnificent! http://t.co/O6R7bBgl", "Wed Mar 06 19:24:54 ": "Our new album has been out a month. Have you checked it out yet? You can listen to three songs at http://t.co/xeyrPkL389", "Wed Mar 13 18:02:32 ": "New post by yours truly. Give it a read will ya? http://t.co/AcYOlQvTpB", "Wed Jan 30 08:11:33 ": "Our new website is launched and you can purchase our third album at http://t.co/WHgbbInq \nIt´s alive!", "Sun Mar 17 20:25:31 ": "It was a true pleasure playing in Stavanger! Cafe Humbug is a stellar place!", "Wed Mar 27 10:41:14 ": "Our friend Tommy Tokyo recently won a Norwegian grammy for his latest record. Congrats! Did you know that we mixed his first album?", "Tue Apr 23 19:05:41 ": "So eager to fire up the turntable today, but have to save for a new amp :-( The turntable is eyeing me, mocking me...gah!!!", "Wed Feb 06 17:42:55 ": "@mxdwn Thanks for the review and giving our music a chance - much appreciated!", "Thu Feb 14 07:48:31 ": "RT @nanobotrock Greg gives you a reason to commit yourself. Give him an excuse...he dares you to #Buy #Music\nhttp://t.co/19LFtDts", "Thu Mar 28 11:29:41 ": "Hm, are we sponsoring this year´s Øya festival? http://t.co/ER6nPFAaAt", "Fri Mar 15 11:25:31 ": "@Sleepyardmusic vi spiller på Cafe Humbug i morgen. Hadde vært kult å se Sleepyard der! :)", "Wed Mar 06 10:58:19 ": "The sun machine is coming 'round...", "Wed Mar 27 16:36:17 ": "Only 22 likes to go before we give-away one album! Spread the word and share the love good people. https://t.co/GowCyZwPEa", "Fri Apr 12 13:44:06 ": "Is currently on a Suede nostalgia wave. http://t.co/xojzgh6m3X", "Wed Jan 09 11:07:26 ": "Happy birthday Mr. Scott Walker! You´re a big inspiration and we can´t believe how fresh you sound at age 70 - Bish Bosch!", "Fri Mar 15 13:10:03 ": "Rehearsel, sleep then 8 hour train ride to Stavanger! Come to Cafe Humbug and see us play if you are in Stavanger tomorrow!", "Tue Apr 16 12:50:31 ": "Today we´ll give away one copy of our new album - keep your eyes peeled! Don´t know our music? http://t.co/xeyrPkL389\n\nPlease RT!", "Sun Dec 23 09:45:38 ": "Happy Xmas &amp; a happy new year from Alpine Those Myriads! Just 5 weeks until we finally release our new album!", "Sat Jan 26 10:27:47 ": "Currently in preparation mode for our, hopefully, big impact on Wednesday ;-)", "Fri Apr 19 09:49:53 ": "Bringing a vinyl of our new album to a fan in Oslo today. We´re calling it the highly personal and mobile record shop - it´s pretty cool!", "Thu Apr 04 17:12:22 ": "Take off your uniform, sit down, and be peaceful. It might feel impossible, but it´s quite simple.", "Tue Mar 12 17:51:45 ": "@inyourspeakers Thanks for listening and writing about our music!", "Thu Feb 28 13:39:34 ": "Sitting on the balcony and soaking in the sun - life is sweet on the ATM balcony!", "Mon Mar 04 09:03:26 ": "Delivering a vinyl to someone in Oslo later today-nice! Live in Oslo and want one? Go to http://t.co/LJVRfjmsaU, send a mail &amp; we'll bring.", "Wed Feb 13 19:33:44 ": "Much thanks, a round of hurrahs and some odd blabbering from us in this blog post. http://t.co/FJVsTqwP", "Wed Apr 10 17:47:10 ": "New blog post by us: http://t.co/q67f1D3n4v", "Wed Mar 13 11:16:09 ": "RT @CafeHumbug: Humbugfestival 14-15-16 April: Bladed, Alpine Those Myriads, Cinema of Spirits, Healing Force, Julius, etc.!!", "Sun Feb 24 11:50:13 ": "Last day to hear our new album in its entirety! Any favorite songs? http://t.co/2tlnQSIsB6", "Tue Jan 15 12:39:13 ": "Check out 'Head wounds' from our new album that'll be released on the 30th of January. http://t.co/9p3jYjVX", "Thu Jan 24 13:21:49 ": "@Ravneson Thanks for sharing the news about our record Feileacán! Means a lot!", "Mon Feb 25 11:07:27 ": "Our album stream is no more, but it´s certainly possible to buy the album. Then you can listen to it from here to eternity...", "Wed Dec 19 17:56:40 ": "Looking forwards to be gobbling pinnekjøtt (salted and dried sheep)this Xmas and to drink akevitt(hard liquor based on potatoes)! Nom-nom...", "Tue Jan 01 11:58:34 ": "2013 will be the year Alpine Those Myriads spreads its wings - happy new year!", "Tue Mar 26 08:07:42 ": "RT @Beard_22: Cannot get this song out of my head. Perfect after a long day http://t.co/HBHucvGK @atmyriads", "Fri Dec 28 13:23:26 ": "RT @Sleepyardmusic: Sleepyard with Mike Garson and Dawn Smithson #Dreampop       http://t.co/20q6zSpv", "Fri Feb 08 11:25:55 ": "\"The end\" done by Nico is such a monumental piece of music! In our book, it exceeds the original.", "Fri Feb 15 11:02:52 ": "We´ve got a pretty cool newsletter we send out once in a while. Why not be a part of our wonderful gang? http://t.co/l972byUA", "Thu Feb 07 17:45:36 ": "You can now buy our new album on vinyl! Go to http://t.co/6S0Eju6X The digital edition is also included in your order! Celebration!", "Thu Jan 24 17:29:02 ": "Today we´re tweaking the bonus song for our upcoming album. It´s called \"Strum thy bones &amp; sky\". It´s a stompin´ glam number!", "Thu Mar 21 17:24:30 ": "We might have a give-away of some sorts on Facebook tomorrow. Hat tip, like us on Facebook today and you'll be set for our give away ;)", "Sat Feb 23 10:58:39 ": "Wish that venues and festivals didn´t recycle the same \"safe\" bands over and over. Go out on a limb, make a change and be daring will ya!", "Mon Jan 28 18:29:48 ": "Only 2 days until we explode at Café Mono in Oslo! Bring yourselves and all your friends!", "Sat Mar 09 16:33:16 ": "@SigneBj Er ikke så greie å forstå seg på disse sære myriadene :)", "Tue Mar 05 10:17:01 ": "Really looking forwards to playing Cafe Humbug in Stavanger on the 16th of March!", "Sat Mar 30 13:34:36 ": "Our Facebook give-away ends soon! 18 more \"likes\" and then we give-away an album. Like and share! http://t.co/w8tHDY93Or", "Sun Apr 14 08:44:49 ": "Booking your own band is hard! We´d love to have a booking agency so we could make more of our kaleidoscopic music :)", "Tue Jan 08 17:39:22 ": "RT @DangerMindsBlog: Alex Jones is such a fucking tool http://t.co/ghTjbGyi", "Wed Apr 17 12:28:42 ": "Strumming the piano…no wait, tapping the piano and making a new song.", "Sun Mar 17 13:04:35 ": "@benjaminhick Thanks for sharing Benjamin! :)", "Tue Mar 26 17:51:58 ": "We´re in your hearts &amp; making nests…", "Mon Apr 22 14:55:57 ": "To…much…beer…spirits…this…weekend…", "Mon Feb 11 19:01:50 ": "TimeLoopWarpHoleCoolTweet - the diary about making our new album is available for your reading pleasure: http://t.co/yQnOPZAv", "Tue Feb 12 15:07:38 ": "We´d like if you´d like us: http://t.co/urC3ZD51", "Sun Mar 24 15:40:11 ": "Our give-away is live! Like us on Facebook and you might get our latest album. Details: https://t.co/W3Qkcpw5mr", "Wed Apr 17 14:44:02 ": "If you´re in Oslo tomorrow, we encourage you to check out http://t.co/RxGionnAVD\n\nWonderful mini-festival with great music!", "Sat Mar 02 14:27:09 ": "New \"Psyche\" wallpaper to grace your computer in our vault: http://t.co/KVMnUsf1z7", "Wed Jan 09 18:16:42 ": "Into the shower we go, washing the hand and the toe, into the shower we go, washing the face and the fro...", "Thu Mar 14 09:17:26 ": "Seems like our desktop wallpapers are quite popular - thanks! More will come soon. http://t.co/KVMnUsf1z7", "Thu Apr 04 13:52:42 ": "Just testing...but follow the link :-) http://t.co/QfT8yBNiwR", "Wed Apr 17 07:49:56 ": "…and our free album is gone to a lucky person. We might do a give away again, so watch out fellow tweetonians.", "Mon Mar 04 19:43:29 ": "We´ve posted a new blog entry. It´s the first tidbit in a series of behind the scenes details about our new album. http://t.co/ZExjePpfCV", "Mon Mar 25 16:18:57 ": "Wormhole sweet &amp; tweet: you may receive our new album if you like our Facebook page. https://t.co/GowCyZwPEa", "Sun Feb 24 19:06:12 ": "Final listening hours…http://t.co/2tlnQSIsB6", "Wed Jan 23 18:58:55 ": "In 7 days we release our new album at Mono in Oslo! We hope the internets will get the word out for us…re-tweet?!", "Sat Apr 13 13:34:43 ": "We´ve made a working list called \"ATM4th\". That´s right, we´re knee deep in making our fourth album!", "Mon Feb 11 17:03:36 ": "RT @Sleepyardmusic: I Dream of Wires: The Modular Synthesizer Documentary   http://t.co/1pL6kxTt", "Thu Feb 21 17:51:28 ": "Visit http://t.co/2tlnQSIsB6 tomorrow...maybe we should´ve done it before our release, but we work in mysterious ways...tune in tomorrow!", "Sat Feb 23 16:19:50 ": "\"And now I'm standing in the corner, \nlooking at the room and the furniture \nin cheap imitation of alienation and grief.\" - Peter Hammill", "Mon Mar 11 17:56:50 ": "Making news songs. One of the songs might deal with genocide - I smell a hit!", "Tue Jan 29 22:07:19 ": "Visit http://t.co/jLm4wDJH tomorrow around 9AM and pick up our new album and go see us at Mono 21PM if you´re in Oslo. We´re almost there!", "Thu Jan 10 14:22:31 ": "In 20 days we release our third album at Café Mono in Oslo. Help us get the word out beautiful people!  https://t.co/hd9pWPgu", "Sun Apr 14 19:19:01 ": "Love me some Karl Pilkington!", "Mon Feb 04 20:51:21 ": "Not a proper video, but a small tour of the artwork of our new album. Enjoy and share...http://t.co/A7BYe1Vv", "Wed Apr 24 12:26:21 ": "And the “ATM vinyl Xpress” is on a roll. Will deliver two vinyls today - it´s so much fun!", "Tue Jan 01 17:16:46 ": "On the 30th of January we´re finally releasing our new album at Café Mono in Oslo! Sign-up: https://t.co/hd9pWPgu", "Tue Jan 08 21:09:33 ": "Happy to see that Bowie is making music again!", "Sat Mar 23 13:01:48 ": "Love this version of \"Jealous guy\" by Lou Reed: http://t.co/oqZ5zeKGqT", "Mon Feb 11 15:38:01 ": "Love that Vangaalen voice! Nice and raw!  http://t.co/ug1ksDsI", "Thu Feb 28 21:09:04 ": "Live in Oslo &amp; want our new vinyl? Mail us at atm(@)alpinethosemyriads(dot)com, bring 150,- &amp; we´ll deliver it to you with an included hug.", "Fri Feb 22 11:41:26 ": "Our new album \"Psyche\" is streaming this weekend! Digital edition is 25% off too! Go to http://t.co/2tlnQSIsB6 and listen. Please share!", "Tue Apr 16 18:18:15 ": "First come, first serve. Here´s is our latest album for free: https://t.co/DpDb6WdptT", "Tue Apr 16 17:18:19 ": "Any minute now we´ll give away a free copy of our new album here on Twitter…watch out!"}