{"Wed Jan 09 19:01:34 ": "Gov. Cuomo's ed. agenda will be primarily funded by competitive grants, according to written report #NYSOTS #NYSOTS13 #newsdayny", "Thu Mar 28 18:13:19 ": "When there's too much goop in the neighborhood. Who does Scarsdale call? Geesebusters. https://t.co/NssybfnVOB", "Wed Nov 14 14:12:22 ": "Teacher unions flexed their muscles in last week's elections http://t.co/48VTs64Z", "Tue Feb 07 20:44:16 ": "@518Schools Have a link to the early intervention report?", "Wed May 16 02:11:52 ": "New Paltz tax cap override fails by 18 votes; Tuxedo succeeds http://t.co/Ut0zUqD3", "Thu Feb 16 17:35:58 ": "Teacher eval. system includes agreement for NYC on appeals process", "Tue Jan 22 15:17:55 ": "@rburnett8 What do you want to hear on education funding? #NYBudget13", "Sun Oct 28 15:10:52 ": "MTA closing at 7 p.m. tonight for Sandy: https://t.co/PZBUUTZU", "Tue Jan 22 19:45:45 ": "@BetsyS48 Thanks. I noticed that after tweeting.", "Wed Jun 27 20:42:25 ": "@Ericpeterson25 yes. email me at meghan dot murphy at cablevision dot com", "Sun Feb 10 22:21:22 ": "Educators: After Newtown, schools need more mental health funding https://t.co/s1a5glNr", "Tue Jan 22 19:22:30 ": "Cuomo: \"The ladder to get there is the public education system\" #NYBudget13", "Mon Feb 27 14:12:54 ": "Mandate relief council at SUNY New Paltz at 1 p.m. Will school relief be on agenda?", "Tue Jan 22 19:27:50 ": "@rburnett8 Where in Central New York are you?", "Wed Jun 27 12:28:42 ": "Courts: Students can sue over school funding http://t.co/HCp7TyBQ", "Sat Apr 20 00:58:48 ": "RT @Boston_Police: CAPTURED!!! The hunt is over. The search is done. The terror is over. And justice has won. Suspect in custody.", "Mon Feb 27 15:37:14 ": "@nyschoolboards I will be there", "Thu Feb 28 17:40:28 ": "@jlubinsky Yes! Rivertowns rock. Send me your ed story ideas esp tech in ed trends meghan dot murphy at cablevision dot com", "Tue Jan 22 14:56:41 ": "Any educators out there watching the budget address today? #NYBudget13", "Tue Jul 10 12:13:37 ": "So true: Kids need to read nonfiction, too #newsday http://t.co/VEqS0UCz", "Thu Oct 25 15:22:56 ": "HV Educators: Not enough bang for buck in school reform http://t.co/LuoJd7IB", "Thu May 31 14:30:58 ": "Experts say early education is the best way to get results but budgets can't fit pre-K. http://t.co/s8jHRQZB", "Fri Feb 10 15:13:25 ": "Got questions on Cuomo's education policy? Ask his ed. sec. today in a web chat http://t.co/gkVyekDW", "Wed Jan 09 19:31:58 ": "@tomkorocz Not in SOTS doc. Coverage of board meeting last night: http://t.co/gL5Ik256", "Wed Jul 11 18:01:45 ": "Should parents use #CommonCore to decide on summer reading? http://t.co/6hkshqSL", "Sun Mar 10 19:12:05 ": "HV enrollment declines spur school closures, other tough decisions http://t.co/WdXOI2m5Ri", "Wed Jun 27 19:39:27 ": "State rejects Yonkers budget on school and fire department fronts http://t.co/FauDxQ0p", "Wed Jan 09 20:11:59 ": "Cuomo wants to fund pre-K. Read my 2012 in-depth piece on pre-K cuts because of dwindling budgets #NYSOTS13 #NYSOTS http://t.co/N7xaBEoO", "Wed Apr 17 13:49:25 ": "East Ramapo: Cut sports, teachers. Still facing budget gap. http://t.co/NbIMNr2mcK", "Sun Nov 25 20:47:38 ": "Hudson Valley history teach boosts learning with cell phones http://t.co/AevLETTl @mseideman #sschat #edtech", "Wed May 16 00:39:50 ": "20 minutes until polls close in NY's first school budget election under tax cap. #newsday", "Thu Apr 11 15:07:57 ": "700 Long Island parents riled up at state testing discussion. SUNY New Paltz panel is tonight #testing #newsdayny http://t.co/6VJ3sLzXpn", "Tue Jan 22 19:44:50 ": "Cuomo budget: Bad news for Dutchess? Proposes closing Beacon prison and Red Hook juvenile justice facility", "Mon Jul 16 19:34:43 ": "First Lady has first rate taste in food. My experience at Stone Barns last year was amazing. #newsday http://t.co/2ZSpj2Ko", "Tue Jan 29 14:28:00 ": "Can the Catholic church stop the decline of Catholic education? http://t.co/M0p1WJTq", "Mon Mar 18 13:56:21 ": "@Shayamg sorry i couldn't make it yesterday. please keep the story ideas coming!", "Tue Mar 19 22:32:54 ": "East Ramapo sues state ed. over special ed. placements https://t.co/hB3uFVABFv", "Wed Jan 09 19:55:32 ": "Cuomo proposal: State will pay 100 percent of cost of extended school day or year #NYSOTS #NYSOTS13 #newsdayny", "Mon May 14 21:58:43 ": "All eyes on the tax cap overriders Tuesday #newsday http://t.co/3K29vkB3", "Thu Mar 14 14:17:46 ": "@Shayamg I'd like to chat with you about East Ram. meghan dot murphy at cablevision dot com", "Thu May 31 20:24:27 ": "@jkellyphd Thanks for the RT", "Thu Apr 18 18:39:15 ": "@ArmaghanS Seriously. What was I thinking?", "Thu Feb 14 21:33:25 ": "YFT President on #teacherevals: \"I have found the APPR process and the training of the teachers like a root canal.\"", "Wed Feb 27 14:24:34 ": "Mount Vernon schools leader Judith Johnson battles tight budget with bold vision http://t.co/8lFdKdDfn8", "Sun Feb 17 19:36:12 ": "@SpeakerBoehner What is the number for your press office?", "Fri Apr 19 19:12:07 ": "East Ramapo school board president quits https://t.co/ano2izyH3D", "Wed Jan 09 19:36:53 ": "Also no mention of education-specific mandate relief so far for schools #NYSOTS #NYSOTS13", "Wed May 16 01:37:14 ": "Tuxedo overrides state tax levy cap http://t.co/ebRnSGXi", "Tue Jan 22 19:37:00 ": "Gov. budget documents here http://t.co/riNluUMg #NYBudget13 #NYbudget", "Mon Jul 16 15:36:03 ": "Had fun dancing in the downpour yesterday, just like the two baristas I photographed with garbage bags on their feet http://t.co/cpj6hW1D", "Wed May 16 02:20:38 ": "New Paltz and Highland fail to override tax levy cap; Most budgets passing in Hudson Valley\nhttp://t.co/znW6YO49", "Sun Apr 29 21:51:47 ": "Lawmaker fights against redefining autism #newsday http://t.co/bnPFiAeU", "Tue Jul 10 19:15:34 ": "What are your kids reading this summer? http://t.co/VEqS0UCz", "Wed Feb 08 01:01:00 ": "@PrimaryPride139 What school district are you in?", "Wed Aug 15 20:52:48 ": "Health officials: Protect kids by getting your whooping cough booster http://t.co/JW2yGbkN", "Mon Apr 15 19:47:36 ": "New Ro watching tomorrow for Anne Marie Rooney, semifinalist for Kelly and Michael's top teacher http://t.co/rRZSJae9iz @KellyandMichael", "Thu Feb 28 16:47:42 ": "State ed. to East Ramapo: Open your books https://t.co/cVRUli80ET", "Wed May 16 02:37:12 ": "Nearly all Hudson Valley school budgets OKd http://t.co/YgLeHmEx", "Thu Feb 28 16:49:50 ": "@jlubinsky Thanks Jesse! What district do you work in?", "Wed Jan 09 19:22:09 ": "NY School Boards says Cuomo should keep competitive grants  out of school aid @nyschoolboards #NYSOTS #NYSOTS13", "Tue Jan 22 19:52:56 ": "@NYGovCuomo Will task force apply to school districts? More details?", "Fri Jan 27 17:16:06 ": "@DianeRavitch Do you know experts following the NCLB waiver process?", "Tue Jan 22 19:49:58 ": "Double relief for schools for pension costs proposed: Extra aid and Tier 6 borrowing plan #NyBudget13 #Nybudget", "Mon Apr 30 15:36:10 ": "Corey Foster's family calls for justice and changes for all kids in treatment centers.", "Mon Feb 27 14:40:31 ": "Redistricting is a top priority for new Kingston schools superintendent http://t.co/I6x2fssn", "Mon Mar 11 15:55:40 ": "Governor announces new resource. State data online on jobs, health, TZ bridge, more. https://t.co/hCx4rH7gqt", "Fri Apr 20 17:32:02 ": "Pineapple question on state test confuses everyone http://t.co/y1p3QDvp", "Wed Jun 27 13:30:32 ": "@omackson Best quote: \"We have boudin balls as big as a softball.\"", "Mon May 14 21:57:49 ": "Newsday Westchester breaks down School Vote 2012 #newsday http://t.co/pIdMYe5j", "Wed Jun 13 15:33:09 ": "83 percent of NY students say cyberbullying is rampant: http://t.co/9ayoC4xO", "Wed May 16 01:06:36 ": "@mpetrella430 Maybe turnout. Maybe passage rates. Maybe nothing ....", "Wed Jan 09 19:17:50 ": "@BetsyS48 Are you an educator?", "Wed Jan 16 22:59:44 ": "East Ramapo to state schools chief: Stop criticizing, help http://t.co/50me7B8E", "Mon Jul 02 15:12:54 ": "What a cute couple! Flash mob marriage proposal at farmers market: http://t.co/M2yleZLh", "Wed Apr 03 12:42:10 ": "Educators: New York schools on path toward insolvency http://t.co/6FcghLngoA @SchlFinance101", "Wed Jan 09 19:12:52 ": "@LionSupt139 What do you think about competitive grants to enact ed. reforms?", "Sat Apr 21 12:24:24 ": "RT @lisafleisher: \"They canned the pineapple.\" http://t.co/tco4iQlq by @NYDNrachel & @nydnbenchapman", "Thu Mar 28 18:45:13 ": "@shankerinst Omg. Haha.", "Fri Feb 10 20:14:33 ": "Questions to NY ed sec. in chat: How do we keep arts? How do you justify competitive grants with schools struggling? http://t.co/KPzYIIMX", "Wed Jul 18 14:34:48 ": "Hudson Valley students surpass NY, improve on tests #newsday http://t.co/feXNDQ5u", "Sat Apr 21 12:24:54 ": "@lisafleisher You should be a headline writer. Canned pineapple.", "Tue Apr 02 15:28:45 ": "Author: Parents have the power to upend march toward high stakes testing https://t.co/ikC9jfD2ss #testing #highstakestesting", "Tue Feb 19 14:21:45 ": "An entertaining read about the problem with pigeons at one MTA station. http://t.co/PEWHokfL", "Wed Nov 28 19:17:43 ": "Hudson Valley teachers sharing skills on Twitter: DM me for a story?#sschat #elemchat #edchat #engchat #edtech #teachchat #mathchat #scichat", "Sun Oct 28 15:11:46 ": "RT @NMHS_Principal: Exploring the BYOD Trend in Education http://t.co/AbcdLGmK", "Fri Apr 12 13:42:31 ": "HV counselors: State tests stressing out students #newsdayny http://t.co/PVoDlz45oo", "Wed Apr 17 13:50:01 ": "RT @Newsday: Congrats to @NewsdayOpinion, a Pulitzer finalist for \"providing a voice of reason, hope and indignation\" in post-Sandy edit ...", "Mon Feb 27 21:55:44 ": "Lt. Gov. Duffy concludes HV Mandate Relief hearing, calls it longest on record so far at the 4 hour mark.", "Wed Jan 09 20:16:29 ": "@SchlFinance101 No mention of school funding disparity in SOTS, though it is mentioned in reform report", "Wed Jan 09 19:15:09 ": "No mention of how much money Cuomo wants for education competitive grants in #NYSOTS report. #NYSOTS13 #nynewsday", "Thu Apr 11 20:53:11 ": "Bill Clinton to get honorary degree, talk global politics in Valhalla #newsdayny #prezbillyjeff  http://t.co/dcdBDcay63", "Wed Jan 09 19:16:07 ": "@nyschoolboards Do you support competitive grants, if they're funded above and beyond basic school aid?", "Wed Apr 03 14:07:02 ": "@SchlFinance101 Thanks Bruce.", "Tue Jan 22 19:08:45 ": "RT @QIIISAP: School Aid will increase by $611m (3.0%).. to go towards expense-based aids, partial off-set of the GEA and more competitiv ...", "Thu Apr 18 17:15:09 ": "Just got verified. Yes, this is really, truly education reporter Meghan E. Murphy. Follow me for insightful school news. #newsdayny", "Thu Feb 28 18:58:30 ": "RT @jlubinsky: School Employee Accidentally Shot During District-Sponsored Gun Training http://t.co/7iR2PuQq67 via @garystager You can't ...", "Tue Jan 22 19:17:56 ": "RT @AlisaCosta: THANK YOU! RT @JessicaAlaimo: YNN budget address stream is better than the official one http://t.co/ALilQOxG #nybudget # ...", "Thu Feb 16 17:33:54 ": "Cuomo and ed. officials announce agreement on teacher evaluations.", "Wed Jan 09 19:45:35 ": "Cuomo highlights Hudson Valley as tourism asset of state. #NYSOTS #NYSOTS13 #newsdayny", "Tue Jan 22 19:45:13 ": "Cuomo budget: Bad news for Dutchess? Proposes closing Beacon prison and Red Hook juvenile justice facility #NYBudget13 #NyBudget"}