{"Tue Nov 13 02:57:32 ": "Curtis is getting ready for the Ogden are you? http://t.co/H1WUnIH4 http://t.co/rBGBKnlx", "Fri Oct 05 01:12:40 ": "Thanks for the love Indy. Next time I promise to remember the day of the week haha", "Thu Nov 08 19:26:08 ": "Click the picture below for details on how YOU can win a VIP package for Zach's upcoming show at The Ogden... http://t.co/4ZqvcExW", "Thu Nov 08 05:57:32 ": "@joshuaradin @afinefrenzy very inspirational shows these guys put on. Catch em if they're in your town", "Sat Oct 06 17:06:45 ": "This chipotle Fest is dopppppe so much good food", "Tue Oct 16 23:28:30 ": "RT @SarahKSilverman: Oh, Dad! You're my hero.  Where do you get such moxie?? http://t.co/Jz94Mbcq", "Sat Mar 30 03:47:34 ": "Check out \" So Far Gone,\" Zach's new song, that was recorded during his recent visit to OpenAirCPR studios... http://t.co/eTbdt4cwQT", "Wed Nov 21 23:51:35 ": "RT @AesopRockWins: What's the phat/wack beat ratio for producers out there? I'm like 1/75", "Wed Nov 07 15:27:10 ": "RT @SarahKSilverman: Let's not wait for the apocalypse or an alien attack to love each other y'all", "Fri Nov 09 19:15:19 ": "Me and Curtis are gonna be on da radio! 1390 am at 3:00. Played some new tunes tell us what you think!... http://t.co/hfuajS65", "Thu Mar 21 16:25:12 ": "I have mad respect for amateur comedians but I enjoy watching them bomb nonetheless", "Fri Nov 09 17:26:01 ": "My new sounds: 17 Circles http://t.co/AHagp9rR on #SoundCloud", "Fri Apr 12 12:24:25 ": "Headed to Minnesota with Curtis for our first show in a minute! Opening for Phillip Phillips and Churchill. Time to rage", "Fri Nov 16 00:37:26 ": "@georgeinthecord Hmmm... I think it was called the garden. Its a new song. Hopefully it'll be on the next record. Thanks for the love!", "Tue Oct 23 13:40:44 ": "Just about a month out from an amazing night... Join the event for details, ticketing links, and to check out the... http://t.co/WzimonL1", "Fri Oct 19 18:48:18 ": "RT @GaryClarkJr: This just in...#blakandblu oct. 22!!! http://t.co/0hP9iMiX", "Sat Apr 13 13:02:29 ": "Thanks Winona for our best show in a while. Shouts to @sarahtraeger for the pic and taking good care… http://t.co/QzNQOlFPwZ", "Sat Oct 27 00:06:47 ": "Working hard or hardly working? Ogden November 23rd babyyy! http://t.co/assjCoHp http://t.co/16YCl6H0", "Sat Mar 30 15:56:22 ": "Just want to let everyone know that Curtis Halle and I are working hard to to get you guys some new tunes.  Thanks... http://t.co/mJyzUVQiQp", "Tue Nov 13 20:26:15 ": "Next Friday, Zach plays The Ogden Theatre. Save $5 by getting your tickets early at... http://t.co/25K0Lb4y", "Tue Feb 19 16:54:40 ": "Started from the bottom by drizzy stuck in my head all morning", "Fri Nov 23 02:03:40 ": "Hope everyone  had a good time grubbing today. We will see you guys at the Ogden tomorrow night. Doors at 8, show... http://t.co/ntjJM2qz", "Tue Apr 02 04:18:48 ": "Just wrote a lyric that gives a shout out to Padme Amidala... That should help my street cred", "Sat Nov 03 04:11:57 ": "@Christine4242 hahaha looks like he's about to do it again", "Thu Mar 07 04:03:45 ": "Cant get me enough of that \"Poetic Justice\"... Im all about anything Drake flows on", "Sun Mar 10 22:51:34 ": "Heading south on 285 with Curtis. Destination? Two feet of powder http://t.co/EOK9rKhMSP", "Mon Feb 18 18:59:45 ": "Then I went down to DC take part in the largest climate change rally of all time. DOPE! Not feeling KXL http://t.co/futjoTyb", "Fri Nov 09 17:48:07 ": "My new sounds: The Cool Down http://t.co/v911q9aY on #SoundCloud", "Mon Feb 18 18:54:39 ": "RT @Alan_D_Smith: In a @zheckendorf kinda mood. His music is so relaxing http://t.co/mJFTTNUn", "Fri Nov 09 17:20:37 ": "My new sounds: Invisible Ink http://t.co/jIGoXqOs on #SoundCloud", "Fri Nov 09 17:24:56 ": "My new sounds: Untitled http://t.co/ZOIx6tk4 on #SoundCloud", "Thu Oct 18 19:09:10 ": "Charlie ain't home by @zzward is my jammmm", "Mon Mar 25 21:36:59 ": "RT @SarahKSilverman: I dare you to be real all the time", "Thu Nov 15 18:08:29 ": "RT @Chelspecksta: @Wengerbanger12 we need to get our tix for @zheckendorf !! Can't visit home properly without going! #colorado #alwaysa ...", "Sun Dec 23 00:57:42 ": "Thanks to all who came out last night for a special sold out show with Zach, Big Head Todd and the Monsters,... http://t.co/LZxXuTGx", "Sun Nov 04 22:40:50 ": "RT @lukevermont: I want to make a record in Austin in the middle of winter. Always have", "Tue Nov 06 18:06:40 ": "That's me sitting on a big ol' Z http://t.co/e8Df6AwX", "Sat Oct 27 00:06:45 ": "Working hard or hardly working? Ogden November 23rd babyyy! http://t.co/assjCoHp", "Tue Oct 30 19:06:49 ": "Check out the Fresh New Tracks page for a write up on Zach as well as to enter their contest below for a special... http://t.co/3ybiZURG", "Sun Mar 24 00:42:18 ": "@amandahand aspen highlands was epic if you can make it up there and have an extra 100 bones sitting around! Haha", "Sun Mar 10 04:51:58 ": "I have a confession. I am an awful \"twit\" or \"tweeter\". All I can think of telling you is which Drake song I'm digging at the moment haha", "Tue Nov 13 15:45:14 ": "RT @HRHtheking: “@zheckendorf: Curtis is getting ready for the Ogden are you? http://t.co/PRc0eqfP”\nYes, yes I am http://t.co/BAPWrEYl", "Sun Nov 11 00:39:51 ": "Just letting everybody know we're working real hard on this November 23rd Ogden show.  Hope to see you guys out there!", "Fri Feb 15 22:39:43 ": "Ive been off my social media grind lately... Sorry guys thanks for all the love though. Keep ya up to date. Lots of dope stuff going on...", "Thu Mar 14 22:20:09 ": "#tbt born to be a ball player... with Curtis and Ben on tour with ZZ Ward http://t.co/d4s7V1eXtt", "Mon Apr 15 01:39:17 ": "RT @Phillips: @zheckendorf hey dude never got to talk to ya but wanted to say yall sounded great!", "Thu Oct 04 03:29:22 ": "Thanks to everyone who put #DebateFest on you da best", "Sat Mar 23 20:48:54 ": "Best ski day of the year at the highlands http://t.co/U2rNffsQ0O", "Sun Apr 07 15:52:52 ": "RT @lukevermont: New Album update: Pledge Update #3 http://t.co/hXQuxiIDUV @PledgeMusic #pop #PMUpdates", "Fri Nov 09 17:22:39 ": "My new sounds: Tie Dye March http://t.co/dqPzUzic on #SoundCloud", "Tue Mar 26 16:18:00 ": "RT @MissPaytonLynn: Forgot how much I love the song \"Roses\" by @zheckendorf He needs to record it and make a video pronto! #GoodMusic ht ...", "Thu Oct 04 17:21:58 ": "A great day yesterday at DU's Debate Fest with Nathaniel Rateliff, The Lumineers, the Governor and the thousands... http://t.co/8W9AVtGt", "Mon Oct 15 16:28:51 ": "RT @queertastically: @zheckendorf LOVE your sound! I heard you over a local radio station some weeks back. Lots of &lt;3 from the Philip ...", "Wed Nov 21 02:15:50 ": "RT @SarahKSilverman: Trying to feel okay about picking up my tofurky thanksgiving meal for 1", "Sun Apr 07 15:52:23 ": "One of the coolest musicians/human beings I know @lukevermont is making a new record and he needs some help. I know he'd appreciate it", "Mon Nov 26 19:43:49 ": "Just announced! Zach will be joining One Republic, Big Head Todd and the Monsters and The Flobots at The Ogden... http://t.co/sxJeKRhT", "Wed Nov 21 16:56:02 ": "Sooo flippin stoked for this Ogden show on Friday", "Sun Mar 31 22:51:46 ": "RT @nprmusic: Dan Auerbach of @TheBlackKeys pairs up with monster Tuareg guitarist Bombino for a dream-team album. Listen now: http://t. ...", "Thu Oct 18 18:51:12 ": "Cash cab is the bees knees", "Tue Oct 23 15:58:16 ": "“@_KylesMyles: Still going to see @zheckendorf at the Ogden, even if it's two days after my shoulder surgery. #dedication\" you're awesome...", "Thu Oct 04 22:23:42 ": "Zach Heckendorf plays City Park in Denver this Saturday as part off Chipotle Mexican Grill's FREE Cultivate... http://t.co/CgLmuRBP", "Thu Nov 29 00:58:06 ": "Who saw this coming!? \"All The Right Places\" can now be heard at your local Karaoke night, right before \"Pour... http://t.co/RYoIO9YZ", "Mon Apr 15 01:38:42 ": "@Phillips you da man, we really appreciate it. Hope to see ya on the road again!", "Fri Nov 02 16:46:35 ": "Zach is featured on THECOOLTV today where they are giving away \"All The Right Places\" as part of their \"Free... http://t.co/UtoQesUF", "Tue Nov 13 02:57:29 ": "Curtis is getting ready for the Ogden are you? http://t.co/H1WUnIH4", "Fri Nov 23 16:53:02 ": "Zach will be on KBCO Studio C at 1P today, just before he heads to the The Ogden Theatre for the big show... http://t.co/xoV8iyaM", "Fri Nov 09 19:15:16 ": "Me and Curtis are gonna be on da radio! 1390 am at 3:00. Played some new tunes tell us what you think! http://t.co/LaCwmvHC", "Thu Nov 08 22:42:59 ": "RT @brettdennen: A visit to my new label. Time to make a record http://t.co/uhPdaZ7P", "Wed Nov 07 04:54:15 ": "64 passed babayyy!!!!!", "Sun Oct 21 03:48:32 ": "Go see Samsara... Heaviest movie I've seen in a while", "Tue Nov 20 01:11:34 ": "Congratulations to Katelyn Kurtic for winning the Zach Heckendorf ticket giveaway for this Friday's show at The... http://t.co/7Be9CkgB", "Thu Nov 01 18:12:20 ": "Halloween styley http://t.co/Y8Qwlaqb", "Mon Apr 15 21:46:02 ": "RT @brettdennen: I love you Boston. I am thinking of you, sending you love", "Wed Oct 03 01:39:08 ": "RT @ThereWithCare: @zheckendorf We are excited to see you perform 10/13 &amp; 10/14 #RedCarpetAdventure TIX: http://t.co/sYtO7hMm", "Mon Nov 05 12:44:27 ": "Joao Gilberto, listen and float.....", "Sun Apr 14 01:37:59 ": "RT @carissa511: @zheckendorf was amazing last night! I am a new fan thats for sure! Thanks for a great show!", "Fri Nov 09 20:52:55 ": "Zach's studio performance @OpenAirCPR will air at 3:00PM today . Details to listen on air or online: http://t.co/rP03aHUo", "Fri Nov 09 17:23:58 ": "My new sounds: Pompeii http://t.co/eiihBf3G on #SoundCloud", "Wed Oct 17 18:56:03 ": "RT @SarahKSilverman: Still in shock over @MittRomney proving his stance on women's rights by letting us get home in time to MAKE DINNER", "Sat Nov 24 21:47:32 ": "Hope everyone had as much fun last night as I did.  Thanks so much for being there.  Join me tonight at the 7:00... http://t.co/PruX126G", "Fri Nov 09 17:23:26 ": "My new sounds: One of Them http://t.co/d8fedC1t on #SoundCloud", "Thu Nov 15 14:57:13 ": "Last chance to enter to in a VIP package for YOU and a buddy to attend Zach Heckendorf next week at The Ogden... http://t.co/jugzmpY9", "Fri Nov 09 21:58:57 ": "Bad information! Gonna be on 1340 am in a couple minutes", "Sat Nov 03 00:42:38 ": "Seeing katt Williams tonight... I expect it to be nothing less than life changing", "Sat Feb 16 15:10:44 ": "@ZTHauer working on it! Glad you dig the new song", "Sat Mar 23 03:13:06 ": "@lukevermont I want one!", "Thu Nov 15 14:58:46 ": "Last chance to enter to win a VIP package for YOU and a buddy to attend Zach Heckendorf next week at The Ogden... http://t.co/gqS59CbD", "Tue Apr 16 17:18:18 ": "If you are an artist of any kind, whether you make music, jewelry or just like creating, read \"Just Kids\" by Patti Smith... Unbelievable", "Sun Mar 10 04:57:50 ": "I am in a Drake phase. I'll get out of it. Once I do I promise to tweet about something else. For example, whats going on with my own music", "Mon Mar 11 20:37:01 ": "RT @brettdennen: Day one of tracking the new record with @charliepeacock drinking @guayaki and playing songs http://t.co/WqSXdM7TRx", "Wed Oct 03 19:22:34 ": "Tryin' to eat some Chipotle and hear some tunes? Come out to City Park on Saturday for free!  We'll be playing... http://t.co/R8sz9GJr", "Mon Nov 12 22:04:42 ": "RT @BurkeMaryKate: @zheckendorf I'll be at the Ogden for my sweet seventeen! Can't wait!", "Mon Feb 18 18:57:38 ": "Visiting my dashing best friend Matt in Baltimore http://t.co/PZYk3z4A", "Fri Nov 02 19:48:29 ": "Colorado Music Buzz just posted a great article about Zach and his upcoming show at The Ogden Theatre on Nov 23.... http://t.co/6WdFMZF4", "Sun Apr 07 15:54:07 ": "Here's the link if you wanna pledge http://t.co/Zcz2G2qAfz", "Mon Nov 12 17:12:42 ": "I have an R. Kelly addiction for real", "Thu Apr 18 17:07:42 ": "RT @MamaKirsy: Join @ThereWithCare at @ColoradoGC on May 20th for an amazing day #golf http://t.co/Un1WmplPbv", "Fri Nov 30 19:36:07 ": "Tickets are now available for Zach's December 21st show at The Ogden Theatre with One Republic, Big Head Todd and... http://t.co/9yxFYKtN", "Sat Nov 17 05:31:20 ": "Gonna be playing a ton of new songs for ya'll on the 23rd... See you there my friends", "Wed Oct 24 22:38:27 ": "Taking my 15 year old puppy for a stroll http://t.co/vGdzQ1Y7"}