{"Tue Apr 16 11:03:06 ": "Here's the Mixlr show i was talking about, that i will do https://t.co/7UQa4SLZsU", "Mon Apr 01 14:29:28 ": "Kokiais atvejais išsakyt savo nuomonę viešai yra korektiška?", "Tue Apr 02 10:58:04 ": "RT @coldtearrecords: Still a plenty of FREE downloads available on our bandcamp page! Download flac or wav, name your price at $0!\n http ...", "Fri Apr 19 09:42:43 ": "Am i the only one who doesn't really need Spotify?", "Sun Mar 10 22:01:19 ": "@Jiggly_junkie nu jo, high five :)", "Fri Mar 01 22:19:15 ": "Indian vedas say that some people are sudras and some deserve to be rich. Can you be against capitalism and believe in vedas simultaneously?", "Wed Apr 17 18:25:19 ": "i hate life, it distracts me from music", "Sun Mar 10 17:33:35 ": "it used to be hip hop. Now it's trap", "Mon Apr 22 16:29:40 ": "you have over a thousand likes, only few hundred see your post. thank you facebook", "Wed Apr 17 18:35:26 ": "Don't miss my Mixlr show tomorrow https://t.co/oriqyNMrRA", "Tue Mar 19 10:09:47 ": "RT @coldtearrecords: You can get some of our CD's on diskunion, japan\nhttp://t.co/W8rFtg5IiM", "Sat Apr 20 15:17:58 ": "Here is my live Mixlr broadcast recording on soundcloud. For those who missed it live: http://t.co/RRrRGzGDmz", "Thu Mar 21 10:38:49 ": "first soundcloud introduces us to a very messy new interface, now all the copyright issues for dj's and podcasters...", "Sun Mar 24 14:44:05 ": "RT @coldtearrecords: Mikrokristal – Forest Walk [Uplated Vibration Edit By Chandanam] VIDEO http://t.co/TOOu6ttvrm", "Wed Mar 20 14:46:36 ": "i love the smell of old electronic equipment! brings memories", "Sat Mar 02 10:14:05 ": "@yoursck i want to live in a really European environment, Lithuania is not really like that yet", "Thu Apr 18 15:17:32 ": "RT @coldtearrecords: SEN playing his album live. Tune in now!\nhttp://t.co/GYKmFP5e8a", "Sat Mar 02 17:29:28 ": "Giriu Dvasios podcast on electrosphere.eu radio now!\n http://t.co/qyZEgOWhSZ", "Tue Apr 16 21:18:51 ": "i have just put an order for korg volca bass, hopefully it was worth it. We'll see", "Mon Mar 25 17:31:43 ": "RT @coldtearrecords: I forgot, like every year. But March 1st, was our third birthday! SO we've been working for three years now\n https: ...", "Sun Mar 10 21:58:09 ": "@Jiggly_junkie yes exactly, that's what i was listening to :)", "Sat Mar 16 09:37:31 ": "Do people buy a lot of cassette releases?", "Wed Feb 27 22:00:36 ": "sometimes digital distributors charge money if you want to take down a release. I think it is ridiculous", "Sat Mar 16 09:45:46 ": "@dubtechno i don't know, i do own, because i like tapes. But i'm a junkie. I don't know if it makes sense to release cassette economicaly :)", "Mon Mar 18 21:28:53 ": "@silent_season yes in silence you may have a feeling which can be translated into a certain sound. To me a feeling and a sound is the same", "Wed Feb 27 21:30:05 ": "Aether Blueprints. Ambience http://t.co/cWEBsIW4Gm", "Thu Mar 28 08:55:50 ": "My two favorite labels are both from Canada. It's Silent Season and Dewtone. Coinsidence?", "Sat Mar 09 11:44:08 ": "what if i started a mastering service using my reel-to-reel machines? not for clean sound, but rather for vintage warmth", "Tue Mar 05 19:50:00 ": "when i don't get spam i start to worry that smth wrong with my email", "Fri Mar 08 20:36:53 ": "i want to see an asian movie", "Tue Apr 16 22:20:31 ": "@yoursck i see that only famous people have verification. I feel strange, but kind of honoured at the same time :)", "Thu Mar 14 19:34:11 ": "i think sometimes people lack sense of humour in electronic music", "Sat Mar 02 10:19:14 ": "@yoursck btw Germany also looks good, except stuff with copyrights... :)", "Thu Apr 18 22:06:17 ": "@DAVID_FIRTH How about \"this like wasn't as good as you previous like\"", "Fri Apr 12 14:43:14 ": "i've heard many things, but to-do lists really keep me productive", "Tue Mar 12 22:30:38 ": "atsimenat, dar ne taip senai marozai savo merginas vadindavo gyvatėm. \"Mano gyvatė\" \"tavo gyvatė\"", "Thu Apr 18 20:15:25 ": "wow that was a ton of fun, thank you all who spent those two hours with me on Mixlr :)", "Sat Apr 20 11:24:31 ": "RT @coldtearrecords: A great Dub Techno session from yesterdays broadcast on Mixlr by Spaceci \n http://t.co/OGrj33LIDZ", "Mon Mar 11 21:49:00 ": "Stan Getz &amp; João Gilberto - O Grande Amor", "Sat Apr 06 12:59:07 ": "@jleinerts my 101 has nothing to do with dub techno, are you sure? :)", "Tue Mar 12 10:29:10 ": "Have you noticed that you can't answer to more than one message on soundcloud in a span on 10 minutes", "Tue Mar 26 14:31:38 ": "as the sun started to shine now, like five days in a row, those dub tech chords don't sound so boring again. I guess it's the sun!", "Sat Mar 16 09:49:49 ": "@dubtechno yeah i guess it's just a thing of fashion, to be exceptional, limited, exclusive and desired", "Thu Feb 28 14:07:19 ": "RT @coldtearrecords: Creative Commons licensed electronic music 24/7  http://t.co/UjFly09yxL", "Mon Mar 18 12:21:23 ": "every moment is full of sound", "Wed Mar 20 20:55:55 ": "we use music made by other people to express our selves", "Thu Mar 21 14:41:56 ": "In 70's and 80's DUB was fun, happy, dancable music. What have you done with it?", "Fri Mar 08 11:14:34 ": "no offence, bet when you listen a psy trance mix, it feels like it a one continuous two hour length track. But maybe that's good...", "Sun Mar 10 22:00:19 ": "Nineteen sixty nine in the sunshine", "Mon Apr 15 12:57:19 ": "i hate connecting my fb account to all the apps, starts posting shit everywhere", "Tue Apr 16 21:23:34 ": "I don't understand this recent boost in followers for me. What's going on?", "Thu Mar 28 19:02:51 ": "RT @coldtearrecords: As promised all releases on bandcamp are free to download. Just name your price at $0. Good opportunity to get flac ...", "Sun Apr 21 07:25:06 ": "RT @silent_season: Tired of record store day. Not a record store within 150km from here. I do this shit everyday. Who needs a special day f…", "Tue Apr 16 22:01:30 ": "@yoursck well that's great i guess", "Fri Apr 19 20:28:22 ": "When facebook asks \"Do you know this person outside of facebook?\" there should be a button \"non of your business\"", "Thu Mar 21 20:42:39 ": "i suspect that on those late night comedy shows they have empty cups with which they pretend to drink coffe or whatever", "Thu Apr 18 17:57:58 ": "Radiant Child's present Giriu Dvasios live in couple of minutes on Mixlr! Tune in!\nhttp://t.co/jm9HNaaQJH", "Fri Mar 29 21:08:26 ": "Sometimes i remember how i have said something in the past, and passionately defended it, and now i realise that i was wrong", "Sat Mar 30 10:13:26 ": "Šiandien eisiu į TECHNO tūsą, kur taip pat bus rengiamas kiečiausio margučio konkursas. No shit :)", "Tue Apr 16 22:07:12 ": "@yoursck They sent couple of messages about it couple of months ago but i totaly ignored didn't even open to read, and somehow here i am :D", "Tue Mar 19 20:45:31 ": "tai daba jau visi suprontat?", "Sun Apr 14 09:01:45 ": "SoundCloud: Change your copyright policy https://t.co/OKbeichbHW via @change", "Tue Mar 19 12:21:38 ": "after i found out that you can re-connect midi controllers without restarting ableton 9, i decided that i need it", "Wed Mar 27 14:52:05 ": "have you ever played defender on bandcamp stats page?", "Thu Mar 28 16:36:53 ": "soundcloud copyright issues are now getting ridiculous. people get notified of copyrighted material on their own original productions", "Mon Mar 18 21:57:18 ": "gal kas žinot kaip užčiaupt knarkiantį kaimyną iš penkto aukšto?", "Fri Mar 01 21:44:52 ": "there should be more girls who make electronic music", "Tue Mar 26 10:05:48 ": "so many unfinished tasks and i will enjoy every one of them", "Thu Apr 11 11:34:27 ": "I'm going to do a live show online through Mixlr, i'll let you know the details soon", "Sun Mar 17 12:45:45 ": "i have encountered the weirdest bug in ableton live 8.2.1, it crashes on copy/paste action", "Sat Mar 09 13:54:35 ": "i'd rather have an old version of ableton live, but a stable one", "Thu Apr 18 20:43:58 ": "If you still haven't had enough of me, here's an interview about on Radiant Child's, about GD, Cold Tear etc http://t.co/OMfj4of623", "Fri Apr 19 09:40:57 ": "RT @soundlove_org: Only one copy left of this beauty! Arc of Doves - The Lights http://t.co/cTNvhV1FMC", "Thu Mar 28 12:55:10 ": "@Blikmuzik nekantrauju pamatyt kaip atrodys jūsų vinylas :)", "Sat Apr 06 12:46:15 ": "I'm looking for remixers to do a rmx for a new 101 album. Anyone interested to try?", "Sat Apr 06 13:20:37 ": "Recently i'm into movies about epic ancient Chinese legends/stories/myths", "Sun Mar 10 21:33:33 ": "orange", "Mon Mar 04 17:15:21 ": "I'm wathcing Lucky Louie series all over again. great stuff!", "Sun Apr 21 19:53:25 ": "I think people tend to overuse plugins and use too many midi/audio tracks, as a result complain about high cpu usage. Less is more :)", "Sat Mar 02 18:11:21 ": "when is google going to do something about their ugly blogspot?", "Thu Apr 18 20:21:30 ": "Rendering the mix now for those who missed it :)", "Sat Mar 09 12:10:14 ": "@murmau thank you! no tape sound on that album though :)", "Wed Feb 27 22:04:19 ": "although i have no idea how much work is that...", "Thu Apr 18 07:58:31 ": "to be honest, i have enough material for the next Giriu Dvasios album, but releasing a new one again would be crazy", "Tue Apr 16 21:22:00 ": "@MarkHjorthoy i'm excited to try it out, it's affordable and looked sweet in the videos. I'm good Mark, how is it going for you?", "Mon Apr 22 09:35:16 ": "RT @coldtearrecords: Palescent Tints by Enervant is now out! http://t.co/x6gCoRyOtQ", "Thu Apr 04 09:31:52 ": "has anyone anything to say about official.fm as an alternative to bandcamp?", "Fri Mar 15 10:03:27 ": "i always thouth that i will sell out bvdub CD's on my online shop very quickly. But i was wrong and i don't know why", "Sat Apr 20 09:26:18 ": "RT @soundlove_org: Happy record store day!\n http://t.co/hSxet6N9dn", "Sat Mar 02 10:09:41 ": "I think i should try to move to Netherlands or Denmark or something like that", "Wed Mar 06 22:13:24 ": "davai dedam niurka", "Wed Apr 10 14:26:27 ": "RT @coldtearrecords: Papildytos mūsų leidinių atsargos parduotuvėje \"Ragainė\" Vilniuje. http://t.co/hm3t4rz9sD", "Tue Mar 26 14:14:57 ": "@miestomeras aš sakiau kad i'm going to enjoy them, taigi aš nenoriu jų išvengt :)", "Thu Mar 28 11:21:35 ": "What do you think, which strategy is better for bandcamp, to have your latest release as a homepage, or to have an index page as a homepage?", "Sat Apr 20 11:23:10 ": "Have you read my interview? Proud to be featured on this project! :) http://t.co/OMfj4of623", "Sat Mar 02 10:38:22 ": "@yoursck in Lithuania Capital is the most expensive city to live in. And in Germany Berlin is a cheap living? interesting :)", "Thu Mar 14 20:18:52 ": "i often state my opinion/thought in hopes that someone will say some good points and change my understanding about that subject", "Thu Mar 07 22:13:57 ": "Why do they always ask for mercy in ragga jungle music? because they smoke too much pot i guess", "Mon Mar 04 21:02:22 ": "i want to tell the \"exceptionally spiritual\" people to chill out, you're not the messiah", "Thu Mar 14 19:12:21 ": "i think maybe idm/experimental is not that popular anymore because everyone got bored of making weird sounds"}