{"Wed Nov 10 03:17:40 ": "Philly, you're amazing. King Charles, we love you. Yes. Listening to Mumford's are sing their songs. Yes.", "Wed Apr 06 17:33:55 ": "@AudioDaughter Dude, that's pretty awesome.", "Wed Nov 17 23:05:32 ": "“@RebeccaPrus: #Mumford encore = EXTREME bromance w/ openers Cadillac Sky + dreaded Perry Farrell lookalike (cont) http://tl.gd/71aokv", "Sun Oct 31 19:33:19 ": "Oh Halloween, you never know what mischief is to be had!", "Sat Nov 06 22:33:30 ": "Made it to Macon, Douglas Theater is gonna be fun tonight", "Mon Nov 15 01:24:08 ": "Help us blow up our Twitter - tell your friends to follow us @cadillacsky - the party's gonna be over here, too!", "Sat Dec 04 21:35:39 ": "@christhile definitely ignore the @, unless you want to incorporate it into the band name, thus ensuring auto-tagging for all time. Genius?", "Sun Nov 07 23:30:19 ": "We put bulkhead theater, sorry, BUCKHEAD THEATER.", "Sun Nov 07 17:14:05 ": "Tonight at the Bulkhead Theater, formerly the Roxie, in ATL...we love ATL", "Mon Dec 13 18:17:17 ": "Discretion is the better part of valor", "Sun Nov 07 04:49:20 ": "After what might have been the wildest c sky show, off to crash...thank you US Gov for the extra hour of rest. Thank you.", "Sat Dec 25 16:09:24 ": "Merry Christmas - may God bless your holidays", "Fri Dec 24 04:44:58 ": "Glad to be shutting down for Christmas, very needed...", "Fri Jan 21 20:51:44 ": "W/ the hiatus & all, 50% off everytng in our store. Enter \"letters\" @ checkout for coupon. While supplies last http://bit.ly/gJ6YvZ", "Tue Nov 16 20:00:53 ": "Central Park in the fall... SPECTACULAR.", "Wed Dec 08 18:54:03 ": "Home from house concert tour with Kym, great time, fun picking", "Wed Nov 17 23:01:37 ": "“@_dharv: Cadillac Sky is primarily chubby, white, bearded hipster-types. Might I suggest a more accurate band (cont) http://tl.gd/71anct", "Sun Nov 14 18:25:29 ": "@KingCharlesUK - check personal facebook for message.", "Sun Nov 14 18:23:26 ": "@KingCharlesUK - one of you guys left ur passport at the border at Niagara falls and they won't let us pick it up. Call Marcus asap!", "Fri Jan 06 13:27:42 ": "@taylornugent YES.", "Fri Nov 05 16:47:05 ": "Huddle House in LA, look, there's a crocodile", "Sun Oct 31 02:59:27 ": "Milwaukee, maybe the most epic c sky show ever?!", "Wed Nov 10 23:52:27 ": "Wow, made it to East Hartford, ridiculously long day but really glad to be here!", "Fri Nov 12 15:06:19 ": "We're in Montreal, woop.", "Wed Nov 17 07:39:01 ": "Wow, it's over. For now. Can't wait to see what next year holds, too many cool things happening, WOW!!!!!!", "Thu Feb 03 00:44:10 ": "Farewell White Stripes, we know we set the trend and we're glad you could join our ranks.", "Sat Nov 13 15:52:36 ": "@sierrahull sent you a msg on facebook. REALLLY sorry about the oversight.. Next time for sure.", "Fri Dec 10 18:59:10 ": "RT @jonacuff: Dear churches, you can't casually go into Christmas camel choreography. This church learned hard way. http://bit.ly/fXM37n", "Fri Nov 05 20:58:17 ": "It's cold in New Orleans, why?", "Sun Nov 14 15:16:48 ": "\"2 - 4 - 6, dude. That's MATH.\" - Ross Holmes, chainsawing through the red tape of an unhelpful hotel concierge.", "Mon Nov 08 21:25:58 ": "Mr BlueChip himself has provided the perfect devices of strumming, thank you for being awesome!", "Thu Nov 04 20:37:41 ": "KHYI radio in Dallas was great, now off to load in/sound check at the HOB with Mumfords/King Charles, a hootinany tonight in Big D", "Mon Nov 22 15:20:59 ": "Home, what a concept, love it", "Wed Nov 17 23:07:30 ": "“@DavidRMayfield: RT @musicvice: Some beardy dudes called Cadillac Sky are playing the soundtrack to Willow on (cont) http://tl.gd/71ap9e", "Mon Nov 15 21:46:18 ": "Awesome venue, Terminal 5, pumped to be here", "Fri Dec 17 01:17:05 ": "The Ryman is always a great place to be, always.", "Sun Nov 14 18:40:24 ": "We love America. AMERICA!", "Mon Nov 08 20:47:12 ": "Did radio, now sound check", "Fri Feb 25 19:56:46 ": "ChessBoxer - Matt Menefee and Ross Holmes have officially teamed. Yes they have. Mentals - instru that is...", "Tue Nov 09 05:17:58 ": "Great time in Knoxville, now the long overnight haul to Philadelphia, joy", "Wed Nov 03 23:26:24 ": "Thanks to Steve and the crew at Collings Guitars for showing us true Texas hospitality, you're awesome", "Mon Nov 15 20:05:22 ": "Hangin' with long lost friends in NYC - this place rules!", "Tue Nov 02 21:01:58 ": "Texas, here we come, home sweet home in the lonestar state!", "Sat Nov 20 15:43:49 ": "Home, first saturday back with our families - nice to sleep in!", "Tue Jan 04 15:26:22 ": "If you have a sec, we made a big announcement on Facebook -", "Wed Nov 10 23:18:24 ": "Sliding into home for our show this evening in East Hartford, CT. Van repairs and NY traffic will not defeat us!!!", "Mon Apr 18 15:55:57 ": "Look for Matt and Ross on the Railroad Revival Tour - you might just get to catch a little ChessBoxer music!", "Sat Nov 27 19:39:42 ": "Go Go Gadget Christmas tree decorator!", "Thu Dec 02 05:50:01 ": "RT @BrownJugMusic: Big Mama reviews Letters in the Deep by Cadillac Sky (2010)  http://t.co/pjXLGeq", "Sat Dec 18 17:08:33 ": "Indecision is always a burden, let's be decisivie.", "Sat Nov 27 19:41:49 ": "Awesome thanksgiving weekend, thankful for so much, been a great year for c sky!", "Sat Nov 06 04:12:41 ": "New Orleans, always an amazing city! Looking forward to returning next spring", "Sun Nov 07 01:18:42 ": "Ross just did a swan dive and landed on his backside on the first song of the show, courtesy of a chord around his ankle. Good times!", "Mon Nov 01 04:26:11 ": "Another great show in Chicago, although I wish we'd had time for Giordano's deep dish.", "Mon Nov 22 03:56:19 ": "Take time this week to take a sackful of canned goods over to your local food pantry. You're not gonna eat all that stuff anyway, right?", "Sun Nov 14 19:20:37 ": "At the Anchor Bar in Buffalo, NY where the hot wing was invented. INVENTED!! Matt just ordered a sub sandwich. *sigh*", "Fri Nov 05 05:27:16 ": "King Charles was absolutely ridiculous tonite! Wow, what a talent! Fantastic show in Dallas, we love you Texas!", "Tue Nov 16 19:53:02 ": "@JohnDalyFTW Thanks!! See you when we come back in the spring!", "Tue Nov 02 16:28:48 ": "What a ridiculous night at the station inn, couldn't have been any more fun at all!", "Mon Nov 22 03:59:58 ": "Just sayin'. There's a lot of folks hurting out there, and $10-$20 worth of canned goods could make all the difference to them this week.", "Tue Nov 09 16:21:39 ": "Pennsylvania horse country is second to none, beautiful", "Fri Nov 05 00:34:53 ": "So excited, home town show and so many friends will be out, great night ahead, still unreal we're out here!", "Sat Nov 06 00:57:42 ": "Cajun food with the guys, right at home in New Orleans", "Wed Jan 05 19:49:45 ": "We chuckled - it was Yoko.", "Mon Nov 08 06:53:44 ": "Wow, ATL, in believable! Can't wait to get back next spring, good times in store, I see it clearly!", "Mon Dec 27 01:03:28 ": "Loving the family time, needed much more often", "Wed Nov 10 18:29:08 ": "@KingCharlesUK we posted the address for tonight on your  personal facebook page. Gotta come, gonna be SICK!!!", "Wed Dec 01 15:51:11 ": "Will it snow? Is it going to snow? Global warming. We miss tour and we miss everyone on tour - fans and bands.", "Fri Nov 05 07:05:31 ": "New Orleans, here we come!", "Sun Nov 14 05:18:50 ": "Montreal has done its thing to us, on to Toronto, can't wait to arrive in big T.", "Sun Nov 07 23:29:40 ": "New guitars are always hard to put down...Marcus, please put my guitar down. Please, now. Now. Please.", "Sat Dec 04 21:25:46 ": "@KingCharlesUK we miss you, as well. And your hair. And your spirit. And your music. And those amazing pants. Oh, those pants...", "Mon Nov 01 15:39:01 ": "On the way to Nashville for the war memorial show tonight, exciting time", "Sat Nov 06 19:58:52 ": "Long drive from NOLA. Great show, but that city can put some voodoo on ya. Macon 2nite @ Douglas Theater w/spc guests. Tix avail, come out!!", "Mon Nov 01 05:48:02 ": "Amazing Grace has become the jam closer, a very precious way to shut down the evening", "Mon Nov 08 19:32:55 ": "Just watched Dumb and Dumber 3D, better known as \"Ross and Matt trying to navigate the van on the U Tenn campus.\"", "Sat Dec 11 19:10:34 ": "Dear friends are worth more than any gold or gifts, true blessings that we all should appreciate more", "Fri Nov 12 08:45:09 ": "Overnight drive to the Canadian border after an AMAZING show in Boston. You guys were incredible - thanks for the love!!", "Sun Jan 02 03:49:22 ": "TCU - a great start to '11", "Mon Nov 15 18:11:48 ": "We want to see @KingCharlesUK park his RV in the middle of Central Park. You know, just for convenience.", "Tue Nov 23 23:38:35 ": "Tour's caught up with us, kind of nice to be sick, like a body purging", "Sun Nov 07 14:40:22 ": "Hangin at the Lowrey's, awesome southern hospitality in Dacula!", "Mon Nov 15 19:08:11 ": "Love nyc, absolutely love it", "Fri Nov 12 00:04:16 ": "Boston has a fantastic vibe, really great city.", "Tue Dec 21 21:40:29 ": "Kind of balmy in Nashville, not too cold though", "Thu Nov 18 01:14:44 ": "Baltimore? Baltiless. Having last tour dinner at Hank's oyster bar in DC. Can't believe we're nearing the end of the road...", "Thu Nov 11 20:40:01 ": "Sitting at Fenway Park, love it", "Sun Nov 14 18:24:32 ": "@KingCharlesUK - to get one of our numbers, or just call one of us.", "Wed Nov 03 14:24:27 ": "Stubbs tonight, maybe salt lick will cater", "Fri Nov 26 00:42:12 ": "Emerging from a food coma. Oy vey...", "Sat Nov 13 19:05:19 ": "@KingCharlesUK is a freakishly awesome songwriter. SON!!!", "Tue Nov 02 07:29:23 ": "Nashville, Dierks, Mumfords, Old Crow, C Sky, Greenland, epic!", "Tue Feb 08 23:05:39 ": "Great time for music in Nashville. Support @drewholcomb \"Chasing Someday\" #10 overall @iTunes! http://tinyurl.com/somedayitunes", "Thu Dec 09 19:19:08 ": "When does it end? Does it ever end? Check out David's and Levi's separate schedules, they're on tour and playing it hard. Real hard.", "Thu Nov 04 15:53:55 ": "Made it to Dallas at 6 am, long drive from Austin.", "Fri Nov 05 05:01:10 ": "Wow, amazing hometown gig with mumford's...levi's at emergency room for his finger, pretty bad break.", "Mon Jan 03 19:45:50 ": "Hard times come again no more", "Wed Nov 10 04:20:39 ": "The shaker came apart in my hands on stage while playing with the Mumford guys. Shaker beads EVERYWHERE.", "Wed Nov 10 04:02:05 ": "@KingCharlesUK is flippin' amazing, y'all. Follow him and check out his music!!", "Thu Nov 11 04:17:08 ": "King Charles arrived and we musiced in East Hartford...thanks to Joe White for singing great tunes as well!"}