{"Fri Mar 22 02:40:09 ": "Sometimes I wish there were wheels on my bathtub.", "Tue Apr 16 16:15:04 ": "I'm starting a bluegrass band called \"White Noise\". Who's in with me?", "Mon Apr 01 15:20:34 ": "Happy day that regular people lie day!", "Thu Mar 28 04:04:45 ": "Pithy is just pity with a lisp.", "Wed Apr 03 00:50:40 ": "Asked pharmacist, but he didn't know anything about homeopathic options. Makes sense, since MD's don't know nutrition.", "Sat Apr 13 22:42:22 ": "@philiprood except they weren't accurate. The raptor is only up to your knees.", "Thu Apr 11 19:38:42 ": "Close! I said invest in Precious Metals... not Precious Moments®!", "Thu Apr 04 03:02:51 ": "\"@Evidence: Everyone wants to be Pac, but no one wants to carry Shock G's luggage.\"", "Thu Apr 04 16:11:18 ": "My chickens are at that awkward teenager stage.", "Thu Mar 21 18:14:30 ": "At the end of the day... I get it. It is what it is.", "Sun Apr 14 19:07:21 ": "I find toothpaste in the darndest places. That is, everywhere but teeth.", "Thu Apr 04 06:21:46 ": "There are no absolutes! Umm... Except that one. But that is definitely it! Wait... nevermind.", "Mon Apr 08 05:41:37 ": "Where are all the mentors at? No seriously... I need mentors!", "Fri Apr 19 18:48:31 ": "The \"T\" in @MrT stands for Tureaud. Tureaud is an anagram of Trudeau. Starting to understand?", "Wed Apr 17 13:58:45 ": "The difference between Bernard Madoff and the U.S. Government is... Bernie's in prison.", "Mon Apr 08 21:37:26 ": "When someone tried to hand me an invoice I said \"No thank you\". They insisted. This went on for hours. Manners are useless.", "Fri Apr 12 19:07:01 ": "Why is a tax refund exciting? That means you voluntarily strapped your cash flow and let someone else have your interest.", "Mon Apr 22 15:34:29 ": "Beggcon.", "Fri Mar 22 17:15:46 ": "Theology + Anthropology = Worldview.", "Mon Apr 22 23:41:34 ": "I'm not sure if this barber is trying to kiss me, or do a really good job. Either way, I tipped him one dollar.", "Sun Apr 14 02:24:50 ": "That moment when you get carded for buying ginger ale.", "Sun Mar 31 18:30:23 ": "Little Debbie? More like Big Diabetes.", "Tue Apr 02 00:31:02 ": "\"I may not understand... but I 'get' it!\" - Guy In Board Room", "Wed Apr 17 21:29:16 ": "Titling an album \"Lost In The Shuffle\" would be genius if the album flops! Except for the whole \"waste of time\" part.", "Thu Apr 04 17:59:59 ": "Any recommendations for a Wordpress coder?", "Sat Apr 20 08:13:44 ": "What am I doing up? Oh great now I'm talking to myself. Doh! I just did it again!", "Sat Apr 20 01:49:36 ": "@chadhorton people are greasy.", "Wed Apr 17 01:58:04 ": "I live oloves.", "Wed Mar 27 21:20:06 ": "Does anyone else have problems w/ your conversation filter turning off when you're super tired?", "Mon Mar 25 15:41:09 ": "Q: How do you hug a porcupine without getting hurt? A: You don't... but they need love too!", "Fri Mar 22 23:34:26 ": "Are you \"talking to yourself\" if the questions are rhetorical?", "Tue Mar 26 05:46:05 ": "I have Coffeet. Who wants to go running with me?", "Mon Mar 25 15:34:43 ": "Marathong. Flip flops that go the extra mile. Marathong.", "Wed Apr 17 23:35:02 ": "If they were having a mysterious contest, I would win!", "Tue Apr 09 16:10:29 ": "When life gives you dehydrated grapes, make raisins.", "Sat Apr 20 18:38:21 ": "First time in a decade that I haven't been in Nashville this weekend in April. Feels weird.", "Fri Apr 12 15:50:00 ": "See authentic manhood through men like John Harper. 101 years ago this was going down, literally: http://t.co/KUF6FkI5R1", "Thu Mar 21 00:32:22 ": "What meal could you eat everyday without getting sick of it?", "Fri Apr 05 02:59:06 ": "Two thumbs waaay down.", "Tue Apr 23 20:44:48 ": "So... #4 will join the party on/or around November 4th (we're 12 weeks pregnant):  http://t.co/qLZRqDigSl", "Wed Apr 10 05:03:02 ": "If your neighbor has a vending machine on the porch do you knock on his door before using it? What's the etiquette?", "Thu Apr 11 15:10:12 ": "There is a disproportionate supply and demand of lotion in the world today.", "Fri Apr 12 21:07:18 ": "\"I've gotta go update my MySpace profile.\" said no one since 2009.", "Fri Apr 12 21:22:08 ": "New Media became extinct before it became Media.", "Wed Mar 27 00:38:56 ": "\"Art and media are the means and the bridge over which the current philosophy of the philosophers reaches the general culture.\" F. Schaeffer", "Wed Mar 27 14:26:16 ": "In the end, Doubting Thomas sounded more sensational than Evidentialist Thomas.", "Wed Apr 10 19:41:50 ": "That moment when you ask for extra napkins and the waiter brings back one.", "Tue Mar 26 17:28:19 ": "That moment when you can't figure out which browser tab is playing the music.", "Tue Apr 09 23:25:28 ": "Being successful in Christian Hip-Hop is like being the prom king in a small-town. Who cares? Read Here: http://t.co/WoMvGROoSS", "Tue Mar 26 17:22:48 ": "RT @SyntaxMusic: Kansas’s @JohnElefante Along with @SyntaxMusic Unveils New Album http://t.co/5DRYW2jZIs via @SyntaxMusic", "Thu Mar 28 03:07:49 ": "Speak now or forever hold your piece.", "Sat Mar 23 20:42:05 ": "I get fingers... but not toes.", "Thu Apr 11 19:48:38 ": "@jameybennett @sphereofhiphop I once saw a 60+ year old white lady in Walmart wearing a G-Unit shirt. I have a picture somewhere.", "Fri Mar 22 02:41:16 ": "Sometimes the smartest guy in the room is the only guy in the room.", "Mon Apr 22 15:39:52 ": "Happy Romans 1:25 Day!", "Fri Apr 12 19:52:05 ": "\"Behold, children are a heritage from the LORD, the fruit of the womb a reward.\" - Psalm 127:3", "Wed Mar 27 20:35:34 ": "Even thinking about baklava tastes good.", "Thu Apr 11 19:46:57 ": "@FlexAforeal you're welcome!", "Sun Mar 24 16:33:26 ": "I only eat whole cucumber. Because, how do you know if a slice was previously laying on someone's face or not?", "Sat Apr 20 02:36:53 ": "Pull into gas station. See guy smoking and pumping gas. Pull back out of gas station. Thanks Zoolander.", "Mon Apr 08 18:30:39 ": "The silver lining of Obamacare is that the DMV will no longer seem so bad.", "Thu Apr 11 15:26:24 ": "I don't get it. Is it supposed to be ironic when a kid wears a Run D.M.C. shirt?", "Thu Mar 28 15:36:02 ": "Ironically, apples and oranges do have a lot in common.", "Tue Apr 09 18:46:40 ": "This is the mother of all over-statements.", "Fri Apr 19 17:35:54 ": "I haven't watched N.E.W.S. on television since the second Gulf War, and I haven't missed anything. (both meanings)", "Tue Apr 09 00:37:24 ": "Who you calling an idiom???", "Fri Apr 05 21:32:51 ": "How come no one has ever invented a pyramid scheme to end all pyramid schemes?", "Wed Apr 10 18:31:54 ": "Common grace *is* amazing grace!", "Tue Apr 09 16:06:30 ": "Karma??? More like inertia!", "Thu Mar 28 05:07:31 ": "Caffeind.", "Tue Apr 02 01:24:15 ": "Whoever invented soup must be a bouillonaire.", "Sun Apr 21 15:32:18 ": "Probably faster and cheaper than adoption... but does the Government know classifieds website Craigslist has a section for babys/kids?", "Tue Mar 26 00:39:56 ": "Most \"trump cards\" are really just \"recycled diapers\".", "Fri Mar 29 18:51:20 ": "I used to rock domes but now I roc domz.", "Wed Mar 27 20:25:39 ": "The fact that you are even looking me in the eye and speaking to my ears presupposes that you already know where my head is at!", "Thu Mar 28 06:27:39 ": "#AnEntireUpdateAsAHashTag", "Thu Mar 28 16:09:37 ": "Substance is the essence of a thing. Thanks philosophy.", "Fri Apr 19 18:12:22 ": "Besides \"Pick Up The Pieces,\" what is the funkiest song of ALL time?", "Tue Apr 16 14:47:27 ": "Rich Dad, Poor Mom.", "Thu Mar 21 19:06:50 ": "Syntax Distribution (@SyntaxMusic) Top Songs on @Spotify:  http://t.co/0jk1wkwZ1F", "Tue Apr 16 00:30:46 ": "Who waited until today to do their taxes?", "Sat Mar 23 14:26:20 ": "Remember when you used to brag about the baud rate of your phone modem?", "Thu Apr 11 22:10:32 ": "I struggle to know the difference between a strut and a limp.", "Thu Mar 28 04:05:46 ": "The moon looks exceptional tonight.", "Fri Mar 29 02:50:20 ": "What's the point of slipping into something more comfortable... why not start out wearing something comfortable?", "Thu Apr 11 01:18:15 ": "Why don't they sell adult size heelys?", "Wed Apr 10 20:01:07 ": "It's one thing to be homeless, it's another thing to look homeless.", "Wed Apr 17 18:18:23 ": "This cat was like meoooow.", "Thu Apr 11 19:47:10 ": "@John_vanderVeen THANK YOU!", "Thu Apr 18 20:08:45 ": "Walkman? That’s not a Walkman! -- http://t.co/8aIOXOAQFu", "Wed Apr 10 01:14:03 ": "Vwls r dmb.", "Wed Mar 27 18:47:01 ": "I've been amazed by all the friends who are coming out of the closet to reveal they are huge fans of math!", "Thu Apr 11 22:05:37 ": "Don't judge a burrito by it's tortilla.", "Thu Apr 11 22:05:07 ": "Reverse psychology never works!", "Wed Mar 27 19:03:43 ": "If you love Coffee... Love Shakespeare... Love insults... Have I got a mug for you! http://t.co/byyHqsBJML", "Thu Apr 04 17:14:56 ": "It's better to have a schedule and to mess up once in a while (or for a season), than to have no schedule at all.", "Wed Mar 27 23:31:37 ": "Amerrogant.", "Wed Mar 27 19:37:20 ": "I pithy the fool!", "Fri Apr 05 22:04:36 ": "If everything you say is meant to zing, maybe you shouldn't say any-zing. Hey-oh!", "Mon Apr 01 20:07:25 ": "An email is like a bowl in a China shop. Old, placed on a shelf, people look at it, but ultimately no wants it or buys it."}