{"Wed Apr 17 12:11:05 ": "RT @dabeard: RIP actor Richard LeParmentier, who mocked Darth Vader (and got choked for it) in 'Star Wars': http://t.co/oxrtxaWk10", "Sat Apr 20 01:26:49 ": "RT @bostonmarathon: The B.A.A. joins all citizens of the Commonwealth of Massachusetts in thanking the federal, state and city law... http:…", "Tue Apr 16 15:44:51 ": "RT @themarkberman: Pres. Obama calls the the attack \"an act of terror.\" Quick write-up of Obama's remarks from a few minutes ago: http:/ ...", "Mon Apr 22 16:08:27 ": "Puts the \"ew\" in \"nude.\" RT @dcsportsbog: Lefty Driesell sleeps in the nude because of Marilyn Monroe http://t.co/NESblxSAKu", "Wed Apr 17 17:42:33 ": "RT @AP: BREAKING: Law enforcement official: Arrest imminent in Boston Marathon bombing, suspect to be brought to court.", "Sun Apr 21 17:05:59 ": "Very cool. RT @middlebrooks: Jonny Gomes bat today http://t.co/5f3g5u1eBx", "Fri Apr 19 11:42:03 ": "Live updates on the manhunt for the Boston Marathon bomber:  http://t.co/3vrNlD0YFV  #bostonbombing", "Wed Apr 17 17:07:44 ": "RT @BostonGlobe: BREAKING NEWS: Source: Authorities have an image of a suspect carrying, and perhaps dropping, a black bag at the second ...", "Sat Apr 20 10:51:34 ": "@uofmike @jasonjwilde Also, when did I get a backyard?", "Thu Apr 18 23:19:16 ": "@NeilNRockville Very!", "Thu Apr 18 22:05:49 ": "ICYMI RT @themarkberman: Photos, video of suspects in Boston bombings released by FBI: http://t.co/U493QbVquE", "Sat Apr 20 01:28:50 ": "@peterogburn @ec2011 @NewsBreaker Just said the same thing.", "Wed Apr 17 17:08:43 ": "RT @BostonGlobe: BREAKING NEWS: Source: Officials are “very close” in the investigation of the Boston Marathon bombings.", "Sat Apr 20 00:00:08 ": "RT @BostonGlobe: BREAKING NEWS: Police are using 'flash bangs' to disorient and distract the suspect. They have seen him sit up.", "Thu Apr 18 12:19:56 ": "We'll be back with Boston Marathon updates again today on the live blog...join @themarkberman and me. http://t.co/VvFTSLmwvD", "Tue Apr 16 15:34:24 ": "Obama urges people to be vigilant: \"If you see something suspicious, speak up.\"", "Tue Apr 16 15:31:04 ": "President Obama is speaking now...after briefing by national security team.", "Sat Apr 20 00:01:25 ": "Cops are \"assaulting\" the boat.", "Wed Apr 17 14:14:00 ": "RT @themarkberman: John Kerry spoke about the Boston bombings during an appearance before Congress this morning: http://t.co/hUd4Shn2ri", "Fri Apr 19 23:49:12 ": "RT @alvinschang: To get an idea of how close this boat is to the original shootout, here's our map: http://t.co/54gZcx6PZC", "Sat Apr 20 01:57:15 ": "Words cannot describe the extent of my freakout if I'd found that dude in my boat...", "Sat Apr 20 00:03:35 ": "@billlehecka I have a serious thing for the mayhem guy.", "Wed Apr 17 18:05:43 ": "@bruce_arthur I think the stew he made in his new pressure cooker is ready.", "Sat Apr 20 00:00:55 ": "RT @nowthisnews: For those unfamiliar with non-lethal \"flashbang\" grenades, here's a YouTube video of one being demoed. http://t.co/DZym939…", "Wed Apr 17 18:25:59 ": "RT @themarkberman: Law enforcement sources tell the Post's Sari Horwitz that no arrests have been made", "Sat Apr 20 01:00:57 ": "RT @Boston_Police: CAPTURED!!! The hunt is over. The search is done. The terror is over. And justice has won. Suspect in custody.", "Sat Apr 20 00:56:37 ": "RT @BostonGlobe: State official: Tsarnaev is \"Alive, conscious, captured.''", "Tue Apr 16 15:34:48 ": "Obama: We respond to evil \"selflessly, compassionately, unafraid.\"", "Wed Apr 17 22:05:16 ": "Wolf with the pressure cooker again. Sheesh.", "Sat Apr 20 00:47:08 ": "RT @cjzero: The only reaction GIF you need for the end of this ordeal for Boston http://t.co/itH1H1edCQ", "Thu Apr 18 19:59:45 ": "@NeilNRockville Deja vu all over again.", "Sat Apr 20 02:01:55 ": "@Callahan_9 The SS Minnow!", "Thu Apr 18 19:09:45 ": "The FBI will hold a press conference in Boston at 5 p.m. EDT. http://t.co/O1AgZI29A7", "Fri Apr 19 23:42:55 ": "@jbeardsley I saw that. Looks like one my dad had and my mom begged him to get it out of our side yard.", "Wed Apr 17 13:14:03 ": "@sonnyandsam @adbrandt There was an elegance to him. Kind of like DiMaggio, but more accessible.", "Sat Apr 20 00:04:22 ": "@CT_IKE \"Winter is coming.\"", "Sat Apr 20 01:00:02 ": "@tomecurran I'd settle for just Martin Richard's dad, holding up that photo of his son with the peace sign.", "Wed Apr 17 19:45:15 ": "Couldn't have said it better. RT @ovi8 Yra yra yra!!!hahahah", "Tue Apr 16 18:17:17 ": "The name of the third victim of the Boston bombings still has not been released.", "Wed Apr 17 18:36:27 ": "RT @Boston_Police: Despite reports to the contrary there has not been an arrest in the Marathon attack.", "Tue Apr 16 18:49:35 ": "RT @BostonGlobe: BREAKING NEWS: Source: Investigators found circuit board believed used to trigger marathon bombs.  via @shelleymurph", "Wed Apr 17 17:02:41 ": "CNN's John King: Source says they believe they have a suspect from video at a Lord &amp; Taylor near the finish line and Boston TV.", "Wed Apr 17 16:54:22 ": "It would be nice of CNN to tell us what it means by saying there was been \"substantial\" progress on the Boston bombings.", "Wed Apr 17 17:51:50 ": "Oops. Make that Richard Jewell. Apologies for misspelling.", "Fri Apr 19 10:27:27 ": "RT @nowthisnews: A timeline of the confirmed overnight events in the pursuit of the #BostonMarathon bombing suspects: http://t.co/rnrejAPk8i", "Wed Apr 17 19:08:46 ": "RT @BostonGlobe: BREAKING NEWS: Federal court is being evacuated and a witness says Brigham and Women's Hospital is also being evacuated.", "Sat Apr 20 02:17:40 ": "@uofmike @jasonjwilde \"First the good news: I got a boat...\"", "Wed Apr 17 15:19:38 ": "RT @EYESRadio: Tonight @backfieldradio Scheduled to appear @JBernstine from the #Redskins and @CindyBoren Of Wapo.Tune in! http://t.co/K ...", "Tue Apr 16 15:32:10 ": "Obama: FBI is investigating as an act of terrorism, but we don't know who carried it out or why. Or whether this is foreign or domestic act.", "Wed Apr 17 12:11:37 ": "@adbrandt Yes! That's it! Perfect word for Summerall: regal.", "Fri Apr 19 14:56:51 ": "RT @BostonGlobe: Local, state and federal agencies, including Secret Service, are on scene. Dog teams, explosives experts, and SWAT members.", "Tue Apr 16 16:28:50 ": "A very personal view, from a Bostonian who's a student at GW -- @ektraynor http://t.co/7PNaq0OD10", "Mon Apr 22 20:15:50 ": "@john_keim Awesome news, John! Glad you're joining us.", "Fri Apr 19 14:47:11 ": "@ektraynor Hope your fam is safe and hunkered down.", "Wed Apr 17 18:30:58 ": "RT @washingtonpost: 2 law enforcement sources tell Post reporter @SariHorwitz that no arrest has been made. http://t.co/hSzphJmBur", "Thu Apr 18 16:12:38 ": "Obama notes that Boston was his home when \"very few people could pronounce my name.\"", "Thu Apr 18 12:46:12 ": "@ipimi @themarkberman We will, as soon as they're officially available.", "Tue Apr 16 19:12:01 ": "RT @_RJ3: TMRW 04/17 Scheduled to appear @JBernstine  from the Redskins and @CindyBoren  of the Washington Post. Tune in! RT http://t.co ...", "Sat Apr 20 02:14:25 ": "@greenbaydean @jasonjwilde Yet another excellent point.", "Sat Apr 20 02:02:28 ": "@hbryant42 The Stugotz. I'll take you out on it.", "Wed Apr 17 12:10:37 ": "@wpjenna Shouldn't they call it Widener Awake?", "Sun Apr 21 20:20:29 ": "Timeout for the Lakers to read Kobe's tweets!", "Fri Apr 19 00:15:45 ": ".@jtannenwald Can't say I wasn't expecting it. Gonna be lots of sleepy Redskins fans!", "Sat Apr 20 01:21:11 ": "RT @RyanKerrigan91: I know I'm not saying anything that hasn't already been said, but it's incredible that our forces already have this chu…", "Wed Apr 17 16:56:02 ": "@si_vault No doubt thinking happy thoughts about all his friends in the media!", "Sat Apr 20 02:04:06 ": "@EBJunkies *nodding energetically*", "Sat Apr 20 02:01:28 ": "@ByChrisJenkins It's an 18-foot figurative outboard.", "Wed Apr 17 18:01:08 ": "@khalilgarriott And...there's that, yes.", "Wed Apr 17 18:05:10 ": "@tonyg5256 Yeah.", "Wed Apr 17 18:01:37 ": "RT @cvmikesisak: NBC's Pete Williams says reports that arrest has been made or is imminent appears, to him, to be wrong. #marathonbombing", "Wed Apr 17 18:00:42 ": "@BenGoesslingPP Also, I'm a worrier. (And a worrier who forgot how to spell Jewell's last name.)", "Fri Apr 19 23:53:35 ": "@jbeardsley Sounds like that boat is going to lose some of its seaworthiness.", "Wed Apr 17 17:58:48 ": "@BenGoesslingPP Yep.", "Thu Apr 18 16:08:15 ": "RT @themarkberman: An FBI agent tells @sarihorwitz that no decision has been made yet on releasing photos: http://t.co/BFKw5a8lab", "Fri Apr 19 20:23:14 ": "RT @BostonGlobe: BREAKING NEWS: With his brother shot by police, Dzhokhor A. Tsarnaev drove over him, two law enforcement officials said.", "Fri Apr 19 23:29:38 ": "RT @BostonGlobe: Marathon bombings suspect believed to be inside boat in back yard of Watertown home. The boat was surrounded by police.", "Sat Apr 20 13:01:31 ": "@dcborn61 @jbeardsley @FluteByTrey @thebrowncoat @cnn That was just ... the worst.", "Wed Apr 17 19:09:07 ": "RT @twoeightnine: Beginning to think that getting your news a day later on a piece of paper really was the way to go.", "Tue Apr 16 15:32:30 ": "Obama: \"It will take time, but we will find out\" who did this.", "Wed Apr 17 19:50:58 ": "RT @RavensInsider: Jonathan Ogden to announce Ravens' second-round draft pick in New York at Radio City Music Hall", "Tue Apr 16 18:15:15 ": "RT @BostonGlobe: BREAKING NEWS: Second victim identified in Boston Marathon bombings: Krystle Campbell of Arlington.", "Sat Apr 20 02:03:03 ": "@steelergurl I wish.", "Tue Apr 16 16:17:08 ": "RT @themarkberman: god. MT @Chris_Moody: Child who died in Boston blast was running from the first bomb when the second one struck him.  ...", "Sat Apr 20 02:13:40 ": "@ByChrisJenkins It's the eye patch.", "Fri Apr 19 23:43:20 ": "RT @washingtonpost: A police operation is underway in Watertown. Live updates: http://t.co/C2g27pSFsJ", "Thu Apr 18 15:01:38 ": "RT @themarkberman: The interfaith service in Boston is beginning. Watch it live here: http://t.co/wcitAzrOj0", "Fri Apr 19 23:44:49 ": "@AugensteinWTOP She has not impressed me in all of this.", "Tue Apr 16 16:09:55 ": "RT @AP: BREAKING: Person briefed on probe: Boston explosives made of pressure cookers with metal, ball bearings -MM", "Fri Apr 19 23:59:26 ": "@jbeardsley @FluteByTrey I gave up on them before the false reports, when Erin Burnett asked a runner how life had changed...at 6 pm Monday.", "Sat Apr 20 02:14:47 ": "@TheMrsBobBecker @jasonjwilde Ew.", "Sat Apr 20 02:03:24 ": "@BoyGeniusLA I don't have a boat!!!!!", "Tue Apr 16 17:46:16 ": "RT @BuzzFeedSports: How The Newest New England Patriot Just Won Boston's Heart: http://t.co/3xEjVI6waW", "Wed Apr 17 19:41:12 ": "RT @_RJ3: NEW BACKFIELD RADIO tonight at 8PM @JBernstine @CindyBoren and @TheNatsBlogJoe to join the show!  Tune in! @EYESRadio", "Tue Apr 16 15:33:13 ": "Obama praises runners who headed straight to hospitals to give blood, others who courageously helped.", "Wed Apr 17 17:50:31 ": "This is a good time to remind people about Richard Jewel and the Atlanta Olympics.", "Wed Apr 17 17:25:06 ": "RT @themarkberman: .@bostonglobe report: \"Image shows suspect carrying, perhaps dropping, black bag.\"  http://t.co/dbm3xDcxO1", "Sat Apr 20 02:13:12 ": "@Tim_Eagon @jasonjwilde I'd have made like Usain and Bolted.", "Fri Apr 19 23:30:54 ": "RT @ailworth: The scene http://t.co/p3l9t5tcw9", "Wed Apr 17 12:24:22 ": "For more Boston updates, follow @therealmarkberman @wpjenna @MelissaBell and me on the liveblog for day 3. http://t.co/kB1GuAJV0Z", "Fri Apr 19 21:36:00 ": "@bankonjustin @katierogers @themarkberman @MelissaBell @caitlindewey It takes a village."}