{"Fri Apr 12 15:14:47 ": "It's not too late to join us at \"Becoming Myself\" (Embracing God's Dream of You) tonight and tomorrow morning at... http://t.co/iuvW8Ktw6t", "Thu Apr 04 15:21:22 ": "So thankful that God is consistent in the midst of my inconsistencies, faithful in my faithlessness, the Answer -... http://t.co/ttL3t9shOZ", "Thu Mar 21 02:55:53 ": "@SheilaWalsh And I love you, sweet sister and fellow worshipper of the King!", "Thu Feb 21 14:09:30 ": "Seriously trying to learn how to tweet.  I feel like a dumb bird, but getting it.  I think I'm too chatty 4 this!  But trying! #tweet", "Fri Mar 01 16:43:35 ": "3 1/2 hour delay now.  Meal voucher in hand...going for sustenance, not just snackage. 🍏🌽🍇", "Thu Apr 18 13:26:00 ": "Good morning, rainy Grand Rapids!  Looking forward to seeing the Holy Spirit pour out on us tonight and tomorrow... http://t.co/6dRSZwKjEq", "Fri Feb 22 16:21:50 ": "Excited to join @NancyDeMoss on the #ReviveTour this Spring!  First stop DFW/Houston in March!  http://t.co/YIVUXAaMyP", "Fri Mar 01 20:53:09 ": "Chicago, I have arrived!  Now, to Traverse City!  A delayed flight in Chicago came in handy since my flight was 3 hrs late from CO! Whew!", "Thu Feb 21 19:52:07 ": "I LOVE THIS!!!!\n\n“O God, I have tasted Thy goodness, and it has both satisfied me and made me thirsty for more. I... http://t.co/1S3NBaJDiu", "Fri Mar 15 15:36:36 ": "@DrJuliSlattery thanks, sweet Juli!:). Love you!", "Sat Feb 23 16:21:58 ": "Does anyone else make their side of the bed while their spouse is still in it?  Just curious...I may or may not do that.  #OCD", "Sat Feb 23 14:50:43 ": "Don't think less or more of yourself; think of yourself less. (Keller) #themeaningofmarriage", "Sun Apr 14 12:36:24 ": "RT @CandiceWatters: Thank you @conor64 and @TheAtlantic  for covering the #Gosnell trial and horrors http://t.co/MJ2oCpFKnF (HT @DouthatNYT)", "Fri Mar 15 16:58:14 ": "New blog post up at http://t.co/B6kdUksLsr. Join the conversation...read, comment, join the party! A free... http://t.co/t1RxfyKUzl", "Sat Feb 23 05:28:19 ": "@PriscillaShirer fun!!! Wish I could crash the party!", "Fri Apr 12 18:12:25 ": "My song \"Pour Your Spirit Out\" is now available as a FREE DOWNLOAD on my website. Click this link to download... http://t.co/E67N11dH9k", "Fri Feb 22 14:49:35 ": "@PriscillaShirer who hoo!!!! Congrats to all!!!", "Sun Feb 24 15:35:22 ": "RT @mafeinberg: Today marks the celebration of #Purim. Read about this Jewish feast here: http://t.co/0cs4jTt18a", "Mon Feb 25 19:24:39 ": "Hey peeps! I had the privilege of guest blogging for my dear friends at Authentic Intimacy's (Dr. Juli Slattery &amp;... http://t.co/IIwDCfDe3z", "Sat Feb 23 21:51:49 ": "RT @SheilaWalsh: \"Your past is supposed to help someone else find a future.\" @HollyWagnerLA @womenoffaith", "Fri Feb 22 14:49:16 ": "RT @PriscillaShirer: Listening to @wexelberg this AM in celebration of our WINNERS today! Congratulations!  http://t.co/XTnSaoqJX9", "Fri Feb 22 14:44:13 ": "@ldharper sounds perfectly heavenly!!", "Sun Feb 24 00:30:18 ": "In this world we'll have trouble, burdens &amp; scars\nBut we have a King who has been where we are\n #TakeHeart  http://t.co/D4eS3Q6T6Q", "Sun Feb 24 15:29:17 ": "I got this on a whim on sale at Target.  It instantly takes smell of garlic off hands.  For real!!!  Weird! http://t.co/saDaJpj9By", "Tue Feb 26 16:09:02 ": "Come join me &amp; @NancyDeMoss for #ReviveTour! Grateful 2 be leading worship! http://t.co/XvOjqpV37x", "Mon Feb 25 16:37:26 ": "I love Colorado.  Blizzard yesterday, sunny today. And our sweet neighbor plowed our driveway.  #blessed http://t.co/Og62dFuT4g", "Mon Mar 11 16:10:20 ": "Ladies (&amp; any brave men)! Tomorrow night I'll be ministering the songs from my new project \"Take Heart\" at... http://t.co/y2cyp7WYZ5", "Fri Mar 01 16:43:38 ": "3 1/2 hour delay now.  Meal voucher in hand...going for sustenance, not just snackage.", "Fri Feb 22 00:27:55 ": "RT @PriscillaShirer: Good morning! This is your final day to enter to win @wexelberg 's new cd. http://t.co/LarbjFNZB9. Also free downlo ...", "Sat Apr 06 15:17:33 ": "I will trust in who You say You are\nYou are faithful, You are kind\nI am always on Your mind\nI'll remember all... http://t.co/rR439y4Gon", "Sat Feb 23 21:53:01 ": "RT @CSLewisDaily: Atheism turns out to be too simple. If the whole universe has no meaning, we should never have found out that it has n ...", "Sat Mar 02 21:02:07 ": "Such confidence as this is ours through Christ before God.  Not that we are competent in ourselves to claim... http://t.co/4EljML66rH", "Fri Feb 22 14:45:22 ": "@SheilaWalsh ha!  Maybe we'll go for Oxnard.  Doesn't have quite the same ring to it!:).", "Sun Feb 24 23:28:55 ": "New blog &amp; Take Heart CD giveaway!  Click here 4 details &amp; to read.  Pls.share!   http://t.co/E9q26JsaBE", "Sun Feb 24 23:43:19 ": "View outside from where I sit @ my keyboard.  A mighty fine time to write. http://t.co/zN0LKXTyJ9", "Mon Feb 18 13:25:04 ": "My sweet girlfriend Priscilla Shirer of Going Beyond Ministries (who is an amazing Bible teacher &amp; author with... http://t.co/luV7mXMK", "Thu Feb 21 15:52:22 ": "@PaigeGreene oh man!!  Praying Godspeed to you!!!!!!!!", "Tue Feb 19 13:38:09 ": "2 more days to read my friend Priscilla Shirer's blog \"Take Heart\" &amp; enter to win 1 of 5 of my \"Take Heart\" CD's!  http://t.co/arsqUE7X", "Thu Feb 21 14:03:05 ": "@PaigeGreene who hoo! Wish we lived closer! Could try more crazy food. #PadThai. Blessings, sweet friend!", "Fri Mar 08 02:17:42 ": "RT @Annie_Belle_T: Adoring @sjwexelberg's new CD, \"Take Heart\"! Performed with phenomenal talent that allows the soul-stirring lyrics to ...", "Thu Feb 21 19:44:10 ": "Hey peeps! In case u missed my incessant posting 2 weeks ago, my new CD \"take heart\" is available now at http://t.co/d4nw28o9dr.", "Sun Feb 24 00:30:24 ": "In this world we'll have trouble, burdens &amp; scars\nBut we have a King who has been where we are\n #TakeHeart... http://t.co/CHVjmNdT0X", "Thu Mar 28 00:34:08 ": "Amazing grace.", "Sat Feb 23 14:08:48 ": "Reading #TheMeaningOfMarriage by Tim Keller.  Really great, as are all his books!  #greatauthors", "Sat Feb 23 06:27:20 ": "So amazed by grace...#amazinggrace", "Sat Apr 13 19:12:26 ": "Wow.  I am speechless &amp; undone.  God met us in profound ways through Warrior Princess @Stasi Eldredge at the... http://t.co/4WSOumb0Yn", "Mon Feb 25 02:20:41 ": "Oscars recording til Christian goes 2 bed. Meanwhile, Teenage Mutant Ninja Turtles.", "Wed Feb 27 17:16:37 ": "So, if you're still looking for an Easter song or two for services, consider \"Love Came for Me\" on my Christmas... http://t.co/bCDYNwMi7k", "Tue Feb 26 13:14:35 ": "What a gift TODAY is from Him! A day to rejoice &amp; be glad. So, let's do it, people!", "Sun Feb 17 19:50:53 ": "@pboyd86 thank you, Pam!  What a joy to worship with so many daughters of the King.  New Life was such a gracious host!  Blessings to you!", "Tue Feb 26 13:47:55 ": "Would you rather be validated by God or the world?  Many times they are polar opposites.", "Mon Feb 25 13:44:09 ": "RT @DailyKeller: The key question in order to change you is not \"What would Jesus do?\" but \"What has Jesus done for you?\"", "Wed Mar 20 13:47:08 ": "You can have all this world...give me Jesus.  #ReviveTour", "Sun Feb 17 20:48:41 ": "How can it already be the Downton Abbey season 3 finale tonight?  Not feeling very jolly about this all too soon pause in storyline.", "Sat Feb 23 05:39:53 ": "@SheilaWalsh @HollyWagnerLA @SelahOnline @HopeDarst @themoneycouple Praying for you all tomorrow!!  May His presence be sweet &amp; powerful!", "Tue Feb 26 02:26:04 ": "@RhodaSchultz lovely!!", "Sun Feb 24 23:10:52 ": "Well, you knew it was coming!  The first \"Take Heart\" CD giveaway.  TO ENTER:  First, you must \"like\" this page.... http://t.co/LcLeoHCEvy", "Thu Mar 14 16:16:54 ": "is making final preparations for the Revive Tour with Nancy Leigh DeMoss beginning next week in Dallas / Houston!... http://t.co/hFbaCIVXF9", "Thu Feb 21 15:49:32 ": "@PaigeGreene so fun!!!", "Sun Feb 17 19:52:03 ": "@joshuainman love that pic!  We actually look alive after being up since 4:30 AM!  Great 2 meet u!  Shine brightly on the country bus!", "Thu Feb 21 13:52:30 ": "Enter to win one of my \"Take Heart\" CD's on Priscilla Shirer's blog!  Winners announced tomorrow!  http://t.co/guaqaTcxMV", "Wed Mar 20 00:07:04 ": "#ReviveTour kicks off right now with host Bob Lepine...the voice of Family Life Radio.", "Sat Feb 23 15:16:48 ": "@ChanceScoggins that blog impacted me hugely this week!!!", "Sun Feb 24 20:53:59 ": "Hey friends!  So, I'm trying to learn how to use Twitter.  (trying..operative word)  Wanna join me?  My Twitter... http://t.co/ND6jACshaB", "Mon Feb 25 21:31:22 ": "@CandiceWatters We are!  Moved back to Monument this last Summer!  Will u be visiting soon?", "Fri Feb 22 00:19:41 ": "And the reason I keep buying the white uniform shirt for Christian each year is...? #Boyswillbeboys http://t.co/koBSfCZBdJ", "Fri Mar 22 00:40:41 ": "Having fun in Houston!  #ReviveTour #KHCB  God is awesome &amp; so are His people!", "Thu Feb 21 16:11:21 ": "And....it's a snow day in Colorado Springs!   Here's lovely proof off our back patio.  http://t.co/p9zDSE8480", "Fri Mar 08 02:28:49 ": "God has provided a Lamb.  Oh, what love.", "Thu Feb 21 05:51:27 ": "RT @NancyDeMoss: Dallas/Ft Worth--first stop on our #ReviveTour! Hope to see you March 19-20: http://t.co/Dd5FVwWh @ReviveOurHearts @Wex ...", "Thu Mar 21 03:37:15 ": "Grateful to minister w. @NancyDeMoss on the #ReviveTour!  Our self portrait in the van. http://t.co/wY4YJYU2aW", "Thu Feb 21 13:52:28 ": "Enter to win one of my \"Take Heart\" CD's on Priscilla Shirer's blog!  Winners announced tomorrow!  http://t.co/DjK856F5", "Mon Apr 08 00:04:44 ": "@gpackiam Loved NLD today!  And best potluck ever!:). It was great to join the feast.", "Tue Feb 19 22:09:40 ": "I am blessed beyond measure because of the riches of Christ.  It doesn't get much better than that!", "Sun Feb 24 01:07:27 ": "Me, Jersey &amp; Berty (our cats) are the only ones not sick in the house.  #quarantined http://t.co/AOQ1dMzC3c", "Sat Feb 23 21:52:40 ": "@PaigeGreene no doubt about it!!! She'll bring it!", "Fri Feb 22 05:42:11 ": "@SheilaWalsh I told my Christian about Shaquille the eel last week &amp; he totally cracked up!  Then he started asking for a turtle or hamster!", "Tue Mar 12 20:24:25 ": "is counting on God.", "Tue Feb 26 02:36:34 ": "My hubby is fantabulous &amp; fun!  http://t.co/ICSgHtRZar", "Tue Feb 26 13:21:06 ": "@GwenSmithMusic woohoo!!!!", "Sat Feb 23 18:55:17 ": "@PriscillaShirer love it!!!", "Thu Mar 21 02:56:02 ": "RT @SheilaWalsh: Whole page in Christian Retailing on @sjwexelberg new CD, Take Heart. LOVE this woman and her passion for worship", "Fri Mar 08 02:19:08 ": "@gpackiam I was!!!! I had to slip out a bit early, but loved it so much!!!  Excited about the new project &amp; what God is doing in &amp; through u", "Wed Mar 13 05:37:17 ": "@SheilaWalsh cute pic of you two!  Makes me smile!:)", "Sat Feb 23 18:55:57 ": "@SheilaWalsh that'll preach!!!", "Sat Feb 23 15:13:16 ": "@SheilaWalsh @ldharper You too, sweet Sheila!  Lifting you up...", "Wed Mar 06 01:42:01 ": "is at Glenn Packiam's album release concert.  #themysteryoffaith", "Fri Mar 01 15:41:47 ": "And the 2 hr flight delay has now become 3.  Might need to go get some snackage.", "Tue Mar 05 03:35:17 ": "Congrats to the five winners of the \"Take Heart\" CD's!  \n\n1.)  Elizabeth\n2.)  Darsi\n3.)  Rhonda\n4.)  Kelly G.\n5.)... http://t.co/7vqIGgej7y", "Thu Feb 28 20:01:57 ": "A few more days to check out my blog post and enter to win one of 5 \"Take Heart\" CD's.  Just \"like\" this page,... http://t.co/of0aqCIrD6", "Tue Apr 09 19:42:45 ": "Very excited to be leading worship for the \"Becoming Myself\" conference with Stasi Eldredge this Friday &amp;... http://t.co/aEilnaTncR", "Thu Feb 21 13:53:51 ": "@LysaTerKeurst great reminder, Lysa!!", "Fri Mar 15 15:36:12 ": "RT @DrJuliSlattery: I love worshipping with @sjwexelberg's new album \"Take Heart.\" It's outstanding !!", "Tue Feb 26 13:28:36 ": "Read my guest blog at Authentic Intimacy!  \"Lessons from a Pity Party\"  http://t.co/ZNESxcTZLK", "Tue Feb 26 16:09:04 ": "Come join me &amp; @NancyDeMoss for #ReviveTour! Grateful 2 be leading worship! http://t.co/YIVUXAaMyP", "Mon Feb 25 13:46:43 ": "Father, calm my anxious thoughts &amp; help me to leap into Your arms trusting.  I need You every hour.", "Thu Feb 21 05:58:25 ": "@PaigeGreene hey sweet Paige!  Not sure if you'll win, but \"take heart\" is on it's way to you from my house to your desk!:).", "Fri Mar 08 02:21:58 ": "@CandiceWatters Yeppers!!", "Thu Feb 28 18:14:55 ": "Packing up to head to Traverse City, MI tomorrow. Ministering Sat. PM &amp; Sun AM at New Hope Community Church! Come... http://t.co/fDOpBlQ15Y", "Fri Feb 22 13:32:12 ": "@SheilaWalsh I have a feeling a visit to Pet Smart is in my near future! :). #Shaquille'sHamsterCousin"}