{"Mon Apr 22 13:14:00 ": "Received my 50th Cap last weekend 4 QLD, even more special because we played our younger bro@colbyfaingaa #honoured http://t.co/zdpj0qEmvx", "Thu Apr 11 06:13:43 ": "@gps_rugby @ruan_twin @jeanpierresmit1 @kinson88 @verified thanks for the support!!", "Thu Apr 04 12:12:41 ": "Mate love your work, would love some help as well @Haesleycush: This months 1 minute market update @RayWhiteGroup http://t.co/7CyYGVgVVT", "Sun Apr 21 07:42:56 ": "@ScottOakhill10 thanks mate", "Wed Apr 10 12:54:43 ": "@Brookster81 @verified thank u so much for your kind words!!", "Fri Apr 19 10:14:20 ": "Not to sure if laughing is part of the #haka ??? What do you think? #AUSvNZ http://t.co/bjt0YJ1u9p", "Sun Apr 21 02:30:48 ": "Trying to find some good places to buy carpet on the north side of Brisbane, any ideas? #Help!", "Wed Apr 17 00:37:54 ": "#FTA doing his baby sitting duties, not to sure if he is the best baby sitter #maybeholdthebaby #daddydaycare http://t.co/XAG2tPkYXj", "Thu Apr 11 01:55:19 ": "@TwitterAU is there no other way?? only cause we don't know or wouldn't know what to say to the about the tick..", "Thu Apr 04 08:30:43 ": "@BrisGrillTeam @reds_rugby was thinking that he would look great in dreadlocks just like #FTS haha, still waiting for the job offer ;) #FTS", "Wed Apr 17 01:22:49 ": "@soathehulk hey cuz wat's been happening? Wondering u got my bed ready 4 when I come over 2 Perth, the king bed in the master bedroom lol", "Fri Apr 12 05:06:53 ": "@Coopsy2012 sorry it is saia as well mate", "Wed Apr 10 10:10:03 ": "@jonno_lance #classified #sundayafternoon #mariokart", "Sun Apr 21 00:47:31 ": "Family breakfast after a big game! @colbyfaingaa @skuxx_dyluxx @vilifainga always lots of fun! #WeAreRed http://t.co/2kG9zbfwqp", "Thu Mar 21 07:11:47 ": "@melissamay1 lol next time come up and say hi hope your well..", "Sun Mar 17 10:37:20 ": "RT @smartwomancoach: @FaingaaTwins check it out! You feature on pgs 39-41! Born Organized Lifestyle #magazine #pkPR  Read here : http:// ...", "Sat Apr 06 09:13:24 ": "What's your thoughts on the Rebel vs Force? Who is going to win?? Rebels playing some good rugby so far!", "Wed Apr 10 12:57:36 ": "@kylie_ashton thanks u so much for your kind words, and then helping us to try get @verified", "Thu Apr 11 06:27:39 ": "@TwitterAU thank u so much for the support and your effort.. #BlueTick", "Thu Apr 11 04:59:51 ": "@TwitterAU So we r guessing u can't help us get the Blue Tick?? #Help #Please", "Sat Apr 06 11:58:18 ": "Thanks 4 the kind words @bierfesten: @FaingaaTwins hope neither of u make the @QantasWallabies thats like a #Beale or @QuadeCooper statement", "Fri Mar 29 02:18:02 ": "Looking forward to my 50th game. It's been a long journey with injury and adversity but if u believe in yourself anything is possible #FTA", "Thu Apr 18 08:43:53 ": "@xoxo_ameliaa haha next time come and say hi;) we don't bite!! Hope your well..", "Sat Mar 16 22:30:28 ": "Thinking of taking my father to watch his favourite team play the Canbrrea Raiders at GoldCoast!! Spare Tickets... http://t.co/8eN9JHbBis", "Mon Mar 11 11:18:22 ": "Not sure if this bloke knows wat he's doing.Have never seen him wash the dishes.He only ever looks (cont) http://t.co/yoHESRIGcP", "Sat Mar 16 14:47:54 ": "Disappointing result 2night, out played by the Force but looking forward 2 next weeks challenge against the bulls. Thanks 4the great Support", "Mon Apr 01 05:11:35 ": "@abbey147 should of came up and say hi;)", "Fri Apr 12 06:07:58 ": "@shellster1982 how do u know the squad", "Sat Apr 06 09:18:54 ": "Anyone have any luck at the track today on the golden slipper? Thanks @tomwaterhouse for the tips! #WinnerWinnerChickenDinner", "Mon Apr 22 13:26:13 ": "@jeanboy82 did we not stay around long enough this week, usually last off the field, we will stay till security kick both of us out #Deal", "Fri Apr 05 03:47:55 ": "@TW_Bet Hey mate, hope your well? Any good tips for the big day tomorrows?? #alwaysgoodtips", "Mon Mar 11 10:47:53 ": "@CookeBrad @barefootsport We would love to?  Let us know when your free", "Wed Apr 10 12:54:01 ": "@iGreggsy @verified haha very true thanks for your nice comments.. Couldn't be anyone else cause of our great spelling due to #FTS ;)", "Wed Apr 10 13:14:39 ": "@dazedinsanity never knew u could buy followers..", "Mon Mar 25 09:40:18 ": "@kat_x haha next time come say hi ;) I won't bite", "Tue Mar 26 11:08:47 ": "@CoolCatCass well make sure to say hi", "Sun Apr 21 01:07:25 ": "@DokosInkTattoo @colbyfaingaa thanks brother.. Hope your well?", "Tue Apr 02 11:50:50 ": "@krisnan_inu yeah all good cuz hurt my neck a couple of weeks ago but getting better. Well good luck with everything bra and catch up soon", "Sun Apr 21 00:05:56 ": "Would be honoured #FTS @FR_union: @FaingaaTwins New account 4 those special ones in the front row union. Would be honoured if u would follow", "Wed Mar 27 00:44:15 ": "Doing a photoshoot at the Courier Mail today! Practicing my blue steel look in the mirror ;)", "Sat Apr 06 11:02:54 ": "@bjfinnisher not to sure but we work hard trying to be!!!", "Sat Apr 13 05:25:55 ": "@DrJohnBarletta lol sure is mate ;)", "Tue Apr 09 09:09:39 ": "Ok #MummysBoy@colbyfaingaa: @FaingaaTwins aka #FTA look alike u guys reckon! Maybe if ant could grow a healthy length moustache #latepuberty", "Thu Apr 18 07:21:14 ": "Good luck;) RT @RowdyBec: Here's my post fight VLOG from Invicta;)Please RT @rayelbe @natashawicks @FaingaaTwins\nhttp://t.co/FN5JsfyH58", "Sat Mar 16 22:26:15 ": "Might take my dad 2 watch his favourite team the raiders play @ GoldCoast #SpareTicketsAnyone @ChristineWangui:@FaingaaTwins plans 4 Sunday?", "Wed Apr 10 13:00:18 ": "@dazedinsanity free followers?? Is there a site for that?", "Wed Mar 13 12:18:21 ": "@jaxii @kooklatanya lol well it was suppose to be funny!!", "Wed Apr 10 09:56:30 ": "How do we get verified?! #suggestions?@Zaipri88: When is the @FaingaaTwins twitter account gonna be verified? It's about time that happened", "Mon Apr 15 10:59:28 ": "@JuanDeJongh happy birthday cuz, hope u have a great day #Twins", "Wed Apr 17 05:31:09 ": "@MelissaKCraig thanks so much we both really appreciate the offer will be in touch!!", "Tue Apr 02 10:55:04 ": "@krisnan_inu what happened to the leg cuz u all good been playing well.. Saia", "Sun Apr 21 06:10:43 ": "@AMBAConvention Thanks for your kind words!!!", "Mon Apr 01 02:41:00 ": "Cruising around Robina Shopping mall, didn't realise how big it was! Spent more time looking for the car than shopping! #FTS #RookieError", "Wed Apr 10 12:48:19 ": "@Pekcowan @verified funny guy run it straight, then hook yourself haha.. Hope the family is well brother!!", "Thu Mar 28 03:40:12 ": "Have you got plans yet for Sunday 7th April? Why not head down to Sleeman Sports Centre, Chandler and get involved... http://t.co/YNanTj2m56", "Wed Apr 10 13:17:13 ": "@Brookster81 ;) thanks #QBN #2620", "Fri Apr 12 01:33:54 ": "RT @soathehulk: SHOUTOUT 2MYboys @SonnyBWilliams @JamesTeHuna @Buddy_Franklin @IzzyFolau @FaingaaTwins @CVUNA @RealNaitanui @TheREALRIKI ...", "Tue Apr 09 08:39:39 ": "Big shout out to our little bro @colbyfaingaa AKA Anthony look-a-like!! Give the little fella a follow and a RT!", "Thu Mar 28 10:48:40 ": "Thanks everyone 4 the great support.. @Reds_Rugby: Congrats 2 @FaingaaTwins #FTA  who will play his 50th game 4 the QLD Reds 2morrow night", "Mon Apr 01 08:33:48 ": "@RowdyBec hey hope your well, how r u going?? When is your next fight and all your training going?", "Fri Apr 12 22:58:54 ": "@i__Matt hey all good just training and trying to get back from my neck injury, #FTA playing tonight so can't wait hope your well?", "Thu Apr 11 01:58:30 ": "@Alicia_Maher @twitterau thanks for your help lol who should I call maybe the CEO as well?? ;)", "Wed Apr 10 12:58:00 ": "@taylasdfghjkl @verified I agree haha;) thanks", "Thu Mar 28 11:00:45 ": "@ben_tune thanks mate", "Wed Apr 10 12:55:29 ": "@abbey147 @verified thanks lets hope.. Fingers crossed, hope your well;)", "Wed Apr 10 09:52:27 ": "Time4Kids: Locked up 2 help the PCYC Police who look after young people #blackandwhite are not our colours! http://t.co/eRDPRnbNrs", "Wed Apr 10 12:50:49 ": "@cHalapua @verified that's hope he can, I think the blue tick would look great next to our name!!", "Wed Apr 10 12:49:59 ": "@shirlld @verified thanks for the support ;)", "Sat Mar 16 14:18:08 ": "@Luttsy hey mate how did we go this morning and good feed back lol", "Sat Mar 16 14:50:18 ": "@FaingaaTwins: Disappointing result 2nigh,t we were out played by the Force but looking forward 2 next weeks... http://t.co/T8s82buLEq", "Thu Apr 11 11:03:22 ": "@TwitterAU We have just sent you our email address, thanks again for your help..", "Thu Mar 14 04:47:11 ": "\"Hanging Out With The Faingaa Twins\" - If this was a reality TV show, would you watch it? Saia thinks it would... http://t.co/THr1vLBerO", "Sat Apr 20 23:57:13 ": "Recovery sesh with brothers @colbyfaingaa @vili_f  &amp; @dkaraitiana. Good 2 have the family 2gether. Brekky @ famished on Frasers Rd Ashgrove", "Wed Apr 17 00:42:35 ": "Photo shoot today at SouthBank with survivor Natalie Oconner to help out with Mother's Day classic for @NBCFAus #bluesteel #greatcause", "Fri Apr 12 22:57:27 ": "@DrJohnBarletta  hey John, small world haha.. Hope u r having a great weekend..", "Sat Mar 16 04:30:08 ": "Good Luck @AussieGrit for the weekend... Enjoy Melbourne", "Sat Mar 16 14:42:56 ": "@Luttsy You should have to get me a gig for a couple of morning to start up some shit jokes!! Lol", "Sat Apr 13 23:26:13 ": "Hope u enjoyed it;)@niczzzzz:Massive shout out 2 the bros #FTS and #FTA aka @FaingaaTwins 4 the match tickets yesturday! Had an amazing time", "Wed Mar 13 12:32:57 ": "@ShannonMarieNZ I know but u always have to look at the bright sight haha ;(", "Fri Apr 12 08:50:20 ": "Watching Brumbies vs Highlanders, what a game! What's your prediction on the score?", "Thu Apr 04 07:46:21 ": "@Zaipri88 thanks for the shout out;$", "Sat Mar 23 13:29:09 ": "RT @RonnieMelck: @QuadeCooper and A @FaingaaTwins celebration of a simple handshake was just classy", "Sat Apr 06 11:02:18 ": "@Coopsy2012 haha mate would love too we will be in tomorrow night for dinner!! See u then;)", "Wed Mar 13 11:10:52 ": "Great 2 speak 2 my boys @inklab Colin &amp; Tim! Best in the business, if u need a website the boys will hook u up #BestInTheBusiness", "Sat Apr 06 09:25:53 ": "Watched @vili_f play 4 @gps_rugby they had a great win, now enjoying having the week off! @kooklatanya: @FaingaaTwins how is ur day so far?", "Fri Apr 05 06:03:15 ": "@TW_Bet Thanks mate everything is going well.. Thanks for the tips and hopefully we get up!!", "Fri Apr 12 13:53:39 ": "@terrycampese6 hey brother hope your well and the family is safe!! Twins", "Fri Mar 15 08:36:55 ": "@kaitlynjane_ ask away??", "Tue Mar 12 03:51:21 ": "@smartwomancoach Tell him we said congrats awesome work;)", "Sun Apr 21 00:54:34 ": "Congrats 2 our younger brother @colbyfaingaa for signing with the Melbourne Rebels.. #BigDecision but good luck 4 the rest of the season.", "Wed Apr 10 14:15:08 ": "@SalesiMaafu @pekcowan @verified Must of forgot your tick to big Sally haha", "Sat Apr 06 09:02:01 ": "@colbyfaingaa Can't believe your on twitter now haha will have to u teach u a few things haha hope your well say hi to the family!", "Wed Apr 10 12:49:27 ": "@Coxi_Streetwear @verified how many followers do u need to get the tick you think? #thoughts", "Tue Apr 09 09:37:05 ": "@vili_f And we all look the same except #FTS #BodyShape lol@SuckerForRed: @Alicia_Maher @FaingaaTwins @colbyfaingaa Isn't there a 4th one?", "Fri Apr 05 06:13:16 ": "Happy birthday to my boy @QuadeCooper have a great day!! Looking sharp brother!! http://t.co/QK8n4g9nY2", "Thu Apr 04 12:13:59 ": "@BlairEvans Not to sure about that statement but that is a big pillow;) hope your well?", "Wed Apr 10 12:58:38 ": "@Zaipri88 @chalapua @verified thanks;)", "Wed Apr 10 10:05:20 ": "So @verified what ID do you need from us before you give us the little blue tick??!!", "Mon Mar 11 11:19:23 ": "@JessSchipper haha thanks", "Wed Mar 13 11:29:40 ": "The awkward moment after u send your meal back cos u find a hair, only to be told that it is actually your dreadlocks #passmethesuperglue"}