{"Fri Apr 19 23:40:41 ": "What's the New York Post headline?", "Sat Apr 20 00:16:46 ": "\"20,000 cops on the scene,\" the Jules Verne book", "Sat Apr 20 03:25:59 ": "RT @EricDKoch: Well played, someone http://t.co/5YNUhaVvn0", "Fri Apr 19 23:43:03 ": "Post hed: Sunk! Teen terrorist dies cowering in boat.", "Mon Apr 22 00:33:16 ": "What is punk when the likes of Anna Wintour appropriate it for themselves? @ntabebe explores http://t.co/Wu9gSzlZcM", "Fri Apr 19 23:44:03 ": "RT @sllambe: This photo of a girl looking out from her home in Watertown is surreal. http://t.co/PdfCx4XnzD http://t.co/nY8fpcZHBb", "Mon Apr 22 00:11:39 ": "Inside the hostile takeover of Ramapo, NY schools by the Orthodox to patronize a booming Hasidic population http://t.co/E8qZLyGfH6", "Mon Apr 22 18:12:07 ": "Is \"weapon of mass destruction\" a truly meaningless term?", "Sun Apr 21 14:25:27 ": "Menino to @GStephanopoulos: all bombing victims went to Boston hospital and all lived. Bravo.", "Mon Apr 22 02:11:09 ": "Bob Benson will be in Jonestown in a few years", "Sat Apr 20 04:36:19 ": "RT @globecynthia: First edition of tomorrow morning's Boston Globe. #Bostonmarathon http://t.co/LiyJciEMWG", "Sun Apr 21 22:17:39 ": "Michigan lost 15% of employer- provided health insurance between 1999, 2011. Some \"recovery\" http://t.co/0EtGmFek1M", "Mon Apr 22 00:28:01 ": "If you wanted to see up a woman's skirt in 1903, you'd stand outside the Flatiron Building http://t.co/81hKnQvhnL", "Mon Apr 22 01:12:48 ": "Dinner with the First Couple of American Fiction http://t.co/IxaR99dp5e Claire Messud &amp; @newyorker's James Wood http://t.co/9SHOOS0VJl", "Sun Apr 21 18:23:01 ": "California has 66x as many people as Wyoming. When Constitution was ratified, Virginia had 10x as many as Rhode Island", "Mon Apr 22 17:46:03 ": "DoJ's full complaint against Dzhokhar A. Tsarnaev http://t.co/7abEqziMJZ", "Sat Apr 20 00:10:42 ": "\"How you like dem apples?\"- all of Boston", "Mon Apr 22 02:19:31 ": "\"When I created Don Draper, in my mind I saw Garner\" http://t.co/yTs53OauLh", "Mon Apr 22 16:44:24 ": "RT @ryanjreilly: How you weigh Guantanamo detainees when they're in chains http://t.co/cVqpKRpFzH", "Fri Apr 19 23:59:14 ": "RT @rossneumann: News Bros RT @morningmoneyben: Brian Williams/Pete Williams 2016", "Mon Apr 22 00:22:38 ": "@rossneumann Ha. Someone for Thought Catalog sadly", "Mon Apr 22 11:37:37 ": ".@PeteWilliamsNBC: Carjack victim told police Tsarnaevs didn't kill him because they said he was \"not an American\"", "Mon Apr 22 18:56:42 ": "Obama has gone further than Bush in \"blurring the lines between the criminal and military justice systems\" http://t.co/9iOC6Jwfzw", "Sun Apr 21 18:09:20 ": ".@billmaher: Equating Christianity and Islam is \"Liberal Bullshit\" http://t.co/YVpGOBFHrp", "Fri Apr 19 22:28:55 ": "Boston is the best and worse of Jane Jacob's ideas right now http://t.co/Jrd54Ut7QV new @nymag", "Sat Apr 20 00:13:18 ": "RT @ABC: Eyewitness: Neighbor went to check boat behind his house today, saw blood, climbed up ladder to open boat's cover, saw a body, cal…", "Mon Apr 22 16:15:16 ": "@pbump Are your links broken? Doesn't work for me", "Sat Apr 20 00:13:56 ": "RT @TheFix: Remember that Pete Williams is doing all of this from Washington not Boston. Which means he has REALLY good sources.", "Sat Apr 20 00:24:53 ": "Most confusion over whether man is dead or alive since Abe Vigoda", "Mon Apr 22 14:37:49 ": "\"Fucking shit\" news anchor could use Sorority Girl as a life coach", "Mon Apr 22 15:04:55 ": "One week later, Boston's Copley Square is still barricaded http://t.co/8ITg3WWFMS by @CKummer", "Mon Apr 22 02:02:52 ": "BREAKING: Don Draper in pinstripes. I believe first time ever", "Mon Apr 22 12:14:42 ": "http://t.co/huM2lnYiMR", "Mon Apr 22 13:05:21 ": "@davabel Exactly the story @bobkolker wrote for New York mag this week http://t.co/YsFN2WtRvl", "Sat Apr 20 15:45:17 ": "Dzhokhar, Klebold, McVeigh and the roar of young male rage, by @lisaxmiller, new @nymag http://t.co/fxI8Vcbb58", "Mon Apr 22 16:16:49 ": "@pbump Press release now dead http://t.co/yx0hRF5WEo", "Fri Apr 19 23:45:42 ": "@jaredbkeller Drink's on me", "Sun Apr 21 17:51:32 ": "George W. Bush put down cigars and picked up the paint brush http://t.co/yVlRaJRNam", "Sat Apr 20 15:55:38 ": "Tsarnaevs couldn't have found a more welcoming town than the one they terrorized in Cambridge http://t.co/q5yJ7z1mG9 by @bobkolker", "Sat Apr 20 16:30:39 ": "20 years after Oklahoma City, Tsarnaev wasn't Mirandized like McVeigh. A Constitutional right's erosion http://t.co/aAlVLp3FTf", "Sat Apr 20 04:01:35 ": "MT @DaveCullen: \"Is Boston Like Columbine?\" http://t.co/kQzZMLWEXg", "Mon Apr 22 02:52:45 ": "@MattZeitlin hey now", "Mon Apr 22 17:43:24 ": "@ScottBix Where does it say WMD?", "Mon Apr 22 12:39:08 ": "NYPD cameras count how long unattended package sits motionless, alerts officer http://t.co/e7fPr2JIX2", "Sun Apr 21 14:35:31 ": ".@PeteWilliamsNBC reports: Charges likely Sunday for Dzhokhar Tsarnaev http://t.co/DY4bSomQBA", "Sat Apr 20 19:42:20 ": "RT @CharlotteCowles: Drunk babies = prohibition ads. http://t.co/jUsElBkjxH", "Fri Apr 19 23:44:51 ": "Good: at a bar. Bad: no tv in bar", "Sun Apr 21 17:54:56 ": "Senate to vote Monday on taxing all Internet purchases http://t.co/BeCbnKmscf via @dabeard", "Sun Apr 21 17:11:03 ": "Islamophobe Pamela Geller really loves the Cure http://t.co/TSRd5LCM4s", "Mon Apr 22 16:05:55 ": "Why is it still called Sterling Cooper Draper Pryce after Lane's death?", "Sat Apr 20 00:33:43 ": "RT @MattZeitlin: Can Allison Williams please get involved in this somehow?", "Mon Apr 22 15:45:32 ": "The Village dies a bit more: Papaya Dog to be replaced by Victoria's Secret http://t.co/Iu7uH6pAFQ", "Mon Apr 22 17:01:16 ": "RT @michaelroston: Ashcroft explained filing charges under seal in Nov. 2001: http://t.co/dMELOik240", "Mon Apr 22 15:07:45 ": "RT @si_vault: Pat Tillman died nine years ago today. RIP. http://t.co/eNI5FE3dS2", "Mon Apr 22 00:49:03 ": "Democrats, Republicans, and their allies spent $7.1 billion on the election, as much as the GDP of Nicaragua http://t.co/eMtp3JMqB3", "Sat Apr 20 11:18:19 ": "I kind of predicted this newspaper hed, dek https://t.co/hWAELTvxfK https://t.co/MuMH4nN7mm", "Fri Apr 19 23:49:30 ": "Spoiler: He and Sundance escape to South America", "Fri Apr 19 22:22:28 ": "The bomber who killed runners is now running for his life. Ironic.", "Sat Apr 20 19:35:00 ": "@DanAmira @msnbc does this count as rubbing it in?", "Mon Apr 22 18:36:07 ": "RT @stevenportnoy: Sen. Lindsey Graham (R-SC) says it's \"impossible to gather the evidence\" in days, believes Tsarnaev should be held under…", "Sat Apr 20 01:29:58 ": "@pbump A 19-year-old who killed 4, wounded 160, tried to kill again. Really?", "Sun Apr 21 17:52:41 ": "@radleybalko What was the legal authority for searching inside homes? Obviously there were no warrants", "Sat Apr 20 01:40:26 ": "RT @pbump: @justinjm1 I'm not saying he wasn't dangerous! I'm not saying I'm not glad he's caught. I'm saying this is a little much.", "Mon Apr 22 17:52:31 ": "Snow Fall Boston http://t.co/Z0mrd8cLBa via @rossneumann", "Sun Apr 21 14:33:36 ": "A wounded, sedated, guarded hospital patient is no threat to public safety. He deserves Miranda rights like you and me", "Sun Apr 21 02:09:02 ": "Sronewash is like fascism: never coming back", "Fri Apr 19 23:51:17 ": "Does boat insurance cover damage from terrorist squatters shot by police?", "Mon Apr 22 11:52:05 ": "71-year-old tortoise who defied Hitler comes back from the dead http://t.co/8ZfTmvoPHH via @David_Dobbs", "Sat Apr 20 15:33:51 ": ".@jonathanchait on the appalling Boston profiling, from the @nypost to all of us http://t.co/NlibcxL2R1", "Sun Apr 21 21:57:07 ": "We need a policy besides overkill @Reuters: New York's JFK airport terminal briefly evacuated over package http://t.co/7rbHQ4WKla", "Mon Apr 22 02:51:25 ": "Physically displaying excitement over how good this episode got. HAIL WEINER", "Sun Apr 21 18:02:59 ": "@radleybalko And of course @Slate did an explainer http://t.co/jnV2Mdxn0C", "Mon Apr 22 17:55:19 ": "Dzhokar had \"apparently gunshot wounds to the head, neck, legs, and hand.\" http://t.co/7abEqziMJZ", "Mon Apr 22 00:13:08 ": ".@nymag covers Boston http://t.co/0ywwIIB1PL", "Mon Apr 22 13:15:13 ": "AIDS 'Patient Zero' was bullshit http://t.co/YdbSPkibMz via @jbarro", "Mon Apr 22 12:10:35 ": "Earth from 3,700,000,000 miles away http://t.co/dbUgzRo5RR", "Mon Apr 22 16:32:19 ": "Get your hate on http://t.co/LsRAGoRPRo http://t.co/UfwqWlvavS", "Sat Apr 20 22:03:58 ": "Religion saves many wayward men but didn't for Tamerlan Tsarnaev http://t.co/pruvpHN8iK", "Fri Apr 19 23:43:20 ": "RT @stefanjbecket: Boat on land in Watertown. Weird day.", "Mon Apr 22 00:19:53 ": "@rossneumann This http://t.co/2kvxMLGwuM", "Mon Apr 22 02:43:00 ": "President Bartlett for Trex wood products", "Mon Apr 22 00:44:44 ": "RT @BreakingNews: Reports: Boston Marathon bombing suspect awake, responding in writing to questions, officials tell @ABC, @USATODAY, @NBCN…", "Fri Apr 19 23:30:41 ": "So this ends like every episode of Cops", "Sat Apr 20 00:29:01 ": "Negotiator: How do you want to die, fire or bullets?", "Mon Apr 22 02:55:43 ": "\"Do you know who I am? I made my bones when you were going out with cheerleaders!\" - Reese Witherspoon", "Sat Apr 20 17:34:32 ": "RT @JamesGleick: Continuous real-time broadcast news is a failed experiment. http://t.co/FJdwN1vRwz by me.", "Mon Apr 22 15:18:00 ": "The wild club Joan went to on Mad Men was real. The Electric Circus, East Village, 1967 h/t @HannaRosin http://t.co/Jw3Rp2e3uU", "Mon Apr 22 02:36:37 ": "Jefferson D'Arcy is a swinger!!!", "Mon Apr 22 16:17:45 ": "@pbump n/m now it's good", "Fri Apr 19 23:36:32 ": "RT @BostonGlobe: BREAKING NEWS: Police have taken the cover off the boat containing the man believed to be the Marathon bombing suspect. He…", "Mon Apr 22 18:43:43 ": "Is Anthony Weiner on Twitter?", "Sat Apr 20 15:58:57 ": ".@JamesGleick on the Boston Manhunt becoming a crowd-sourced witch hunt http://t.co/mPhI0WWgr0", "Sun Apr 21 22:28:54 ": "RT @FakeLeyland: FUCK THIS SERIES FUCK THE UMPIRES FUCK EVERYONE IN THIS STADIUM FUCK CAMEL CIGARETTES BECAUSE THEY DON'T HAVE THE SAME TEX…", "Mon Apr 22 02:00:45 ": "MT @MichaelOreskes: \"Don't wash that wound. You might wash evidence away.\" Emergency nurses after the bombing http://t.co/tdjv7IOW2z", "Mon Apr 22 13:04:18 ": "The boat where Tsarnaev was apprehended, full of bullet holes http://t.co/Br6FnM3BDh by @reverepolice", "Mon Apr 22 02:07:33 ": "UPDATE: Draper wore pinstripes once last season http://t.co/IRbQhaE9T8", "Sat Apr 20 19:18:09 ": "MT @Suntimes: Since 1978, Chicago Police alone have arrested Shermain Miles 396 times. Nothing has worked http://t.co/AlD8mfxiF1", "Mon Apr 22 01:09:02 ": "@jessmisener That's why I drink alone and watch", "Sun Apr 21 17:58:05 ": "Zambia, with a population greater than Illinois, has only 15 gynecologists http://t.co/cZtXYlapST", "Sat Apr 20 16:13:43 ": "Even without being Mirandized, @CBSAndrew writes, Tsarnaev was given more rights than fellow citizen Jose Padilla http://t.co/aAlVLp3FTf"}