{"Thu Apr 11 22:27:35 ": "@Seals_Cheston23 We fainted when we heard our name in Family Guy", "Fri Apr 12 00:07:32 ": "@Ciiruitful ;-)", "Sat Feb 09 17:57:18 ": "Once out of this blizzard we promise great Zulu singing &amp; dance Sunday in Cambridge Mass. Hope everyone can make the new show!!", "Fri Apr 19 00:05:15 ": "@fransongs @mrhpresents Cool. Just don't want people thinking we r towel craaaaaaazy", "Tue Feb 19 04:04:53 ": "We r Xcited 4 our next 3 shows. Henderson Kentucky Tuesday nite, Michigan State U East Lansing on Wed nite &amp; Massey Hall Toronto Friday nite", "Sun Feb 10 19:43:41 ": "@CONORMCCREEDY @NelsonMandela Sawubona Conor! We'll b drivin fr Massachussetts 2 Ohio all day 2morrow so heres an early Happy Birthday 2 u!!", "Fri Apr 05 02:29:28 ": "That's right, we're headed to Europe Apr 27 &amp; 1st show is in Vienna Austria on Apr 29. Hope we get to c old friends &amp; new fans at our shows", "Sun Feb 10 09:34:35 ": "RT @tr0n_allycat: LADYSMITH BLACK MAMBAZO IS COMING TO HENDERSON! Someone go with me!", "Sat Feb 16 21:11:07 ": "Tonight in Elgin, IL &amp; Sunday in Stoughton, WI.  Hope to see friends at the shows!!", "Thu Apr 11 13:08:48 ": "Hollywood Bowl on June 16 Festival with us &amp; India Arie, Taj Mahal, Trombone Shorty, Bob James, David Sanborn &amp; others.  Some show!!", "Thu Apr 11 13:11:46 ": "Returning to Boston area on July 1. Rockport, MA.  Tix on sale here\nhttp://t.co/GSavaIIqAv", "Fri Apr 05 21:48:38 ": "Comin 2 Europe soon. Apr 29-Vienna 30-Innsbruck, May 1-Zurich, 3-Copenhagn, 4-Malmo, 6-Gothenburg, 8-Umea, 9-Uppsala, 10-Paris, 11-Coutances", "Sun Feb 10 19:38:25 ": "For tonites show in Cambridge bcaus of snow we've been told parking lots r open 4 free &amp; subways r running. C u tonite @ Sanders Theater 8PM", "Thu Apr 11 22:24:55 ": "RT @barrymorelive: Ladysmith Black Mambazo at the Barrymore Theatre 6/18 #constantcontact http://t.co/AKy4ceyCns", "Thu Apr 11 22:38:47 ": "@LadyFN Yes, they were Women of Mambazo led by Nellie Shabalala.  Our next cd is a tribute to Ms Shabalala where we sing with her recordings", "Tue Feb 19 03:59:13 ": "RT @lsostlukes: Delighted to announce that we have the phenomenal @therealmambazo performing here on 25 June: get your tickets now http: ...", "Fri Apr 05 13:09:46 ": "@joshgroban Tried getting thru to mgmt but no responses in return", "Mon Feb 11 14:03:03 ": "We left Harvard U last nite 11PM driving 850 miles 2 Middletown Ohio. Got 4 hours 2 go. 13 men on a bus. Shower time for all soon please!!", "Sun Feb 10 09:33:10 ": "@joeman4ever Cambridge Massachussetts...USA", "Sat Feb 09 11:15:07 ": "@ladycariad We'll just have the tea then.  Biscuits would have been nice though. Next time, be prepared.", "Mon Feb 11 14:47:14 ": "Upcoming shows...Feb 12 Frankfort KY, Feb 13 Middletown OH, Feb 15 Chicago, Feb 16 Elgin IL, Feb 17 Stoughton WI, Feb 19 Henderson KY", "Fri Apr 05 02:27:56 ": "Comin 2 Europe soon. Apr 29 Vienna, 30-Innsbruck, May 1 Zurich 3-Copenhagen 4-Malmo, 6-Gothenburg, 8-Umea, 9-Uppsala, 10-Paris, 11-Coutances", "Mon Apr 08 14:06:19 ": "Comin 2 Europe soon. Apr 29-Vienna 30-Innsbruck, May 1-Zurich, 3-Copenhagn, 4-Malmo, 6-Gothenburg, 8-Umea, 9-Uppsala, 10-Paris, 11-Coutances", "Tue Feb 19 21:11:15 ": "Hoping our fans join us in East Lansing (MSU) Wednesday night &amp; Massey Hall Toronto Friday night!! Oakville, Ontario on Saturday too.", "Thu Feb 14 11:50:58 ": "Three concerts this weekend in Chicago area. Friday night at Old Town School of Music at 7PM &amp; 9:30PM. Early show... http://t.co/E784Y59H", "Thu Feb 14 11:48:56 ": "Hey Chicago...2 shows Friday nite, 7PM &amp; 9:30PM @ Old Town School of Music. Early show is sold out so why not a later show on a Friday nite!", "Fri Feb 15 04:11:39 ": "@MikaJupiter We've got about 4 shows lined up for Sweden in early May.  Watch for details very soon", "Wed Apr 24 23:04:41 ": "July 1 Rockport MA, 2 Lewiston, ME. visit our website for all our concert dates....www.mambazo.com", "Fri Apr 05 17:30:22 ": "Europe here we come!! April 29 Vienna, Apr 30 Innsbruck, May 1 Zurich, May 3 Copenhagen, May 4 Malmo Sweden\nMay 6... http://t.co/xTv1J935aW", "Thu Apr 11 15:19:12 ": "@WahyuWibie oh thats a tough place 4 us to get to 4 a show. We would come but there needs 2 b a local promoter who can bring us there.", "Thu Apr 11 19:52:59 ": "Hey London-our only UK show this year is in London June 25. St Luke's-very small hall so tix r selling fast. Buy here http://t.co/AMUGljEWNI", "Wed Apr 24 19:44:23 ": "Heading 2 Europe this weekend. First few shows Apr 29 Vienna Konzerthaus, Apr 30 Innsbruck Treibhaus Club, May 1 Zurich Moods Club.", "Fri Apr 05 13:00:18 ": "@HornMusicOther No closer than Phoenix but next February many Colorado shows", "Sat Apr 13 02:03:44 ": "@Ciiruitful Tix for our London show June 25 here...www.barbican.org.uk/music/event-detail.asp?ID=14679 or at Box office", "Thu Apr 18 23:57:23 ": "@andyetc @scandipop @Mr_Chris_Jones What time??  Now??? How bout a little bit more warning next time!", "Wed Apr 24 19:41:39 ": "Hey London...Thanx for selling out our June 25th concert at LSO St Lukes! We'll see u in two months!!", "Fri Apr 12 00:08:57 ": "@_Dalanda \nhttp://t.co/AMUGljEWNI", "Tue Feb 19 04:02:07 ": "Shows: Tue Henderson KY, Wed East Lansing MI then Ontario. Feb 22 Toronto, 23 Oakville, 24 London, 26 Burlington, 27 Brampton, 28 St Cath's", "Wed Apr 24 23:03:23 ": "USA Shows-Jun 14 San Fran, 16 LA, 18 Madison WI, 19 Evanston IL, 20 Milwaukee, 21 Fish Creek WI, 22 Washburn WI, 29 Ottawa, 30 Saratoga NY..", "Thu Apr 11 22:43:15 ": "@Ciiruitful @mariessalyn June 25 St Luke's in London via Barbican. Tix on sale now &amp; almost sold out. Better get to it &amp; stop complaining!", "Fri Apr 19 00:00:11 ": "@madomasi Really? Record companies sell our songs without asking us or paying us &amp; there's nothing we can do about it. Hope the ad is nice", "Fri Feb 08 13:59:39 ": "We have traveled the world, won Grammys, sung for Nelson Mandela, meet Queen of England, but we have never been in a blizzard...until today", "Mon Feb 11 14:03:59 ": "Thanks to everyone who came out in the deep snow last nite to see us in Cambridge Massachussetts. Thank u all sooooo much!!", "Sun Apr 14 05:22:07 ": "@TamalaBaldwin Yes, but can't mention it til May 10. Not The Bronx, not SI, not Man...let's leave it at that for now.", "Thu Apr 11 12:55:19 ": "@angieb119 Rockport, MA on July 1. See you there!", "Mon Apr 15 23:48:05 ": "RT @yocla14: 남아공의 남성 합창단 Ladysmith Black Mambazo은 타인의 목소리에 귀기울이며 자신의 목소리를 보태어 화음을 만들어내는 것이 얼마나 멋진 일인지 보여준다. \"Wenza Ngani?\" http://t.co/j ...", "Wed Feb 20 17:00:10 ": "Excited 4 our concert tonite @ Michigan State U/East Lansing Wharton Center. Hope 2 c plenty of fans!! Friday we're in Toronto Thomson Hall", "Thu Apr 11 22:33:35 ": "@a_clai714 See u at the show!!", "Fri Feb 08 18:46:45 ": "Upcoming shows...Feb 10 Cambridge MA, Feb 12 Frankfort KY Feb 13 Middletown OH, Feb 15 Chicago IL, Feb 16 Elgin IL, Feb 17 Stoughton WI", "Thu Feb 14 11:52:20 ": "We will return to Europe from April 29 until May 11.  Shows in Vienna, Innsbruck, Zurich, Paris and several... http://t.co/C7LuBNaw", "Thu Apr 11 03:37:28 ": "We're returning to Chicago area on June 19-Concert in Evanston...small venue so tix will sell out fast....... http://t.co/1g2bJa9cmt", "Fri Apr 05 15:06:38 ": "Comin 2 Europe  soon. Apr 29-Vienna 30-Innsbruck, May 1-Zurich 3-Copenhagen 4-Malmo, 6-Gothenburg, 8-Umea, 9-Uppsala, 10-Paris, 11-Coutances", "Thu Apr 11 13:15:53 ": "Coming to Vienna Austria April 29! Tix on sale here....http://t.co/LEFwcLXdED", "Sat Feb 09 17:46:41 ": "Thulani Shabalala &amp; Russel Mthembu outside our hotel to see how much snow the blizzard brought. A lot!! http://t.co/EAXeEtUb", "Fri Apr 05 02:32:32 ": "USA &amp; Canada dates for June &amp; July coming soon!", "Sat Feb 09 17:55:54 ": "RT @BurlingtonPAC: .@therealmambazo brings us hot-running rhythms &amp; rich harmonies on Feb. 26.  http://t.co/SWekCTIx", "Thu Apr 11 22:34:43 ": "@FETA_WORLDPEACE Hope to see u at the show!", "Thu Apr 11 22:33:13 ": "@CatRoehre Yes, we'll be performing in Madison, WI on June 18!", "Tue Feb 19 04:07:02 ": "We have shows Mar 2 Scottsdale AZ, 3 Tucson, 5 Oakland CA, 6 Santa Cruz, 8 Portland OR, 9 Eugene, 10 Bend, 12 Port Angeles WA, 13 Edmonds WA", "Wed Feb 13 21:17:26 ": "RT @GetToTheBC: Enjoy the melodies of Grammy award winner's Ladysmith Black Mambazo (@therealmambazo) tonight at Miami U Middletown http ...", "Thu Apr 18 23:53:30 ": "@fransongs @mrhpresents We NEVER use 65 towels at a show. 9 singers so we ask for 20 total, 10 on stage &amp; 10 backstage.", "Fri Apr 05 13:02:10 ": "Comin 2 Europe soon. Apr 29-Vienna 30-Innsbruck May 1-Zurich  3-Copenhagen 4-Malmo, 6-Gothenburg, 8-Umea, 9-Uppsala, 10-Paris,  11-Coutances", "Sun Feb 10 19:40:38 ": "We r performing tonight, Sunday, in Cambridge Massachussetts at Sanders Theater at 8PM. Was supposed to be last... http://t.co/lmYzuEk2", "Wed Feb 13 21:16:25 ": "Hey Chicago area. 3 shows this weekend for u. Friday @ Old Town School of Music 7:30PM &amp; 10PM. Saturday nite in Elgin at Community College", "Thu Feb 21 10:55:39 ": "RT @aladdintheater: 3/8 - Check out South African acapella group @therealmambazo (also known as the chorus on Paul Simon's Graceland!!). ...", "Thu Apr 11 13:05:19 ": "Apr 29 in Vienna, Apr 30 Innsbruck, May 1 Zurich, 3-Copenhagen, 4-Malmo, 6-Goteborg, 8-Umea, 9-Uppsala, 10-Paris, 11-Coutances. Hope u come!", "Thu Apr 11 03:07:19 ": "Just announced our 1st show for Summer Tour....June 14 in San Francisco. Tix on sale... http://t.co/DpxrlEP59R", "Thu Apr 11 22:28:31 ": "RT @SFJAZZ: JUST ADDED!!! Ladysmith Black Mambazo has been added to San Francisco Jazz Festival. On sale now to @SFJAZZ Members http://t ...", "Tue Mar 05 15:12:41 ": "This week we r @ Rio Theatre, Santa Cruz Wednesday, Aladdin Theater Portland Friday, Shedd in Eugene Saturday &amp; Tower Theatre Bend Sunday", "Sat Feb 09 17:54:05 ": "@sarapascoe @ladycariad Actually we're trapped in Portland Maine USA blizzard w/ 2 feet of snow (see just tweeted pic). How bout delivery!", "Tue Feb 12 03:40:07 ": "We finally made it out of the Blizzard! Nite off in Middletown Ohio. Concert Tue in Frankfort Kentucky &amp; Wed in Middletown. Come 2 the show!", "Sun Feb 10 16:49:02 ": "@joeman4ever Sanders Theater", "Thu Apr 11 22:29:38 ": "RT @OttawaJazzScene: New #Ottawa #jazz series at Dominion-Chalmers: Mavis Staples, Sweet Honey in the Rock, Ladysmith Black Mamboza, Chu ...", "Sun Feb 10 16:49:50 ": "We hope to see many people at our show tonite in Cambridge Massachussetts. Sanders Theater at 8PM.  Tonight!!!", "Thu Apr 11 22:32:01 ": "@lizstrobel We hope u join us...in Real Life!", "Thu Apr 11 13:06:05 ": "June 14 we're in San Francisco. Get tix here\nhttp://t.co/6W21xW9tRW", "Fri Feb 08 18:41:01 ": "RT @CRASHarts: Due to the storm, Ladysmith Black Mambazo has been rescheduled to Sun., Feb. 10, 8pm, at Sanders Theatre! For tickets: ht ...", "Sat Feb 16 21:08:34 ": "RT @Seriouslive: http://t.co/x4ju4XlM Only 200 tickets available for @therealmambazo at @lsostlukes so grab yours now: http://t.co/aMSn4b7U", "Thu Apr 11 13:02:49 ": "Coming to Paris for 1st time in many yrs. May 10 at New Morning Club. Hope 2 c our French fans! Get tix here http://t.co/kUUNpcnJ0E", "Sun Feb 10 19:34:29 ": "@tristan_gold We'll b the Zulu guys in the lobby after the show saying \"Hi\", takin pics &amp; signing autographs. C u in Middletown!!", "Sat Feb 09 18:03:46 ": "Hoping everyone knows this already. Our Cambridge Mass show tonight is changed to Sunday night 8PM bcaus of Blizzard. C u all then!!", "Sat Feb 09 00:14:07 ": "Riding out this Blizzard near Portland Maine. Thankfully Portland Pizza Pie Company is open &amp; delivering. Here comes Pizza for dinner!", "Sun Feb 10 19:36:44 ": "Cambridge Massachussetts show tonite! 8PM. Sanders Theater. After 3 days of being trapped in Portland Maine its time to sing!!\nC u tonite", "Thu Feb 14 11:39:52 ": "@gabriellererra Glad to know!", "Thu Apr 11 02:57:04 ": "We will return to USA/Canada in June/July with a quick trip to London, England (St Luke's) on June 25.  London... http://t.co/aurtgt0hnr", "Wed Feb 13 13:12:32 ": "tonight in Middletown OH. Feb 15 Chicago, Feb 16 Elgin IL, Feb 17 Stoughton WI, Feb 19 Henderson KY, Feb 20 E. Lansing, MI Feb 22 Toronto", "Thu Apr 11 03:12:37 ": "We're comin 2 Paris France for 1st time in many years. Hope 2 c many fans at the New Morning Club...tix on sale here http://t.co/kUUNpcnJ0E", "Tue Feb 19 05:39:20 ": "RT @tourhendersonky: Tomorrow night at the Henderson Fine Arts Center: Ladysmith Black Mambazo...http://t.co/7nvcSkKF", "Tue Apr 16 03:20:10 ": "@lilottsdawg @anniesteib We'll definitely be there!", "Thu Apr 11 22:41:45 ": "@_Dalanda June 25 St Luke's in London. Tix on sale now and almost sold out!", "Mon Apr 15 23:44:55 ": "RT @acappellaSF: Event: Ladysmith Black Mambazo at SFJAZZ Center, Fri, Jun 14 8:00p: A South African institution, Lady Black Ma... http: ...", "Mon Apr 15 23:46:12 ": "@EllNewtofitfam She has very good clothing taste!", "Sat Feb 16 21:10:19 ": "RT @Hinsdale60521: @therealmambazo Ladysmith Black Mambazo performs at Monroe School in Hinsdale, Ill.! http://t.co/XCoHY9Rt", "Thu Apr 11 13:10:14 ": "Returning to Chicago area on June 19. Evanston, IL. Tix on sale here http://t.co/DxBeVmbiCL", "Thu Apr 11 02:59:22 ": "We are performing one show in UK this year, June 25, in London at St Luke's. Tix on sale now and it's a very small... http://t.co/wcMCFXm12J", "Wed Feb 13 02:15:14 ": "@808hays We would suggest starting with Shaka Zulu, which is the first after Graceland &amp; if that is enjoyed we'll recommend earlier.", "Thu Apr 11 22:33:55 ": "@sweeetcarol9 We hope to see you at the show!!", "Sun Feb 10 09:34:04 ": "RT @acappellaSF: Event: Ladysmith Black Mambazo at Kuumbwa Jazz Center, Wed, Mar 6 7:30p: Ladysmith Black Mambazo has a long hist... htt ...", "Tue Feb 12 03:38:07 ": "We have new Live CD, \"Singing For Peace Around The World\" for sale on iTunes, http://t.co/nMGkNOrq, http://t.co/UUcaznjd &amp; other websites", "Wed Apr 24 20:01:42 ": "Europe shows Apr 29 Vienna, 30 Innsbruck, May 1 Zurich, 3 Redovre Denmark, \n4 Malmo, 6 Goteborg, 8 Umea, 9 Uppsala, 10 Paris, 11 Coutances"}