{"Fri Mar 22 16:37:03 ": "New Deerhunter record coming soon! http://t.co/PwUILGrg02", "Thu Feb 28 20:59:03 ": "♫ Just Announced: Austin, TX - Mar 15 at The STAGE on 6th http://t.co/Ge79OWDjHX", "Sun Apr 14 05:09:03 ": "The code word has changed from \"Willie Nelson\" to \"Harmonica\" ... That is all... Enjoy your harmonica with friends...", "Mon Apr 01 19:46:31 ": "♫ Just Announced: St Louis, MO - Apr 27 at Off Broadway http://t.co/kw64UxONKg", "Sun Apr 14 17:40:13 ": "@offbroadwaystl we're a less is more kinda team... And if we were playing golf... We'd be winning...", "Mon Apr 01 03:59:30 ": "Nothing says Easter like close friends around me... http://t.co/xEDozcuvz8", "Thu Feb 28 16:08:04 ": "@pizzaparty43 @trapperschoepp I knew he'd come around:)", "Wed Apr 17 10:09:59 ": "Krunk at the airport again... But this time is sober up in Jamaica!!", "Tue Mar 05 17:22:17 ": "♫ Just Announced: Nashville, TN - Apr 26 at High Watt http://t.co/0DIIFH38MI", "Tue Mar 05 17:16:28 ": "♫ Just Announced: Davenport, IA - May 2 at Redstone Room at River Music Experience http://t.co/iWRZ8KOLAf", "Mon Feb 11 02:48:14 ": "@dawestheband I think cuz there is so much \"y\" that happens the whole show ya know... Does that makes sense? My Grammy ritual is kicking in.", "Thu Feb 28 05:02:20 ": "@hollywilliams1 you toss in Bob Dylan's \"Not Dark Yet\" and you got the perfect mix...", "Tue Apr 02 18:44:26 ": "♫ Just Announced: Norman, OK - Apr 13 at Memorial Union East Lawn at Oklahoma University http://t.co/ydISs2Ie1G", "Tue Mar 19 21:37:14 ": "No doubt the new Foxygen record is the best I've heard in a long time...", "Tue Mar 05 14:52:44 ": "My forehead is pealing on the airport bar... Just some tropical bullshit blues ....", "Mon Apr 15 15:11:08 ": "@BassmanZim haha you have time best  impression ... Beers next month when I'm home are tracking you down. Rumor has it I missed yer birthday", "Thu Feb 28 20:56:22 ": "♫ Just Announced: Austin, TX - Mar 14 at Billy Reid Store http://t.co/KUqCwyjrju", "Mon Apr 01 19:47:22 ": "♫ Just Announced: Appleton, WI - Apr 5 at Cranky Pat's http://t.co/5QK9mjcfyj", "Thu Feb 28 04:33:16 ": "@itslynnykansas @adrieldenae @norahjones thank you! Nice to play for ya!", "Mon Feb 25 01:59:18 ": "In Singapore waiting to watch Norah sing at the Oscars. Wishing I had Samuel Jackson's red velvet suit!", "Fri Feb 15 06:05:31 ": "@TropicaliJaye I just spit my wine out laughing...", "Thu Apr 11 21:28:16 ": "@nick_stroot @offbroadwaystl if we lose the series I gotta wear a band aid under my left eye like Nelly thanks to a bet. Worth seeing...", "Mon Apr 15 20:53:26 ": "Thoughts with you Boston...", "Sat Jan 26 16:20:04 ": "Having a look around Liverpool... Nice place...", "Mon Apr 01 19:47:58 ": "♫ Just Announced: Neenah, WI - Apr 6 at Cranky Pat's http://t.co/WKyDr0XwTB", "Sat Jan 19 20:02:56 ": "First time in Miami ... Hope there is a dance club in the airport.", "Thu Jan 24 19:46:34 ": "@singletrackroad @ccfest hopefully soon... Put I a good word!", "Tue Apr 16 19:50:39 ": "@shanenyman love that band...", "Thu Jan 24 16:32:41 ": "Im eating fish and chips like it was just invented... There may need to be an intervention. Last night in Bristol I found the best spot yet.", "Sun Jan 27 09:13:53 ": "We've missed you Dublin... Can't wait to see you tonight!", "Thu Apr 04 21:07:42 ": "Dropped into cranky pats to go over some fun for tomorrow... I already smell like whiskey regrets and the worlds best pizza...", "Mon Apr 01 00:08:57 ": "@KaitlinWalker1 @jmheiss you know that's a sign that we need to hit the town! Happy Easter to you both!", "Mon Mar 11 21:55:05 ": "RT @adrieldenae: #sxsw tour diary no. 1 http://t.co/LpFpTEpN7h", "Sat Feb 09 17:46:13 ": "Something great about listening to Lightnin' Hopkins while packing my bag to go...", "Wed Apr 03 18:19:24 ": "♫ Just Announced: Fargo, ND - May 4 at The Aquarium http://t.co/FRuXKfg0Xa", "Thu Apr 11 21:01:18 ": "Says it all... http://t.co/G6yVV4Al4x", "Mon Feb 04 20:30:38 ": "Really interested to hear Jim James on Jimmy Fallon tonight ... Got that feeling its going to be great...", "Thu Mar 28 18:25:56 ": "I've found that I'm capable of any type of behavior a person can be accused of... And that should help in understanding those I love.", "Thu Jan 24 19:21:55 ": "@FRabbits your music is really great my friends... Thanks for it!", "Sun Feb 03 22:31:31 ": "@melanyjoybeck yeah... Great planes .... Great flight attendants... Food was actually good... Damn.", "Thu Feb 28 20:57:44 ": "♫ Just Announced: Austin, TX - Mar 15 at Mohawk http://t.co/Umh2Q7nX0s", "Mon Feb 11 23:10:16 ": "Hey New Zealand ... You're nice to look at... http://t.co/0uHINhXJ", "Tue Mar 12 02:00:32 ": "@Deerflesh I need you to sign up for vine... Are on der yet?", "Thu Apr 04 16:44:00 ": "@KaitlinWalker1 I sure do... Ya got my number?", "Sat Apr 13 14:44:46 ": "Looking forward to our show with Iron and Wine tonight!", "Fri Feb 22 06:39:15 ": "@JasonIsbell can't wait to hear it!", "Sun Feb 17 13:56:06 ": "Overheard quote of the night: \"a smooth sea never made a skilled sailor\"...Tis true.", "Thu Jan 24 19:12:48 ": "@BBCRoddyHart thanks Roddy... Means a lot to us!", "Tue Feb 19 12:11:35 ": "Who's on the cover of Rolling Stone in the US? In Australia it's Nick Cave... And for once ... I'm happy about the cover I see...", "Sun Feb 03 21:50:38 ": "Aer Lingus ... New favorite airline...", "Sun Mar 03 15:53:36 ": "What part of Malaysian reggae doesn't sound fun? That's right no part... We doin' it!", "Tue Jan 15 19:23:12 ": "Hey Minnesota, Florida, United Kingdom , and Europe... Let's have some sleep overs. We'll bring guitars.", "Thu Feb 28 04:35:37 ": "Thank you Singapore... That was an amazing experience... Boarding up for Thailand!", "Mon Mar 11 21:52:26 ": "@beeebeck catch me if you can cabby... In a secret soiler ...", "Thu Mar 28 20:51:48 ": "RT @GCT_News: Video of our pals at @Billy_reid's shindig w/ @JasonIsbell, @CoryChisel, @Dawestheband @DadCountry and John McCauley !http ...", "Thu Jan 24 16:43:44 ": "@roddyhart may they last forever! Btw what's you radio show called? We wanna tune in!", "Thu Jan 24 16:30:56 ": "@calummcn great to meet you my friend!", "Thu Feb 14 01:16:51 ": "@TessPrendergast very welcome.. Wonderful place...", "Tue Mar 05 17:12:18 ": "♫ Just Announced: Chicago, IL - May 3 at City Winery http://t.co/RchYV7hZNy", "Tue Jan 22 16:10:33 ": "@roddyhart loved playing with you my friend ... Hope it will happen again soon... Love to play with ya in the states!", "Tue Mar 12 01:55:58 ": "When you get hungry for that prison meat sandwich ... Just say Subway.", "Thu Jan 31 14:31:54 ": "What does one do with three days in Amsterdam?....Hmmmm", "Sun Feb 10 00:06:43 ": "@Phillips I vote for \"The Harder They Come\" by Jimmy Cliff", "Wed Mar 13 23:08:41 ": "The oh sees are gonna be the show to beat at south by...", "Sat Feb 09 21:09:58 ": "Dear friends in northern states... I found all your birds... They are in my front yard. All if them.", "Thu Apr 11 20:49:31 ": "@johnhenryengine are we playing together at Off Broadway?", "Fri Feb 15 05:52:48 ": "I was going to have a kangaroo burger today... But as a rule I like to meet one before I eat one...", "Sun Mar 24 19:24:21 ": "@KaitlinWalker1 you watchin Indiana?", "Wed Mar 13 14:19:14 ": "@jnuhlane she finds it with her friends who are also here looking for coffee...", "Sat Mar 16 19:17:20 ": "@TheHollyWinter happy I picked the right set list:) thank you for listening ...", "Sat Feb 09 16:29:11 ": "Very moved by the beautiful work, and story of Ai Weiwei... Should watch \"Never Sorry\" free on Netflix...", "Mon Jan 14 03:06:33 ": "@GregJennings rumor has it you're a great bass player?", "Wed Apr 03 18:20:28 ": "♫ Playing Live: Fargo, ND - May 4 at The Aquarium http://t.co/P7DrqLXLWK", "Sat Mar 23 17:55:54 ": "I think it's dumb when people screen capture texts and post them on Instagram ... So I'm gonna bitch to twitter about it like an adult.", "Mon Apr 08 19:53:32 ": "@JustinTEarle you watching yer boys play my Brew Crew?", "Sat Apr 13 05:48:59 ": "@offbroadwaystl thanks for being awesome.", "Sun Mar 10 23:10:47 ": "Four words I will not be saying at south by southwest: Long. Island. Ice. Tea.", "Thu Feb 28 04:32:49 ": "@eydee08 happy you knew one of our songs! Hoped you liked the show!", "Fri Feb 01 18:26:27 ": "Amster- damage. http://t.co/5pcMkrH2", "Mon Apr 15 21:41:04 ": "@corychisel: The terror these hateful few want to leverage ...is overwhelmed by the fearlessness of those rushing to help their fellow man.", "Sat Mar 23 16:59:06 ": "@KevinWadeInge that's a nice thing to say... You write as well?", "Sun Mar 10 12:41:12 ": "@BassmanZim no doubt... Is this in question? I'll run home and set shit straight...", "Sat Mar 16 01:17:27 ": "@billy_reid thank you my friend ... Highlight of our trip!", "Fri Apr 05 21:00:54 ": "♫ Today: Neenah, WI - Apr 5 at Cranky Pat's http://t.co/g3FpRWKv1n", "Fri Feb 08 20:49:56 ": "@iamthomasbishop well we are keeping good company then!", "Fri Mar 15 02:29:25 ": "BBQ so good ya gotta take your bra off to eat it... At Willie Nelson's ranch... http://t.co/X41H56gMYg", "Thu Apr 11 20:13:08 ": "I like everything about St. Louis... Except the Cardinals...", "Sat Apr 06 21:00:05 ": "♫ Today: Neenah, WI - Apr 6 at Cranky Pat's http://t.co/iX78QR0mmP", "Thu Apr 04 17:22:44 ": "RT @MenatWorkTBS: The day has come...Men at Work returns for Season 2 TONIGHT at 10/9c! Where will you be tuning in from?", "Thu Feb 07 22:04:05 ": "On my way tonight to my first Nashville Predators game... Viva...", "Fri Feb 22 06:37:47 ": "Waited a long time to drink Adelaide wine while actually being in Adelaide, Australia. Satisfying.", "Tue Jan 29 16:50:32 ": "Yes I think we are going to like this pub very much! https://t.co/poNskPou", "Fri Mar 22 16:13:23 ": "Deep down I'm just an old man who loves strong coffee, and starting the day watching the weather and history channel. I'm good with that.", "Tue Mar 12 18:01:00 ": "Who's a guy gotta blackmail to see Nick Cave in Austin tonight?", "Mon Apr 15 20:46:55 ": "I can't even procrastinate on time.", "Thu Mar 21 16:34:17 ": "A full day at home with a stack of new records to listen through...", "Thu Jan 31 20:30:24 ": "Interrational Stuporstar...", "Sun Feb 10 00:10:51 ": "Tweets on a Plane.", "Thu Feb 28 20:55:17 ": "♫ Just Announced: Austin, TX - Mar 13 at Cedar Street Courtyard http://t.co/XPrmUj1XfV", "Fri Feb 08 04:38:05 ": "@lancepaine remember when the dolphin threw up all over our pork fries?"}