{"Sun Apr 07 11:44:11 ": "@domknight hope you're not paying too much for it becos it looks like an imposter...", "Wed Apr 03 06:40:25 ": "Great column from Sarah Wilson http://t.co/nts5IgcmtJ with a special message for PR people", "Wed Apr 03 01:15:04 ": "@poppygresson @jibuyabu thanks! went with echofon!", "Wed Mar 27 23:55:09 ": "Bondi to Bronte, autumn http://t.co/ujt75VeZ6o", "Wed Apr 17 00:51:30 ": "@leesawatego Hi Leesa... wondering if you can DM me with a contact number I can reach you on. Trying track down Suzette at Hymba Yumba. thks", "Tue Mar 26 00:59:46 ": "@brookejburns hey, thanks for beer suggestions on Sunday!! Will have to take my US visitor to Manly!", "Wed Apr 24 02:35:44 ": "@aunkoh haven't been for years: prob don't need to go to both with so little time...", "Sat Mar 30 05:36:11 ": "Road trip, Forbes, NSW, reflections, Easter Saturday http://t.co/E4Fqw9eRJR", "Thu Mar 21 10:34:15 ": "disturbing pics showing how we age ... http://t.co/DQivZD975J", "Fri Apr 05 09:49:45 ": "any tips... cheapest/best place online to buy skincare products etc????", "Sat Apr 13 23:10:15 ": "The wonderful @brainpickings looks at the wonderful Hitchens' new book, 'Mortality' http://t.co/Ix7LA2goMH", "Thu Apr 11 14:29:18 ": "RT @rivercottage: Launching an amazing competition on Monday to find a foodie star of the future to learn from the best at River Cottage ...", "Thu Mar 28 14:21:35 ": "RT @NeilMcMahon: TIME says it’s time, with two striking covers on same-sex marriage. The male cover…. http://t.co/TtmjnC19kx", "Tue Apr 09 02:34:39 ": "Toowoomba people: any recs for good-quality picture framers???", "Fri Apr 05 00:42:50 ": "Counting the cost of bad food on a road trip through the NSW countryside http://t.co/d6WKL4cc89", "Sat Mar 23 03:03:28 ": "@Colvinius wonderful wonderful to see you back here! Hope the hospital food's not too ghastly and the bedside manners fetching!!", "Mon Apr 01 04:54:20 ": "Road trip, following the ocean home, north of the Gong http://t.co/S9cobLnf4X", "Tue Apr 23 06:34:50 ": "@crgentle ah... thanks!", "Sun Apr 14 06:01:43 ": "@jibuyabu probably ... But if you could see the pile of similar I've found!!", "Tue Mar 26 08:32:58 ": "Now trying to find videos of multi-coloured poultry and PAL dog show ... he's starting to play show-tunes from \"State Fair\" ... help!", "Thu Apr 11 23:15:01 ": "@ErikOJensen or a culture that's deeply unfashionable", "Tue Apr 02 06:33:03 ": "@thehound2 interesting... thanks.... other insights to share????", "Mon Mar 25 21:29:43 ": "RT @kymelphinstone: Three sets of identical twins will perform Damien Hirst's work in #13rooms this April for Kaldor Public Art... http: ...", "Tue Apr 23 03:08:46 ": "A wonderful Guardian piece celebrating awesome women http://t.co/nuqELsiUXt", "Tue Apr 02 10:46:23 ": "Giving up on hopeless crashing tweetdeck for iPhone app .... What is the best alternative?? Suggestions appreciated", "Wed Apr 24 00:57:00 ": "Thanks for tips yesterday re yr fave fast food genres... still crowdsourcing here for @DailyLifeAu What are your top 3 fast food picks?", "Thu Mar 21 07:41:01 ": "RT @walkleys: Tonight's #walkley media talk is just about to begin. Women changing media in a changing world. Join in the conversation u ...", "Wed Mar 27 12:23:29 ": "@nadinevoncohen you too huh?", "Thu Mar 21 10:29:39 ": "@ottolenghi Waiting anxiously for delivery of 'Plenty' to my mailbox...", "Wed Apr 03 01:14:18 ": "@KenBurgin thanks Ken!", "Thu Mar 21 09:29:39 ": "RT @mbachelard: Re Rudd: \"Such unctuousness has rarely been uttered, even in the political greasepit\" says @tonyowright http://t.co/ympa ...", "Tue Mar 26 03:15:25 ": "help...anyone... looking for decent Easter Sat night accommodation in the Southern Highlands....yes, I leave things until the last minute...", "Fri Mar 22 03:22:29 ": "@kkomadina glad you enjoyed!S", "Tue Apr 02 06:22:49 ": "Tough one, but if willing to share stories of yr experience with loneliness, pls email stephanie.wood@fairfaxmedia.com.au (confidential)", "Wed Apr 24 02:32:42 ": "@aunkoh Hire car, drive an hour north of city, visit Australia Zoo... the late Steve Irwin's zoo? Or take them to the \"beach\" at Southbank.", "Tue Mar 26 00:59:11 ": "@danivalent I'm not a convert, quite yet...really needed a bit more time with the contraption!", "Fri Apr 12 15:20:24 ": "RT @HuffingtonPost: Swedish officially introduces gender-neutral pronoun http://t.co/KomglWBGR3", "Wed Apr 24 02:33:45 ": "@aunkoh People talk about Esquire http://t.co/9Z0dJTOSN1", "Sun Apr 21 23:58:00 ": "Call yourself a food geek? Looks like this might be the book of the year for you ... http://t.co/ojTyimtGkI", "Thu Apr 04 23:56:53 ": "Sydneysiders... learn to make ricotta, labneh and yoghurt http://t.co/xLfrKNEw2u", "Tue Mar 26 04:07:57 ": "@NakedNed um, no, alas, not much of a swag person!!!", "Tue Apr 23 06:26:57 ": "@crgentle hmm.. interesting, thanks Chris! Do you mind if I ask where home is? Where do you go for your Chinese?", "Wed Apr 17 10:54:56 ": "RT @GreenJ: Black Caviar proving that even in today’s world, a mare just can’t have it all.", "Tue Apr 23 06:17:50 ": "An attempt at crowdsourcing my @dailylife column ... what are your top 3 takeaway meal options?", "Sun Apr 14 06:46:44 ": "@lizeganchef thinking of having a vintagey garage sale ... framing a couple... no bloody idea!", "Sun Mar 24 21:30:33 ": "the greatest gift ... @Colvinius on his new kidney — and on his new kidney's Twitter account http://t.co/dRXGrE7L9B", "Fri Apr 05 02:38:00 ": "RT @kimseverson: A while back I cooked and ate with Roger Ebert, who couldn't talk or eat. But the guy loved food. http://t.co/y5aWXdMBxS", "Sat Mar 30 01:29:34 ": "Forbes, NSW, road trip http://t.co/5aMrhpXQkL", "Sat Mar 30 05:30:04 ": "Road trip, no meat today, settlement between Forbes and Cowra http://t.co/qpw0ddi7Ow", "Tue Apr 23 06:19:20 ": "@stellaorbit kind of meals! in general terms rather than specific places", "Thu Mar 21 23:45:06 ": "@HartsyardNaomi glad you like!X", "Fri Apr 05 10:11:53 ": "@BrookeESimmons mainstream brands....", "Sat Mar 30 23:26:44 ": "Road trip, Berrima cemetery http://t.co/TcneAGnllJ", "Thu Mar 21 23:24:53 ": "RT @merivalechefs: Grilled scallops, shaved fennel, zucchini flower, truffle and rocket with dandelion pistou on the menu at est. today  ...", "Mon Apr 01 23:51:50 ": "This doco looks fabulous: http://t.co/oexRVBTjYr Says Isabella  Rossellini: I don't get invited to the A-list parties anymore", "Thu Mar 21 23:11:11 ": "RT @Colvinius: I'm about to get the gift of a new kidney. http://t.co/x1VNnwwckM", "Fri Mar 22 05:34:02 ": "RT @sallysaraABC: Mark Colvin's kidney surgery has gone well.  @colvinius", "Tue Mar 26 08:24:53 ": "Just showed American house guest video of Easter Show woodchopping. His rejoinder? A video of the hog-calling contest at the Iowa State Fair", "Fri Mar 22 03:37:56 ": "@EatingAsia I wonder sometimes if the mistake is just being there!!", "Sun Apr 14 05:14:28 ": "Packing up the family home 5: Discovering my Grandmother and Great Aunt's collection of linen. http://t.co/YGzA7LPju2", "Tue Mar 26 01:00:41 ": "@mbhoffman re Little Creatures (sunday tweet)...it's made in W.A. I was sad to discover!", "Sat Mar 30 05:37:34 ": "@troubleholic thank you so much!", "Fri Apr 05 23:26:54 ": "Is this the fridge of the future? http://t.co/BxLm6mB7Uv Something moulding, something dead, something alcoholic...", "Thu Mar 21 07:28:48 ": "RT @crgentle: Portfolio confusion: Minister for the Arts responds to media pressure for more Australian drama on TV by calling for a #spill", "Sun Apr 14 10:45:39 ": "RT @nytimesworld: The Saturday Profile: Chopper Read, Australia’s Brand Name for Ferocity Is Softened by Illness http://t.co/gUcZ8qdm2u", "Sat Mar 30 05:15:14 ": "A tribute to my grandfather http://t.co/I7u7qSgDXt", "Sun Apr 07 11:45:58 ": "@SCGWalker thank you!", "Wed Apr 24 02:47:59 ": "@aunkoh I love Wasabi in Noosa: mainly for sashimi and sushi... set menu disappointed last visit", "Fri Mar 22 03:35:23 ": "RT @EatingAsia: Yes, please! &gt; @ottolenghi tells where to eat in Jerusalem http://t.co/1JAMpWRqpk", "Wed Apr 17 01:02:34 ": "Packing up the family home no. 167: Have catalogued 600+ of my Dad's books in the past day. Wish I had… http://t.co/CIDKln6H3S", "Thu Mar 21 07:28:09 ": "RT @farrm51: Kevin Rudd flinches, supporters pay the price. http://t.co/M5Z1zTUEue", "Fri Mar 22 02:27:38 ": "RT @RidingShotgunLA: Food writers: I love ya but PLEASE stop using ethnic.\nI don't call you that.\nWe are all human, different cultures.\n ...", "Thu Mar 21 23:10:52 ": "@Colvinius oh wow! May you be striding the streets with vigour and a glow the soonest!xx", "Thu Mar 21 10:28:41 ": "New word to know: to be Brooklynized ... http://t.co/Y4d3Mh1vOP 'the exportation of these culture-pages clichés to fresh landmasses'", "Sat Mar 30 09:15:47 ": "Road trip, the Dish, Parkes, it's there, just look, in the background ... http://t.co/I0XlPJEGLS", "Mon Apr 01 08:37:03 ": "@troubleholic thanks!", "Sat Mar 30 09:12:17 ": "Road trip, meeting the locals, Bowral Grand hotel http://t.co/dtNJs3ZAlp", "Mon Apr 01 08:35:53 ": "@psephy thanks Donna... I'm glad I was able to tell the story finally!", "Thu Apr 11 22:48:52 ": "RT @annabelcrabb: Herald Sun reports Hird took Melanotan II, which can function as a \"tanning agent and aphrodisiac\". Surely ASADA must  ...", "Sat Apr 13 18:06:21 ": "RT @j_freedland: Joan Collins modelled Alexis Carrington on Margaret Thatcher, she just told @BBCRadio4's Loose Ends", "Fri Apr 12 15:29:18 ": "RT @secularbloke: THIS WEEK\n\nRELIGION: Saudi Imam rapes 5 yr daughter due to doubting her virginity\n\nSCIENCE: New method for mapping bra ...", "Wed Apr 03 01:13:44 ": "@SamdeBrito Hi Sam, hoping you might be able to email me (stephanie.wood@fairfaxmedia.com.au) re article I'm working on...", "Sat Apr 06 00:14:40 ": "@Elizru thanks! Yes, nothing wrong with solitude!", "Wed Apr 03 23:08:04 ": "Is this the future of the fast food industry? http://t.co/cCEtCVo2cF 'vegetarian-friendly, sustainable and even humane'", "Sat Mar 30 05:37:14 ": "@LyndaNewnam thanks Lynda ... Didn't realise that!", "Tue Apr 02 06:20:21 ": "@andrewfaith WTF!?", "Mon Mar 25 21:35:37 ": "Head cold. Crap, crap, crap.", "Mon Apr 01 00:33:48 ": "Road trip, resumed, Seven Mile Beach, NSW South Coast, a little sad and washed out, but I swam http://t.co/46hEP2c7v9", "Fri Apr 05 08:13:25 ": "So, so sad... http://t.co/NUx7SB0nUI 'extreme portraits of plastic surgery'", "Thu Mar 21 08:26:51 ": "RT @mifblip: RT @clementine_ford: Here's the #JohnLaws segment where he asks victim of childhood sexual abuse if it was her fault: http: ...", "Fri Apr 12 22:44:27 ": "Restaurateur snaps at 'back-stabbing food and restaurant community' http://t.co/LnoYgnguMC", "Wed Apr 03 05:10:15 ": "'Gwynethian, a particular state of lovely obliviousness, a well-intentioned froth http://t.co/WE8Vr2YHJl Paltrow cookbook goes to No.1", "Fri Mar 22 03:43:27 ": "RT @amandapalmer: BRISBANE, SYDNEY, MELBOURNE, PERTH, ADELAIDE, WELLINGTON, AUCKLAND!!! the GTO is coming. september. tickets: http://t. ...", "Thu Apr 18 23:23:23 ": "RT @sallysaraABC: Down at Bondi Beach with mate from Afghanistan, who has never seen the ocean before. Magic.", "Tue Apr 16 01:11:07 ": "Packing up the family home 102: The boozing gene... I've discovered it's origins ... My grandfather's… http://t.co/oaFyCEbvfB", "Wed Apr 03 06:04:30 ": "RT @MattCowgill: Here's a handy cut-out-and-keep guide for any Daily Tele journalists on here: http://t.co/ReGlQf3n7S", "Sun Mar 24 01:12:47 ": "hey, creative types..how do you think your creativity developed? do you think boredom played a part?", "Sun Mar 24 06:52:09 ": "Suggestions please: best NSW beer for American visitor???", "Mon Apr 01 08:36:42 ": "@theoceanharvest thanks!", "Sun Mar 24 21:19:40 ": "Fascinating piece explaining the Ben Zygier story http://t.co/bihuoqrpDX 'the most serious security breaches in Israeli history'"}