{"Mon Apr 01 16:41:57 ": "My bad @alannarizzo, didn't see you in the fan cave!!  Hope it's warmer in the cave then studio 3!  Go Roxs!! @MattYallofMLB @LaurenShehadi", "Tue Apr 02 20:20:19 ": "RT @SeverinoMLB: “He’s got 99 problems but a Boras ain’t one.” #CanoMockHeadlines", "Wed Apr 03 12:59:57 ": "Does anyone really believe the Rangers will be the only team flirting with a perfect game against the Astros this season?", "Fri Apr 12 04:45:05 ": "@rayrynofan @jonmorosi saw that but 3-2 count in a 1 run game. He's not trying to hit him in that situation. Quentin dives in on pitches.", "Fri Apr 19 16:35:30 ": "I hope those same people who were pissed at the President for interrupting \"The Price is Right\" yesterday are... http://t.co/D09HmnLoBd", "Fri Apr 12 14:37:31 ": "Doing the Rundown show today at 2 et on MLB Network.", "Fri Apr 12 03:48:41 ": "@vegavieques thanks for watching!  Crazy fun!!", "Fri Apr 12 04:35:01 ": "Violence is not the answer!!  Lol", "Sun Apr 07 14:36:12 ": "@mcadam_pat haha, this is true!!  Be back this week on air!!  Thanks for the love!  Yes we have shorts and t-shirts on this morning.", "Fri Apr 12 18:16:26 ": "On the Rundown!! http://t.co/vJhvbM5bN6", "Mon Apr 15 00:05:17 ": "Congrats , Adam Scott!!  Great Masters Tournament.", "Tue Apr 02 23:38:37 ": "@jonmorosi game #2?? Either they got the ultimate plan or something ain't right!!  Lol", "Fri Apr 12 05:00:33 ": "BTW, Doc Ellis is the only pitcher I've heard of that hit the first batter of the game on purpose. He also hit the next 4 as well!  Lol", "Tue Apr 02 23:35:36 ": "@BoRosny sure, what's the question?", "Thu Apr 11 13:22:59 ": "@BNightengale I've been saying it for years!!  Boras is right, until baseball helps with college scholarships the point is useless.", "Fri Apr 19 00:17:49 ": "@FeinsandNYDN I'm not questioning, just want half!!  Lol", "Fri Apr 19 00:40:08 ": "@Breezy_Gal :-)", "Sat Apr 06 22:00:20 ": "Okay, after a big win this morning by my brew crew, doing outdoor pizza while watching NCAA national semi final games!!", "Wed Apr 03 22:24:57 ": "@mleone02 Michael, great point but u can't base the Rangers pitching staff off an Astros 25 million dollar payroll team, can you???", "Wed Apr 03 02:54:15 ": "@PattiSmithFSSW now that I'm on my own, not sure if Darvish can do it!!  Patti sold out for the man!!  LOL", "Tue Apr 16 17:55:02 ": "At the Apple store needing help with my MacBook. This place is always pack!! http://t.co/BXyroQtonG", "Fri Apr 05 13:49:12 ": "@CoopsGolf @socialeragolf being greedy will get you no where!!!  Lol", "Tue Apr 02 23:24:38 ": "Heading to Astros/Rangers game. Can the Stros go for win #2??", "Fri Apr 12 17:52:42 ": "The Rundown@2et http://t.co/vrbXiHcEYr", "Sun Apr 14 01:33:33 ": "@MLBNetwork @SeverinoMLB on at the end of Royals/Blue Jays game. http://t.co/PJ3BrnC3a7", "Fri Apr 12 04:28:31 ": "Why would Carlos Quentin think that Greinke hit himwith a 3-2 pitch?  Almost as stupid as when Pedro was charged during a perfect game!", "Wed Apr 17 00:18:17 ": "Rain delay theater with @SamRyanMLB   Check her out giving the knowledge!!", "Fri Apr 12 04:30:43 ": "@rayrynofan Quentin's been hurt the last couple of years so don't think that's an issue.", "Wed Apr 03 13:14:49 ": "@JoeBHousson absolutely!!  Played with him my freshman year!", "Mon Apr 01 16:35:58 ": "Checking out the Rundown show with @MattYallofMLB &amp; @LaurenShehadi. Great job guys!!", "Wed Apr 10 17:12:04 ": "Flying to NYC tomorrow for MLB Tonight!  Still working on new followers on twitter!  Keep them coming!!", "Sun Apr 07 14:13:58 ": "Breakfast at Sunrise Taquitos!!  Best breakfast tacos in Houston!! http://t.co/KkBFJ6Brtt", "Mon Apr 08 18:35:04 ": "@BrewersBeat @brewernation @mlbnetwork $100??  Dude, no way!!  Gotta keep saying off the wall stuff on MLB Tonight and get that card up! Lol", "Sun Apr 14 10:57:08 ": "@MLBNetwork Heading back to H-town this morning after a great few days at the Network. Thanks guys!!", "Sun Apr 07 15:09:34 ": "@crownjameson5 thanks for the love CJ5!  Miss my days in the Bay Area  always enjoy going back!!  Go Giants!", "Fri Apr 12 15:16:15 ": "@dmlitzau @ekshow David it has been part of every sport that's played so don't deny it doesn't happen.", "Wed Apr 17 14:03:56 ": "@Breezy_Gal Chloe, thanks for the love!!  Ive never been referred to as mofo in such a cool way!!  Lol", "Mon Apr 08 18:22:59 ": "Over 700 followers!!  I'm moving up!  Lol", "Wed Apr 03 01:53:34 ": "@mcadam_pat hadn't thrown a lot of pitches so I say yes!!", "Thu Apr 18 20:41:47 ": "Minnie Me!! http://t.co/mUZRHvWd2y", "Sat Apr 13 20:53:01 ": "@scottbraunmlb on with Larry Bowa and Scott Braun for MLB Tonight at the top of the hour. http://t.co/IVZeFP9954", "Thu Apr 18 03:41:34 ": "@HeidiWatney @HeidiWatney HaHa, we only come out at night!!  Have a great show!!", "Fri Apr 12 04:53:25 ": "This is why I never charged the mound. @MLBNetwork has every angle imaginable on the brawl!  Beat down from 10 different angles! Lol", "Sat Apr 20 14:25:47 ": "Why do kids always get the drink that's red?? http://t.co/N9QVpIGHCD", "Mon Apr 01 18:02:51 ": "I guess I was right about Bryce Harper this season!  So far!!  Lol", "Thu Apr 04 19:55:55 ": "@SeverinoMLB now that's funny!!", "Fri Apr 12 04:39:56 ": "@TheBrakeDown ask Paul Wilson!!!", "Thu Apr 11 13:41:07 ": "@fran_charles heading back today!  It's all about the wardrobe!! Lol. Round 2! http://t.co/aElJ7sBWad", "Fri Apr 19 00:39:54 ": "@sharpes84 this is so true!!", "Wed Apr 03 02:34:04 ": "@Ken_Rosenthal @mlbnetwork some people have left the game during a perfect game!!", "Thu Apr 18 03:13:02 ": "Great night of baseball!  Join @HeidiWatney at 1am for Quickpitch. I should be getting out around that time! Lol", "Sat Apr 20 14:01:06 ": "Brew crew getting ready this morning!! http://t.co/3bKjy1OP04", "Wed Apr 03 03:04:27 ": "@PattiSmithFSSW blame Patti folks, you never leave your spot during a perfect game!!  Haha", "Fri Apr 19 00:32:51 ": "It's all about the Who dat? Nation!!  Big come back year for the Saints, unless the league wants to punish us for a 1978 incident....", "Tue Apr 02 14:17:38 ": "Does anyone out there really think Kershaw won't be the next big deal signed?", "Wed Apr 03 00:43:23 ": "@TheCleanUpSpot why sit him on the second game of the season unless something is wrong!!", "Mon Apr 08 18:50:59 ": "@BrewerNation @MLBNetwork Thanks BrewerNation!!", "Wed Apr 03 21:40:12 ": "Okay Astros fans. No runs in last 2 games against a Rangers pitching staff that's not better then any other team in AL west. No good!  :-(", "Fri Apr 19 00:18:49 ": "@alannarizzo forget the Broncos, Who dat??", "Tue Apr 02 23:37:13 ": "@Seth_Everett depends what's in it!!  Got a feeling it will have to be strong for me to get on the bandwagon. Lol", "Wed Apr 03 02:18:06 ": "@PattiSmithFSSW we are still here watching the perfect game. Been waiting to leave since the 1st inning!!  Lol", "Thu Apr 11 17:36:47 ": "@alexwagner haha! Love it!!", "Fri Apr 12 01:47:46 ": "@scottiehutch @mlbnetwork thanks Scott, trying to represent!!  Lol", "Fri Apr 19 20:33:19 ": "Julian after school looking very smart!! http://t.co/crrsVLCnNW", "Fri Apr 12 14:30:26 ": "@dmlitzau @ekshow what do u considered reckless?  This happened during a game not outside on the streets.", "Mon Apr 08 18:50:12 ": "@BrewersBeat Haha, with what they are paying now??  Sure I would love a comeback!!  Lol", "Thu Apr 11 21:13:55 ": "On at the top of the hour with @SeverinoMLB &amp; @JonHeymanCBS on MLB tonight!!", "Wed Apr 17 01:15:08 ": "@HeidiWatney @samryanmlb absolutely right my vampire friend!!  Lol", "Fri Apr 12 04:33:19 ": "@flash17yes @mattcasey9 true dat guys, thinking another situation. Still why would guys who dive get pissed when they get hit?", "Tue Apr 02 19:05:26 ": "check out http://t.co/b0U4b4okTc to find out you favorite athlete's info http://t.co/6cuK68PaEx", "Wed Apr 03 00:40:04 ": "Why is Yu Darvish pitching out of the stretch with no one on base?  It's hard to watch!!", "Fri Apr 12 04:34:11 ": "@TheBrakeDown don't think he would charge that dude!  I wouldn't!!  Lol", "Wed Apr 03 21:52:14 ": "@bwilliamson22 true dat!  I complain about him pitching out of the stretch last night the whole game but it worked. Back to his day in Japan", "Fri Apr 19 00:35:33 ": "@brianharter and out come the haters!!!", "Wed Apr 03 21:45:40 ": "@bwilliamson22 no way hating on Rangers!  Was at the game last night!  Didn't think 1 Astros player had a chance.", "Fri Apr 12 03:39:10 ": "I posted a new photo to Facebook http://t.co/UDLbS0wmNv", "Thu Apr 18 20:23:10 ": "Picked up my Minnie me son an it's funny hearing a tough day for a 10 year old!  The girls cheated in kick ball, how will he survive!!  Lol", "Fri Apr 05 13:46:06 ": "@CoopsGolf @socialeragolf nope, hadn't heard from him. Hope your doing well!", "Wed Apr 03 13:12:23 ": "@JoeBHousson was seating with @PattiSmithFSSW so she was talking my ear off!  Didn't see much of the game!  LOL", "Fri Apr 12 13:33:06 ": "@RodneyH42 haha, classic!!", "Fri Apr 12 13:10:24 ": "Guilty pleasure here in New York. Maury Povich!!  Funny as hell! Don't these guys know the deal when they go on??  Lol", "Sun Apr 07 18:35:54 ": "@alannarizzo wow, nice living room Alanna!! your the ultimate guys girl!!  Lol", "Sun Apr 21 12:18:37 ": "Morning at Whispering Pines Golf Club Trinity Tx http://t.co/kdiEriFzeX", "Sun Apr 14 16:30:50 ": "I posted a new photo to Facebook http://t.co/NNCTZfJSHO", "Fri Apr 19 00:36:20 ": "@FeinsandNYDN right on Mark!!  I'll forward this to the MLB Network!!  Lol", "Tue Apr 16 23:37:08 ": "Class act Yanks! (Never thought I would say that!) http://t.co/5n6bpESM4C", "Wed Apr 03 13:33:45 ": "@JimmieLeeS I'm just a country boy living in the big city!!  Lol", "Wed Apr 03 02:28:42 ": "@JimmieLeeS yep, been doing it since first pitch of the game. I just can't think he's gonna do it!!", "Tue Apr 02 23:36:12 ": "@LaSportsHall looking forward to it!", "Fri Apr 12 16:06:54 ": "@dmlitzau @ekshow fights happen all the time, can't change views now because someone got hurt. Dodger players have charged mound before.", "Thu Apr 11 21:52:57 ": "10 minutes till go time!! http://t.co/nFamL1P1zA", "Wed Apr 03 02:41:55 ": "Oh my god!!  Ankiel was the best chance for a hit!!  Darvish has 108 pitches but looks strong!", "Fri Apr 12 13:48:01 ": "When will men realize never bring your Mommy to Maury Povich for a paternity case. It always ends badly!  Lol", "Wed Apr 17 01:23:28 ": "@SamRyanMLB @heidiwatney inside joke Sam, she only comes out at 1am for Quickpitch!!  Lol", "Wed Apr 03 01:51:40 ": "I'm waiting to leave the game but Darvish has no-no going. Can't leave yet!!  Lol", "Sat Apr 13 04:16:31 ": "@mattcasey9 @flash17yes thanks, not loosing my mind with old age. I knew it was a perfect game somewhere when he charged!!", "Mon Apr 01 15:56:05 ": "@Bleacherdave believe it!!", "Sun Apr 07 23:27:36 ": "Baseball yesterday basketball today!! http://t.co/rm9Nfjfm78", "Fri Apr 12 01:54:11 ": "@SeverinoMLB, @JonHeymanCBS had fun tonight! First show with Jon answering his question then the other way around! http://t.co/TdwwGyY9RO", "Wed Apr 03 02:50:53 ": "7th-8th&amp;9th in the batting order for the Astros in the 9th inning. Wanted to pull a JLS but can't because of perfect game!  LOL"}