{"Thu Mar 28 15:58:44 ": "If you haven't already, pick up 'Anthems' by Anthrax! It's awesome and a lot of fun!! My boys kicked ass!", "Sat Apr 20 04:33:39 ": "@LouBrutus DAMN good photo, Lou!", "Thu Apr 04 16:46:07 ": "@Scott_Ian yeah, but you WERE a Pinkerton and a zombie. You'd just be showing off haha.", "Thu Mar 07 23:46:01 ": "@_burnt0ut hello!", "Thu Mar 07 23:41:53 ": "@DenBlackmore uhhh... You use caps really nicely.", "Mon Apr 08 19:10:50 ": "Tomorrow, my story is concluded. Thank you to everyone who has visited the House of Gold &amp; Bones. Enjoy... #happybirthdaypauly #missyou", "Tue Mar 12 00:55:08 ": "Anyone else ever sometimes crave some KICKASS Huey Lewis? No? Uhhhh... Yeah, yeah, me... Me neither. #fuckit #totalHueyfan", "Fri Mar 29 21:54:27 ": "RT @charlabrown: @CoreyTaylorRock: 2 bxs taco rice- 2 lbs. brgr and taco mix- bg of shredded cheese taco blend- pan, cook- add Philly cr ...", "Fri Mar 29 21:27:59 ": "In addition to my many strange accomplishments, I can now add this: I have created a SUPERIOR taco dip. And addictive- can't stop eating...", "Sun Apr 14 04:00:34 ": "My friend Chi passed away. My heart goes out to his family, and to my friends in @deftones. This is indeed a sad day...", "Tue Apr 02 19:24:01 ": "Happy Stone Sour Month.\n\nhttp://t.co/GlrnUl3CMg", "Tue Mar 12 01:01:40 ": "Hahaha!! SO glad I'm not alone in my Huey worship! Fun Fact: I did a cover of 'Heart of Rock n Roll' with the DumFux years ago. #totesjam", "Fri Apr 05 20:13:37 ": "Have you checked out the trailer for the HoGaB Comic Book yet? - http://t.co/BzhBH3dL3W", "Tue Mar 12 01:41:18 ": "@Benem0th ooh. Good question. Aston Martin DB-5 with ejection seat.", "Wed Mar 20 19:38:56 ": "20 DAYS UNTIL HOUSE OF GOLD AND BONES PT 2! #HoGaBcountdown #thestoryends (well, in the US anyway)", "Wed Apr 17 04:58:02 ": "God DAMN, Charlotte! Amazing fucking show. Thank you for having us! Roll on: ATLANTA! #HoGaBcontinues", "Thu Mar 07 23:03:25 ": "@BellaCria you'll be fine.", "Thu Mar 07 23:45:04 ": "@LesleyRoseG @chris24w8 well played, captain. Okay woman- CALM DOWN haha...", "Thu Mar 07 23:40:39 ": "@TaylorLouiseBvB no, I saw this one.", "Thu Apr 04 16:32:30 ": "Had an epiphany today. I realized, to my chagrin... I'll never be asked to play Abraham Lincoln, in anything. *sigh* #shortandIrish", "Tue Mar 12 01:22:46 ": "@KotowDave ...maybe...", "Sat Mar 16 17:24:08 ": "Home from SXSW. Sick as a dog. My country for a nice cold pillow. More later.", "Fri Mar 22 21:00:30 ": "Finished #4's script for the HoGaB comic! Now that it's done, I have nothing to focus on. Maybe the HoGaB movie scripts? SK lyrics? #both", "Fri Apr 05 00:04:10 ": "“@HoganFearsRyder: @CoreyTaylorRock ALRIGHT 8, WHO YOU GOT ON SUNDAY? PUNK OR TAKER?!”\n\nThe Fix Is In and The Streak Continues.", "Thu Apr 18 17:03:51 ": "Nostril Waxing.\n\nHmmmmm...", "Thu Mar 07 23:04:24 ": "@barfolishus yeah, but tweesh sounds grossest.", "Tue Mar 12 01:25:31 ": "@NatHatch ...no...?", "Thu Apr 04 16:41:36 ": "@sparkly_spike haha you SHOULD!", "Thu Mar 07 23:32:26 ": "@RU48666 hahaha for fuck sake... I was wasted, at a club we used to play.", "Sun Apr 21 19:40:31 ": "RT @LouBrutus: @CoreyTaylorRock \"'RAGE AND BLOW, YE CATARACTS AND HURRICANOES!' King Lear. Always wanted to say it.\" ~ Jesse Custer - The P…", "Mon Mar 11 14:29:09 ": "When http://t.co/dv2waeYnR7 uses 'rock n roll', 'rockin' out' or 'heavy metal' in songs that are clearly not these things he should be sued.", "Tue Mar 12 01:31:13 ": "@papabear7411 ...I'm Ron Burgundy...?", "Fri Mar 29 21:59:48 ": "@HarriedWizard no worries, man. I'll bring some the next time I'm on Chicago.", "Tue Mar 12 01:19:52 ": "OK, shameless promo: HoGaB pt 2 out Apr 9, HoGaB comic #1 out Apr 17 AND new book 'A Funny Thing Happened On The Way To Heaven' out in June.", "Fri Apr 05 22:37:05 ": "Picked up 'Dancing on the Grave of a Son of a Bitch' by Diane Wakoski today. If you like poetry, I URGE you to read it. Amazing.", "Sat Mar 23 19:53:04 ": "Someday, I hope to start a hipster indy band... so I can write songs for commercials too. #fuckingsarcasm #noshame #horseshit", "Fri Apr 12 20:36:58 ": "After much ado, the lyrics for HoGaB 2 are HERE!! \n\nhttp://t.co/vSAFga3Ri8", "Mon Apr 08 19:20:05 ": "Sorry- @devicetheband I'm still not great at this haha...", "Wed Apr 17 14:28:57 ": "Today is the day! The House of Gold and Bones comic is out! GET YOUR COPY NOW! http://t.co/xr47kG2ktN - Find a store: http://t.co/j94zv3jrGO", "Fri Apr 19 17:37:50 ": "Wherever you are in the world, if you want a physical copy of the #HoGaB comic book, you can order it here:\n\nhttp://t.co/zsDoSHll9M", "Wed Apr 03 19:33:45 ": "Sitting in Boston, right across from Fenway! Can't wait to see everyome tonight at House Of Blues!! #HoGaBcontinues", "Tue Mar 26 19:43:23 ": "RT @ChadCheifer: @CoreyTaylorRock Please RT the Slipknot for SNL Facebook Campaign. Endorsed by Roadrunner, Loudwire, and Clown. https:/ ...", "Thu Mar 07 23:00:03 ": "RT @axejay64: @CoreyTaylorRock I almost bought a Creed CD. Then I realized I should just buy toilet paper.", "Sun Apr 07 01:29:37 ": "Obviously, people didn't read my memo about spamming my timeline... Jesus wept...", "Fri Mar 29 21:52:27 ": "Note 2 those making Taylor Dip: cook the rice and meat separately first. Then blend in pan w/ shred cheese. Let cool, then add cream cheese.", "Tue Mar 12 01:38:46 ": "@Benem0th a fighting sea turtle. With a spear gun.", "Fri Mar 29 22:02:35 ": "RT @BobFleischer: @CoreyTaylorRock Couch Ass was my favorite wrestler from the 80s.", "Thu Apr 18 18:40:41 ": "For my boys in Papa Roach!\n\nhttp://t.co/fgbl7iKAur", "Sun Mar 31 19:26:54 ": "Happy Easter, everyone. Remember: this was a result of the Council of Nicea, so pagans and Christians- JOIN HANDS!!! You both get your way!", "Tue Apr 09 20:20:12 ": "@EvilLegoKnight duh...", "Mon Apr 08 19:30:17 ": "Thank you so much for the thoughts and concerns today. Me and The Nine appreciate all of it truly. Love you all.", "Thu Mar 07 23:02:50 ": "@Jordan_FF hahahahahahaha fair enough", "Tue Mar 12 01:27:08 ": "RT @aettredge1980: @CoreyTaylorRock http://t.co/7eZtpj7yc5", "Thu Apr 04 18:09:36 ": "RT @DenBlackmore: @CoreyTaylorRock I fucking love this!!! http://t.co/R3lvHF5VbX", "Tue Mar 12 01:36:07 ": "@RU48666 ooooooh yes... Hehehehhwhwhwhwh sorry, I was choking...", "Tue Mar 12 01:35:28 ": "@Sxvenfold it was Bumper Boner Monday. My apologies.", "Mon Mar 18 18:23:34 ": "This is kinda cool!\nhttp://t.co/5pdcEe2ugd", "Tue Mar 12 01:37:51 ": "@ladidadupy 'Preacher' by Garth Ennis. Hands down. All of em.", "Tue Apr 16 21:47:11 ": "RT @ispyCHELSIE: You know what would make for a fun QI episode? @CoreyTaylorRock, @twhiddleston and @daraobriain joining @AlanDavies1 an ...", "Fri Mar 29 22:04:53 ": "“@666shaun666: @CoreyTaylorRock and what tasty beverage do you recommend to go with the taylor dip?” http://t.co/Q4ZLzNjxi8", "Thu Apr 04 16:38:38 ": "Oh BTW: yes, the 2 albums combine to create a house. You need pt 1 &amp; 2, but the cases can be put together to make the House of Gold &amp; Bones.", "Fri Mar 29 21:50:20 ": "@robyneld i hate to correct you, but it's actually 18 inches. Plays hell buying shirts... FML", "Mon Apr 01 18:22:08 ": "More Countdowns! 8 days til HoGaB pt 2! 16 days til HoGaB comic issue 1!! April is STONE SOUR MONTH! #staytuned", "Wed Apr 17 04:46:09 ": "RT @bury_your_life: @CoreyTaylorRock @DisneyChannelPR  lol http://t.co/zNma4cspix", "Mon Apr 08 19:24:37 ": "RT @alliballi_b: Come to mamma! http://t.co/JBpZqthTCI", "Tue Mar 26 17:35:31 ": "It's always the days you want to be left alone that people inundate your doorstep. Fine, I'll put some pants on...", "Tue Mar 12 01:32:16 ": "@RU48666 more than likely. No getting out of that haha...", "Mon Apr 08 19:17:38 ": "Don't forget @DAVIDMDRAIMAN and @deviceband new album comes out tomorrow as well. Support our genre- support our music. #fuckthesystem", "Thu Apr 04 16:41:01 ": "“@rar358: @CoreyTaylorRock Well not with that attitude.”\nNot with ANY attitude!\n\n#friskydingo", "Mon Apr 08 19:31:20 ": "@SteveMoshes that's called a priapism and it COULD lead to ED. And no, it's awesome really.", "Fri Mar 29 22:08:22 ": "RT @Brookes1Joe: @CoreyTaylorRock think I could get a rt for this legend #rip #bestofalltime http://t.co/5C5OumcuET", "Tue Apr 02 19:01:08 ": "RT @WeAreStoneSour: ALBUM PREMIERE: Stream 'House of Gold &amp; Bones, Part 2' one week before its release here: http://t.co/iBpOJv3dMg. ...", "Fri Mar 29 21:46:23 ": "2 bxs taco rice- 2 lbs. brgr and taco mix- bg of shredded cheese taco blend- pan, cook- add Philly cream cheese (whole package)", "Wed Apr 17 04:56:07 ": "@Aubrie7fold @wearestonesour @adelitasway @therealspider1 well, I tried to crash mine, but the cops made that a BIT difficult...", "Thu Mar 28 19:11:06 ": "RT @MrChuckD: Anthrax taught us how to raise performance intensity beyond ALL.Speed energy power &amp; lyric.You really have to BRING it ...", "Tue Mar 12 01:23:25 ": "@themanzshow ...maybe...", "Fri Mar 08 17:25:41 ": "Just heard the creepiest version of 'Where Is My Mind' by Pixies on an episode of 'Criminal Minds'. On Xylophone. Jeez Louise...", "Sun Apr 07 17:18:03 ": "@fakeeddietrunk @thatmetalshow haha OH DON'T THINK I WON'T!!! I'll be there!!!", "Thu Mar 07 23:21:25 ": "@RU48666 hahahahaha! Yeah, I was 19. That's outside a Target store!", "Tue Mar 26 19:47:13 ": "@srichardd HAHAHAHA fuck, fair enough...", "Thu Mar 07 23:48:56 ": "@DaleA7X hmmmm... Dunno.", "Tue Mar 12 01:37:23 ": "@DaleA7X Deal! Wait...", "Tue Apr 09 18:47:49 ": "HAPPY HOGAB 2 (in US) DAY!!! Go forth, reek havoc on shops and iTunes! We'll see you LIVE in Wallingford, CT tonight! http://t.co/3CGxH89U9o", "Thu Mar 07 23:31:12 ": "@LesleyRoseG @chris24w8 oy! Go see your fucking girlfriend! What are you, dumb? Put the bottle down and get on it!", "Tue Apr 09 20:29:58 ": "Bizarre Sidenote: I SWEAR my eyebrows are getting bigger...", "Tue Mar 26 19:42:28 ": "After answering the door, realized I got the 1st edit of my new book. Glad I put pants on. 'A Funny Thing...'- out June in UK, July in US!", "Fri Mar 29 18:35:24 ": "Check out the House of Gold &amp; Bones comic book trailer here! http://t.co/93a4B3WJUP.", "Fri Apr 05 00:01:10 ": "@URACrumb abso fucking lutely.", "Fri Mar 29 21:58:32 ": "Side effects of Taylor Dip include: blood in your gas, total fuckin fatness, fingered tastebuds, happy face, and couch ass. Enjoy.", "Thu Apr 18 17:08:35 ": "@zipyrich that IS great news! Couldn't have done without you, man! Congrats indeed!", "Sat Apr 13 21:14:27 ": "Whoa! Woke up today with a blue checkmark! How the shit did THAT happen?! Well, it's official----&gt; #verified", "Tue Apr 02 15:46:42 ": "@HatingFrankie @carlito_martini that's not true. Who the fuck is carlito booze?", "Thu Apr 04 23:54:48 ": "@Dustin35311 Because. I. Can.", "Thu Apr 04 23:54:25 ": "RT @Dustin35311: @CoreyTaylorRock Hey Corey! you're overrated. How can you talk as much shit as you do on other artist then turn around  ...", "Thu Mar 07 23:31:46 ": "@PaigeTayl0rx hi!", "Sun Apr 21 20:10:17 ": "DALLAS!! We're back, baby!! See you all tonight, and I PROMISE I won't collapse again. Then again, if you're as crazy as last time... #HoGaB", "Wed Mar 27 17:11:51 ": "Looking forward to seeing everyone Apr 2 in Portland, ME for the start of the Road To Revolver Tour w/ In This Moment and Hell Or Highwater!", "Wed Mar 27 17:42:11 ": "The 'Do Me A Favor' video is out now! Watch the video premiere: http://t.co/j6dIOva9Y9.", "Sun Mar 31 19:36:47 ": "@ChadTaylor @dmcityview @zzzrecords @raygunshirts Whoa... I'm what?!?", "Fri Mar 29 22:09:13 ": "“@nach0ide: @CoreyTaylorRock Any good drink you recommend to go with taylor dip?” http://t.co/LreLcjHyIy"}