{"Sun Apr 21 10:11:32 ": "I'm sure the time sums up somewhere,  a bonus bank ..hmmm . You see it's not healthy travel alone. Taking with myself now..", "Fri Apr 19 18:32:25 ": "RT @yousefcircus: @SimonDunmore no way...?!  who?  booooo....  hate that shit. RA etc need to do a poll. its relentless...", "Fri Apr 19 18:37:16 ": "@marcusschossow @sebjak I find the glow stick, it was out of glow so did not see it first. Thanks for the help!", "Fri Apr 19 18:19:41 ": "@robinhosking yes I even use books and pay for media. I try to leave as its 1984.", "Tue Apr 23 07:13:52 ": "@stretchmc that's my new scifi script I'm working on.", "Tue Apr 16 20:42:43 ": "@andycaldwell send link only. Speak tomorrow. Rock on!", "Fri Apr 19 20:51:17 ": "@JoeyMassaLIVE or is it the iTunes effect ?", "Sat Apr 20 05:34:10 ": "Stockholm - Munich - Donetsk - Munich - Stockholm . Starts now.. Bye bye.", "Fri Apr 19 20:53:32 ": "@pars1 för tusan, nästa vecka.. Spelar i helgen.", "Fri Apr 19 18:49:07 ": "@AlexKenji i can never go half they way . All or nothing :)", "Fri Apr 19 20:35:30 ": "Tittade 37 sekunder på lets dance.. Rekord!", "Thu Apr 18 11:00:47 ": "After spending last 4 days doing nothing then paper works I'm finally free! Back to studio!", "Wed Apr 17 20:30:17 ": "RT @3E23: \"Twitter is awash with fakers with fake friends\" - @Kevin_Ashton: How to become internet famous for $68 http://t.co/XD2k7NpqkX ...", "Thu Apr 18 21:32:07 ": "RT @IdaEngberg: http://t.co/jpkXZ3Cq0N", "Fri Apr 19 18:38:42 ": "@SimonDunmore @yousefcircus funniest when you see this panel music talks about production and .. Well you get the picture..", "Mon Apr 22 10:42:06 ": "Feels like my North Korea vs gangham style dude makes all sense now.", "Fri Apr 19 20:47:35 ": "@jorisvoorn haha", "Fri Apr 19 21:06:00 ": "RT @Ashleyday_86: Please RT: My father passed away in February and @Orangeuk are not letting us cancel his phone contract and making us pay…", "Fri Apr 19 20:21:58 ": "RT @ciaotiga: I think I got twitter poisoning. Adios.", "Fri Apr 19 05:24:58 ": "RT @lukemckeehan: I love that grown men are selling a Daft Punk tribute act back to the kids. I take it Mini Kiss were unavailable? #musicb…", "Tue Apr 16 16:28:05 ": "RT @andrewmrvos: @andycaldwell @realzoobrazil this pairing = amazing! Can't wait to catch you in sc this week Andy!", "Fri Apr 19 20:54:34 ": "@JoeyMassaLIVE Thats the side\nEffect :(", "Fri Apr 19 20:22:19 ": "RT @dennisferrer: I just want 2 say RIP George Mena an old friend from my beginning days. Some of u may have bought his records as Mena Key…", "Mon Apr 22 18:47:05 ": "RT @DENSOMAGcom: ECI Korea presenta un nuevo recopilatorio con temas de Billy Johnston, Zoo Brazil y Tony Blunt entre otros...... http://t.…", "Fri Apr 19 18:11:55 ": "RT @SinisaTamamovic: @SinisaTamamovic @DJBORISNYC @gagahun @alexmineOFC D-Deck @GrassoandMaxim @_MrBizz @realzoobrazil @WHYTNOYZ @MladenTom…", "Wed Apr 17 14:46:35 ": "@Magnusbetner @aliesbati hur mycket betalt i månaden+pension får man för att sitta och fundera ut det där?", "Sun Apr 21 12:37:03 ": "Boarding. Sorry I  had one of those tweet days. Bye.", "Fri Apr 19 18:12:34 ": "@SinisaTamamovic @djborisnyc @gagahun @alexmineofc @grassoandmaxim @_mrbizz @whytnoyz @mladentomic @p_dema @_oscarl nice chart ;)", "Fri Apr 19 20:30:17 ": "@BoyGeorge wondering if they really have one..", "Sat Apr 20 04:27:19 ": "Airport time", "Mon Apr 22 20:02:21 ": "RT @kwasbeb: ni vet när något är fullständigt logiskt och väldigt deprimerande samtidigt? http://t.co/sWpAlDBkOi", "Sun Apr 21 10:04:36 ": "RT @Time4Depression: When you masturbate, the ghosts of your dead relatives watch. Goodnight!", "Wed Apr 17 09:44:22 ": "RT @juliocarmelo: Discovering Sweden's @realzoobrazil last two albums, Please Don't Panic and Any Moment Now. Excellent house, check the ...", "Mon Apr 22 12:27:43 ": "@pars1 nej.. Kidsen ser ut så där idag.", "Fri Apr 19 05:26:18 ": "So once again I wake up.", "Mon Apr 22 18:46:21 ": "Please @Time4Depression can you have a talk with @TheGodLight", "Thu Apr 18 19:55:44 ": "@nihadtule helt rätt! jag letar efter ett Neve Melbourne/kelso bord säg till om du ser ett!", "Thu Apr 18 12:01:39 ": "@AlexKenji haha good now it sounds\nmuch better!! I try to buy an EMS VC3 here now, every family should have 1 at home just next to the tv.", "Fri Apr 19 21:05:23 ": "@JoeyMassaLIVE Hahaha", "Fri Apr 19 21:09:24 ": "Good\nNight", "Sat Apr 20 14:13:16 ": "RT @clekclekboom: Happy record shop day!", "Sat Apr 20 05:33:06 ": "@tommiesunshine love you tommie but we need to discuss this over a pint of lager. Of to Ukraine here now for some\nDjing. Peace.", "Fri Apr 19 18:16:48 ": "Packing my bag full of cdr records for Donetsk tomorrow. Any of you highfly Swedish Djs  fancy a breakfast at Arlanda tomorrow morning 6:40.", "Tue Apr 23 07:28:07 ": "@Martinmissinga att sura är en bra sak!", "Sat Apr 20 13:54:54 ": "@therealsebleger eeeellllll roooooowwww (in à Wolf kind of way!) Have fun!", "Tue Apr 23 19:51:42 ": "@AN21 go bayern!", "Mon Apr 22 10:38:15 ": "Perhaps they see all Swedish music \"producers\" making as the kids say \"bombs\" as a threat? Wait.. Might be a good reason!", "Fri Apr 19 21:07:36 ": "SAS star alliance #eurobonus You down graded me - I'm depressed now.", "Tue Apr 23 17:43:52 ": "RT @PornEdits: Celebs With No Makeup http://t.co/Xu4N291XQ1", "Sun Apr 21 12:34:32 ": "I'm going to form a techno band @erolalkan you can play saxophone.", "Tue Apr 23 07:02:55 ": "@stretchmc im sure that enough info that can back it up for me.", "Thu Apr 18 17:42:37 ": "@nihadtule nice!", "Thu Apr 18 20:01:34 ": "@nihadtule Ah :))) kolla in argosy borden det är grymma, men lite för robocop moderna kanske.", "Fri Apr 19 18:35:49 ": "@marcusschossow ah thanks, I find it! only the glow stick and im ready, I think @sebjak have it up his.. No!!... must be here somewhere :)", "Sat Apr 20 14:12:57 ": "@Manare they are Sky High!  Mmmm.. Sorry.", "Fri Apr 19 18:29:24 ": "RT @SimonDunmore: Gutted 2 discover some1 we've been workin with has a \"ghost\" producing 4 him. Taking credit 4 someone else's creativity i…", "Tue Apr 16 16:29:04 ": "RT @zoo_radio: Zoo Brazil featuring Ursula Rucker - You Don't Know Me (Sante Remix) http://t.co/5YKpLCTFhi", "Fri Apr 19 21:04:36 ": "@pars1 jag Hakar på :)", "Tue Apr 23 17:49:08 ": "RT @thumpthump: Felix Da Housecat (@TheeRealFDHC) talks about sinning, winning and his new album. READ HERE: http://t.co/E62ZlkX3x1", "Sun Apr 21 12:27:17 ": "I know why I'm talking to my self http://t.co/hkbnh3r0qy", "Fri Apr 19 18:32:03 ": "@SimonDunmore I can fill you in with 23 other \"artist\" \" producers\" that claim they do all the writing them and take the glam. But are fake.", "Tue Apr 23 07:08:09 ": "dear @Time4Depression don't wanna bother you but @TheGodLight says you are evil. Is that true? He also says he will pray for you..", "Tue Apr 23 16:08:36 ": "@ciaotiga go Germany!", "Fri Apr 19 18:21:43 ": "@JonasLichter terminal 5 klockan 7:40 mot Munich. Ditt?", "Fri Apr 19 20:45:54 ": "Great movie! http://t.co/drNMVDyZWJ", "Sun Apr 21 10:12:34 ": "Who did people talk to before twitter?", "Fri Apr 19 18:45:28 ": "@JonasLichter Ahhh lycko!! :) blir upp med tuppen här.", "Fri Apr 19 20:28:28 ": "@tommiesunshine Timothy - he def changed his mind a few times a day..\n:)", "Sat Apr 20 04:26:08 ": "@andrewmrvos haha nice get @andycaldwell a lit bit drunk from me.", "Tue Apr 23 17:48:15 ": "@SebIngrosso @emilijakeravcin that picture is miss leading - there is no gravity in space..", "Thu Apr 18 10:58:27 ": "@AlexKenji Nice!", "Sun Apr 21 10:08:26 ": "All this waiting at airports, hotels and endless flights - is it anyway to get back the lost time?", "Wed Apr 17 09:45:44 ": "Thatcher the milk snatcher.", "Fri Apr 19 19:28:08 ": "@eats_everything you can never be sure this days", "Sun Apr 21 12:07:39 ": "@smaraki_k it will all turn in to a white noise in the end. I sent a latter with stamps yesterday .. In years - felt great.. Not joking.", "Thu Apr 18 12:05:54 ": "Nice weather in Stockholm today. http://t.co/Oexj8jDuiT", "Fri Apr 19 19:10:33 ": "@eats_everything the name sounds like a guy..", "Tue Apr 23 06:52:13 ": "Internet is great, you can find all the news and info that's fits your opinion.", "Sun Apr 21 12:08:25 ": "@CraigSwinson hahaha yes! - and we still do :)", "Sun Apr 21 10:36:44 ": "@hongzouk ah thanks bro! :)", "Tue Apr 23 07:12:10 ": "@themike_p today it's worlds book day,  just letting you know.", "Fri Apr 19 19:29:41 ": "RT @pars1: Tatuerade dansband är väl lite som rix megapol?", "Fri Apr 19 18:28:23 ": "@marcusschossow I Have all that with me but can't find my Elephant horn and glove stick, do you have it?", "Sun Apr 21 10:35:28 ": "@KngtRdr haha - totally understand you! They do have opinions :(", "Mon Apr 22 19:57:24 ": "@XquisiteLiving @thegodlight yes thats must be the problem.", "Tue Apr 23 16:10:23 ": "RT @ROUXsoundsystem: Mix du lundi, 7 de 7: Zoo Brazil pour DJ Mag. http://t.co/hmLiYbUEbp", "Mon Apr 22 10:33:18 ": "Woke up with the news that Russia practice flight bombing attack on Sweden this Easter. Nice! Peace", "Sat Apr 20 15:36:07 ": "@SebIngrosso 30! Äntligen ;)", "Sat Apr 20 14:02:27 ": "Hi there Donetsk and the cool arena see you tonight I have my favourite records with me ! http://t.co/MJ3c6fa1yV", "Tue Apr 23 19:52:32 ": "RT @marcusschossow: Live footage from the FC Barcelona's dressing room at halftime at Allianz Arena. http://t.co/1MZ03a1zkA", "Mon Apr 22 20:20:58 ": "RT @nachosarah: my kids can do as many drugs as they want as long as they never write any fucking poems", "Sat Apr 20 15:23:30 ": "@RLidbom det blir klackarna i taket! :)", "Tue Apr 23 07:01:46 ": "@stretchmc it's great!  today i gonna pretend be a 1 legged astronaut from Tawain that Claims the moon is a reflexion of our minds.", "Mon Apr 22 18:42:55 ": "@TheGodLight I don't believe you!", "Sat Apr 20 15:46:13 ": "RT @danielswedin: Privat vårdcentral gick till nattklubb och gav gymnasieungdomar pengar om de listade sig hos dem: http://t.co/pc5RHKW83y", "Sat Apr 20 05:35:02 ": "@tommiesunshine sending new music  when I get back home monday.", "Tue Apr 23 19:50:56 ": "RT @stretchmc: -27db http://t.co/YBJm6B8pUQ", "Sun Apr 21 12:33:09 ": "@CraigSwinson in Russia they all ready do that..", "Fri Apr 19 21:08:55 ": "@realzoobrazil I gonna have a affair with Lufthansa now SAS.", "Fri Apr 19 19:09:41 ": "@eats_everything sure that's a woman?"}