{"Thu Mar 07 13:24:39 ": "now at IHOP KC we are praying for Hollywood now and that God's light would break in to the entertainment... http://t.co/KwdMXndZZp", "Tue Mar 26 19:54:37 ": "Right now at the International House of Prayer leaders from around the world have gathered to unite and pray for... http://t.co/op70VYTIbA", "Tue Apr 16 13:33:55 ": "you can find true and lasting success today: being loved by and loving your creator. Being loved by and loving... http://t.co/z7OgsziXR8", "Sun Feb 17 19:23:23 ": "Proverbs 25:2 \"it is the glory of God to conceal a matter; to search out a matter is the glory of kings.\" I'm... http://t.co/FFiOh9Lj", "Thu Apr 18 20:22:01 ": "This summer I will be leading worship and worship teams at Birmingham's House of Prayer. If you live near... http://t.co/Cdn3umd4fK", "Mon Apr 22 17:01:57 ": "I'm learning to never get mad at my body or \"dislike\" things about myself. Our bodies serve us 24/7 in ways we... http://t.co/EueMdnzOn1", "Wed Mar 06 09:51:35 ": "Wow- baby Corbin who's picture is in my \"I See God in You\" video had cancer and is now cancer free! I'm honored... http://t.co/jnNhDpnfXq", "Mon Apr 08 15:40:13 ": "Touching pictures http://t.co/C72EsH8Ekb", "Mon Mar 25 08:20:13 ": "“It is amazing what you can accomplish if you do not care who gets the credit.” ~ Harry Truman", "Wed Mar 20 21:56:38 ": "Glitter French manicure... :) painting nails, face masks, friends, Swedish fish and the movie The Help make for a... http://t.co/Y67ocX29Nc", "Wed Mar 13 07:18:45 ": "Have you found things, people, events are worth exactly as much as the value you give them?", "Wed Apr 10 02:12:36 ": "this trailer doesn't do this book justice. It's called \"Beautiful Outlaw\"- a new favorite of mine. It's all about... http://t.co/OJxwzo2heq", "Fri Apr 19 16:46:06 ": "So much bad news.. I literally googled \"good news\" last night when I couldn't sleep... and found some :) and then... http://t.co/hc7C2WDeyE", "Thu Mar 14 14:22:35 ": "PREVIEW of NEW FRONTIERS. http://t.co/UtiqXQv4z3", "Fri Feb 15 11:30:44 ": "Today at the communion table I saw someone put a rose on the crown of thorns that sits there on the table. How... http://t.co/fJwGSONf", "Tue Mar 19 20:27:34 ": "New Frontiers Now on iTunes! Download and review it! If we get good reviews it may get featured. I really... http://t.co/1huI3p4oUJ", "Sun Apr 07 22:19:04 ": "Hope.", "Sat Mar 09 11:10:36 ": "\"Every man lives by faith, the nonbeliever as well as the saint; the one by faith in natural laws and the other... http://t.co/mSqlBj5Cor", "Wed Feb 06 17:23:57 ": "\"I'm wrong\" and \"I'm sorry\" are the greatest word combinations ever assembled. Give them a try.", "Mon Feb 11 04:08:33 ": "Had such a wonderful time leading worship and hearing from Carolyn Moore this weekend in South Carolina. http://t.co/g9Tz80Ch", "Thu Feb 28 11:44:11 ": "is there any musicians that live in or near East Nashville (I STRESS East Nashville) that want to get involved in... http://t.co/7nHIhrfgGs", "Wed Feb 27 08:35:10 ": "Is you feel condemned and accused it is not from God. Gods correction is always empowering and gives us grace to... http://t.co/6bwIleKZ2X", "Thu Mar 21 09:05:35 ": "So now is the time to spend your Christmas iTunes gift cards on some summer music :) Listen to previews here: http://t.co/OnGaXvHfxx", "Mon Mar 04 15:38:32 ": "Psalm 127:1 Unless the LORD builds the house, its builders labor in vain. Unless the LORD watches over the city,... http://t.co/uZ1vKcOUvG", "Sat Mar 09 05:02:58 ": "God is a painter... http://t.co/rdvfS0BE2a", "Mon Apr 22 21:29:55 ": "\"Your Kingdom come, Your will be done on earth as it is in heaven!!! Release Your love in my city Jesus!\" we can... http://t.co/s1Uc78mZxP", "Thu Feb 07 15:48:18 ": "this question spoke to me so powerful: \"If you could give Jesus the desires of His heart, would you?\". Read John 17 to find out.", "Tue Feb 19 07:04:21 ": "Promise and vision for the church and, as God leads, personal application- Isaiah 54 \"Enlarge the place of your... http://t.co/4BcYtE2h", "Sun Mar 10 06:21:13 ": "The International House of Prayer meets the other IHOP... Yummmmmmmm!!! http://t.co/KXlOABmQq1", "Mon Apr 15 14:22:09 ": "Powerful story. \"Most of the people who say they don't believe in God, it's not that they don't believe in God,... http://t.co/4fM7cGYoOQ", "Wed Apr 03 14:04:24 ": "\"I sought the Lord, and he answered me;\n    he delivered me from all my fears.\nThose who look to him are radiant;... http://t.co/A0kOiMCDP3", "Sun Mar 10 19:30:27 ": "Would you \"waste\" what is most precious to you at Jesus feet? Is He worth the first and the best or the last and the rest?", "Wed Mar 27 07:21:48 ": "Have you heard the beautiful song that is so appropriate for Easter called \"Behold The Lamb\"? I and my friend... http://t.co/6SMGb4JGnW", "Tue Mar 12 06:18:07 ": "Due to a few glitches the new electronic worship album will be available next Tuesday, the 19th. Can't wait to share all the songs with you!", "Tue Mar 05 11:20:51 ": "Im treasuring so many secrets- I hope one day I will be able to share them in songs.", "Thu Apr 04 10:52:38 ": "It's amazing that Jesus had to learn and study the very Word he created and learn from teachers that He created.... http://t.co/gDDj8NZgAz", "Tue Mar 26 07:01:31 ": "\"Beautiful Outlaw\" by John Eldredge is about Jesus and his personality: playful, fierce, generous, disruptive.... http://t.co/qum1HoGQHo", "Fri Mar 22 13:32:46 ": "Watched \"The Sound of Music\" on my sick day off- now of course I have the urge to run down a grassy knoll singing... http://t.co/tO8ehOl91k", "Sat Feb 09 20:50:41 ": "having a great time leading worship at Trinity Women's Retreat in South Carolina. Our theme: \"Encountering the... http://t.co/pBD0DSvA", "Wed Mar 27 07:21:54 ": "Have you heard the beautiful song that is so appropriate for Easter called \"Behold The Lamb\"? I and my friend... http://t.co/yTDYwFCLKK", "Thu Feb 14 06:37:26 ": "\"this is Jesus in His glory- King of Heaven- dying for me!\"", "Sun Feb 24 19:21:06 ": "What we behold, we become. That is why the enemy tries everything to steal our gaze away from Jesus.", "Fri Mar 01 18:41:41 ": "Had a date with destiny today. ONE thing I ask and I would seek psalm 27:4", "Wed Feb 27 08:39:59 ": "If you feel condemned and accused it is not from God. Gods correction is always empowering and gives us grace to... http://t.co/jGvkSM6m40", "Sun Mar 24 03:30:04 ": "\"Because if you don’t accept excuses, pretty soon people stop giving them, and they start looking for solutions.... http://t.co/PGHCxjFnrd", "Mon Apr 01 12:37:54 ": "If family doesn't matter, what does? Start revival in your own family and extended family. Change the world starting in your own home.", "Wed Mar 27 13:35:58 ": "\"It's what you wanted in the garden\nIt's what you wanted on the mountain\nIt's what you wanted on the crossbeam\na... http://t.co/9gC9hemw8L", "Wed Mar 06 17:49:03 ": "I tell you- it's a strange and wonderful feeling when there are no seats left in a big prayer room because it's packed. #theworldischanging", "Thu Mar 28 14:36:39 ": "I'm so happy to be graduating tonight from my internship and the hardest and best 3 months of my life at the International House of Prayer.", "Sat Mar 23 05:35:37 ": "\"as the Father loved Me, I also have loved you; abide in My love.\" -John 15:9 oh that we would grasp this and... http://t.co/L5Q3abRj63", "Mon Feb 25 19:00:47 ": "When we feel that God doesn't just put up with us but likes, loves and enjoys us- we run to Him and nothing could... http://t.co/K81H3PSoco", "Mon Mar 18 15:17:50 ": "New album out tomorrow!!! It features some of my favorite hymns and scriptures set to electronic/dance music can... http://t.co/5prLwNmzsT", "Sun Apr 14 23:12:15 ": "had a week full of friends, springtime beauty, the friendship of Jesus... cheers to another week of more of that.... http://t.co/6biSljWRPl", "Mon Mar 18 19:40:49 ": "Video Blog and album preview!!! Album out tomorrow! get the album and get your workout on :) http://t.co/PJzOLEIpmo", "Sun Mar 10 12:31:57 ": "\"to Him who loves us and has freed us from our sins by His blood, and has made us to be a kingdom and priests to... http://t.co/Xht1lVaWc4", "Fri Apr 12 13:19:37 ": "great quote \"Praise is the expression that we give for the worship that we live\". Our life is an act of worship... http://t.co/0oUkclfqlE", "Mon Feb 11 19:56:00 ": "Never be afraid or ashamed of shattered dreams- God uses those pieces to mold and make a much better dream for your life.", "Sat Apr 20 16:22:02 ": "In Birmingham this weekend at a worship and prayer training- excited to spend the summer here at Birminghams... http://t.co/t9aKOKDQBl", "Mon Feb 18 02:36:00 ": "The pressure of knowing you need to be asleep keeping you from actually sleeping. One of the worst conundrums in... http://t.co/9SWRUiKH", "Thu Apr 11 00:16:59 ": "LOVE this. New way to look at Proverbs 31. When it says who can find a virtuous woman? meaning, who can see the... http://t.co/LQPBknn13B", "Wed Mar 06 09:58:39 ": "I was honored to have Sherrie's sons picture in my I See God In You Video- this is the good news she just shared... http://t.co/KFDcXiQcEq", "Fri Mar 15 20:26:45 ": "Seaweed salad, vanilla latte, spicy tuna rolls, Korean tacos... Umm yes! Cool spot we found that's inside an art... http://t.co/3RRdQA9Xgd", "Thu Feb 21 03:06:25 ": "\"Deal with it when it's a struggle not a stronghold.\nDeal with it when it's just a weakness not full blown... http://t.co/18p47oxnn5", "Thu Apr 18 01:22:41 ": "I'm learning more and more that the most powerful \"ministry\" or \"work\" we can do is living in the present and... http://t.co/kOEC0dLPEU", "Thu Feb 07 21:44:01 ": "Dear Friends... learning so much about myself and God during this break. Laying things down, letting God do some... http://t.co/XzG3UkPU", "Tue Apr 02 13:08:08 ": "Don't live in the lie that God is not here, present and loving you with His whole heart. He's the one who said... http://t.co/fzUPP9K0VZ", "Sat Feb 23 16:27:09 ": "do less, better. &lt;---- My new attitude.", "Mon Apr 22 03:56:08 ": "sometimes I can forget who I am but I know that I know that I know WHOSE I am.", "Sat Mar 30 10:51:39 ": "Did you know Sheperds always lead the flock from behind? To make sure none stray? That tells me 2 things: leaders... http://t.co/dh50N5yv7F", "Sun Mar 17 09:50:29 ": "Re-reading the book Captivating. Highly recommend to both women and men...  \"you won't understand your life as a... http://t.co/6HS1zwDJgK", "Thu Apr 11 12:58:09 ": "\"The hard part is being used by God and not using God\" -Governor Bill Haslam sharing his story of faith at this... http://t.co/Xj2cD8jWIa", "Tue Feb 26 15:39:03 ": "Plumbs new album came out today. I always enjoy her music and I'm proud to say she encourage me in my first few... http://t.co/ZZA5hOpGeQ", "Tue Feb 12 05:41:28 ": "Saw this pretty site at an abandoned gas station- when do you guess this was from? http://t.co/oaPcF5NY", "Fri Mar 15 20:16:46 ": "Beautiful day today checking out union station in downtown Kansas City with a new friend and then jamming on my... http://t.co/wFZHrclHZP", "Sat Feb 23 20:00:39 ": "The book of Revelation often scares people or intimidates but I challenge you to just read the first few chapters... http://t.co/VFg0TZFN4y", "Mon Mar 11 20:04:40 ": "The humility and \"hidenness\" of Jesus stuns me. The real miracle is not the signs and wonders He performed but... http://t.co/pTmXzeW6aY", "Mon Mar 25 15:29:22 ": "Review for my new collaborative album \"New Frontiers\" available at all digital music stores http://t.co/uALJzghNNC", "Wed Feb 27 14:16:10 ": "Does the devil ever put thoughts in your mind in the first person like \"I don't have anything to live for\" \"I'm... http://t.co/6eEsiFLxLp", "Sun Mar 31 08:46:12 ": "He is risen!", "Tue Feb 26 15:44:36 ": "Plumb, one of my favorite artists released a new album today \"I Need You Now\" check it out and enjoy.", "Wed Mar 20 12:11:00 ": "Jesus Freak Hideout gave New Frontiers a shout out... http://t.co/HChC7cC1hH", "Wed Mar 20 15:11:58 ": "every single person ever created is driven and motivated by a need for love- that need can get distorted,... http://t.co/Y6oD9tXNQ0", "Mon Feb 11 03:31:51 ": "@beckykel Hey I'm glad you like my version. Your original is amazing!", "Wed Mar 06 12:54:21 ": "6 days until the new electronic worship project is out. My friend and producer Magellan and I teamed up to take... http://t.co/Yf6G8fF2lq", "Fri Apr 05 15:19:06 ": "Heading back to Nashville... the last three months God in His kindness revealed so much to me- He loves me too... http://t.co/NqBS1BR7zD", "Sat Mar 30 11:01:31 ": "Did you know Shepherds lead from behind? This tells me two things: good leaders put themselves last to watch out... http://t.co/5xFIDsHc7f", "Tue Apr 02 23:30:47 ": "A friend that I got to tour and serve with last year just released a new record. The \"making of\" this record... http://t.co/7Oj0423x29", "Wed Mar 06 13:26:25 ": "Jesus never did anything half-heartedly. He loves us with His full heart, mind and strength. And He asks us to... http://t.co/O99Nn69mzc", "Fri Apr 12 12:46:49 ": "great quote \"Praise is the expression that we give for the worship that we live\". Our life is an act of worship... http://t.co/BSEpyr5osm", "Thu Mar 21 06:22:43 ": "I'm so grateful for the people I've gotten to know through music at live concerts or online. You are so precious... http://t.co/XxSHZuXCAr", "Tue Apr 09 02:35:08 ": "Springtime!!! http://t.co/EyA2UWIuzJ", "Tue Mar 26 05:47:14 ": "The good news is someone loves you. Someone loves you enough to go all the way to the cross to be with you. Having... http://t.co/WGAK3ArL4e", "Thu Apr 04 15:44:29 ": "Ask me any question and sign up for my mailing list here: http://t.co/PO1QurSGNz", "Sat Feb 16 14:26:01 ": "What would you say about me cutting my hair into a short pixie cut and dying it blonde? Had the strongest urge... http://t.co/rX7zffI1", "Sun Mar 03 10:05:09 ": "New worship project coming out in 10 days!!! Sign up for my newsletter on my website and get a free song and more... http://t.co/CewCOMc7OP", "Mon Feb 25 08:11:13 ": "Playing in the snow with my roomie. love snow days! http://t.co/IsTsM5Z2ia", "Thu Feb 28 20:09:28 ": "God told us to love our neighbors. I admit I don't know mine even though Gods been telling me to reach out to... http://t.co/S1GKx9FfHP", "Wed Feb 20 21:17:17 ": "The Trinity loves each other and we are invited into this- Holy Spirit knows and loves Jesus (He loves revealing... http://t.co/zeHgtiVPJu", "Sun Mar 31 20:17:05 ": "I just released a new dance/worship album. Preview it here. http://t.co/qAUikwGBGO", "Fri Mar 08 06:03:02 ": "Can not wait for Spring in Nashville! God is good if He did nothing else except think of and create Spring :)"}