{"Fri Mar 22 01:46:09 ": "I want @Drake to stop showing his friends that ill-advised tweet from a former child star", "Wed Mar 13 17:53:28 ": "NYT redesign interview for nerds! http://t.co/IzH6apqbFf", "Thu Mar 28 20:50:32 ": "how is the Jodi Arias trial still happening/how are you all still not paying attention?", "Mon Apr 15 15:22:58 ": "\"while we may play around with SLANG in our writing, don't get it TWISTED, we have the UTMOST RESPECT for all people\" http://t.co/lz9jpSLkUC", "Sat Apr 20 17:19:27 ": "\"Blood oranges grow well in Florida, but they frighten American women.\"", "Tue Mar 26 16:47:42 ": "Dalton--&gt; NYU--&gt; coke--&gt; heroin--&gt; love--&gt; weapons--&gt; jail--&gt; baby named Melody = my ideal article(/screenplay) http://t.co/rbmaGS3l5R", "Fri Mar 22 16:41:09 ": "rappers stay using these filters that make their skin look bad RT @WordOnRd Drake And DJ Drama  http://t.co/cChJgbF97c", "Tue Mar 19 17:21:48 ": "never forget #falafel RT @TheOddDominion How could Bill O'Reilly get divorced?! http://t.co/NwyDmYlnbX", "Thu Mar 14 12:08:07 ": "@matthewt_ny @MWJ1231 @revandaposey @RockabyeReview gift (review bags) from (PR) heaven", "Wed Apr 10 16:07:05 ": "\"I'm getting paid to write this article.\" http://t.co/z1QEhzXkWg", "Thu Mar 14 15:07:00 ": "*ducks* RT @akdobbins \"Isn't that how you all ruined Community? I don't care about that either.\" http://t.co/WaHGwUmiE6", "Mon Mar 18 19:41:07 ": "Steve Brill vs. Chris Hughes, continued http://t.co/j1cvVSOBWk", "Thu Mar 21 17:58:28 ": "@harvilla thought to myself last night, re the 'hiatus' or w/e, \"so this is what it's going to be like when they cancel Nashville, huh?\"", "Fri Mar 01 19:43:27 ": "embattled semen artist Marc Johnson tells me the show was \"Amazing. We had a great turn out.\" http://t.co/UxWYuTor3D", "Fri Mar 22 15:11:38 ": "RT @vulture: \"It was simulated, but, you know, I wish it wasn't.\" http://t.co/EdrAuys9sY", "Fri Mar 15 21:08:47 ": "RT @rkylesmith: Error. NY mag calls me \"plain-looking.\" Meant to say \"devilishly handsome.\"  http://t.co/iLKwzmDTz6 @Intelligencer", "Fri Mar 29 21:53:05 ": "RT @intelligencer: You Won't Soon Forget This Syrian Child Soldier http://t.co/JBQ6YE2DeP", "Tue Apr 16 16:56:17 ": "@corbangoble @Im_TheMyth @cbattan thank you for waking up today", "Thu Mar 14 12:13:17 ": "RT @noz: there's even a certain old world sadness to just going by the name \"joseph\" it sounds like the name of a man who died in a sens ...", "Fri Mar 01 17:15:52 ": "RT @NYMag: See Lindsay Lohan's life of crime, in numbers. http://t.co/7yQj5q4Cxs", "Mon Mar 18 15:16:30 ": "Constant, y'all http://t.co/qsKVrlFMqS", "Fri Mar 22 15:36:18 ": "@nickrkm burrrrr", "Mon Apr 08 18:59:13 ": "Lindsay Weir  &gt;&gt; RT @bzcohen Linda Cardellini &gt; Linda Cardellini breaking up Don and Megan &gt;&gt;&gt; Linda Cardellini breaking up Cory and Topanga", "Tue Apr 09 19:27:57 ": "RT @bloodless_coup: .@kirstenpowers10 JERK -&gt; @joecoscarelli #snob #elitist #manhattan #bubble #overmothered #booksmartnotlifesmart # ...", "Fri Mar 15 15:22:19 ": "RT @intelligencer: Party report from the @NewYorkObserver's 25th anniversary party at the Four Seasons: http://t.co/3k9nKgGdV9", "Thu Apr 18 20:02:39 ": "Amanda Knox alibi: \"smoking marijuana, reading a Harry Potter book aloud in German and watching the film Amélie\" http://t.co/r5TFCSzZHe", "Thu Apr 18 19:47:17 ": "will sorority girl email get the most 'ever' 'of all time' headlines ever of all time?", "Fri Apr 05 17:51:13 ": "RT @jonathanchait: Down to Final Four Senate Democrats still opposing gay marriage. Who will be the last? @danamira and I break it down: ...", "Sat Mar 30 19:19:45 ": "RT @LILBTHEBASEDGOD: Respect to the beautiful students and staff at nyu! Were my first historical lecture was held!!!!! :+) i love you a ...", "Tue Apr 09 15:40:06 ": "update: \"the feel good atmosphere of the party has been tainted\" http://t.co/UmYENsh7Jd", "Mon Apr 01 22:03:07 ": "Arianna Huffington denies breaking walls, bloodying mattresses, ruining rare tables in $27k-a-month loft http://t.co/FuSHevnsSn", "Fri Apr 12 21:54:57 ": "\"This is the only true sport (besides cockfighting, bare-knuckle boxing, and women's tennis).\" http://t.co/UxCY0t8TcO", "Wed Apr 03 19:22:28 ": "RT @DanAmira: Joe Biden zoning out http://t.co/zXBmWlgo6H http://t.co/D1FsuzwVwp", "Wed Mar 20 15:18:13 ": "TMZ, y'all: \"Wearing her brunette weave at half-mast...\" http://t.co/lUvlWjI5tU", "Wed Mar 13 22:29:21 ": "Holy grail... http://t.co/kz9tuVlHxe", "Fri Mar 08 15:43:52 ": "I'm not mad but Harmony Korine makes Sofia Coppola look like John Hughes http://t.co/FoNxhvQuT8", "Fri Apr 12 17:05:52 ": "the @jonathanchait is trying to tell me Cyndi Lauper is better than Madonna, and their relative fame is a \"huge injustice.\" crazy or insane?", "Tue Apr 09 17:31:47 ": "RT @xzachbaronx: Against Me's Laura Jane Grace writes a gender-switch diary behind a \"Fresh Flirty Fun\" @Cosmopolitan coverline. 2013! h ...", "Wed Apr 10 20:34:35 ": "\"Sounding like Schumer never made Weiner a Schumer, just as marrying into Clinton World never made Weiner a Clinton.\" http://t.co/ED7bJaVk1o", "Sat Mar 02 23:42:34 ": "@stefanjbecket @DanAmira we did it (reached a completely meaningless milestone by guilting people)", "Thu Mar 07 21:24:10 ": "Nate Thayer was exposing more about \"the state of journalism in 2013\" than he knew http://t.co/YgQPzqpVNJ", "Thu Mar 28 17:55:00 ": "@jillkrasny guess I should start watching that show...", "Fri Mar 29 20:44:13 ": "@hazelcills Cheetos, Doritos http://t.co/TYys7CqZVU", "Mon Mar 04 23:18:00 ": "@jonathanchait let me use one of his signature headlines to make fun of Tucker Carlson http://t.co/Brsk7b50xq", "Thu Mar 14 21:34:59 ": "Team Kushner-Trump recommends you keep an eye on Team Kushner-Trump http://t.co/kJCTz0HcYg", "Thu Mar 07 19:02:20 ": "Drake names \"Drake featuring Drake\" best Drake line about the name Drake since \"Do Right And Kill Everything\" #drake", "Thu Feb 28 21:19:35 ": "RT @intelligencer: Art school seizes 68 vials of semen used in student's art project \"Take This Sperm and Be Free of Me\" http://t.co/vhR ...", "Wed Mar 27 14:33:44 ": "bearded man on crutches steals laptop at Columbia, a.k.a. James Franco method acting http://t.co/ZfEj6IsNxC", "Tue Mar 05 20:01:09 ": "@lindseyweber $490 http://t.co/vN5KatBwuE - $1,200 http://t.co/eovQgOiUHo (red not out yet)", "Wed Mar 20 13:45:45 ": "#freegwyneth RT @cbattan Skip the clean diet stuff and CTRL+F \"sisterhood\" for another reason to stop hating Gwyneth http://t.co/ta4pecMG4i", "Thu Apr 11 13:54:59 ": "\"5 a.m. in Havana\"", "Tue Mar 19 20:49:54 ": "feel like this is straight from @rembert or @ChrisRyan77's brain RT @jordansarge dying http://t.co/TypA3F9CXF", "Fri Mar 15 17:06:31 ": "I cannot wait for Andrea Peyser to write about Spring Breakers", "Sat Apr 20 17:43:28 ": "@nickrizzo @weareyourfek just started \"Oranges\" by John McPhee #rad", "Thu Apr 04 14:55:25 ": "http://t.co/J1n78pJ4IK RT @cbattan Did some misandrist cheerleading for Jenny Lewis http://t.co/PMyhPPjGY1", "Wed Apr 03 14:58:36 ": "DJ Clue, a.k.a. 3 Pills, has had his license suspended 8 (!) times http://t.co/KqMsttBe9f", "Thu Apr 04 14:19:34 ": "\"I wrote a manuscript for a movie/book that would make him the #1 American hero! He would only have to play a small cameo role at the end.\"", "Thu Apr 04 16:23:37 ": "'extremely rare' RT @stellabugbee What @RookieMag looked like when I was a teen. http://t.co/kouFcE48fo", "Tue Apr 02 17:36:45 ": "these kids rule RT @oliviab33 http://t.co/cUTAJ7or6i a look book of kiddos that reside in New York that I shot for New York Magazine!", "Thu Mar 21 20:38:21 ": "RT @intelligencer: How One Brave Skateboarder Jumped Over the Subway Tracks http://t.co/sDAy1pHfRw http://t.co/2gRQAdjyyx", "Thu Mar 14 13:22:40 ": "RT @soalexgoes: Peak internet. The only place to go is down: http://t.co/Ngyby9inYC", "Fri Mar 01 15:06:38 ": "@lfitzmaurice makes sense. hope he has the snorkel http://t.co/MXatt7eNKi", "Thu Mar 21 19:00:39 ": "@MC_NYC I'm not even watching, just reading blog posts about watching! (\"for work\")", "Tue Apr 02 16:04:38 ": "big like Fulton and St. James RT @intelligencer Notorious B.I.G.’s Childhood Apartment in Brooklyn Selling for $725k http://t.co/Lj8CC3UIDB", "Fri Mar 29 19:22:02 ": "maybe the darkest thing I've ever heard: \"he said he subbed in 'Tony Soprano' for 'Boy Soprano' in the Xiu Xiu song\" http://t.co/DVHD5ifHfq", "Thu Mar 14 17:32:05 ": "@ClareMalone And she couldn't even say it to my @", "Wed Mar 27 20:48:23 ": "\"The notion of 80 percent — it's not a Nate Silver 80 percent\" SCOTUSblog on predictions, trendsetting http://t.co/mq57dhGQw5", "Thu Mar 28 17:56:51 ": "Basquiat's old friend-with-benefits is so chill http://t.co/CjdlJFENXw", "Mon Mar 18 00:58:36 ": "\"You've been a very bad girl... a very very bad bad girl, Gaga\" http://t.co/r65tA0YMr9 #beenon", "Thu Mar 14 16:09:00 ": "Cam'ron lyrics ---&gt; Metropolitan Diary http://t.co/QyIdWQvwE0", "Wed Apr 17 15:03:47 ": "RT @NFreeman1234: Courtney Love responds in the comments to my story in today's Observer about her feud with her grandmother, Paula Fox  ...", "Thu Mar 21 16:12:40 ": "Gucci's baby hungry, Gucci sleepy RT @joncaramanica \"Just make sure you don't reoffend.\" http://t.co/sbXWRIQg96", "Mon Apr 08 22:23:10 ": "@SaraMorrison hey sara, I hadn't seen your coverage, but thanks!", "Thu Apr 04 14:18:57 ": "received a handwritten letter: \"Mr. Coscarelli, I am writing you to plead for you help. I realize your cousin is Donald Trump's son-in-law.\"", "Thu Mar 28 15:47:23 ": "RT @kevinroose: At Liberty University, ground zero of the culture wars, the gay marriage debate has gone quiet. My story:  http://t.co/D ...", "Thu Mar 14 18:25:14 ": "@frantaclaus are you at a strip club?", "Fri Mar 29 16:23:28 ": "I think Chloe S. has been going to fewer Knicks games this season http://t.co/7SSxEyj16h but Padma is all about it http://t.co/n83ljAEy4F", "Fri Mar 01 15:30:31 ": "@DanAmira @stefanjbecket +2, you're dead", "Sat Apr 06 15:50:37 ": "very, very positive and #rare: @LILBTHEBASEDGOD and @bzcohen together again, on Russ Smith and planting trees http://t.co/43340HHdzw", "Thu Mar 21 18:28:10 ": "\"How to Watch March Madness Without Getting Fired From Your Job\": data bleep bloop computing http://t.co/83wuGCqXtm by @NickGreene", "Fri Mar 08 16:12:57 ": "@Billy_Goodman I'm talking strictly trailers so far, but Gucci, Skrillex &gt; Sleigh Bells in 2013", "Tue Mar 26 16:59:36 ": "@deadlilo control+f \"Beck\"", "Thu Feb 28 19:30:31 ": "#archives RT @intelligencer The Top 37 Pope Tweets of All Time http://t.co/1rYPQoza5Y", "Tue Mar 26 18:02:09 ": "@kevinroose http://t.co/brPfSEkIuC", "Tue Mar 19 17:05:40 ": "RT @leoncrawl: \"every single person who had a BlackBerry in 2006 was an important person.\" really funny new piece by @fusedavid http://t ...", "Wed Mar 06 17:02:15 ": "ban ticketmaster RT @rembert Beyonce and THE CAPTCHA. @Nomizeichner doing impt work that'll make you sadddddd http://t.co/IJXKKGxKpv", "Fri Mar 08 16:11:49 ": "@sts10 Gordy, Babe", "Fri Mar 22 15:44:00 ": "RT @emmacargo: We need to talk about the Harvard Band. http://t.co/KjVYNI1lIs", "Fri Mar 22 18:05:37 ": "\"Drake would send your vagina to college.\" \"Pour it a glass of Moscato.\" This @thecut chat is stunning: http://t.co/JtIZVm0qBZ", "Fri Mar 01 20:54:46 ": "RT @dawnsiff: I'm in @nymag #VineResume. Secretly hoped Approval Matrix. LowBrow. HighTech... Despicable? http://t.co/gMBXp9Sne7", "Tue Apr 09 01:19:27 ": "#ProtectRussSmith", "Wed Apr 17 14:14:38 ": "http://t.co/J5FbdaGIUW", "Tue Apr 16 16:48:04 ": "cc @Im_TheMyth RT @lindsayzoladz THANK U BASED GODDESS @CBATTAN http://t.co/y4LuBkj9yc", "Tue Mar 05 22:43:41 ": "Nate Thayer says fuck your free online journalism http://t.co/Au4vROAeGe", "Tue Mar 12 19:53:14 ": "@MichaelWolffNYC I don't really want to play this game, but I believe resources like this are fairly common! http://t.co/xYdNvBQBA6", "Tue Mar 26 13:03:02 ": "Amanda Knox's creative writing classes must get really uncomfortable", "Fri Apr 05 14:01:46 ": "Mad Men season 13 filming in Cuba http://t.co/EPmots9mYy", "Wed Mar 13 16:49:25 ": "Franco/RiFF RAFF Spring Breakers 'debate' is lame but American Dream inventory monologue = East Brazilia vids, period http://t.co/2DePjzNitj", "Fri Mar 01 23:21:57 ": "Korn and Rage Against the Machine on the office muzak playlist tonight #friday", "Wed Mar 06 15:17:27 ": "RT @mlcalderone: NYO: \"At 37, @tanehisi is the single best writer on the subject of race in the United States.\" http://t.co/bWpoQvn6bn"}