{"Fri Apr 19 10:00:42 ": "RT @eurocontrol: Lufthansa: more info on expected impact when we have it.", "Wed Apr 10 15:40:16 ": "We'll pick a winner for the €100 @TheLoopShopping voucher competition before 7pm. To enter RT &amp; follow @DublinAirport .", "Tue Apr 09 09:20:37 ": "We're tweeting an #Irishfact every day in 2013 to celebrate @gathering. To suggest one use #Irishfact", "Mon Apr 22 10:55:19 ": "Our Twitter feed &amp; Facebook page both nominated for #sockies13 &amp; we're also on shortlist for most innovative use of #socialmedia", "Fri Apr 19 10:00:38 ": "RT @eurocontrol: Lufthansa ground ops strike Monday: all day at FRA HAM MUC STR HAJ DUS &amp; CGN; Berlin till 1430 local &amp; NUE am only.", "Tue Apr 09 23:10:48 ": "RT @Cmdr_Hadfield: Tonight's Finale: Our golden lights from Dublin to Paris, Nature's from green aurora to blue dawn. http://t.co/h7QIbQDKXO", "Thu Apr 18 06:00:15 ": "RT @eurocontrol: Good morning! Strong, gusty winds expected to cause #flightdelay at Heathrow and Amsterdam http://t.co/AUmaUmCWud", "Thu Apr 18 06:44:25 ": "@nachofranch Hi, too early to say at this stage best to check your airline's website for updates.", "Mon Apr 15 11:52:21 ": "DAA wins 'Large Enterprise' training award at the National IITD Awards 2013 http://t.co/NQW2P1yjOA", "Sat Apr 20 13:02:07 ": "The grounds of Birr Castle in County Offaly contain the oldest wrought-iron bridge in Ireland, dating from 1820 #irishfact", "Wed Apr 10 07:31:35 ": "@DublinAirport welcomes delegates to @CAPA_aviation's Airlines in Transition conference. http://t.co/WJqrJgXYeA #aviation #gathering", "Mon Apr 15 11:10:30 ": "This day in 1971 saw Aer Lingus' first 747 flight from @DublinAirport to JFK. Report via @RTEArchives http://t.co/nQ0jQIkAj3 #avgeek", "Wed Apr 17 06:36:41 ": "For the best car parking prices at @DublinAirport always book online. http://t.co/k86Bp6mUrQ", "Sat Apr 20 19:29:46 ": "RT @lufthansa: Update: Strike on 22.04.13 to cause heavy flight disruptions. Current information on affected flights here http://t.co/B7L7G…", "Fri Apr 12 07:55:16 ": "RT @stjohnsairport: Dublin was the 5th most popular destination using LHR as a connecting airport between YYT last year. #yyt", "Tue Apr 09 12:39:49 ": "We are Host Airport for @CAPA_aviation's Airlines In Transition Conf. A @gathering of airline CEOs http://t.co/m0TT0RnkAL #aviation", "Fri Apr 12 11:27:32 ": "RT @gathering: There are loads of Gatherings planned for this weekend, with something for everyone, view them here -&gt; http://t.co/ADi ...", "Tue Apr 16 07:11:47 ": "Transatlantic capacity up 17% this summer at @DublinAirport. http://t.co/wNxTeZFaD6 #travel", "Mon Apr 15 09:01:03 ": "Phoenix Park gets its name from a clear spring, 'fionn usice' in Irish, anglicised by land owner Sir Edward Fisher #Irishfact", "Fri Apr 12 13:28:10 ": "@le_shark_attack Hi, we work closely with GNIB at Dublin Airport in relation to passenger volumes expected on a daily basis.", "Fri Apr 12 13:30:23 ": "@mollox Hi, this is something we do every day throughout both terminals. DAA staff are on site to help manage passenger flows.", "Thu Apr 18 05:10:02 ": "Last night's severe winds affecting operations at @DublinAirport today with cancellations &amp; delays. http://t.co/sva1B98nv2", "Thu Apr 18 08:39:00 ": "@alidubs1 Dublin Airport is open 24/7.  Airlines &amp; Handling Agents normally open check in desks 2 hrs in advance of flight departure.", "Wed Apr 10 16:22:57 ": "@DublinAirport driving Irish air traffic growth in March, says IAA. http://t.co/TlvggDC7iO #aviation", "Thu Apr 18 10:01:08 ": "County Louth is colloquially known as 'the Wee County' as it is the smallest county by area in Ireland at 826 km² #irishfact", "Mon Apr 22 07:30:37 ": "Google's satellite image of @DublinAirport has T2 still in construction. Looks like autumn 2009. http://t.co/dWiJzPMx3p", "Fri Apr 19 10:50:31 ": "Dublin born artist Francis Bacon’s Triptych, 1976 sold for $86.28 million in 2008, a record for an Irish artist #irishfact", "Wed Apr 10 11:20:53 ": "We're giving away a €100 @TheLoopShopping voucher to celebrate our 100th #Irishfact. To enter RT &amp; follow @DublinAirport", "Mon Apr 15 12:14:35 ": "To coincide with #HNCJ conference we have an exhibition of images in T1 showing the work of @WFP. http://t.co/4hMC2m7khI", "Sun Apr 21 08:31:50 ": "RT @eurocontrol: Lufthansa strike: almost all short-haul flights on Monday cancelled. More info here http://t.co/osHkVnAi0Q", "Sat Apr 20 15:37:56 ": "@DublinAirport sunrise this morning by @CreatDev. Lovely. #Spring http://t.co/FIG6cC4EVa", "Mon Apr 15 21:03:54 ": "RT @dfatirl: Anyone with concerns for Irish relatives or friends at #BostonMarathon, please call Dublin 01 4780822 @IrelandBoston", "Thu Apr 18 06:05:03 ": "Cancellations and delays today due to the knock-on impact of last night's severe winds.  http://t.co/sva1B98nv2", "Mon Apr 22 14:00:11 ": "Welcome your Gathering guests home in style with a personalised greeting on arrival. Find out how here http://t.co/rL08Qz7ODA #TheGathering", "Tue Apr 09 21:37:23 ": "Magical: @Cmdr_Hadfield: A clear Dublin night in early Spring. http://t.co/PUiofdxjxb", "Fri Apr 12 13:15:17 ": "@deccypower Hi, The DAA has no responsibility for passport checks at Dublin Airport this is done by the Garda National Immigration Bureau.", "Thu Apr 18 04:31:53 ": "Last night's severe weather affecting operations at @DublinAirport this morning with cancellations &amp; delays. http://t.co/sva1B98nv2", "Wed Apr 10 08:15:04 ": "To mark our sponsorship of @gathering we're tweeting an #Irishfact every day in 2013.", "Sun Apr 21 16:07:25 ": "Almost all of @Lufthansa_DE's short-haul services are cancelled Tomorrow (Mon) due to industrial action http://t.co/taHrftoj1M", "Tue Apr 16 08:54:23 ": "Flying this week? Use Shop &amp; Collect before you fly and pick up your goods on return on European destinations http://t.co/vTLNbn0sOQ", "Tue Apr 16 17:01:43 ": "Need help for you or a loved one as you pass through Departures? Help is at hand with Airport Genie, see details here http://t.co/b42P0bGzhD", "Wed Apr 17 21:09:38 ": "@Wicklow_Weather Some flights being diverted as a result of strong cross winds at Dublin Airport. Passengers advised to check with airlines.", "Fri Apr 12 08:04:26 ": "We are currently hosting an exhibition of images in Terminal 1 featuring the work of @WFP #photography http://t.co/3tCUtVDrcO", "Thu Apr 11 15:33:23 ": "@rupertfuller Hi, The DAA has no responsibility for passport checks at Dublin Airport this is done by the Garda National Immigration Bureau.", "Thu Apr 11 11:15:42 ": "Rathlin Island is the most northerly inhabited island off the coast of Ireland. It has a population of about 100 people #irishfact", "Mon Apr 22 12:19:08 ": "@DublinAirport nominated for 5 awards in 2013 Bord Gais Energy Social Media Awards #sockies13 #socialmedia http://t.co/SFPiRMuQc5", "Tue Apr 09 09:30:36 ": "Oscar Wilde’s father, Sir William Robert Wills Wilde, was appointed in 1854 as Oculist in Ordinary in Ireland to Queen Victoria #irishfact", "Fri Apr 19 21:19:54 ": "RT @BoeingAirplanes: We’re set to begin modifying 787s immediately after FAA approved our battery improvements. Deliveries soon. http://t.c…", "Tue Apr 16 19:14:16 ": "@roryenglish Aer Lingus contact for lost property is 0818 365 888", "Mon Apr 22 08:57:33 ": "RT @IATA: Happy #EarthDay! The aviation industry is committed to a sustainable future and reducing its environmental impacts. http://t.co/v…", "Sat Apr 13 11:30:26 ": "Pat Eddery is the second most prolific flat jockey of all time with 4,632 winners #irishfact", "Sat Apr 20 08:48:00 ": "Congratulations to our colleagues at @Cork_Airport which has just passed the 4,000 followers mark. http://t.co/RTvN38eMHW", "Thu Apr 11 12:04:41 ": "700,000 extra seats to and from Dublin Airport this summer.  17% growth in transatlantic capacity. http://t.co/9YLc4JZ0Vp", "Tue Apr 16 12:01:02 ": "Dublin city’s first ever electrified trams began running between Haddington Road and Dalkey on May 16, 1896 #irishfact", "Mon Apr 15 09:49:35 ": "RT @scalbatty: Know how free airport wifi should be? Free, available, unlimited. It is in Dublin: great! In Paris CDG you only get 15 mi ...", "Thu Apr 11 08:20:24 ": "American's Chicago service at Terminal 2 this morning in the airline's new livery #avgeek http://t.co/G4cUtQQeFs", "Wed Apr 17 13:49:02 ": "Flowers at arrivals, Terminal 1. #spring #atlast http://t.co/yETK4YpsRv", "Fri Apr 12 09:23:19 ": "700,000 extra seats available at @DublinAirport this summer. Where will you go? http://t.co/XAzPygDhCz http://t.co/2pgL7Uj89l", "Sun Apr 21 16:45:03 ": "Rare sight at @DublinAirport. Kalitta Air 747 flight carrying an aircraft engine. Pic via elevationair http://t.co/WziPcOttdz #avgeek", "Mon Apr 15 09:29:03 ": "Excuse earlier typo: Phoenix Park gets its name from a clear spring, 'fionn uisce' anglicised by land owner Sir Edward Fisher #Irishfact", "Fri Apr 12 13:14:37 ": "@gra5105 Hi, The DAA has no responsibility for passport checks at Dublin Airport this is done by the Garda National Immigration Bureau.", "Fri Apr 19 08:19:24 ": "Taking a weekend break? With Shop &amp; Collect buy before you fly and pick up your goods when you get back. http://t.co/cWSI9dqPcB", "Thu Apr 18 19:41:09 ": "@jo2worthington @sheilaoflanagan Jo we DM'ed Sheila earlier.", "Sun Apr 14 14:56:51 ": "Titanic, which sank 101 years ago, had 2,225 passengers &amp; crew onboard. She could carry 3,327 and had lifeboats for 1,178. #Irishfact", "Thu Apr 18 07:42:32 ": "@Dest_Golf Weather has calmed and Dublin Airport is fully operational.", "Sun Apr 21 13:15:46 ": "The first mainline diesel locomotives ever built by CIE entered service in April 1950 #irishfact", "Wed Apr 17 09:25:05 ": "RT @WFP_europe: Building Resilience @WFP and @eu_echo &amp; fighting #hunger together. See our photo exhibition @DublinAirport Terminal  ...", "Thu Apr 18 06:37:01 ": "Need to check a departure time at @DublinAirport? Click here http://t.co/Io0lVnxvPJ", "Tue Apr 16 15:05:51 ": "Travelling with passengers with autism? Check out our visual guides here http://t.co/BPLTADd4fk", "Thu Apr 18 04:48:23 ": "@powerslot Gavin, you should contact your airline in relation to your flight. Details here http://t.co/sva1B98nv2", "Tue Apr 09 07:26:52 ": "Latest timetables for @DublinAirport services here http://t.co/BZQ6gHFleo", "Thu Apr 18 17:41:46 ": "Great sunny @DublinAirport Instagram shot by @kevinnolan1976 http://t.co/3J5GMkf5A1", "Mon Apr 22 06:42:04 ": "RT @eurocontrol: Good morning! Almost all Lufthansa flights cancelled. SAS flights to Germany also affected. Otherwise, looks quite good.", "Fri Apr 12 14:30:09 ": "Do you have a special Gathering planned? Welcome your guests  in style with a personalised message. Find out how here http://t.co/hv7LP9qRff", "Mon Apr 22 06:46:49 ": "@Lufthansa_DE services between @DublinAirport and @Airport_FRA have been cancelled today due to industrial action in Germany.", "Fri Apr 12 13:31:18 ": "@keating_eamonn Hi, we work closely with GNIB at Dublin Airport in relation to passenger volumes expected on a daily basis.", "Thu Apr 18 15:28:03 ": "Experienced Travellers Fly British - vintage aviation poster via our @pinterest account. #avgeek http://t.co/xKhyl74p00", "Thu Apr 18 12:31:31 ": "We've just passed the 32,000 followers mark. Thanks to all our Twitter followers both old and new. We appreciate your interest.", "Thu Apr 18 04:33:26 ": "Passengers should check with their airline or airline website regarding the status of their flight. http://t.co/3xTgg42u70", "Wed Apr 10 13:12:06 ": "Brilliant timelapse created with Google Street View. See @DublinAirport at 1.05. http://t.co/VtTXHCMMP2 T via @DigiColMedia", "Fri Apr 19 09:17:52 ": "@mwhiteley self service postage machines are available in Terminals 1&amp;2 offering stamps and postage for larger items http://t.co/kGmhN4EvBX", "Sat Apr 20 19:29:22 ": "RT @Stephanie_Foote: All intl airports take note from @DublinAirport -going thru @uscustoms     Prior to departure makes arrivals a breeze!…", "Thu Apr 11 07:52:13 ": "We are a proud sponsor of @CAPA_aviation's #AIT13 conference which starts today. A #gathering of senior airline executives in Ireland.", "Mon Apr 15 09:24:22 ": "RT @adi30dec: I'm loving free wifi and airport genie at Dublin Airport @DublinAirport ... Absolutely brilliant 😃😃", "Wed Apr 10 18:04:49 ": "@athtrasna is the winner of our €100 voucher for @TheLoopShopping to celebrate our 100th #Irishfact. Thanks to everyone who entered.", "Tue Apr 09 10:00:57 ": "We are hosting an exhibition of images from @WFP ahead of this conference http://t.co/n2PZhk6XOl http://t.co/uGP72NfLgX", "Tue Apr 09 08:11:53 ": "RT @Cmdr_Hadfield: Southern Ireland, sweeping from Kinsale and the river Brandon down the coastline of County Cork. http://t.co/4sYJiGmlSE", "Fri Apr 19 18:40:03 ": "RT @Lufthansa_DE: Strike on 22.04.13 to cause heavy flight disruptions. Information on flight status available Saturday evening http://t ...", "Wed Apr 17 22:23:58 ": "@RossTallon Hi, you need to check with your airline or handling agent they are best placed to assist you with this information.", "Wed Apr 17 10:13:22 ": "@samusthe58th James, the T2 car park was full this morning and reserved for those with pre-booked spaces. All other car parks open.", "Wed Apr 17 15:01:28 ": "The highest temperature recorded in Ireland since records began was 92F or 33.3C on June 26, 1887 at Kilkenny Castle, Co Kilkenny #irishfact", "Fri Apr 12 14:23:50 ": "@eltravo Stands for Irish Naturalisation &amp; Immigration Service.Which is responsibility of Garda National Immigration Bureau (GNIB) at Dublin", "Wed Apr 10 08:45:35 ": "To celebrate our 100th #Irishfact we've a €100 @TheLoopShopping voucher to be won. Just RT &amp; follow @DublinAirport to enter #freestuff", "Wed Apr 10 08:31:17 ": "WB Yeats' poem ‘September 1913’ was first published under the title ‘Romance in Ireland’ in The Irish Times in Sept 1913 #irishfact", "Wed Apr 10 11:27:52 ": "You can be a new follower or an old one. To enter the competition for the €100 voucher you must RT earlier tweet &amp; follow @DublinAirport", "Thu Apr 11 07:30:37 ": "For the best car parking rates at @DublinAirport always book online. http://t.co/PeMCFX35fb", "Mon Apr 08 17:29:05 ": "We are the 6th largest airport in the world in terms of Twitter followers via @sven_solterbeck blog http://t.co/CHibELuFbN", "Fri Apr 12 14:14:29 ": "@eltravo An Garda Síochána have responsibility for passport control in both T1 &amp; T2.", "Fri Apr 12 10:01:02 ": "Ireland’s first cinema, the Volta, was set up by James Joyce and opened for business in December 1909 on Mary Street in Dublin #irishfact", "Mon Apr 22 10:47:56 ": "We've received 5 nominations in #sockies13 for our use of social media. Two nominations for Dubliners @DublinAirport #socialmedia"}