{"Sat Apr 20 14:02:48 ": "RT @JustinRYoung: Remember when you watched 24 and you were like, “how can all that shit happen in one day?”", "Wed Apr 03 22:48:05 ": "This is the best thing on the internet today. #chanandlerbong http://t.co/W6neKVRWqX", "Mon Apr 15 20:21:42 ": "RT @rolldiggity: Twitter does its best work in the first five minutes after a disaster, and its worst in the twelve hours after that.", "Mon Apr 01 03:01:53 ": "Truth. RT @tomgara: April Fools Day is to funny what New Years Eve is to fun.", "Wed Apr 03 23:05:40 ": "RT @nuggits2: White people almost kissing- a book by Nicholas sparks http://t.co/QbSfBlxf6A", "Wed Apr 03 18:20:44 ": "\"Apparently hashtag has something to do with Twitser. Twizzler. Twizzler? Is it Twizzler? I love their licorice.\" http://t.co/cNn7S3JbnY", "Wed Apr 10 17:04:04 ": "RT @HuffPostRelig: \"I am a proud Muslim-American woman and I'm tired of being told that I'm oppressed\" http://t.co/OMoSSqHoxR", "Thu Apr 04 03:37:20 ": "You would think that people and their dogs have a clear master-pet relationship, until you remember who cleans the other's poop.", "Tue Apr 09 17:05:55 ": "RT @gabrielsherman: When did it become July?", "Wed Apr 10 15:20:24 ": "@reemarasool from the bottom of the chain, but don't get me started on interns....", "Mon Apr 08 14:09:05 ": "Working in the news biz sucks when you miss an episode of Mad Men. #spoilers", "Sat Apr 06 05:03:02 ": "@YE_faz basically a cross between all three", "Sat Mar 30 00:58:20 ": "@SarahKSilverman but no more Jason?? Sonny foreva.", "Tue Apr 09 16:41:08 ": "Awesomeness required. RT @NYMagJobs SUMMER INTERNSHIP: Public Relations. 4 days/week for school credit. http://t.co/bXtghT9nXB", "Wed Apr 10 14:31:07 ": "Looks like I'll be spending my whole morning telling people that @nymag is not the same as @nytmag. No Weiner here today, folks.", "Mon Apr 08 19:40:01 ": "RT @meenasaurus: Scientists: Oh yeah, size does matter. http://t.co/CnaztAexov", "Sun Mar 31 15:32:22 ": "This Easter...THE NORTH REMEMBERS. Happy @GameofThrones day to you all! #GoT", "Wed Apr 17 19:22:21 ": "@Riy Al-Jazeera America can't get here soon enough", "Fri Apr 19 14:47:14 ": "RT @robdelaney: As far as I’m concerned, the scariest thing to come out of the Muslim world is algebra.", "Sat Apr 20 14:07:37 ": "It's a fallacy to assume that bc many terrorists are Muslim, many Muslims are terrorists. The NYPost exploited that. http://t.co/YyfySoHysE", "Tue Apr 16 21:23:10 ": "RT @90sgirlproblem: Praying for a Friends reunion show so we can find out what Ugly Naked Guy has been up to. #90sgirlconcerns #Friends", "Tue Apr 09 21:03:25 ": "@reemarasool hopefully just a paperwork error, but now I'm a lil worried....", "Wed Apr 17 18:40:36 ": "RT @heartlesley: That sultry pony @NYMag snagged @jodyrosen. New pop critic acquiring famez while the rest us eat #cereal and #cry all o ...", "Fri Apr 12 22:32:25 ": "RT @trevso_electric: Welcome to Twitter. We are the men and women behind your friend's funny Facebook statuses.", "Wed Apr 10 14:26:08 ": "@reemarasool I miss when people were talented", "Mon Apr 01 14:13:51 ": "National Magazine Awards nominations are up! Six for @NYMag. Woot! http://t.co/BIMmWrXuR9", "Sat Mar 30 19:44:28 ": "RT @TVMoJoe: If you love #GameOfThrones and loathe the GOP's more radical elements, follow @JoffreyGOP2016 #tcot", "Sat Apr 20 00:31:34 ": "RT @EmilyShornick: Wake me when we're allowed to talk about something else.", "Fri Apr 12 22:23:15 ": "Just realized 'Zou Bisou Bisou' can easily be replaced with 'Scooby Dooby Doo'. #madmen #amiright", "Wed Apr 17 14:01:08 ": "Important read on the treatment of the Saudi Marathon man in the @NewYorker today. http://t.co/jrHU7xVmRj h/t @PIX11Narmeen", "Sun Mar 31 22:37:06 ": "@jeffwilser @tomchau so many characters, it does get overwhelming. I read a 'who's who' guide online when I started and it made more sense", "Mon Apr 22 14:39:06 ": "RT @SamEwen: I feel like it's a holiday when none of my Facebook friends have a birthday to be reminded of.", "Tue Apr 09 21:01:13 ": "RT @jeffwilser: @shama_ny That would be an *amazing* way for a woman to tell a dude that he's the father.", "Sun Apr 14 15:34:15 ": "RT @christaylor_nyc: A social media will: What happens to your email, Facebook and Twitter after you're gone? http://t.co/M36Uoy2hBD", "Wed Apr 03 14:28:03 ": "@iamkenza from that expression, it could only be work emails 😒", "Sat Apr 13 20:18:14 ": "Yes, mom, I do have friends. All ten seasons, in fact.", "Mon Apr 22 01:36:13 ": "This week's @nymag cover: The 21st century converges on Boston. http://t.co/WsKF41wbOv", "Mon Apr 15 23:28:44 ": "@AonghasCrowe @erikrush of course Fox News would be the outlet to let a bigot like him have a public voice", "Thu Apr 18 00:01:30 ": "@julesdwit uhm, besties! Chandler &amp; Joey style", "Wed Apr 10 01:07:30 ": "Makeup-free celeb pics are supposed to make you feel good, but Emilia Clarke w/o makeup is better than me IN makeup. http://t.co/dwMHzVfNGm", "Wed Apr 10 15:32:50 ": "@reemarasool haha my thoughts exactly!", "Tue Apr 16 00:01:24 ": "@Deanofcomedy @truthzone ignorance at its finest. I'd also like to hear what Fox News has to say about Erik Rush's hate tweets.", "Thu Mar 28 22:52:11 ": "@LoriFradkin haha sorry about that! Hope you had a good time otherwise", "Sun Mar 31 22:03:26 ": "@BilalNizami how about a spoiler instead?", "Wed Apr 17 01:33:30 ": "RT @DKThomp: Well now thats just a winner. RT @JoshuaGreen: I defy anyone to top this headline: https://t.co/CzW3N23130", "Mon Apr 08 03:27:02 ": "Is @Buzzfeed really the future of journalism &amp; advertising? @Peretti may have the algorithm. New from @nymag: http://t.co/0cY9NHkzz4", "Sun Mar 31 22:49:11 ": "@BilalNizami I wish, just read the books like a good nerd should", "Tue Apr 16 00:38:36 ": "RT @profkrg: Being right is much more important than being first. #journalism #media", "Sat Apr 20 15:09:47 ": "RT @digimatized This entire twitter feed is high.", "Fri Apr 12 15:16:14 ": "I think my biggest work fear is accidentally forgetting to BCC a press release. #PRproblems", "Fri Mar 29 20:56:14 ": "Love reading @HuffPostWomen's tweets from women every Fri. I'm in here today! Thanks @lorifradkin &amp; fabulous ladies. http://t.co/s3MSwT7NQK", "Mon Apr 15 23:09:52 ": "Disgusting. Fox News contributor @ErikRush tweets over the bomb in Boston to blame Muslims: \"let's kill them all' http://t.co/vhGOEK2THP", "Sun Mar 31 22:39:32 ": "@TomChau @jeffwilser excellent suggestion", "Fri Apr 19 05:57:05 ": "RT @rossneumann: Twitter really should have push notifications that tell you when your timeline freaks the fuck out at night.", "Wed Apr 10 01:13:30 ": "@FarheenDayala seriously, if they're posting these pics, they need to look as awful as I do the day after a breakup or something", "Wed Apr 17 14:55:58 ": "RT @ConnectingtheWd: @shama_ny @ghoshworld I would wear that deportation stamp like a badge", "Wed Apr 17 16:54:39 ": "#FF @JodyRosen, who is joining @nymag as our new pop critic! http://t.co/As7xIlQM4S", "Sat Apr 06 04:53:48 ": "Is this supposed to be a dog or a baby? #holidayinn http://t.co/zCcM6Yxftl", "Fri Apr 05 17:16:42 ": "Wow. RT @kristen Kind of bubbling over with jealousy after looking at @Hootsuite's crazy cool new office http://t.co/3CyUAnOczA", "Fri Mar 29 18:44:46 ": "@buzz60 thanks! If only I could change my job title to that ;)", "Wed Apr 17 01:26:48 ": "RT @jakefogelnest: .@Twitter I am a 34 year-old man. http://t.co/OvxQnwks3l", "Sat Mar 30 01:47:22 ": "@curerbell I can never look at her and not think of Rachel. She was perfect.", "Mon Apr 01 16:45:06 ": "RT @jeffwilser: Or Valentine's Day is to Love. RT @shama_ny Truth. RT @tomgara: April Fools Day is to funny what New Years Eve is to fun.", "Wed Apr 17 14:50:08 ": "In ridiculous news of the day RT @ghoshworld Saudi Arabia deports 'irresistible' men deemed 'too handsome' to women http://t.co/yut32sU5iu", "Fri Apr 19 15:04:27 ": "RT @JuddLegum: Things we'll do to keep people safe: Lock down an entire city for hours\n\nThings we won't do: A 5 min background check bef ...", "Wed Apr 17 19:27:09 ": "RT @ktumulty: Dear Media: Tomorrow, try decaf.", "Sat Apr 20 00:57:57 ": "RT @MissMJByrne: I feel like they just caught Voldemort.", "Fri Apr 12 15:26:10 ": "@reemarasool that and accidentally replying all. Damn Outlook for all the anxiety it causes me.", "Mon Apr 01 00:46:08 ": "Dragons &gt; Zombies. #gameofthrones #thewalkingdead #NERD", "Tue Apr 09 20:58:47 ": "My accountant just told me that my W4 forms indicate I have three dependents. Three kids I never knew about! #HappySpring?", "Fri Apr 05 15:15:48 ": "Upcoming next wk in @nymag: Old, new &amp; evolving media. @FrankRichNY on the NY Times, @riceid on Buzzfeed, and a convo with Bob Silvers.", "Thu Apr 11 00:57:05 ": "New York is the best place to be for the times when you don't want to do more than grunt at your fellow human being.", "Wed Apr 17 15:04:14 ": "Marta Kauffman says a FRIENDS reunion will never happen. So just going to sit in a corner now and cry. Forever. http://t.co/8zeXMIcelC", "Mon Apr 08 14:33:36 ": "Woot! RT @FishbowlNY 2013 Magazine of The Year finalists include @Esquiremag, @NYMag, @TIME and more. http://t.co/2HSCvMTC9D", "Sat Mar 30 00:55:22 ": "@joshgreenman the Hunger Games and N Korea... It all makes sense now", "Wed Apr 17 03:27:07 ": "@TashweenAli @KariInWonderlnd sigh, I wish but don't think any truth to it. http://t.co/XZj1TNC9GG", "Thu Mar 28 20:13:19 ": "Weddings time. Kicking off @nymag's New York Weddings event with the Wedding Suite @Nordstrom. http://t.co/7Z4bVeopp3", "Tue Apr 02 19:40:58 ": "Publicists who pitch other publicists: You're doing it wrong.", "Thu Apr 11 21:38:58 ": "If I hold the door open for you and you don't say thank you, I reserve the right to trip you.", "Fri Mar 29 19:35:18 ": "An infographic on work management, in @GameofThrones terms. Love. http://t.co/H6zfbMP6HC #GoT via @loganhill33", "Sat Mar 30 00:25:20 ": "I need more friends who call me for the sole purpose of chatting about Jennifer Aniston's love life.", "Mon Apr 22 16:47:05 ": "@nycfoodtruck when are the trucks coming back to One Hudson?", "Fri Apr 05 13:57:22 ": "This GIF of a little girl refusing to kiss Prince William is flipping adorable. http://t.co/4kflZ1A0HP", "Wed Apr 03 03:23:44 ": "Me IRL. http://t.co/oz5buYALIR", "Sun Apr 21 18:32:14 ": "Reasons DC beats NYC: Joining a djembe drum circle. http://t.co/6tk3dIeXSq", "Sat Mar 30 00:49:17 ": "@Oscarwatcher ha good point", "Thu Mar 28 20:41:54 ": "@jorcohen I'd pray more for @realDonaldTrump's PR person", "Tue Apr 09 21:01:56 ": "@jeffwilser not the case thank GOD!", "Tue Apr 16 19:24:36 ": "Mad Men Kidz! Lil Don, Lil Betty, and the rest of the gang. http://t.co/uyQmol4Mna Lil Megan is perfect. http://t.co/qd73OXxapj", "Fri Mar 29 19:12:21 ": "RT @zachbraff: Jon Hamm's penis has a good publicist.", "Mon Apr 01 18:45:28 ": "RT @Millie: This really is the best thing on the internet right now: http://t.co/TVZ8uv6ZYd", "Thu Apr 18 14:28:04 ": "It's a shame we give the New York Post so much attention when it's purely a sensational tabloid rag. http://t.co/nbQOcgy0WF", "Mon Apr 15 18:24:40 ": "RT @ghoshworld: Happy Bengali New Year!", "Fri Apr 19 14:40:40 ": "President Obama, George W. Bush, and Bill Clinton all avoided talking Chechnya. http://t.co/2DPpcsxGa6", "Thu Apr 18 00:04:39 ": "@stefanjbecket a whole different world indeed!", "Wed Apr 10 14:38:14 ": "@adamrenz -_- I need to find an appropriate GIF to respond to the 758932752752x I've had to correct this today", "Sun Mar 31 21:57:20 ": "Worst home remedy for being sick ever. http://t.co/DLwHfN9Dn3", "Mon Apr 15 23:18:28 ": "RT @RaniaKhalek: Will the @AP also dedicate an entire article to Fox News contributer Erik Rush's desire to see all Muslims killed? http ...", "Tue Apr 09 21:23:19 ": "@ConnectingtheWd ha my life is nowhere near this interesting", "Tue Apr 16 00:11:47 ": "@TheMariamZ @Deanofcomedy @truthzone appalled these people try to hide their racism and bigotry behind the false claim of 'patriotism'"}