{"Sat Apr 20 16:54:16 ": "@susannecraig sue, you know my abs are better than that.", "Fri Apr 19 16:10:18 ": "If @AdrianChen is right and @j_tsar is the suspect's Twitter account, he is the \"best beer pong player in Cambridge\" http://t.co/VhOFge7oRd", "Sat Apr 20 00:08:18 ": "Kickstarter campaign in 3, 2... RT @doreeshafrir: Neighbor of boat owner on @WCVB: \"That boat is his baby. He's going to be heartbroken.\"", "Thu Apr 18 16:15:52 ": "@MattZeitlin yes. always cringe.", "Wed Apr 17 13:36:38 ": "OK those have been my Very Serious Thoughts for today, now look at this gif of a man riding a tiny bicycle: http://t.co/gJtzCSFVJO", "Thu Apr 18 18:26:51 ": "So Christine Quinn repaid Lloyd Blankfein's lukewarm endorsement by \"accidentally\" calling him a Republican? http://t.co/hVrfwX9fvF", "Sat Apr 20 16:49:59 ": "My profile of grad student Tom Herndon is still getting insane traffic. Hollywood, make a movie about him! http://t.co/ACetNgPAE9", "Fri Apr 19 15:34:45 ": "Who plays the uncle in the Hollywood remake of this? DeNiro, right?", "Thu Apr 18 21:58:33 ": "Any George Soros obit that doesn't include his crazy girlfriend drama isn't a proper George Soros obit: http://t.co/OfSTm4kHqr", "Sat Apr 20 05:35:54 ": "Boston guy looks for love on Craigslist: \"Why don't you come over here and we can pretend we're still on lock down\" http://t.co/F3IVpqS5hT", "Tue Apr 16 21:06:50 ": "@lopezlinette bored", "Fri Apr 19 05:45:01 ": "My friend in Cambridge writes, \"Ugh. I'm waiting for Bane to appear.\"", "Thu Apr 18 13:53:41 ": "Stelter kills RT @clairehoworth: so rapt by @brianstelter's story that I actually walked into scaffolding reading http://t.co/QoSiDhNxB7", "Tue Apr 16 21:03:12 ": "The Goldman Sachs Annual Report Look Book, 1999-2012. http://t.co/VXBd6IUGIH", "Tue Apr 16 21:56:42 ": "@kaylatausche + being rich for a long time, I guess.", "Thu Apr 18 15:22:02 ": "Instagram founder @Kevin appears in the Time 100 in a 3-piece suit. Is that a Silicon Valley first? http://t.co/LfMDwb0aKA", "Fri Apr 19 15:19:14 ": "@daweiner Yeah. Did it with the hurricane, etc. Part of her shtick.", "Thu Apr 18 15:14:51 ": "@brianstelter That is amazing. Hope you also wore trench/fedora and dark glasses.", "Tue Apr 16 21:11:36 ": "@felixsalmon ok Mr. Aerial Photography Expert", "Thu Apr 18 20:14:29 ": "@rossneumann @michaelbd uhhh how do we know that's the same girl?", "Fri Apr 19 23:21:41 ": "RT @nycsouthpaw: \"Hey Tony, did yah check undah the covah of thaht boat?\" -BPD ten minutes ago, probably", "Sun Apr 21 19:05:28 ": "@retheauditors aw shucks", "Thu Apr 18 21:13:40 ": "#bravebrand RT @fmanjoo: Sheraton logo getting a lot of airtime.", "Thu Apr 18 21:43:25 ": "RT @ditzkoff: Ok, everyone, let's pitch in on the manhunt. CNN and NY Post, here are some coloring books for you.", "Sat Apr 20 00:47:34 ": "@JennyAnash That was nationwide permission.", "Wed Apr 17 13:32:10 ": "Just catching up on Reinhart &amp; Rogoff’s response to Excel-gate (http://t.co/ksqgJklNIz ) , and a few thoughts:", "Fri Apr 19 16:02:02 ": "I am about to Eat My Feelings.", "Fri Apr 19 05:52:33 ": "@stefanjbecket has to be", "Tue Apr 16 18:36:07 ": "RT @pareene: this is so fun/depressing http://t.co/Z3vILUl2Wz", "Sat Apr 20 16:28:07 ": "It's 4/20 and I'm in Berkeley. I expect I may witness some controlled substance use today.", "Wed Apr 17 14:10:14 ": "RT @Pawelmorski: Excel: Clippy's Revenge (ht @HeroZedge )  http://t.co/6P3uMGfIm6", "Sat Apr 20 00:18:56 ": "RT @lizzieohreally: Come on. RT @Reuters: Magnitude 7.0 quake strikes Szechuan region of china: USGS #breaking", "Thu Apr 18 20:59:35 ": "@Neil_Irwin @Matthew_C_Klein @zengerle @TheStalwart I seriously think there should be a movie made about this guy. What a story.", "Fri Apr 19 15:11:54 ": "Hey business TV network: you don't have to interrupt your manhunt coverage to bring us Dell stock price updates. Really, we're good.", "Tue Apr 16 19:53:28 ": "RT @TheStalwart: FULL TEXT: Reinhart And Rogoff respond to study slamming their debt paper. http://t.co/4oJPkD0XTJ", "Thu Apr 18 17:00:59 ": "\"I push more code by 9 AM Pacific than most people do in a lifetime.\" http://t.co/BaoSAHvBHq", "Tue Apr 16 21:17:49 ": "@felixsalmon Sorry, I'll alert our Editor for Accuracy in Listicles", "Wed Apr 17 18:13:07 ": "RT @jwherrman: Worst possible speculative fiction prompt: \"Twitter exists during the OJ trial\"", "Thu Apr 18 20:16:49 ": "Just did an interview with the grad student who effed up Reinhart &amp; Rogoff. Up shortly.", "Thu Apr 18 18:25:04 ": "I'm actually fairly impressed with the sorority e-mail, like, as a piece of writing. http://t.co/0zfEvuRC7g", "Thu Apr 18 15:41:51 ": "The guy who took down Reinhart &amp; Rogoff's famous study was a 28-year-old UMass grad student? Wow. http://t.co/yfr7wIKZAY", "Fri Apr 19 15:25:35 ": "It's almost like...you didn't want us...to see this... RT @ReutersUS: U.S. Boy Scouts set to end ban on gay members http://t.co/yQnIlB3H15", "Thu Apr 18 15:03:29 ": "@MattZeitlin Gawker currently in an an all-staff meeting", "Fri Apr 19 06:26:21 ": "Boston Globe reporting that the guy police have in custody is 1 of the 2 marathon bombing suspects. http://t.co/1SZLdo4kOa", "Fri Apr 19 16:39:48 ": "@MattZeitlin @max_read only heroes get #verified", "Thu Apr 18 22:14:14 ": "RT @BennettHMarcus: @GoldmanSachs Lloyd Blankfein on his style: \"I open up my closet, and there’s a dozen absolutely identical suits.” h ...", "Wed Apr 17 13:34:08 ": "...  it allowed partisans to cloak their agenda in the language of academic neutrality. (3)", "Sat Apr 20 00:44:44 ": "OK TIME FOR A DRINK EVERYONE", "Wed Apr 17 21:19:45 ": "@rembert @lindseyweber rem come to club v, it's nice in here", "Thu Apr 18 01:20:59 ": "@jessmisener congrats", "Thu Apr 18 15:18:30 ": "Nominative determinism case study Rich Ricci is out at Barclays investment bank. Tragedy, that. http://t.co/V4uOEqHi5K", "Thu Apr 18 20:26:37 ": "@UmadBrazi1 Herndon", "Fri Apr 19 15:14:32 ": "@daweiner She always does this.", "Fri Apr 19 14:02:15 ": "RT @juliweiner: Kid on CNN just described Tsarnaev as “an actual angel” who “smokes a little weed” but is not, like, “some foreign dude.”", "Thu Apr 18 17:02:57 ": "@jwherrman do u even push code, bro?", "Wed Apr 17 13:34:49 ": "Academics crave relevance. R&amp;R’s desire to have their work widely read led them to play up its most politically useful application. (4)", "Fri Apr 19 13:32:16 ": "RT @arosegregory: dooo doo dooooo, just waking up, walking around, making some coffee, reading the WHAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA ...", "Wed Apr 17 13:34:01 ": "R&amp;R’s flawed 90% debt-to-GDP figure wasn't the biggest problem with their study, but it was the most dangerous because ... (2)", "Thu Apr 18 21:06:20 ": "@CardiffGarcia That irked me too. Like, dude, you trained him!", "Tue Apr 16 21:06:34 ": "Shoutout to Morgan Stanley's ugly-ass annual report, which I think is *beautiful* http://t.co/VXBd6IUGIH  (scroll to bottom)", "Wed Apr 17 20:27:50 ": "Uh oh, @max_read is not gonna like my new blue check mark.", "Mon Apr 22 13:34:48 ": "RT @samfbiddle: Good morning, I'm happy to announce my latest pivot: Valleywag is back http://t.co/4g0h0dPY8t", "Fri Apr 19 15:54:37 ": "Dunkin' Donuts are the cockroaches of the restaurant world. You can drop a nuke directly on them – won't close.", "Thu Apr 18 13:47:19 ": "Very excited to read @brianstelter's morning TV book, which is amazing considering how little morning TV I watch. http://t.co/XVPihxWFKS", "Fri Apr 19 15:35:06 ": "@justinjm1 jinx", "Thu Apr 18 15:11:52 ": "@brianstelter And they didn't recognize you and stop talking?", "Thu Apr 18 21:52:48 ": "Wait, George Soros died at age 30? And Reuters house style is Roman numerals? I'm confused. http://t.co/KEKhrrGsYl", "Wed Apr 17 13:35:40 ": "A lot of the glee anti-austerians feel today is a response to the smugness and certitude with which deficit hawks have made their case. (6)", "Tue Apr 16 21:00:07 ": "So Dan Loeb used his Yahoo turnaround winnings to buy Sandy Weill's old yacht? http://t.co/aCA2GQDRFS", "Tue Apr 16 21:19:29 ": "@felixsalmon No, he was Editor for Telling Me My Tax Posts Are Boring", "Fri Apr 19 17:47:54 ": "Remember the Justin Bieber/Anne Frank thing? That was THIS WEEK.", "Thu Apr 18 20:45:57 ": "IMO the best part is that Reinhart basically blew the kid off as unimportant, and then he killed her seminal work. http://t.co/ACetNgPAE9", "Fri Apr 19 13:20:50 ": "Boston friends, you have my permission to have a drink before noon today.", "Thu Apr 18 20:39:01 ": "Here it is: meet Thomas Herndon, 28, who put the hurt on a famous econ study and became an insta-academic-celebrity. http://t.co/ACetNgPAE9", "Wed Apr 17 13:35:17 ": "But it’s shocking, and disingenuous, for R&amp;R to claim they played no role in the politicization of their study. They clearly did. (5)", "Thu Apr 18 21:23:00 ": "Quick everyone post the photos.", "Thu Apr 18 21:54:57 ": "And leaves out the lamp-throwing! RT @mattyglesias: It’s also a remarkably ungenerous assessment of Soros’ life and contributions.", "Fri Apr 19 13:24:26 ": "Ugh RT @KateKellyCNBC: Will the Boston terrorism renew gold's allure as a fear trade?", "Thu Apr 18 16:16:47 ": "@MattZeitlin opposite of dry powder?", "Tue Apr 16 19:56:55 ": "Shorter Reinhart &amp; Rogoff: We're not gonna talk about the Excel mistake we made, but here are a bunch of boring words to distract you.", "Fri Apr 19 15:16:58 ": "@TheStalwart Have fun at airports!", "Wed Apr 17 20:48:53 ": "RT @katelaurielee: On @medium: exclusive excerpt of @michaelpollan's new book COOKED https://t.co/KzwaUpboO5 Read w/Mary Roach's GULP ht ...", "Wed Apr 17 13:41:13 ": "@IvanTheK Eminently possible!", "Sat Apr 20 00:43:28 ": "NBC: \"It's over.\"", "Thu Apr 18 15:32:13 ": "@JamieShupak Except they spelled his name wrong!", "Wed Apr 17 14:40:18 ": "What is a \"bitcoin?\" RT @zseward: WSJ does its first big bitcoin piece and the currency jumps 35% today.", "Fri Apr 19 16:28:38 ": "@DKThomp slow clap", "Sat Apr 20 00:25:41 ": "The Amish should take out an ad campaign. \"This whole week? We got to ignore *everything*\"", "Wed Apr 17 16:17:55 ": "RT @mattyglesias: Austerians last week—Reinhart &amp; Rogoff prove we’re right! Austerians this week—R&amp;R is immaterial to our argument!", "Fri Apr 19 15:53:57 ": "\"Select Dunkin' Donuts restaurants in the Boston area are open to take care of the needs of law enforcement\" http://t.co/TCJ5TiW8L0", "Fri Apr 19 20:13:13 ": "!!! RT @rortybomb: Hearing word that Thomas Herndon, the grad student who replicated Reinhart/Rogoff, is going on Colbert Report next week.", "Tue Apr 16 21:08:01 ": "@samfbiddle per @BenDWalsh, it's tierra del fuego, which is some rich person hangout i guess?", "Thu Apr 18 16:00:27 ": ".@marissamayer RTing some harsh criticism of Yahoo right now.", "Sat Apr 20 00:13:43 ": "RT @ericspiegelman: why not just tow the boat to jail", "Thu Apr 18 20:07:35 ": "Re: Sorority Girl (I agree) RT @michaelbd: 4) I would hire her in almost any media enterprise.", "Fri Apr 19 15:16:21 ": "RT @MattRosoff: Love the headline of @SAI's \"10 Things You Need To Know\" this morning. Yeah, pretty much: http://t.co/0cW2EkaiBy", "Thu Apr 18 14:37:48 ": "RT @maureenoco: Now that Peter Dinklage has discussed being a DwILF, we must ban all terms that end in -ILF forever. http://t.co/C777f1Fdx9", "Wed Apr 17 13:32:37 ": "Even Harvard professors make mistakes. But this is a bigger one than most, and there should be some institutional repercussions. (1)", "Thu Apr 18 22:07:38 ": "RT @MattZeitlin: Lol like George Soros can die", "Fri Apr 19 14:10:17 ": "Not now, Martha. RT @MarthaStewart: The project of moving all the roses from my E Hampton home to my Bedford farm-on 2days blog."}