{"Thu Feb 28 05:36:15 ": "deadlines staring at me down the barrel. this is what happens when you don't drink coffee anymore.", "Fri Feb 01 14:38:55 ": "Just played a covers gig in Adelaide. Covers. Adelaide. But had a blast with Camilla Charlesworth playing some 90s... http://t.co/MYOYhHR7", "Wed Feb 20 08:14:30 ": "Seaford Day and Night Clinic is one of the best Medical Centres ive been too, clean, new, they have a psychologist... http://t.co/r9neF9R0", "Fri Jan 18 07:35:15 ": "so much work to do but a bright friday evening is staring at me through the window #playtime #balmy #wishicouldpauselife", "Thu Mar 21 08:29:35 ": "@dpsandford haha yes it's set to be a killer night :)", "Mon Jan 14 04:27:53 ": "big ups to Homebrew on PBS FM for playing my tunes today! one love &lt;3", "Wed Mar 06 09:52:33 ": "a vanilla slice changed my life today. in other breaking news, im playing the Laundry soon, how i've missed you... http://t.co/HxhtkVAzmN", "Thu Mar 07 03:17:04 ": "whaddup sunny coast! we're coming back to take over Solbar for the night with Electrik Lemonade on Easter Sat, so... http://t.co/dNATaeoP3e", "Thu Jan 03 22:25:40 ": "sun is shining, weather is sweet yeh... i love the sound of cicadas on a summers day. heading to maroochydore to... http://t.co/PdKiLSci", "Tue Jan 22 21:54:39 ": "@Lisa_Sheena haha were for art thou queen of sheeba", "Tue Feb 05 02:56:32 ": "good news: we r playing melbourne MAR 29 at Laundry Bar\nbad news: its the only melbourne show for the year\n\nhope... http://t.co/caLpzcuN", "Mon Dec 31 08:15:11 ": "here is my live performance at this year's Waiata Maori Music Awards, i was so thankful and happy to be nominated... http://t.co/NU2sKU18", "Tue Jan 29 06:50:58 ": "gross, dark age laws in australia. the WA govt just granted woodside 'permission to desecrate an Aboriginal site'... http://t.co/7hBqLcn7", "Wed Feb 27 03:36:32 ": "sometimes i just want to stop work and drink beer. #hoha", "Sun Mar 17 09:18:59 ": "@HuwJoseph  i sure am ! you in town ?", "Mon Mar 04 02:30:04 ": "so i've been spending a lot of time in America, and it is SO EASY &amp; CHEAP to eat junk food. its scary. this is for... http://t.co/PtesL98UO2", "Mon Jan 14 04:04:34 ": "ppl who keep their word stand out in this industry.", "Mon Mar 04 15:42:28 ": "how does a girl get #beyoncetickets to brooklyn. impossible.", "Sat Mar 16 23:51:33 ": "Back in Adelaide briefly, Playing the Glenelg Surf Club today. Our time here is coming to an end.. come down if ur free, 3pm-6pm xo", "Mon Apr 22 02:06:49 ": "We just hit 3000 likes on our music page! Welcome to all the new listeners :) Camilla and I are in a giant... http://t.co/Nnf0o4bpXE", "Fri Jan 18 10:53:19 ": "remember this lil 'ol thang? i just made it avail online :) http://t.co/YwZadPdp http://t.co/GWfnKqxP", "Fri Apr 19 22:44:08 ": "#wellingtonairport was interesting, #christchurchairport followed suit with a fire alarm and an… http://t.co/qdFjbuYrUt", "Sat Mar 30 09:27:39 ": "Double pass for tonight's show at Solbar goes to.... John Cargo! Just mention your name at the door where 2... http://t.co/O8mOApO7Dm", "Thu Jan 31 10:13:38 ": "would any northern queenslanders come see my show if i played in Cairns? might have to rock it solo acoustic like... http://t.co/ZCWD2xG5", "Tue Feb 05 15:41:18 ": "oww! this just clicked over 30,000 views! thanks for bumpin it at your BBQs :) hope to see you at the melbourne... http://t.co/E8Az9wk8", "Mon Apr 22 05:24:16 ": "Post-tour #roadtrippin home. #aotearoabeauty http://t.co/adhFBGrd79", "Wed Feb 06 03:58:59 ": "QLD! im hitting up the sunny coast with my band for a show on my way out to NZ, so come for a drive, pitch a tent,... http://t.co/SbSG40qM", "Mon Dec 31 00:20:28 ": "my fav new fan, my lil cuzzy harlee :) http://t.co/EJn3qb98", "Thu Apr 18 00:43:43 ": "I'm sill in NZ.. I could get married! Haha now it's your turn Australia. We are celebrating tonight at our sold... http://t.co/LU0ouNGBeJ", "Fri Feb 08 05:23:33 ": "i love dealing with pro's, Derringers Music Adelaide just ordered us in some sweet gear for a sweet deal and lent... http://t.co/xYKuytPk", "Fri Mar 29 08:31:20 ": "And the double pass goes tooooo... Lynn Matthews! Just mention your name at the door and 2 tickets will be there... http://t.co/2gamDxKxmJ", "Sun Mar 03 13:28:52 ": "played 3 covers gigs this weekend. good practice for future epic stadium shows me thinks...", "Fri Apr 05 04:47:06 ": "some live footage from melbourne :) http://t.co/8bmidiCdqC", "Fri Jan 25 09:38:28 ": "@serenawilliams 'I Go' from Neon Heartache :) http://t.co/yAMUeqhi", "Mon Feb 18 01:15:35 ": "hitting the tropics! playing cairns Mar 15, cant wait! http://t.co/5gthHjxD", "Sat Feb 09 03:17:41 ": "we landed in adelaide at the right time, fringe festival, womadelaide, and the Spirit Festival is on next... http://t.co/r9P5qdj1", "Tue Apr 02 03:51:57 ": "had a ballin time on our easter tour!! thanks to everyone who showed up with massive smiles! :) http://t.co/FTgVfSzM5k", "Sun Jan 06 04:17:21 ": "we hit 10,000 views!!! last show of east coast tour tonight, lets crank this puppy brisbane! http://t.co/OhOhqYog", "Sat Mar 30 06:26:13 ": "You were beautiful last night Melbourne, thanks for showing so much love!!! Hope to see some smiling faces at... http://t.co/WXwXAgDhdm", "Tue Feb 12 02:53:28 ": "owww! shortlisted in the APRA Professional Development Awards http://t.co/0iBTfGow", "Mon Jan 07 12:16:05 ": "Tour finished and 2013 well and truly started! Happy new year everyone, follow your dreams! http://t.co/6daCldCm", "Sat Feb 02 02:46:19 ": "@teamtobes haha playing some tunes this Sunday at the highway hotel, will play more originals 5-7, so do some homework! http://t.co/PN5isccG", "Tue Feb 19 15:00:45 ": "Out of action with a sprained neck. So debilitating :( got heatpacks on the go, been to physio, nurofen plus,... http://t.co/CbbjP3Ar", "Thu Apr 11 22:39:29 ": "Tauranga u were amazing last night! Met so many beautiful ppl! Hamilton your turn tonight, it's almost sold out... http://t.co/u2o7mxgROg", "Fri Jan 11 20:05:24 ": "Adelaide-bound. Bye Brisbane! You showed us so much love! Thanks to my amazing family for housing the band too! Xx", "Thu Apr 04 02:33:13 ": "there's some great footage and stills coming forth from this weekends easter tour, send us your images or post... http://t.co/KzIwDxSumy", "Thu Apr 11 07:55:43 ": "Ready to roll ! First show of the NZ tour kicking off in tauranga. Soundcheck sounded HUGE http://t.co/yO1lZP7eug", "Sat Jan 05 03:43:08 ": "Sunshine Coast was such a beautiful gig!!! The room was rockin! Come catch the show in the Gold Coast tonight at... http://t.co/Wh43qsTY", "Fri Mar 29 04:46:07 ": "Giving away the double pass soon, stay tuned. Thanks to everyone who shared the poster! Ur all in the draw :)", "Mon Jan 14 06:26:48 ": "endless hours of preparation, for few precious moments like this! 2013, you and i are going to become good friends :) http://t.co/QfCBI95S", "Sat Dec 29 01:04:14 ": "ever been to Solbar on the sunny coast before? get your paradise on and meet us there jan 4 &lt;3", "Mon Apr 08 02:08:24 ": "if anyone grabbed a sticker, you can use the discount code here for the album http://t.co/I9XHfBarjZ http://t.co/MhrRODfeno", "Tue Apr 02 10:08:57 ": "absolutely astounded by the beautiful people we encountered on this weekends easter tour, melbourne went OFF and... http://t.co/4KBKCkMhEK", "Thu Mar 07 02:40:36 ": "woah!!! YEH GIRRRL!!! http://t.co/fTPbcMvE5L", "Mon Jan 21 11:43:14 ": "im sorry adelaide but i cant seem to find a venue to play in, im getting no love! does anybody know anybody?", "Sat Feb 23 10:22:42 ": "will be in Cairns soon!! owww! http://t.co/853fvBBAXw", "Tue Mar 26 13:11:28 ": "I've got songs coming out of my ears!! Land in Melbourne in the morning and head straight into studio. Meanwhile... http://t.co/uh0QK7BrFh", "Tue Jan 22 07:40:34 ": "melbourne ill be dropping in for a headline show and a brew or two with old friends, late march. more details soon... CANT WAIT!", "Mon Mar 25 02:56:08 ": "cant wait to see you melbourne!!! http://t.co/Ork6WBycC7", "Thu Jan 31 06:12:54 ": "we reached 10k !  here is a a thank you letter from the traditional custodians of the land at james price point,... http://t.co/PJMrcfOi", "Fri Mar 22 01:38:11 ": "RT @OzRockMusic: @jessharlen Will be @Solbar19 Saturday 30 March, 8:30pm... \n\nA beautiful new artist not to be missed!", "Thu Mar 21 08:31:12 ": "@KristenDAlmeida hey Kristen cheers!!", "Fri Apr 19 05:13:54 ": "After a long a$$ drive to Wellington and a few roadside power naps, we are ready to fill up Bodega with soul and... http://t.co/Rkkn0EMFmT", "Tue Jan 08 03:50:26 ": "beautiful brisbane! thank you for showing so much love! &lt;3 http://t.co/4WwUKils", "Mon Dec 31 02:09:07 ": "loving reading every1's resolutions.. if only every day was new years eve.", "Fri Mar 22 11:12:13 ": "Playing a 4hr covers gig with copious amounts of lactic acid drenching all the muscles in my body from... http://t.co/lKqL59truU", "Sat Mar 23 08:58:35 ": "We're jammin, I wanna jam it with you", "Wed Mar 20 01:55:16 ": "gearing up for our melbourne show next week, on good friday! share this poster for a chance to win a double pass xo http://t.co/jM3qnGw5Lr", "Wed Feb 06 08:08:38 ": "deadlines!!! i like moving at this speed though #infullflight", "Tue Feb 26 14:37:03 ": "cairns i cant wait to visit, 2 weeks to go! posters are up :) http://t.co/2HewOQYBTS", "Fri Jan 11 04:26:04 ": "Wow!!! This new TV show \"Made in Jersey\" recently aired on CBS in the US, and they played \"Let You Down\" in one of... http://t.co/IK5JofKR", "Mon Mar 18 09:30:59 ": "Kia ora NZ!! I'm coming home! I'm super stoked and very privileged to be supporting the awesome cuzzy Jayson... http://t.co/171IudvTrz", "Fri Jan 25 09:20:14 ": "RT @common: In our daily lives, we must see that it is not happiness that makes us grateful, but the gratefulness that makes us happy. - ...", "Sat Apr 06 04:57:05 ": "Playing our last gig in Australia tomorrow at the highway hotel in Adelaide, 3pm, last chance to grab a Tshirt before we take them to NZ!", "Sun Dec 30 02:23:06 ": "lots of ppl keep asking me if im playing in bris soon, or have no idea that we're playing on the sunny and gold... http://t.co/9OG02Vzf", "Tue Mar 26 17:37:16 ": "4am... finally ready for bed but have to go to airport in half n hour to fly to melbourne... the zombie begins here.", "Tue Jan 22 23:24:28 ": "Woah! Let you down just landed another US TV show, hello big fat pay day!!!!!!! Endless hours of struggling to... http://t.co/hyLvxk8E", "Tue Apr 09 00:44:09 ": "2hrs 45min away from being in NZ :) the Christchurch show just Sold Out so if u want to come to one of the other... http://t.co/ecJ40euAwx", "Sat Jan 19 02:33:24 ": "having more success getting my songs on American TV than on Aus radio. not complaining! publishing = bacon.", "Fri Jan 04 08:25:15 ": "loving this gig already, swim at the beach followed by a stella soundcheck, and a personalised cocktail of the... http://t.co/LtccyBC7", "Wed Mar 20 14:40:49 ": "these are our 70's, and this is our revolution. so good to see so many straight ppl publicly and pro-actively... http://t.co/ZrGauEOM5k", "Mon Mar 25 01:40:32 ": "RT @TheEllenShow: 11am Tuesday in Birrarung Marr Park! Are ya ready Melbourne? I can't hear you! I can't hear you! Probably because this ...", "Thu Feb 14 07:28:56 ": "my valentine Camilla Charlesworth... *wolf whistle* http://t.co/JyrzFqDa", "Tue Jan 22 21:55:43 ": "@yeahgooodthanks @southern_fm nice one! Cheers ya'll !", "Sat Mar 30 23:30:21 ": "The sun is cranking today! We'll be playing the Ocean Street Festival on the main stage at 3:30pm, bring some sunscreen!", "Wed Jan 02 14:34:49 ": "Day 1. Done. Thank you Byron Bay!! Sunshine Coast your next.", "Sun Feb 17 23:56:57 ": "grant deadlines, posters to design, songs to write, vocals to record, invoices to chase, flights to book, there... http://t.co/3tR4yR6r", "Mon Feb 04 03:18:14 ": "a balmy afternoon in south australia with Camilla Charlesworth. we may or may not have been playing peter andre. http://t.co/r6M2AJaA", "Thu Jan 03 12:35:06 ": "Dammmn Byron! You have inspired me to return for a longer term. Good ppl, good life. http://t.co/m0A7RKuY", "Mon Jan 21 07:50:44 ": "hell yeh grrl http://t.co/KV7t2RXf", "Thu Mar 21 08:31:40 ": "@alby_music had a blast with u lot!", "Sun Dec 30 08:34:11 ": "Juicing up for the tour. I heart Asian grocers. http://t.co/9JVntoQc", "Fri Jan 25 01:19:00 ": "haha was just watching TV and heard my song play in the soundtrack, Bondi Rescue has been cranking I Go! this is... http://t.co/pryhQa7t", "Thu Mar 21 09:59:02 ": "i cant change, even if i tried, even if i wanted to...", "Fri Mar 01 04:11:47 ": "that feeling when you realise the song you just wrote (with Camilla Charlesworth) is going to be your next... http://t.co/gs834kvtHo", "Wed Feb 13 02:40:05 ": "writing for Tre Samuels today with Camilla Charlesworth. talent in stereo!", "Sat Mar 30 12:27:35 ": "@Littlefish949 freakinggoodfriday haha", "Thu Jan 24 15:36:58 ": "RT @WillyFerrel: That weird awkward run you do when a car lets you cross the street.", "Sat Mar 30 12:27:59 ": "Ready to rock the Solbar", "Sat Apr 06 08:35:36 ": "i land in auckland on tuesday! then play the first show of the tour on thursday... pass it on! limited tickets... http://t.co/6wgDN4XSUp"}