{"Fri Nov 16 17:54:55 ": "HFT est ce soir en concert au Fil à St Etienne dans le cadre du Festival Les Oreilles en Pointe. Bonne soirée et bon week-end", "Fri Oct 14 09:24:49 ": "HFT vient de se voir décerner le Grand Prix de la Chanson Française de la SACEM (la cérémonie se déroulera le 14... http://t.co/75Y7G2Mb", "Wed Apr 24 16:33:09 ": "Pour réserver vos places sur le site du Bush Hall, cliquez ici : http://t.co/b3S5e9qLxv http://t.co/c7JZY26Cnc", "Mon Mar 05 09:22:20 ": "UN MOT:\n\nMerci.", "Thu Nov 08 18:11:22 ": "HFT est ce soir en concert à l'espace André Malraux de Châteaudun.\nBonne soirée", "Thu May 12 14:09:28 ": "Vous avez été plus de 200 à participer pour assister à l'enregistrement de Taratata.\nNous avons les gagnants ! Rdv... http://fb.me/G2tBslMF", "Wed Nov 07 18:16:56 ": "HFT est en concert ce soir à Laval à la Salle Polyvalente \nBonne soirée", "Tue Jun 21 08:52:21 ": "La tournée passera également par Metz le 08 mars 2012 et Le Mans le 29 mars http://fb.me/XoHuxIZo", "Mon Oct 17 12:24:38 ": "L'album \"Suppléments de mensonge\" fait parti des 12 albums de l'année sélectionné par la radio RTL.\nC'est le... http://t.co/KlYYSzYR", "Mon May 16 14:48:18 ": "Ouh ! Toutes ces velléités métaphoriques & sombres. Ouh! Toute cette huile de vision sur ma confiture de buvard ! Ouh !", "Thu Jul 21 14:53:03 ": "« Un certain âge… 63 ans…vous avez plus qu’à dire : non !... non !... et vous en aller !... courtoisie !... vous êtes en rab !... » Céline", "Mon Jul 02 12:44:33 ": "Festival Eurockéennes 2012 - Interview : Thiefaine - Samedi 30 http://t.co/N8Vhobbi", "Tue Apr 24 12:30:45 ": "Vous avez peut-être vu Archimède en première partie du \"Homo Plebis Ultimae Tour\" et à Bercy ?\nNe les manquez pas... http://t.co/f6ZbeDkw", "Thu Aug 18 15:06:19 ": "La tournée passera aussi par Alençon, Marmande, Rouillac, Amiens, Sausheim et Béthune...\nToutes les dates sur le... http://t.co/H3VaV6n", "Wed Aug 01 08:28:34 ": "HFThiefaine Live teaser http://t.co/W7Zvte1l", "Tue Oct 04 14:09:08 ": "Rendez-vous vendredi à partir de 23h20 sur France2 pour y voir le duo entre Archimède & HFT sur \"Lorelei sébasto cha\" http://t.co/QGUlUFIH", "Thu Sep 29 16:53:36 ": "Nous sommes plus de 30 000 sur cette page !\nL'occasion de vous faire gagner 30 exemplaires du nouveau single... http://t.co/81gO7D8k", "Fri Jul 22 10:36:56 ": "HFT n’était pas apparu dans un clip depuis (très) longtemps…\nA l’aube de l’été  et à l’approche de la très... http://fb.me/17u77w0hI", "Fri May 04 14:12:44 ": "HFT sera en concert le 11 Mai prochain au Castellet pour le Festival MINI United http://t.co/xilojDHS", "Wed Dec 12 15:41:54 ": "Samedi 15 décembre à 15h20 aura lieu la diffusion du documentaire « Galaxie Thiéfaine : Supplément d’âme » sur... http://t.co/8xDthzfv", "Fri Oct 28 18:06:09 ": "C'est le moment de voter !\nPlus que 2 jours pour que l'album \"Suppléments de mensonge\" soit dans les 5 albums de... http://t.co/B7teFUSV", "Mon Oct 10 13:17:53 ": "Vous pouvez revoir le duo entre HFT & le groupe Archimède sur 'Lorelei Sebasto cha' diffusé dans Taratata... http://t.co/haA9gPPk", "Mon Jun 06 09:54:15 ": "'Agenda d'un mort Européen' à lire chaque jour pendant le mois de Juin sur le site officiel http://fb.me/uQXS9URF", "Tue Sep 06 10:50:12 ": "HFT sera ce soir sur le plateau de Taratata pour y enregistrer un duo avec le groupe Archimède sur le titre... http://t.co/yoM4038", "Tue Jan 08 15:26:30 ": "Bonne année à tous.\nLa tournée reprend le 10 janvier à Foix, pour quelques dates seulement avant la fin du Homo... http://t.co/XUAvcfzU", "Mon Jan 23 11:09:06 ": "HFT A L OLYMPIA\nMise en vente ce samedi 28 janvier à 10h ! http://t.co/s2GWHoyb", "Fri Jan 27 19:24:08 ": "N'oubliez pas, demain 10h ! http://t.co/0q8R5ds7", "Wed Jan 16 17:14:59 ": "HFT ce soir en concert au Centre Culturel Georges Brassens de Feytiat – Plus que 5 concerts avant l’arrêt... http://t.co/KmNijbTg", "Wed Apr 04 11:08:12 ": "///  ERRATUM  ///\n\nBonjour à tous,\nComme nous l'avons tous constaté, la date de diffusion qui nous a été donnée a... http://t.co/ZRMDkSXe", "Mon Mar 18 17:17:31 ": "Retrouvez dans l'ouvrage \"Rock Attitude\" de Pascal Pacaly un chapitre sur HFT :... http://t.co/6QwGy0zEf2", "Fri Jun 29 10:31:34 ": "Hubert-Felix Thiefaine se produit ce soir aux Eurockéennes de Belfort. Il sera également en direct sur France... http://t.co/DZsNK0UN", "Tue Nov 15 09:57:27 ": "HFT était hier soir au Casino de Paris pour les Grands Prix Sacem 2011 http://t.co/EvBv40SQ", "Fri Dec 14 17:00:48 ": "La diffusion du documentaire « Galaxie Thiéfaine : Supplément d’âme » a lieu demain à 15h20 en direct sur... http://t.co/U42Zuvw7", "Wed Nov 21 19:04:03 ": "Demain soir HFT est en concert à L'Olympia de Paris, concert complet depuis des mois. \nEn première partie, il... http://t.co/lj8muAyM", "Thu Oct 06 16:32:51 ": "Les photos du concert de Brest sont disponibles sur le site officiel http://t.co/TZshjaLc", "Mon May 21 17:36:44 ": "CE JEUDI A LA CIGALE\nNous vous en avons déjà parlé, Archimède est à la Cigale ce jeudi 24 mai… Et HFT montera sur... http://t.co/lufSV8ht", "Tue Jun 05 10:43:37 ": "La tournée s'étoffe, HFT vient de confirmer 3 nouvelles dates en septembre :\n\n07/09 – Festival le Chant du Gros –... http://t.co/nu6nr1wd", "Mon Sep 19 14:33:08 ": "HFT était l'invité du \"Pont des Artistes\" diffusée samedi dernier sur France Inter.\nEmission que vous pouvez... http://t.co/AZ7ugkJI", "Tue Oct 04 15:16:20 ": "Le \"Concert d'un Soir\" enregistré par HFT mi-septembre sera diffusé samedi 08 octobre à 19h00 sur RTL.\nPlus... http://t.co/His8hsxX", "Wed Nov 14 19:01:18 ": "Hubert Félix Thiéfaine sera l’un des invités de Dominique A le 17 décembre aux Folies Bergères de Paris lors de... http://t.co/VrXTp047", "Tue Jun 07 09:38:07 ": "HFT était en concert privé à La Flèche d'Or hier soir.\nRetrouvez le compte rendu de cette soirée sur le site... http://fb.me/10JIwPXYm", "Mon Jun 25 13:21:25 ": "Bruxelles, Muret, Abbeville... 7 nouvelles dates viennent d'être ajoutées à la rubrique Concerts du site officiel... http://t.co/GECAWaKM", "Wed Sep 21 11:21:53 ": "Retrouvez sur le site officiel le nom des gagnants qui assisteront demain soir au \"concert d'un soir\" d'HFT dans... http://t.co/RCd78Jy4", "Tue Jul 05 09:54:31 ": "Bravo à eux ! 'La ruelle des morts' chanté par les élèves CE et CM de l'école Diwan an Oriant pour le spectacle de... http://fb.me/EkQXq1oT", "Fri Feb 15 17:42:48 ": "Nouvelle date : retrouvez HFT en concert sur la plage de FRIAR'S BAY à SAINT-MARTIN (French west Indies) le 1er mars 2013 à partir de 21H.", "Wed Sep 14 13:48:19 ": "Retrouvez sur le site officiel les prochains passages radio & TV d'HFT http://t.co/3LfEfGa", "Mon Oct 22 13:59:57 ": "\"Homo Plebis Ultimae Tour\" est sorti aujourd'hui.\n\nVous découvrirez plus d'informations ainsi que les liens... http://t.co/NBt35USH", "Sat Jun 11 12:53:16 ": "Du grand et du bien bon Hubert Félix Thiéfaine http://fb.me/SmS4s913", "Fri Nov 09 18:25:19 ": "HFT est ce soir en concert au Prisme à Aurillac.\nBonne soirée et bon week-end", "Thu Apr 19 16:56:26 ": "Vous trouverez un TEMOIGNAGE sur le site officiel. http://t.co/zq6cic9W", "Wed Sep 14 15:22:28 ": "Le 17 octobre paraîtra une nouvelle version des « Suppléments de Mensonge »\nToutes les infos à retrouver dès... http://t.co/uOPHxyE", "Fri Nov 30 17:30:48 ": "HFT est en concert ce soir à Muret, Salle Alizé.\nEt demain soir à Saint Georges de Didonne, Espace Colette Besson. \n\nBon weekend à tous.", "Thu Jan 17 17:02:35 ": "HFT ce soir en concert au Bocapole de Bressuire – Plus que 4 concerts avant l’arrêt définitif de la tournée Homo Plebis Ultimae Tour.", "Fri Sep 30 16:30:56 ": "Vous êtes 30 à avoir gagné le single promotionnel d'HFT 'Fièvre Résurrectionnelle' : \n\nHulin Marietta, Hanane... http://t.co/FaEHoayB", "Wed Jun 01 08:22:35 ": "Vous pouvez revoir HFT en duo avec Cocoon pour une reprise de Cat Stevens 'Father And Son' dans Taratata http://fb.me/ONWwzmpK", "Tue May 29 14:45:36 ": "De nouvelles dates de concert s'ajoutent à la tournée 2012 !\n\n11/10 – Paloma – NIMES\n13/10 – Festival Tango,... http://t.co/RayBfsyO", "Mon May 23 14:01:48 ": "Pourquoi cette silencieuse patrouille de police dans les loges funèbres de mon théâtre autiste ?", "Thu Jun 16 12:46:52 ": "La tournée s'étoffe avec de nouvelles dates en 2012 : Auxerre, Gap, Pau, Seignosse, Strasbourg...\nRetrouvez la... http://fb.me/Pl62Q9hK", "Fri Oct 21 13:12:18 ": "BERCY : J-1", "Thu Feb 09 15:12:47 ": "La boutique HFT officielle est en ligne sur le site officiel et accessible également sur cette page dans l'onglet... http://t.co/YgcKIQtS", "Sun Aug 19 21:18:03 ": "C'est avec tristesse que nous vous informons du décès de Jean Théfaine des suites d'une longue maladie. \n\nNous... http://t.co/rhaF51fm", "Fri Oct 19 15:03:13 ": "HFT est en concert ce soir à Cherbourg au Trident. \nBon week-end à tous", "Tue Jul 10 14:19:50 ": "HF THIEFAINE - LE LIVE\n« Homo Plebis Ultimae Tour »\nLe live de la tournée\n2CD + DVD\nSortie le 22 octobre\nUne... http://t.co/IscHseGa", "Thu Nov 29 15:57:00 ": "HFT est en concert ce soir à Castres, Salle Gérard Philipe.\nBonne soirée", "Mon Sep 26 11:15:21 ": "[Mise à jour] Le duo entre le groupe Archimède & HFT sur \"Lorelei sébasto cha\" sera finalement diffusé dans... http://t.co/Q5FLaGm1", "Mon Dec 17 18:13:10 ": "Hubert Félix Thiéfaine est l’un des invités de Dominique A aux Folies Bergères de Paris ce soir lors de son... http://t.co/XfYW9FaM", "Wed Mar 21 16:02:59 ": "HFT sera à l'affiche du Festival Papillons de Nuit. http://t.co/kPvZwm0k", "Fri Jun 10 15:31:46 ": "HFT sera en concert ce soir à 23 heures sur l'ïle de la Réunion dans le cadre du festival Sakifo http://fb.me/tyslDt71", "Mon Apr 02 15:49:52 ": "HFT sera sur le plateau de l'émission \"28 minutes\" sur Arte, ce mardi 3 avril, à partir de 20h05.", "Fri Jan 18 16:35:14 ": "Plus que 3 dates avant l’arrêt définitif de la tournée Homo Plebis Ultimae Tour, débutée le 5 octobre 2011 .... http://t.co/DV1NdHUX", "Mon Oct 10 20:29:15 ": "Les photos du concert au Cirque Royal de Bruxelles sont disponibles sur le site officiel ! http://t.co/Cqk4MIU5", "Wed Feb 08 16:21:20 ": "FRANCE INTER DEMAIN MATIN\n\nHFT sera sur le plateau de l'émission d'Isabelle Giordano sur France Inter, en direct,... http://t.co/cd97TOO9", "Tue Nov 27 17:48:39 ": "HFT est ce soir à la Salle Jean Vilar d'Argenteuil. Bon concert à tous.", "Wed Oct 05 10:33:11 ": "JOUR J : HOMO PLEBIS ULTIMAE TOUR \nLa tournée débute ce soir à La Carène, Brest ! http://t.co/L0B89vQ8", "Mon Oct 10 15:47:02 ": "(Re)vivez le concert de Brest grâce à ce magnifique compte rendu. http://t.co/8cbmTTyc", "Mon Mar 12 09:58:52 ": "HF Thiéfaine sera à l’affiche du festival MINI United 2012, qui aura lieu sur le circuit du Castellet, du 11 au... http://t.co/YVmaxvKc", "Fri Dec 07 17:02:53 ": "HFT est en concert ce soir au Forum de Chauny, demain au théâtre d'Abbeville et dimanche au Splendid de... http://t.co/TIwLYKcY", "Thu May 03 15:35:30 ": "NOUVELLES DATES DE CONCERT:\n\n08/07 – FESTIVAL LES ARDENTES – LIEGE (BE)\n17/07 – PALÉO FESTIVAL – NYON (CH)\n05/10... http://t.co/6NZ25KYi", "Fri Oct 07 08:37:59 ": "Vous avez toujours eu envie de savoir ce qu’il se passe avant mais aussi après un concert d’HFT ?\nDevenez... http://t.co/25PGntHR", "Tue Sep 13 15:10:16 ": "Le duo entre le groupe Archimède & HFT sur \"Loreleï sébasto cha\" sera diffusé dans l'émission Taratata le vendredi 23 septembre sur France2", "Tue Nov 15 16:59:50 ": "HFT était l'invité de Pascale Clark ce matin dans son émission \"Comme on nous parle\" sur France Inter.\nEmission... http://t.co/TFEhkeA3", "Tue Sep 20 10:42:00 ": "HFT sera en « concert d’un soir » ce jeudi dans les locaux d'RTL\n20 places sont à gagner en vous rendant dès... http://t.co/SbioK4Fu", "Thu Jan 10 12:06:07 ": "HFT ce soir en concert à l'Estive de Foix – Plus que 8 concerts avant l’arrêt définitif de la tournée Homo Plebis Ultimae Tour.", "Wed Apr 24 15:45:05 ": "Le 113ème concert de la tournée Homo Plebis Ultimae Tour se déroulera le 27 juin, à Londres où Hubert jouera pour... http://t.co/HzCejv0TAo", "Fri Mar 02 17:38:07 ": "DEMAIN SOIR: les Victoires\n\nComme vous le savez, rendez-vous demain dès 20h35 sur France2, en direct du Palais... http://t.co/zdW4Ja1N", "Wed May 18 13:37:27 ": "Hubert-Félix Thiéfaine sera en concert privé le lundi 6 juin à Paris-La Flèche d'Or \nDes places sont à gagner sur... http://fb.me/Ka9lh3Ig", "Wed May 25 14:05:51 ": "Vous pourrez voir HFT dans Taratata le mardi 31 mai sur France 4 et le vendredi 3 juin sur France 2", "Mon May 30 10:03:29 ": "Vous avez été plus de 1500 à participer pour assister au concert privé d'HFT qui aura lieu le 6 juin à La Flèche... http://fb.me/wbdx5X2s", "Mon Jan 21 17:37:05 ": "Débutée le 5 octobre 2011, la tournée Homo Plebis Ultimae Tour s'est terminée hier soir à Saint-Malo après plus... http://t.co/VqjtbvAz", "Fri Jan 11 17:00:47 ": "HFT ce soir en concert au théâtre Grenat de Perpignan – Plus que 7 concerts avant l’arrêt définitif de la tournée Homo Plebis Ultimae Tour.", "Thu Nov 29 16:06:18 ": "Rendez-vous sur le site si vous souhaitez assister à la projection en avant-première du documentaire \"Galaxie... http://t.co/FS1xdp7u", "Wed Oct 26 12:12:01 ": "Retrouvez dès maintenant sur le site officiel d'HFT le compte rendu du concert de PARIS - BERCY par Isabelle... http://t.co/FWHh5zcM", "Tue Oct 23 11:18:24 ": "Hubert-Felix Thiefaine sera ce soir en direct à 19h00 sur France 5 dans l'émission C à vous présentée par Alessandra Sublet", "Tue May 31 15:00:00 ": "Pour rappel, vous retrouverez HFT ce soir dans Taratata à partir de 22h15 sur France 4 http://fb.me/Yq3WhtZA", "Mon Oct 10 15:49:45 ": "(Re)vivez le concert de Brest grâce à ce magnifique compte rendu. http://t.co/rzYOhHhs", "Tue Oct 18 12:40:47 ": "La nouvelle édition de l’album « Suppléments de mensonge » incluant 3 inédits est disponible depuis hier en... http://t.co/IZn4jYe1", "Mon Oct 03 16:50:26 ": "J-2 avant la première date à Brest, l'occasion pour le site officiel de passer en mode tournée ! http://t.co/0LMZztGf", "Wed Mar 07 09:59:10 ": "EUROCKEENNES:\nHF Thiéfaine jouera le 29 juin au festival des Eurockéennes (Belfort) http://t.co/UxWO1tL6", "Mon Nov 14 10:36:26 ": "HFT sera en live ce soir au Casino de Paris pour les Grands Prix 2011 de la Sacem. \nHFT y recevra le Grand Prix de... http://t.co/hpX9zMER", "Fri Feb 17 17:17:04 ": "NOUVELLES PHOTOS LIVE\nLa tournée vient de reprendre à Amiens au Cirque Jules Verne samedi dernier, et vous pouvez... http://t.co/cYtMq08g"}