{"Wed Mar 27 03:40:08 ": "@staximillian it's on Hulu", "Mon Mar 11 17:49:21 ": "@Merch_Mike haha that's how I feel right now", "Sun Mar 31 17:31:00 ": "RT @RichGuzzi: HAPPY EASTER. I'm going to a Real Peep Show! LOL.- http://t.co/9P3B6BrbOq", "Fri Mar 15 05:36:08 ": "makaveli knowledge http://t.co/7GoRlitBYj", "Sat Apr 20 18:03:08 ": "RT @robdelaney: An apple a day keeps the doctor away. A marijuana “joint,” even once, permanently robs you of the use of your legs and pean…", "Thu Feb 21 05:59:51 ": "Identity Crisis", "Sun Mar 10 07:44:31 ": "Because reality isn't entertaining enough RT “@_golom: Why is EVERY reality show scripted these days??”", "Thu Apr 04 17:47:26 ": "RT @ieatanddrink: Fun prank:\nTake a lady up in your hot air balloon and say \"Whoaaa, how do you turn this thing off??!\" and float into t ...", "Sun Apr 14 02:47:30 ": "@LPxDC no fucking way", "Fri Apr 05 01:54:25 ": "early Evil Dead movie with @Lauren_Molina eeeeeeeeeeee!! 😱", "Fri Apr 19 00:17:36 ": "RT @JimNorton: A Texas teacher accused of molesting a 6 yr old denies it, saying she's 'too racist to touch black kids'.-- Greatest. Exc ...", "Sun Apr 07 23:23:12 ": "Hinchliffe Stadium - Recently named a Historic Landmark this passed March. Home to the New York Black… http://t.co/w1iXRRigMd", "Sat Mar 02 02:06:39 ": "@gregmengert where at! Nyc?", "Mon Feb 25 06:12:52 ": "RT @mattg00d: Anne Hathaways nipple dress on the Oscars.", "Fri Mar 01 01:50:30 ": "In recent news, a \"marijuana cannon\" was confiscated at the Mexican border, firing 30lb weed packages… http://t.co/XXiNFeifJ3", "Thu Mar 28 04:35:01 ": "@staximillian BB season 5 is on once a week at 430 in the morning. My tv has been set to record them but its already on episode 7.", "Tue Mar 26 17:54:37 ": "RT @deanjnorris: Bryan Cranston A great actor An even better man Learned so much from you Thanks for the ride @BryanCranston http://t.co ...", "Mon Feb 18 07:07:10 ": ". @MikeArcadia we need to get everyone together again and get that album out!", "Tue Apr 23 05:38:09 ": "Trainspotting, two nights in a row", "Thu Feb 14 03:55:39 ": "Saw an old friend @ the supermarket tonight. I kindly said \"hello\" and they said \"Jesus, what the hell happened to you?\" &amp; we kept walking 👍", "Tue Apr 02 05:26:48 ": "How much is enough? How big does this pile have to be? #breakingbad http://t.co/jwj0tDDWVl", "Tue Mar 26 17:56:31 ": "RT @robdelaney: I love gay people. Or as I sometimes call them, \"people.\"", "Sun Mar 31 06:08:26 ": "RT @robdelaney: RT if #moist donkey 🌈", "Sat Apr 06 03:28:07 ": "$15 winner #casinovirgin http://t.co/RDwtqJ0TT3", "Tue Apr 02 00:44:45 ": "@MikeArcadia LOL", "Mon Feb 25 03:01:46 ": "So much Norman Reedus this weekend. Boondock Saints I and II and now The Walking Dead. No complaints at all. Dude rules - @wwwbigbaldhead", "Fri Apr 05 17:26:33 ": "@RyanTheBay it's solid. 20 mins of an intro, and 70 minutes of non stop horror action", "Mon Mar 11 02:52:21 ": "Motherfucking Deftones http://t.co/YtVfF8K9rg", "Sat Apr 20 00:34:40 ": "\"All the people running in the marathon are now gonna be running in the wheelchair marathon.\" Real professional @FoxNews.. real professional", "Sat Feb 23 06:07:09 ": "RT @UncleBlazer: All these raps about molly and NONE about orange tic tacs... smh", "Mon Mar 11 17:16:51 ": "RT @markhoppus: You guys, I wanted to get a new iPad but they were sold out of the one I wanted and it's like why do I even get out of bed?", "Fri Feb 22 04:38:03 ": "RT @ChrisUnderoath: Idea: If venues get a cut of merch, then the band gets a cut of the bar sales. (Not my idea, but who cares)", "Sat Mar 09 22:37:36 ": "He could sell a ketchup popsicle to a woman in white gloves.", "Thu Feb 21 06:16:14 ": "@JustinGewirtz both, simultaneously.", "Mon Mar 18 05:26:24 ": "RT @robdelaney: I bet if Amy Winehouse had changed her name to Amy Lemonadehouse, she’d still be alive today.", "Sun Mar 31 16:58:45 ": "RT @jesus: Hi.", "Tue Feb 26 06:57:25 ": "RT @BryanCranston: Yep, this list pretty much covers all my qualifications to becoming a full-fledged member of the Hollywood community. ...", "Thu Apr 04 17:46:33 ": "RT @ieatanddrink: Fun prank:\nVisit a fast food drive-thru with your dog in the driver's seat and have him turn to the cashier and say \"I ...", "Mon Mar 04 06:47:11 ": "Wah wah @ATT #datausage #freeforme http://t.co/K7ZedmU0Ez", "Mon Mar 18 05:30:54 ": "RT @AwkwardJim: Female cashier catches coin that I dropped on first bounce. \"Nice snatch\".", "Sat Mar 09 05:56:12 ": "I want my kid to have an honest job.. like a politician.", "Sun Mar 10 03:01:58 ": "Can't be too careful. Lotta bad drivers out there. http://t.co/75ZeaeTIiX", "Sun Feb 17 23:24:51 ": "RT @WendyLiebman: \"It's 2:40!\" said the dyslexic stoner.", "Tue Apr 02 00:44:38 ": "RT @MikeArcadia: @AlexCahill is back on the voice lol", "Wed Mar 06 02:31:45 ": "sick brag. Blowing dudes isn't admirable RT @staximillian: I truly enjoy the fact that i can make 7/800$ just for a couple hours of work.", "Sun Apr 07 19:12:27 ": "RT @aaronpaul_8: Six years working with the brilliant @BryanCranston and the rest of the Breaking Bad family made me realize even more t ...", "Thu Mar 28 04:34:19 ": "@staximillian I was referring to the following. If you're interested in watching it you can use my Hulu login.", "Mon Mar 11 02:58:56 ": "Motherfucking Deftones pt2 http://t.co/rb5WqGJyXf", "Tue Feb 26 07:03:47 ": "Go to hell, for heavens sake", "Tue Apr 02 00:47:01 ": ".@MikeArcadia dude can't rock sideburns like I can", "Tue Apr 02 00:45:33 ": "RT @adamlevine: in my defense, @shakira did tell me that cállate means I love you.", "Mon Feb 18 07:05:59 ": ". @MikeArcadia I remember writing the beginning of 'emo song' next to you in the old studio thinking \"damn this is going to be a good tune\"", "Fri Mar 01 03:01:36 ": "@JustinGewirtz not if you open cydia", "Mon Feb 25 18:41:34 ": "I can't help but like the new bring me the horizon album. God damnit 😖", "Wed Mar 27 17:56:49 ": "RT @deathoftheparty: I barely knew thee http://t.co/LaE6WV5C5n", "Tue Feb 19 01:13:49 ": "@deathoftheparty e-cig, cold turkey? You're sparing the details!", "Sat Apr 13 01:21:20 ": "RT @htlnick: Just spent half an hour on the phone crying to my D.A.R.E. officer about how sorry I am.", "Sat Feb 23 06:04:37 ": "@Lauren_Molina just happy that after 5 billion years you forgot how to spell my name", "Wed Mar 13 03:17:52 ": "@G201NJ @senorwanon I guarantee that label is still there. On the inside of the right desk drawer I think hahaha", "Thu Mar 21 04:52:44 ": "I lent this cd to a kid named Diego in Spanish class 10 years ago. He moved and I never saw it again. A… http://t.co/0eK6eyiXXf", "Sun Mar 03 20:57:40 ": "RT @Males_Thoughts: Today. http://t.co/mUMAuSDOKS", "Tue Mar 12 04:44:12 ": "@Merch_Mike dude that's nuts. Must have been amazing though! Miss you too man. Hope alls well!", "Fri Feb 22 06:09:31 ": "Looked up 'cholo' to be certain of its meaning. \"Cholos often drive low riders\" was part of the description. Goodnight. 😂", "Tue Feb 12 00:42:36 ": "RT @robdelaney: .@justinbieber Teenagers are selling their assholes to Japanese #businessmen on eBay to get money to shoot weed because  ...", "Wed Apr 03 17:50:39 ": "RT @AgbiB: \"CHOLO - Chu Only Live Once\"", "Sat Feb 23 04:27:41 ": "@kriscatstro lookin' good, bud!", "Sun Apr 14 03:31:24 ": "@LPxDC I just read :( so devastating. Just saw deftones last month and it was amazing that they dedicated songs to him during the set.", "Wed Feb 27 05:18:27 ": "Watching This Is 40, courtesy of my iphone jailbreak. #moviebox 👍", "Sun Apr 14 03:31:40 ": "RT @LPxDC: RIP Chi Cheng :(", "Wed Mar 13 03:16:29 ": "@SenorWanon @g201nj HAHAHA just reading all of these tweets right now. Absolutely ridiculous times at PetSmart fucking shit up", "Thu Mar 28 04:40:52 ": ". @NBCChicagoFire is a brilliant, emotional tv series that I'd recommend over and over again. It has yet to let me down.  #ChicagoFire", "Tue Apr 23 05:53:49 ": "Choose your future. Choose life. But why would I want to do a thing like that?", "Sun Feb 24 19:59:23 ": "@ChrisDallas_ you should have told me you had a show last night", "Mon Mar 18 02:17:24 ": "Why didnt Andrea just take the truck? This season is so fucking dragged out  @WalkingDead_AMC", "Sat Apr 20 01:06:48 ": "RT @Boston_Police: CAPTURED!!! The hunt is over. The search is done. The terror is over. And justice has won. Suspect in custody.", "Sun Mar 03 07:27:36 ": "RT @Lauren_Molina: Been 2 years since @AlexCahill &amp; I officially met and went on our first date. Can't live without him. He's my oth ...", "Wed Feb 20 03:31:24 ": "If money grow on trees, I branched out", "Tue Feb 19 01:12:54 ": "RT @deathoftheparty: It's officially been a month since my last cigarette. I feel as cool as I looked smoking cigarettes (very cool).", "Sun Apr 14 02:00:25 ": "Big thanks to @verified and @twitter for recognizing my authenticity! 👍😁 http://t.co/CM3aI9RL4L", "Tue Apr 02 17:53:12 ": "RT @MikeArcadia: Dude just came out of the elevator with his Segway. What a herb", "Fri Mar 01 00:48:31 ": "Five years ago - February 29, 2008, my first real band played their last show. Reflecting on the… http://t.co/wC8SPFKKpR", "Thu Mar 07 06:28:36 ": "RT @robdelaney: Guess who just built his own MRI machine? Yup! It totally cooked my pug Aaron though, so I gotta fiddle with it some more.", "Thu Mar 28 12:32:24 ": "😴", "Tue Mar 12 12:29:16 ": "😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴😴", "Thu Apr 11 03:43:36 ": "Don't usually partake in these things, but here's me and my homie @ericcahill17 a couple years back… http://t.co/78pipGTAQC", "Mon Feb 18 18:48:04 ": "@JustinGewirtz if you don't, then only followers of the person you tweet (in this case Burger King) can view it", "Mon Feb 18 18:45:45 ": ".@burgerking's PR is definitely going nuts right now @mcdonalds #hacked http://t.co/DMVZ9CkN", "Sun Mar 24 01:06:47 ": "All we are is paralyzed from the face down.  We're still alive with our fake smiles, when the camera's away.", "Mon Mar 11 17:44:02 ": "10 years ago I'd get home from school, put this on repeat, and play Starcraft Brood War with my friends… http://t.co/5AehdI6kYe", "Sun Apr 07 23:24:58 ": "Hinchliffe Stadium Pt. 2 #Paterson #NJ #historical #ruin #hinchcliffe #sports #stadium http://t.co/vqRWsq2eSM", "Mon Feb 18 18:48:38 ": "@JustinGewirtz if you start out a tweet with the person's twitter name", "Tue Apr 16 00:40:50 ": "What happened today is absolutely disgusting. Boston, one of my favorite cities in this country, has my thoughts and prayers. ❤", "Sat Mar 23 06:24:03 ": "Chris Rock: Never Scared will always be one of my favorite standups", "Mon Feb 18 00:17:27 ": "A few days late, but  after almost 2 years, @Lauren_Molina has never failed to surprised me with amazing… http://t.co/xB0yN3SE", "Fri Mar 22 05:03:52 ": "Can't wait for this new season #BreakingBad http://t.co/zzcZWAbdVm", "Sun Apr 21 03:14:13 ": "So for the bread and butter I leave niggas in the gutter @staximillian", "Thu Mar 07 01:06:02 ": "RT @aaronpaul_8: News Alert: Here is the first promo of the new season of Breaking Bad. Hope you all like it.  http://t.co/as0Qz8aXFo", "Wed Mar 13 03:15:25 ": "RT @SenorWanon: @G201NJ @AlexCahill lmao I remember when I came to work one morning and you drove the forklift thru the wall", "Mon Feb 18 18:36:10 ": "RT @YourAnonNews: Burger King's Twitter account #HACKED! https://t.co/TDnGPUzE Check before it's fixed for some #Lulz #YAN http://t.co/o ...", "Wed Apr 17 04:50:02 ": "RT @ThatCommonKid: If you get a smartphone that isn't an iPhone.... what's the point?"}