{"Thu Apr 11 13:09:34 ": "The #Flames and #Sens hockey ticket giveaways have ended. Thanks to everyone who participated &amp; stay tuned for upcoming giveaways!", "Tue Apr 16 21:37:56 ": "Our hearts go out to those in Boston.", "Thu Apr 04 21:38:36 ": "Thinking of entering Coca-Cola @MuchMusic Covers? Check out the talented contestants here: http://t.co/N4oyBIcI4U  #Covers", "Wed Apr 10 18:50:21 ": "@DJXMarksDaSpot We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 21:04:52 ": "Are you a Coca-Cola lover, enthusiast, or connoisseur?", "Mon Apr 08 15:07:41 ": "@ccfreestyle: one machine serving over 100 unique drink options  - yes, it's possible. #AnythingisPossible", "Tue Apr 09 14:27:09 ": "@IslanderQ  We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Mon Apr 22 14:32:54 ": "@JonathonZuidema Thanks for the love!", "Wed Apr 10 18:46:35 ": "@Kev7nLa We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Wed Apr 10 18:52:23 ": "@DonnaGabbanaT We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Wed Apr 10 18:21:20 ": "@Bias_Sens We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Thu Apr 18 15:15:07 ": "Putting away your hats, mitts and coats? Now is the perfect time to donate gently used items that you may no longer need.", "Wed Apr 10 20:11:32 ": "@Jeff_Gill We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Wed Apr 10 21:07:21 ": "There's still time to enter Coca-Cola @MuchMusic Covers! Enter or rate your favourites today: http://t.co/N4oyBIcI4U", "Sun Apr 07 16:38:47 ": "Ottawa! show us your creative #RandomActofKindness by Apr8 5pm ET for a chance to win 2 tix to a #Sens game! Details: http://t.co/ytLIaPLKY8", "Fri Apr 05 12:18:16 ": "@adgemomo We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Wed Apr 10 20:06:41 ": "@DonnaGabbanaT Please DM us by 5pm EST April 10th (today) to redeem your tickets.", "Mon Apr 08 17:10:00 ": "#Ottawa! Want 2 tickets to see the #Sens Apr 20? Be one of the 1st 20 people to tell us Coca-Cola Covers winner @TylerShawMusic’s home town!", "Wed Apr 10 15:01:11 ": "Give a friend a hug - the best gift for any or no occasion! #HugDayAnyDay", "Fri Apr 12 20:51:15 ": "#FF: @OakleyInc A great Coca-Cola fan &amp; hockey lover!", "Fri Apr 05 15:25:07 ": "There were so many great #everyactionmatters pledges, thank you to everyone who participated! Check out the best: http://t.co/aPqGxJSW80", "Fri Apr 19 15:30:03 ": "@BreakfastCanada Clubs provide Canadian children with a nutrious breakfast. Learn how you can support them: http://t.co/7rMEVJIi3N", "Thu Apr 11 19:56:39 ": "@almajwilson70 Hi Alma, we don't appear to have your information. Please try to DM us again :)", "Wed Apr 17 20:51:33 ": "If you haven't used or worn it for one year it's time to donate it. They don't call it the #SpringFling for nothing!", "Tue Apr 09 17:58:32 ": "Hey #Ottawa! First 20 people to tell us which year @TylerShawMusic won Coca-Cola Covers get tickets to a #Sens game April 20th!", "Fri Apr 05 17:17:19 ": "Give a compliment or high five to a stranger. What will you do to brighten someone's day? Stay tuned for a surprise on Sunday #Ottawa!", "Tue Apr 09 17:00:00 ": "A smile or an \"ahhh\" - how do you express your refreshment? #OpenHappiness", "Fri Apr 05 17:18:44 ": "@CoaltownJ We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Thu Apr 18 19:30:17 ": "High five 2 people you know and 1 you don't! #NationalHighFiveDay", "Tue Apr 09 14:27:44 ": "@Waterstfishchip  We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Fri Apr 05 15:41:46 ": "Yesterday was the exciting grand opening of the new Coca-Cola Canada HQ in TO! Thx to @TOMayorFord for attending. http://t.co/ZOKUzDOfju", "Wed Apr 17 16:55:22 ": "What's your favourite spring time smell? Freshly cut grass takes the cake for us!", "Thu Apr 11 13:13:23 ": "RT @asifintoronto: Really liked this from @cocacola_ca. It is a great neighbourhood. #Toronto #OldTown http://t.co/EphLZSjwqV", "Mon Apr 22 14:32:36 ": "That's great to hear, thank you! RT @OakleyInc: @ShaneD75 I witnessed history, thanks to @cocacola_ca #SmokeTheSens", "Fri Apr 12 16:04:24 ": "What everyday changes will you take to show your continued support for the polar bears &amp; their #ArcticHome? #EveryActionMatters", "Mon Apr 15 20:16:24 ": "\"Be glad of life because it gives you the chance to love, to work, to play, &amp; to look up at the stars.\" - Henry Van Dyke #MondayMotivation", "Mon Apr 15 20:07:59 ": "RT @ScotBenson: @cocacola_ca music night.  @tylershawmusic singing the anthem @nhlflames game http://t.co/HvnXeG3fMW", "Thu Apr 11 12:10:21 ": "@MatteoZahalan We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Follow &amp; DM us by 12pm EST today :)", "Mon Apr 22 14:39:52 ": "@JessBlak Great photo. Thanks for sharing!", "Tue Apr 09 14:29:44 ": "@Jemrah1  We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:40:31 ": "@JessBlak We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Mon Apr 22 14:07:05 ": "We're excited to announce the launch of @CocaColaCo_Ca! Follow to keep up on news, Canadian events &amp;  find answers to your questions.", "Sat Apr 20 21:00:01 ": "Tune into #HockeyNightinCanada to watch @TylerShawMusic sing the national anthem before the #Sens take on the #Leafs tonight at 7pm EST.", "Mon Apr 15 15:16:02 ": "If you could have your own @ccfreestyle machine, where would you put it? - work or home?", "Tue Apr 09 19:37:46 ": "@maireep We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Thu Apr 04 21:14:32 ": "@KrimaroRoger We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Sun Apr 14 18:15:00 ": "@WSSF: Watch today’s show from the best seat in the house. Find a Coca-Cola Ambassador &amp; show them how you #GiveALittleBit", "Wed Apr 10 18:22:11 ": "@leafsweetie We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Mon Apr 22 14:33:49 ": "Returning the love :) RT @Setteer: @cocacola_ca I love you Coca-Cola", "Wed Apr 17 18:27:07 ": "There's still time to rate your favourites! Who do you think will win Coca-Cola #Covers? http://t.co/N4oyBIcI4U", "Tue Apr 09 14:26:29 ": "@the_real_chozn1 We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Wed Apr 10 19:01:02 ": "@ANNEJINGG We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Fri Apr 19 17:20:00 ": "Signs it's spring: we're enjoying an ice-cold Coca-Cola…on the patio! Where will you enjoy your first outdoor Coke?", "Tue Apr 16 13:14:08 ": "RT @KidsUpFrontCalg: Thank you @cocacola_ca for the centre ice @NHLFlames tickets! You really are putting Kids Up Front tonight!! #YYC h ...", "Tue Apr 09 21:06:27 ": "RT @BSComedy: GUESS WHO JUST WON TICKETS TO THE #SENS v #LEAFS game on April 20th as ScotiaBank Place?!? THIS GUY!! THANK YOU @cocacola_ ...", "Wed Apr 10 17:24:32 ": "Nothing like a sibling to teach you the value of sharing! Share a Coca-Cola with your brother or sister in honour of #NationalSiblingDay", "Wed Apr 10 18:18:55 ": "@MikeTenn44 We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Wed Apr 10 16:05:04 ": "@Jordan__RattrayHi! The hockey ticket giveaway is not spam. Lucky winners will see @TylerShawMusic perform &amp; watch the SensVs.Leafs on Apr20", "Thu Apr 11 12:11:57 ": "@LTLPoff We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Follow &amp; DM us by 12pm EST today :)", "Mon Apr 22 15:18:34 ": "Rock climbing or photography? - Spring is the perfect time to try something new! #GoForIt", "Fri Apr 12 18:55:17 ": "#WSSF show a Coca-Cola Ambassador a random act of happiness &amp; get access to the Coca-Cola VIP tower! #GiveALittleBit http://t.co/zX6zP4oxAP", "Tue Apr 09 14:25:20 ": "@almajwilson70 We’d like to recognize your positivity with tix to the Ottawa Senators game Apr 20th! Please follow &amp; DM us :)", "Fri Apr 12 18:45:45 ": "A warm grilled cheese sandwich + an ice-cold Coca-Cola = a deliciously memorable lunch. Happy #GrilledCheeseDay!", "Fri Apr 05 17:30:48 ": "RT @MuchMusic: Dream of making it BIG in music? Enter #Covers and get yourself one step closer to being a star: http://t.co/HaxbHxtdaX @ ...", "Tue Apr 09 14:28:40 ": "@Teever  We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:45:22 ": "@therealbernie1 We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Sun Apr 21 19:12:44 ": "Coca-Cola &amp; #WSSF want to grant you VIP access to the tower! Find a Coca-Cola Ambassador and ask them how! Hint: #givealittlebit", "Fri Apr 05 13:19:39 ": "@SlackerK  We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Sat Apr 13 18:15:44 ": "Hey @wssf time to show &amp; tell! Find a Coca-Cola Ambassador and show or tell them how you #GiveALittleBit for a surprise ☺", "Thu Apr 11 20:52:07 ": "We're excited to see Coca-Cola Covers Winner @TylerShawMusic, perform at the #Flames game tomorrow in #Calgary!", "Mon Apr 22 16:41:59 ": "@alderaphobia Hi, please follow and DM us for more information.", "Thu Apr 11 15:21:50 ": "What's on your spring to-do list? How about donating lightly used clothing and furniture to a local charity? #SpringCleaning", "Tue Apr 09 21:15:57 ": "@Alessandrrro We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:38:56 ": "@FeliciaFatima We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 14:55:18 ": "@BreakfastCanada helps to ensure children have the opportunity to succeed through a healthy start. Learn more http://t.co/7rMEVJIi3N", "Mon Apr 08 20:10:01 ": "\"To be truly happy is a question of how we begin and not of how we end, of what we want and not of what we have.\" - Robert Louis Stevenson", "Tue Apr 09 19:35:53 ": "@StevenGill_ We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Thu Apr 04 21:13:56 ": "@smita411 We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Tue Apr 09 19:42:21 ": "@OakleyInc We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Sun Apr 14 19:45:01 ": "If you’re @wssf: No.1 Find a Coca-Cola Ambassador No.2 #GiveALittleBit No.3 Hang out in VIP style in the Coca-Cola Tower", "Thu Apr 11 19:38:32 ": "Biking, gardening or going for a long walk - what's your favourite spring-time activity?", "Mon Apr 22 20:04:45 ": "#EarthDay is the perfect excuse to have a big candle-lit dinner with friends and family :) #everyactionmatters", "Thu Apr 11 17:28:51 ": "What inspires you to create positive change? Submit a photo on #Instagram w/ the tag #TakeMe2MMVAs for your chance to earn tix to the #MMVAs", "Fri Apr 05 13:16:46 ": "@kellycgy  We’d like to recognize your positivity with a pair of tix to the #Flames game Apr 12! Please follow &amp; DM us :)", "Tue Apr 09 21:16:31 ": "@BradleyMullin We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Mon Apr 15 18:15:14 ": "The best time for a Coca-Cola is ___________. #OpenHappiness", "Mon Apr 22 14:38:06 ": "@almajwilson70 That's what we like to hear! Thank you.", "Fri Apr 19 18:30:00 ": "#WSSF where are you spending your afternoon? Find a Coca-Cola Ambassador &amp; ask them how you can get VIP tower access. Hint: #givealittlebit", "Thu Apr 18 17:30:16 ": "We're happy to announce Coca-Cola @MuchMusic Covers 2012 winner's #KissGoodnight single has gone Gold! Congratulations @TylerShawMusic!", "Tue Apr 09 19:43:27 ": "@BSComedy We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:30:09 ": "@ChrisBonspiel We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Mon Apr 15 20:46:55 ": "@Sparelkar We think this could point you in the right direction: http://t.co/0qwAMjo4Bp", "Mon Apr 22 17:41:45 ": "\"To have joy one must share it. Happiness was born a twin.\" - Lord Byron", "Wed Apr 10 20:55:24 ": "@Jeff_Gill Please DM us by 530pm EST April 10th (today) to redeem your tickets.", "Fri Apr 12 17:08:00 ": "RT @RaniChatoorgoon: Today's #openhappiness tactic: wear mah Coke Converse sneaks to the office! #TGIF #cokeswag @CocaCola @cocacola_ca  ...", "Mon Apr 08 18:09:01 ": "Tingly, bubbly, refreshing - how would you describe your first sip of Coca-Cola?", "Tue Apr 09 14:29:13 ": "@Alexx_Kay  We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:39:51 ": "@ottawa_paul We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Tue Apr 09 19:32:38 ": "@jamieethomas We’d like to recognize your positivity with tickets to the Ottawa Senators game Apr 20! Please follow &amp; DM us :)", "Sun Apr 21 20:15:00 ": "Hey #Whistler! Want VIP access to today’s #WSSF show? Find a Coca-Cola Ambassador and #GiveALittleBit with a random act of happiness ☺"}