{"Mon Mar 04 22:25:02 ": "Harlem Shake Eintracht Style! http://t.co/00vVuxQHck", "Sat Feb 23 18:50:16 ": "Jogo difícil contra o Freiburg. Até que um empate lá foi um bom resultado. Claro que queríamos a vitória, mas eles estão bem na competição.", "Sat Jan 26 17:26:42 ": "Ich bin glücklich wieder zurück in der Mannschaft zu sein. Ein wichtiger 2:1-Heimsieg gegen Hoffenheim.", "Mon Dec 31 18:21:55 ": "Feliz ano novo, tudo de bom para vocês meus fãs do Twitter e que o próximo ano seja melhor pra todos nós!", "Fri Feb 08 12:16:49 ": "Wollt ihr eines meiner Trikots gewinnen? http://t.co/0kdWDURx", "Fri Nov 16 12:48:40 ": "Das erste Mal, dass Frankfurt in der Bundesliga auf Augsburg trifft. Wir wollen natürlich gewinnen und müssen unsere beste Leistung zeigen.", "Sun Jan 20 11:12:05 ": "With my beautiful princess!! Com minha princesa linda e cabeluda!! http://t.co/jKPyWIr7", "Thu Nov 15 18:23:20 ": "“@Melisa_FCB: @Andersonbamba5 Name? :D”Andersonbamba", "Tue Apr 02 09:56:35 ": "Arbeitsschuhe! Working shoes! Material de Trabalho! http://t.co/CSXQhU5v8L", "Sun Feb 10 21:07:56 ": "We tied Nuremberg, but this was not a result that we wanted. But it is ok, now, our focus is for the game against Dortmund.", "Thu Dec 20 18:47:16 ": "Kommt her...Vem para cá....Come here.... http://t.co/HsVoE9UX", "Wed Dec 26 20:02:26 ": "Look what I found here in my house.... the jersey when I played for Flamengo! http://t.co/lL1FqXlY", "Mon Dec 03 15:18:28 ": "@Melisa_FCB Fur eintracht!😜", "Sat Feb 16 09:42:56 ": "We have a tough match against Borussia Dortmund. This is an important game which could define our season.", "Thu Nov 15 18:26:00 ": "@Melisa_FCB alles klar.", "Wed Nov 28 13:19:37 ": "Jetzt konzentriere ich mich voll auf meine Genesung, damit ich so schnell wie möglich zurück kommen kann!", "Sun Dec 30 11:04:25 ": "Was habt ihr an Silvester vor? What are u doing for the new year's eve? O que você vai fazer para a entrada do ano novo?", "Sat Jan 26 17:26:56 ": "Feliz por estar de volta ao time. Importante vitória hj contra o Hoffenheim por 2 a 1, em casa.", "Sat Feb 16 09:43:26 ": "Wir werden ein schweres und wichtiges Spiel gegen Dortmund haben welches für den weiteren Saisonverlauf wichtig sein könnte.", "Thu Nov 15 17:35:38 ": "“@janinmty: @Andersonbamba5 eso causaria rebelião na alemanha... ;-)”Kkkkkk. Verdade.", "Sat Nov 24 22:16:16 ": "Tough game against Schalke on the road where we tied 1-1. Tomorrow, I will make an examination to see the gravity of my injury.", "Mon Apr 01 09:24:09 ": "Very hard game for us against Greather Fürth. However, it was a very important win for us. I am glad we are back on our winning ways.", "Thu Jan 24 18:05:31 ": "Mein Baby!!! Und nicht in 3D! O meu neném ai! E nao foi 3D! My baby!!!And not in 3D! http://t.co/nsSYA5Ib", "Mon Feb 04 13:35:54 ": "Der Süße vom Papa! Sweety from daddy!! Gostosura do papai!! http://t.co/2bQhXJMq", "Sun Nov 18 12:27:01 ": "It was important to get back to the winning ways. We played very offensive and with the help of our fans we were able to beat Augsburg 4-2.", "Sun Dec 23 16:32:05 ": "Hey Leute!!! Ich wünsche Euch allen einen wunderschönen Sonntag! Hey guys!!! I wish you have a wonderful Sunday.", "Sat Feb 16 09:43:07 ": "Temos um jogo importante contra o Borussia Dortmund. É um jogo importante que pode definir a nossa temporada.", "Fri Nov 23 17:03:12 ": "Eu acho que vai ser um jogo bem difícil. Mas, como todo respeito ao Schalke, agente vai para cima deles! Pois estamos jogando assim esse ano", "Sat Nov 24 22:15:44 ": "Partida difícil contra o Schalke fora de casa aonde empatamos em 1 a 1. Amanhã vou fazer exame para ver a gravidade da minha contusão.", "Sun Feb 10 21:08:56 ": "Ein Unentschieden gegen FCN, was nicht das Ergebnis war, das wir wollten, jetzt müssen wir uns auf das Spiel gegen Dortmund konzentrieren.", "Mon Jan 21 19:21:29 ": "Working hard so I can get back as soon as possible. Trabalhando duro para voltar o mais rápido possível. http://t.co/7oS50LfE", "Sun Feb 03 09:23:39 ": "Very good win over Hamburg 2-0. We need to keep up this way, playing  well, that we will reach our goals. http://t.co/COJuhI8S", "Thu Nov 15 14:23:28 ": "@janinmty não é tabu, mas as pessoas não podem comprar nos estádios!", "Fri Dec 28 20:45:05 ": "Rio for you.. http://t.co/yaPGJmCD", "Tue Nov 27 10:19:43 ": "Boa sorte para o nosso time hoje no Derby contra o Mainz. Uma p\nena que não posso jogar, mas vou estar torcendo para uma vitória.", "Sun Apr 07 14:29:12 ": "Trying to relax in a nice afternoon here in Frankfurt. Tentando relaxar numa tarde bonita aqui em Frankfurt. http://t.co/8N5Qn5PojE", "Sun Nov 18 12:26:26 ": "Foi importante voltar as vitórias. Jogamos para frente com o apoio da nossa torcida e conseguimos uma boa vitória contra o Augsburg.", "Mon Apr 01 09:26:12 ": "Ein hartes Spiel und ein wichtiger Sieg gegen Greuther Fürth. Ich bin glücklich, wir sind zurück auf der Siegerstraße.", "Sat Mar 16 22:26:49 ": "Morgen haben wir ein sehr wichtiges Spiel gegen Stuttgart. Wir spielen zu Hause und es zählt nur ein Sieg für uns! #ForzaSEG", "Mon Nov 19 12:28:10 ": "@yalthaqeb podemos sim.", "Wed Jan 09 07:33:54 ": "Könnt ihr das gelbe Teil auf dem Dessert sehen? Das ist Gold!! Solche Dinge passieren nur hier... http://t.co/irXIZ8CY", "Wed Nov 28 13:19:12 ": "Leider habe ich mich im Spiel gegen Schalke verletzt. Die Ärzte des Klubs haben entschieden, dass eine Operation am besten wäre.", "Sat Jan 26 17:26:50 ": "Happy to be back to the team today. Important win over Hoffenheim 2-1, at home.", "Fri Feb 08 12:12:55 ": "Quer ganhar uma camisa minha? http://t.co/0kdWDURx", "Wed Nov 28 13:15:09 ": "Infelizmente, acabei me machucando no jogo contra o Schalke. Os médicos do clube acharam melhor operar e a operação ocorreu tudo bem.", "Sun Dec 23 16:32:20 ": "Olá Gente!!! Um ótimo domingo para todos vcs.", "Mon Nov 19 12:16:28 ": "Ich habe soeben mein cap von La Fama bekommen und ich liebe es! Ihr sollte euch deren Bekleidung und Projekt anschauen http://t.co/jsCpZxv5", "Wed Jan 09 07:33:37 ": "Do you see this yellow thing on top of the desert?..... this is gold!! These things happen only here.... http://t.co/HLboUQhX", "Fri Feb 08 12:18:21 ": "RT @alemao_mario: Promoção no Blog do Alemão!! Concorra a duas camisas oficiais do Frankfurt, usadas pelo zagueiro @Andersonbamba5 -&gt; ...", "Mon Nov 19 09:58:59 ": "Bom dia😉\nGut morgen😉", "Thu Jan 03 08:37:23 ": "Guten morgen meine Fans!\nBom dia meus fans!", "Wed Nov 28 13:18:23 ": "Unfortunately, I got hurt in the game against Schalke and the doctors of the club decided it was best to operate and the operation went well", "Tue Feb 12 18:51:00 ": "Wie war es auf dem Karneval? How was your carnival? Como é que foi o seu carnaval?", "Sun Feb 03 09:24:27 ": "Muito boa vitória em cima do Hamburgo por 2 a 0. Temos que continuar dessa maneira, jogando bem, que vamos chegar aos nossos objetivos.", "Tue Nov 27 10:25:43 ": "Viel Glück meiner Mannschaft für das Derby gegen Mainz. Schade, dass ich heute nicht spielen kann. Ich werde sie aber lautstark anfeuern.", "Fri Nov 23 17:01:50 ": "Es wird ein hartes Spiel gegen Schalke. Respekt ja, aber wir wollen trotzdem angreifen. Offensivfußball, ohne Angst - das ist unser Fußball.", "Thu Nov 15 18:40:31 ": "@Melisa_FCB ok melisa;-)", "Wed Jan 09 07:33:25 ": "Estão vendo essa coisa dourada em cima do doce? Então é Ouro! Só aqui mesmo! http://t.co/IejDFT7g", "Wed Nov 28 13:18:35 ": "Now, I will concentrate in the recovery so I can come back as soon as possible. In the meantime, I will be cheering for my team mates.", "Thu Nov 15 19:42:41 ": "@Eintracht_News @ladysergioguti Ja. 100%", "Mon Dec 31 18:21:42 ": "Happy new year, all the best for you my fans from Twitter and I hope the next year will be better for all of us!", "Mon Nov 19 12:56:34 ": "@yalthaqeb nein. Leben privat ist privat! Nur in Training!", "Sun Dec 02 15:14:11 ": "Ich wünsche euch allen einen schönen Sonntag! Desejo a vocês um bom domingo! I wish you all a good Sunday!", "Thu Nov 29 07:14:58 ": "Viel danke fur alle.", "Thu Nov 15 13:34:12 ": "Entrevista que eu fiz no IG: http://t.co/Y1CTpUC7", "Wed Nov 28 13:16:18 ": "Agora, eu vou me concentrar na recuperação para poder voltar o mais rápido possível!!", "Tue Nov 27 10:19:35 ": "Good luck to our team in the Derby today against Mainz. It's a pity I can't play tonight, but I will be cheering for a victory.", "Fri Nov 16 12:48:04 ": "Esta vai ser a primeira partida entre as ambas equipes na história Bundesliga e queremos sair com uma boa vitória.", "Fri Nov 16 12:48:20 ": "This will be the first time in the history of the Bundesliga that both teams will face each other and we want to have a win in this game.", "Sat Jan 05 22:02:43 ": "Chegamos no hotel! Estamos já em Abu Dhabi para a pré-temporada. http://t.co/dRZOZMSw", "Sun Apr 07 14:28:42 ": "Ich versuche hier in Frankfurt an einem schönen Nachmittag einfach mal auszuspannen. http://t.co/M86jDwyzp0", "Sun Nov 18 12:24:51 ": "Es war wichtig, dass wir auf die Siegerstraße zurückgekehrt sind. Mit der Hilfe unserer Fans haben wir ein gutes Resultat erzielt", "Mon Mar 04 22:25:51 ": "RT @5zambranocz: Con mi hermano marco y @Andersonbamba5 mi compañero en la zaga del #eintracht en un momento de relajo. http://t.co/5JTK ...", "Thu Nov 22 19:49:30 ": "Beautiful stadium that we have! Lindo estádio que nós temos! Wir haben so ein schönes Stadion! http://t.co/IrPxoR2H", "Sun Mar 24 17:23:03 ": "Schon so lange Freunde...sind wie meine Brüder! Friends from a long time....like brothers for me! ! http://t.co/MipAcj1aPC", "Thu Nov 15 19:38:39 ": "“@LadySergioGuti: @Eintracht_News Hallo, mal eine Frage...ist @Andersonbamba5 der offiziele, echte Account?! (: #SGE” ja.", "Mon Nov 19 12:15:24 ": "Acabei de receber um boné da La Fama e adorei! Você deveria checar as roupas e os projetos deles, http://t.co/jsCpZxv5. http://t.co/dtlVZPsk", "Fri Jan 18 11:49:30 ": "Ich gehe die Zeit zurück! Going back in time! hahahah Voltando no tempo! Kkk http://t.co/OnoE7v1P", "Tue Jan 01 16:41:50 ": "Letzter Tag in Rio mit meinen Freunden. Last day in Rio with my friends. Último dia no Rio e aproveitando meus amigos. http://t.co/nBTsvpUq", "Mon Dec 24 18:57:45 ": "Ho Ho Ho Frohe Weihnachten an all meine Fans!!! Ho Ho Ho Merry Xmas to all my fans!!! Ho Ho Ho Feliz Natal para todos meus fãs!!!", "Sat Jan 05 22:03:09 ": "Chegamos no hotel! Estamos já em Abu Dhabi para a pré-temporada. http://t.co/d2G3V7jX", "Sun Apr 07 14:29:56 ": "@Eintracht_Br @globoesportecom valeu....", "Fri Feb 08 12:13:12 ": "Do you want to win one of my jerseys? http://t.co/0kdWDURx", "Sat Feb 23 18:49:34 ": "Tough game against Freiburg. A tie there was a good result. Of course, we wanted the win, but they are  playing good football as well.", "Fri Jan 04 09:01:36 ": "I just got my new boots....Acabei de receber minha nova chuteira...gerade habe ich meine neuen Fussballschuhe erhalten. http://t.co/j8ZKww30", "Mon Apr 01 09:23:57 ": "Jogo muito difícil contra o Greather Fürth. Mas, foi uma vitória muito importante para nós. Fico feliz que vencemos de novo.", "Sun Feb 10 21:07:30 ": "Empatamos  com o Nuremberg, mas não foi o resultados que queríamos. Mas, tdo bem, agora é  focar para o jogo contra o Dortmund.", "Thu Nov 15 17:47:23 ": "“@CastleATL: @Andersonbamba5 Hi. Wie geht's? Schön, dass du auch bei Twitter bist. :)”Alles gut. Fiel danke.;)", "Wed Dec 26 20:03:29 ": "Olha o que eu achei aqui em casa.... minha camisa quando joguei no Flamengo! http://t.co/VCqtIygZ", "Sun Dec 02 21:56:52 ": "@Melisa_FCB ja.", "Thu Nov 15 18:19:23 ": "“@Melisa_FCB: @Andersonbamba5 Ah ok, hast du instagram? :)” ja", "Thu Nov 15 13:22:14 ": "@janinmty danke Jan.", "Thu Nov 15 13:21:24 ": "@NK1899 morgen!", "Mon Nov 19 12:15:55 ": "I just got my Cap from La Fama and I love it! You should check out their Clothing and Project, http://t.co/jsCpZxv5. http://t.co/VjahDLEb", "Wed Feb 06 12:22:21 ": "Nach dem Training. http://t.co/C9iONUoM", "Sat Mar 16 22:25:59 ": "Jogo importante contra o Stuttgart amanhã! Vamos jogar em casa e só a vitória nos interessa. #ForzaSEG", "Mon Dec 31 18:21:28 ": "Allen meinen Fans auf Twitter ein glückliches neues Jahr und ich hoffe, dass es nächstes Jahr für uns alle besser wird!", "Sat Jan 05 22:02:55 ": "We have arrived at the hotel! We are in Abu Dhabi for the pre-season. http://t.co/GaO0CBIK", "Fri Nov 23 17:02:33 ": "I think it will be a tough game. But, with all respect to Schalke, we will attack them! This is the way we have been playing this year.", "Thu Nov 15 17:37:05 ": "“@Melisa_FCB: @Andersonbamba5 Du kannst deutsch?”ja. Aber nicht 100%! ;-)"}