{"Fri Mar 22 17:45:46 ": "Beethoven Journey: Barcelona, Paris, Bratislava, Vienna, Zagreb, Interlaken, Birmingham and Aix-en-Provence http://t.co/sKKKYn0ZdH", "Fri Mar 15 14:29:47 ": "On Saturday night in Lisbon Leif Ove Andsnes performs his first concert with the Gustav Mahler Youth Orchestra http://t.co/kuIHChz65j", "Wed Nov 07 19:01:06 ": "You can download Leif Ove Andsnes's new podcast from Gramophone here: http://t.co/KbWFLr07", "Mon Apr 15 14:50:40 ": "Beethoven is very much on Leif Ove Andsnes’s mind at the moment http://t.co/HznxAVmQFM", "Thu Apr 04 15:25:26 ": "Leif Ove Andsnes solo recitals in Bruges, Paris, London, Pavia, Munich, Lisbon, Oviedo, Madrid and Bilbao. http://t.co/mzNLPUFI17", "Fri Feb 01 15:55:21 ": "At times I have to find a completely clear, transparent sound, and other times I need a really big palette of colours http://t.co/fkncgT9F", "Tue Nov 20 16:05:10 ": "Tune in today at 8pm to hear Andsnes appearance @TheGreeneSpace As part of Beethoven Awareness month @WQXR @OBEYTHOVEN2012...", "Tue Oct 23 15:10:38 ": "Beethoven: \"Not your usual elevator music!\" http://t.co/e7Augojv", "Mon Mar 18 15:25:30 ": "Interview with France's \"Liberation\"  in advance of upcoming concerts with the Gustav Mahler Youth Orchestra. http://t.co/w197Y85rk6", "Sat Apr 06 13:15:34 ": "Leif Ove Andsnes on Radio3's \"Music Matters\" today http://t.co/iXa7B9sEgD", "Tue Apr 02 15:55:38 ": "Beethoven's Allegretto/Sonata op54 -fascinating example of perpetuum mobile,Andsnes returned w/ faultless sense of rhythm...", "Fri Jan 18 20:55:11 ": "Leif Ove Embarks on the second leg of the Beethoven Journey! http://t.co/XwNLGJ6j", "Fri Nov 23 17:55:09 ": "New in-depth interview about life on the road, starting a family and The Beethoven Journey http://t.co/BMrfvR06", "Sat Nov 17 19:00:27 ": "As part of Beethoven Awareness month @WQXR broadcasts Andsnes’s appearance @TheGreeneSpace Nov 20 at 8 pm @OBEYTHOVEN2012...", "Wed Feb 13 21:05:27 ": "Leif Ove Described as “a pianist of magisterial elegance, power, and insight” (New York Times)", "Fri Oct 05 22:30:32 ": "Beethoven’s music was the sun around which Western music revolved for a century - The Journey continues 2nite wth @LAPhil...", "Tue Apr 16 14:35:26 ": "Visit Leif Ove's Facebook Page to win tickets to one of his recitals http://t.co/zhfGiVGasH", "Mon Oct 22 19:50:22 ": "RT @imgartistsuk: @MusicMagazine gave @LeifOveAndsnes #BeethovenJourney the Perfect Double 5 Star Review in this month's issue!...", "Thu Apr 11 20:28:30 ": "Review from Wigmore: \"The second movement exhibited a rare kaleidoscopic quality...\" http://t.co/zaZeITql9H", "Sun Apr 07 16:55:27 ": "BBC Radio 3 will broadcast Leif Ove Andsnes' London recital at the Wigmore Hall live on 9th April at 19.30 local time http://t.co/xv2bgIISgB", "Sat Mar 16 16:40:46 ": "Tonight in Lisbon:  Andsnes performing Beethoven's Piano Concerto no. 4 conducted by Herbert Blomstedt. http://t.co/AVYuL01plP", "Mon Apr 08 19:10:43 ": "BBC Radio 3 will broadcast Leif Ove Andsnes tomorrow! http://t.co/xv2bgIISgB", "Thu Jan 17 16:40:04 ": "Leif Ove making his Liverpool debut this month http://t.co/YEOI8GzN", "Tue Apr 02 20:05:21 ": "Leif Ove Andsnes on Beethoven: The Op 54 is quirky and neglected, a two movement sonata, http://t.co/mzNLPUFI17", "Mon Apr 22 17:05:45 ": "Beethoven Piano Concerto no. 1 in C major, op. 15, III. Rondo\n http://t.co/W77Dmi2gdC", "Wed Mar 27 10:30:53 ": "Leif Ove Andsnes is the guest on France Musique's flagship show \"Le Magazine\"  today at 12:30pm local @francemusique http://t.co/8FvfK8YCh7", "Mon Mar 18 18:45:38 ": "The first reaction from Leif Ove's tour w/ the Gustav Mahler Youth Orchestra has just appeared online: \"Simply brilliant\"...", "Wed Dec 05 15:46:50 ": "RT @imgartistsuk: @LeifOveAndsnes \"shines with some of the best Beethoven playing you will ever hear\" -@BBCNews #beethovenjourney", "Thu Apr 18 18:15:53 ": "Review From Wigmore: it would simply not be possible for Andsnes to do other than elicit a beautiful tone from the instrument...", "Thu Nov 01 16:55:23 ": "Leif Ove discusses the Beethoven Journey with @classicfm http://t.co/XBC4kbWk", "Sun Oct 07 21:18:17 ": "Beethoven the pianist also revolutionized what it meant to be a public performer - final performance with @LAPhil tonight...", "Wed Nov 21 00:55:08 ": "Tune in now to hear Andsnes' appearance @TheGreeneSpace As part of Beethoven Awareness month @WQXR @OBEYTHOVEN2012 http://t.co/dBVU38p3", "Mon Feb 25 18:53:51 ": "Andsnes' recording of Beethoven Piano Concertos nos. 1 &amp; 3 has been nominated for a Spellemann prize http://t.co/8A6A0DtW5f", "Thu Nov 15 22:45:56 ": "From Boy Wonder To Family Man: Norwegian Inflight Magazine this month features Leif Ove interview http://t.co/7foC5mJk", "Fri Nov 09 18:25:13 ": "\"Andsnes' approach to Beethoven is a deft combination of keyboard heroism with evocative and clean-lined lyricism\" @SFGate...", "Fri Apr 19 15:51:20 ": "Don't forget to share the facebook post for a chance to win tickets to see Leif Ove Andsnes! http://t.co/HXjE2y6xxL", "Tue Dec 11 16:04:29 ": "Cancellation update: http://t.co/WjySbyyp", "Tue Mar 19 18:10:54 ": "Leif Ove Andsnes: the Beethoven Journey continues on ten city European tour http://t.co/82FzHejb2y", "Tue Jan 29 15:15:48 ": "It’s all about listening and finding the right colors http://t.co/pE1IoExp", "Tue Oct 02 21:20:38 ": "Leif Ove Andsnes continues \"Beethoven Journey,\" heading west for concerts with @LAPhil and @GustavoDudamel Oct 4-7. http://t.co/rgiD6fV3", "Sun Jan 27 15:45:17 ": "Beethoven: Piano Concerto No. 4 with Vasily Petrenko in Liverpool @liverpoolphil @VasilyPetrenko http://t.co/IM55K9li", "Fri Apr 05 22:45:25 ": "BBC Radio 3 - Radio 3 Live in Concert, Leif Ove Andsnes - Beethoven, Bartok, Liszt, Chopin   http://t.co/0fnMJSr8YT", "Thu Mar 21 15:09:44 ": "Listen to Leif Ove Andsnes on Radio Classique's \"Passion Classique\" in interview with Olivier Bellamy. http://t.co/jEcuuN19pN", "Fri Oct 26 18:15:41 ": "\"He who returns from a journey is not the same as he who left\"  http://t.co/6SMvcV08", "Sat Oct 06 19:37:16 ": "Check out video of Leif Ove on @LAPhil web-site  - Beethoven tonight http://t.co/pmUhb16J", "Wed Apr 03 15:05:17 ": "Leif Ove Andsnes returns to Europe this week in solo recital performances  http://t.co/mzNLPUFI17", "Wed Apr 17 17:05:30 ": "Persistence, thoroughness, clarity and pragmaticism ... http://t.co/6bBQbkbxJd", "Mon Nov 05 18:00:37 ": "Andsnes's Beethoven Journey named @GramophoneMag's Editor's Choice of the Month! http://t.co/KbWFLr07", "Wed Nov 21 20:40:11 ": "Leif Ove in DE STANDAARD  \"I needed time to understand this music.\" http://t.co/arQDXco9", "Wed Oct 10 17:07:24 ": "Beethoven Review in the Guardian: \"The incidental beauties – the articulacy of Andsnes's left hand is a marvel in itself\"...", "Sat Sep 29 17:56:01 ": "Photo of Leif Ove at Gramophone Awards @classicfm #Gramoaward http://t.co/64pwtQ0H", "Wed Mar 06 16:50:11 ": "Gramophone Hall of Fame honors people that changed the shape of the history of classical music recording. http://t.co/TrDNOonGOg", "Tue Nov 27 16:30:29 ": "Feature in DE STANDAARD \"No one comes close to such perfection, energy, intelligence …\"  http://t.co/ucFwWnjl", "Fri Apr 12 19:05:47 ": "Review from Wigmore: \"Andsnes is a pianist and a musician of great distinction, and this was a recital of distinction...\"...", "Fri Jan 18 15:25:10 ": "Liverpool Debut! @liverpoolphil @VasilyPetrenko http://t.co/XRr4vFk1", "Mon Apr 15 18:10:08 ": "On-line Video of Leif Ove on Germany's Süddeutsche Zeitung: http://t.co/ghjAR1zwbE", "Tue Mar 19 13:40:43 ": "Portugal's Público newspaper reviews Leif Ove Andsnes' performance of Beethoven Piano Concerto no. 4 in Lisbon: http://t.co/sOiAD4bdeV", "Wed Oct 03 17:32:34 ": "Andsnes will perform  Beethoven’s First and Third Piano Concertos @LAPhil &amp; @GustavoDudamel tomorrow", "Sat Mar 23 14:45:49 ": "Tonight: Beethoven at “ Vatroslav Lisinski” http://t.co/5JlrxaiiYF", "Wed Nov 14 16:04:28 ": "Austria's Radio Stephansdom chose The Beethoven Journey as CD of the Day! @RSDKlassik", "Wed Feb 27 19:50:21 ": "Vote for Leif Ove Andsnes in the Gramophone Hall of Fame http://t.co/6E2n6zeeVU", "Thu Oct 04 23:30:25 ": "Tonight Leif Ove performs Beethoven with @LAPhil http://t.co/t39IPScD", "Thu Apr 11 13:35:17 ": "4 Stars!: Leif Ove Andsnes at Wigmore Hall http://t.co/CzOzA4hSNa", "Wed Apr 17 13:45:47 ": "Ticket giveaway this week on facebook! http://t.co/2hjHwUrNhZ", "Fri Sep 28 17:43:44 ": "RT @classicfm: @LeifOveAndsnes, a pleasure to chat to you &amp; congratulations on your #GramoAward! - here's our interview:...", "Fri Nov 30 18:25:13 ": "Feel the Music project teaches deaf children a touch of Beethoven http://t.co/ABTH2IcF", "Tue Oct 30 18:06:16 ": "Beethoven Journey: Create your Own E-card to share with your friends: http://t.co/dO38gGC2", "Wed Mar 20 18:17:02 ": "Roll over, Beethoven! Take a “Beethoven Journey” with Norwegian pianist Leif Ove Andsnes France 24 http://t.co/4Get2tpzX9", "Wed Mar 27 15:35:53 ": "He strides through the recital programme that he will bring to Paris on 5 April http://t.co/UzalcScGf0", "Mon Nov 19 19:05:15 ": "Tomorrow @WQXR broadcasts Andsnes’s appearance @TheGreeneSpace at 8 pm @OBEYTHOVEN2012 http://t.co/dBVU38p3", "Mon Jan 21 14:20:16 ": "Norway pianist keys into sounds of silence http://t.co/g6fNdTAJ", "Mon Mar 04 19:55:13 ": "Andsnes nominated for a Spellemann prize - Norway's equivalent to the Grammies. \n http://t.co/QmNBJkidhj", "Fri Nov 02 20:58:57 ": "Leif Ove Andsnes receives the Wilhelm Hansen Foundation Award http://t.co/xK0H882u", "Mon Feb 18 19:15:37 ": "\"There’s a palpable sense of discovery, of living the music.” – Gramophone on Andsnes’s Beethoven Journey http://t.co/idnWNAOU", "Fri Oct 12 18:07:33 ": "ClassicFM:Andsnes captures the sparkling spirit behind Beethoven's 1st &amp; 3rd piano concertos in characterful recording http://t.co/yic4RVaw", "Sun Mar 17 14:40:58 ": "Vote for Leif Ove Andsnes in the Gramophone Hall of Fame http://t.co/geO4BgZCok", "Thu Dec 13 18:49:37 ": "Leif Ove Andsnes’s The Beethoven Journey Is Named Best Instrumental Album on iTunes Best of 2012! http://t.co/gr9uSgAV", "Mon Oct 15 17:09:03 ": "Belgium's Klara Radio: a modern reference for the Beethoven concertos...Andsnes brings joy, excitement, a driving force http://t.co/3jZoKmZX", "Sat Apr 13 02:50:12 ": "Tom Service talks to pianist Leif Ove Andsnes about his Beethoven journey. http://t.co/ycGLUkAbAD", "Fri Nov 16 19:05:09 ": "The Seckerson Tapes: Leif Ove Andsnes Interview http://t.co/gfDfuv30", "Fri Dec 07 19:10:15 ": "Leif Ove Andsnes &amp; Christan Tetzlaff Team Up For Duo Recital Tour http://t.co/aFYha8IT", "Mon Nov 12 16:50:15 ": "SF Chronicle on Andsnes's Beethoven \"a new, polished spin on familiar material\" - @SFGate http://t.co/MV4dRQOv", "Wed Apr 03 20:05:29 ": "Andsnes on Beethoven: Op 101 has it all-I have always loved the combination of particular lyricism in1st&amp;3rd movement http://t.co/mzNLPUFI17", "Wed Apr 10 21:48:28 ": "Interview with Leif Ove Andsnes available on-line on BBC Radio 3 http://t.co/ZoNcVWTyXZ", "Thu Nov 01 17:20:24 ": "Video of Lef Ove Andsnes discussing the Beethoven Journey http://t.co/JlzRyIFh", "Tue Apr 09 14:05:35 ": "Tune-in today to hear  Leif Ove Andsnes on BBC Radio 3 live - Beethoven, Bartok, Liszt, Chopin   http://t.co/0fnMJSr8YT", "Tue Apr 16 15:25:31 ": "\"The First half was a Beethoven Sandwich with a particularly spicy filling\" The Times of London http://t.co/gIRLBigaka", "Mon Mar 25 13:16:01 ": "Tune-In: Leif Ove Andsnes will be On Air wth Radio France this Wednesday, 27 March. @francemusique http://t.co/gHUVmKV71A", "Thu Dec 06 18:05:17 ": "Feel the Music is part of the MCO's Beethoven Journey concert series http://t.co/PAwTfYhI", "Thu Jan 24 15:43:47 ": "Leif Ove Andsnes: How muzak inspired a journey into Beethoven http://t.co/TEzN8e0k", "Thu Oct 04 03:08:36 ": "RT @gustavodudamel: Tomorrow, Gustavo, @LeifOveAndsnes &amp; @LAPhil begin a 3-year exploration of Beethoven's music for piano &amp; orchestra....", "Mon Oct 22 14:39:37 ": "RT @classicfm: Why do people like Beethoven? John Suchet talks to @LeifOveAndsnes. http://t.co/JNvZU7ig #ClassicFMnews", "Wed Feb 06 16:40:27 ": "Leif Ove On Beethoven: I love the 2nd Concerto, and to get to the 4th, which is so different ... will be very special http://t.co/l0Z4kHm4", "Wed Nov 14 20:15:13 ": "Austria's Radio Stephansdom: \"This is the best recording of Beethoven Piano Concertos for a long time ...\" @RSDKlassik", "Thu Apr 11 16:45:37 ": "SIMPLESMENTE GENIAL \"the Norwegian pianist was an expert in the technical &amp; sublime expressive emotionality of the work\"...", "Fri Mar 29 15:40:45 ": "the Norwegian pianist put his sensitivity to the service of the genius of Beethoven http://t.co/SJnr1l7day", "Wed Nov 28 20:12:25 ": "RT @bostonsymphony: #TWD13 musicians continued... @GilShaham @LeifOveAndsnes @YefimBronfman @EmanuelAx @devguthrie http://t.co/exESbenX", "Sun Apr 14 20:45:39 ": "Beethoven Playlist on YouTube http://t.co/yVZJvMI5xX", "Wed Jan 23 18:55:12 ": "Leif Ove: \"I am looking forward to taking the next step in our adventure\" http://t.co/2xVQiitf", "Wed Oct 24 15:16:43 ": "You can be part of the Beethoven Journey: http://t.co/9njbnyIH"}