{"Mon Apr 01 04:31:14 ": "http://t.co/lCVSXZ0k72", "Sat Feb 16 04:41:33 ": "Thank you for the kind words Ludovico! http://t.co/jthIIvzK", "Fri Mar 15 20:53:13 ": "Daniel opens the \"Heidelberger Frühling\" festival this Saturday in Germany, with a sold-out performance of the... http://t.co/j58qso8VgH", "Mon Apr 22 13:05:42 ": "DANIEL HOPE IN HAMBURG: Daniel returns to the Laeiszhalle in Hamburg this Wednesday 24th April, playing and... http://t.co/z9dzHtTCul", "Thu Mar 14 13:40:57 ": "You can hear Daniel live on the Bayerische Rundfunk 'Leporello' Radio show, this afternoon around 16:45 CET... http://t.co/8jNwPN9App", "Mon Apr 22 12:18:34 ": "Daniel is interviewed for one hour, live today at 16:05 CET on WDR Radio. More here:... http://t.co/3L4iYfj0oG", "Mon Mar 04 20:49:20 ": "Today Antonio Vivaldi would have celebrated his 335th birthday! Congratulations Maestro -- you remain immortal... http://t.co/9DU42Y0hX7", "Thu Apr 18 07:15:19 ": "http://t.co/rYtu5qPr88... http://t.co/Fm5niAfJ7e", "Sun Apr 21 11:48:48 ": "http://t.co/UFiIImKgMK http://t.co/ONkTfYBk2I", "Mon Feb 18 16:12:46 ": "http://t.co/XGoT6GJ0 http://t.co/9HRO8x56", "Tue Feb 26 00:42:23 ": "http://t.co/lOR9oW83hT", "Wed Apr 17 13:06:41 ": "Hope to see you there! http://t.co/w1PXySA9Gn", "Wed Feb 06 13:01:35 ": "I'm back in London briefly to film an interview for Sinfini, the new online platform for classical music. http://t.co/TsIjVgtq", "Tue Mar 05 13:21:08 ": "'Spheres' is CD of the week on RBB's Kulturradio in Berlin! \"Mit Daniel Hopes Album Spheres ist es ein überlegter... http://t.co/LFwkyS1Dxi", "Sat Feb 16 05:43:58 ": "Geoff Brown in The Times, London writes: \"Daniel Hope reaches for the stars on Spheres — and grabs them(...)When... http://t.co/upFrVyyA", "Mon Apr 15 22:56:55 ": "signing session tonight with the Maestro after our concert in San Sebastián, Spain http://t.co/0BypLEolVc", "Fri Apr 19 21:56:09 ": "'Spheres' is at No 1 in the iTunes Classical Charts in Australia. A big thank you down under! http://t.co/M0GY8DtIkB", "Thu Feb 21 21:10:15 ": "Less than a month until the http://t.co/uYYEOq697X . 100 Concerts, 17 Days, all music genres. This will be... http://t.co/tS3mccs2LP", "Fri Feb 08 15:17:33 ": "Just announced: Daniel to perform the Britten Violin Concerto at the Aspen Festival on July 14th... http://t.co/9zqrQjbt", "Sun Mar 17 18:40:49 ": "Wishing all 4000 of you, a Happy St Patrick's Day! http://t.co/6d0cWyD5cy", "Thu Mar 14 18:38:15 ": "Ahead of Daniel's 'Spheres' Concert in Munich on Monday night, 18th March, he stopped by the Bayerische Rundfunk... http://t.co/NvxLcYGVKz", "Fri Feb 15 16:48:20 ": "Soundcloud just posted my personal listening guide to \"Spheres\". Hope you enjoy it! http://t.co/hSI1zRua", "Sat Feb 23 13:45:24 ": "You can read all about Spheres in English, German and French right here, as well as seeing bonus material and... http://t.co/N53DLFD4jY", "Thu Feb 14 14:28:54 ": "\"Schmankerl der Woche: Eine bezaubernde Idee, die von Hope u.a. mit Jaques Ammon (Piano), dem Deutschen... http://t.co/DFtvwRMA", "Tue Feb 12 22:50:47 ": "See a short film from last week's Yellow Lounge in Amsterdam featuring Daniel and Alisa Weilerstein... http://t.co/NeoaHOgW", "Wed Apr 17 22:25:21 ": "Fantastic making music this week with one of my heroes, Vladimir Ashkenazy! This was taken tonight after our final... http://t.co/CxuJAGK5TR", "Sat Apr 20 14:44:50 ": "In today's \"Berliner Morgenpost\" newspaper Daniel talks about music, life, the universe (and his upcoming concert... http://t.co/3G1IhfQA9U", "Mon Apr 08 13:51:55 ": "Savannah Music Festival 2013 http://t.co/ZlPUcB008X", "Thu Apr 04 17:16:46 ": "We are delighted to announce that Daniel will be this year's Artist in Residence at the Meraner Musikwochen... http://t.co/oIteAEX0JU", "Thu Mar 28 19:22:47 ": "\"Spheres\" debuts at #3 in the US Billboard Classical Charts! Thank you for your support everyone! http://t.co/B9OdE8VqoK", "Fri Mar 08 10:02:18 ": "One hour on the NDR Kultur radio show down, two more to go. Having fun with Friederike and Mischa. A lot of great... http://t.co/cVmPS5I18C", "Fri Mar 22 03:39:04 ": "The Savannah Music Festival 2013 (http://t.co/uYYEOq697X) is now in full swing and I am thrilled to be... http://t.co/0robDqPKWE", "Sat Feb 02 10:11:53 ": "http://t.co/vAOGGTdI http://t.co/RbWjw2WC", "Mon Mar 04 21:29:15 ": "The Chicago Tribune selects the upcoming Savannah Music Festival in its Big Events for March: \"Breaking the sound... http://t.co/f4jMvgf1nP", "Thu Feb 28 23:10:30 ": "Great review in the Epoch Times, \"Daniel Hope verzaubert mit seiner Geige: CD „Spheres\"...\"... http://t.co/3ckaNl0Nbd", "Thu Feb 28 16:14:18 ": "Gewinnen Sie mit crescendo 1x2 Karten für das Spheres Konzert von Daniel Hope und dem Orchester Jakobsplatz am... http://t.co/jHDaiBXmRR", "Fri Feb 08 00:45:28 ": "Daniel Hope stellt in der kommenden Woche sein neues Soloalbum „Spheres“ vor. „In diesem Album wollte ich... http://t.co/R5H8H9NA", "Fri Mar 08 05:33:08 ": "Good morning to Daniel's German fans! You can hear Daniel today, Friday, from 10 am to 1pm CET as he presents a... http://t.co/HclnVUSE1v", "Sat Feb 09 16:57:02 ": "Back in Berlin for a performance tonight at the \"ARTE Lounge meets Berlinale\" TV Show. Live streaming tonight at... http://t.co/dF3XQyHg", "Tue Mar 12 01:46:31 ": "Deutschlandradio Kultur recommends 'Spheres', calling it \"Out of this world - heavenly sounds\" (\"Nicht von dieser... http://t.co/VQGPXbTeVa", "Sun Mar 03 22:02:08 ": "Daniel Hope: Spheres EPK (German) http://t.co/RVdstcdwaL", "Sat Feb 23 14:23:22 ": "See Daniel's TV interview from today (The film begins at 06m:10s until 11m:30s) for Spanish TV's \"Programa de... http://t.co/jgRo8Gfb2E", "Sat Mar 09 17:06:19 ": "'Spheres' will be released in the US on March 12. As a preview, Soundcloud is hosting Daniel's own listening... http://t.co/f9OybP3Sho", "Tue Feb 12 21:38:19 ": "Daniel was in Atlanta, Georgia last night to take part in a showcase for the Savannah Music Festival, where he... http://t.co/TCsGFQFx", "Sat Feb 23 18:58:40 ": "Great review from the Netherlands: \"A beautifully inspiring album that will especially appeal to younger... http://t.co/buTOPZAm62", "Thu Feb 14 14:26:41 ": "http://t.co/BBZZHK8S http://t.co/Datbx29y", "Sun Mar 10 14:18:15 ": "We are pleased to announce that Daniel Hope will hold the Keynote speech at the opening ceremony of... http://t.co/fGZmiBgLrN", "Wed Apr 03 15:29:53 ": "A live action shot from this week's Mendelssohn Octet performance in Savannah, with Jaime Laredo, Daniel and... http://t.co/wataprfeIN", "Sat Feb 16 17:38:39 ": "Great review for Daniel's performance of the Bruch Concerto, last night with the Indianapolis Symphony and... http://t.co/rNPmQf99", "Mon Feb 25 00:48:45 ": "Singapore's \"Symphony 92.4 FM\" radio station has made 'Spheres' their CD of the week: \n\n\"Ever-resourceful... http://t.co/WSpyuJgOsQ", "Fri Feb 08 00:44:04 ": "http://t.co/EEN9E9p4... http://t.co/5UIPjQF4", "Sun Feb 10 14:27:51 ": "With less than a week to go until \"Spheres\" is released, you can download my personal listening guide to the new... http://t.co/Vs55Czyq", "Sat Mar 02 22:05:41 ": "I posted 2 photos on Facebook in the album \"'Menschen der Woche' TV Show\" http://t.co/JZ9q9jVz4L", "Thu Feb 14 13:54:19 ": "http://t.co/m9wkNrKw http://t.co/nPhGVZe4", "Sun Mar 31 17:02:01 ": "Some photos from our new ARTE TV documentary about the secrets of the violin. Coming soon... http://t.co/nkMUZZ4IPi", "Wed Apr 03 21:58:16 ": "In today's \"Evening Standard\" newspaper in London, Daniel talks about his use of the Ipad as a digital music... http://t.co/mJgIzpduSB", "Mon Feb 25 17:47:37 ": "John Suchet at the UK's Classic FM selects 'Spheres' as his album of the week. \"...Hope's trademark violin sound... http://t.co/YCVIAJ6K8W", "Tue Feb 05 18:39:57 ": "Daniel speaks to the Austrian newspaper Der Standard about \"Spheres\" and his home town of Vienna... http://t.co/NRRO0OSH", "Thu Mar 28 04:53:25 ": "http://t.co/9FiAflwOwC http://t.co/AD1H5dfDq3", "Fri Apr 19 21:51:17 ": "As confirmed on Ludovico Einaudi's Fan Site this week, Daniel will appear as special guest with Ludovico and... http://t.co/2E3srpajNU", "Thu Feb 14 00:58:54 ": "Well, it's a first seeing myself surrounded by pink hearts (!), but I am very much looking forward to the next... http://t.co/cnbH72AE", "Thu Feb 14 19:43:58 ": "http://t.co/2QoBXEMO http://t.co/Sue8MKM4", "Mon Feb 18 22:48:52 ": "Rave review in Germany's Westdeutsche Zeitung for Spheres: \"Dieses Album ist perfekt (...) Sowohl was die Auswahl... http://t.co/S8dpFbuy", "Sat Mar 09 16:34:30 ": "Great review for Daniel's concerts playing/directing the Deutsche Kammerphilharmonie Bremen. The Bremer... http://t.co/7nS4VonFuG", "Mon Apr 01 04:28:56 ": "This photo was taken tonight at our festival in Savannah USA. To my left is bassist Ira Coleman, right is... http://t.co/SDoHgDhyxi", "Fri Feb 15 22:44:37 ": "An asteroid and a meteor on \"Spheres\" day?! Definitely something out there...;0)", "Tue Mar 19 15:48:03 ": "The critics are unanimous: Daniel's performance of the Mendelssohn Concerto with Thomas Hengelbrock and the NDR... http://t.co/Xfa6vqRS35", "Sat Feb 16 06:01:09 ": "See the Deutsche Grammophon \"Spheres\" E-Press Kit here:\n\nhttp://t.co/hf9W8iWN http://t.co/GNrKdamN", "Thu Feb 28 12:32:43 ": "German TV Tip: On Saturday March 2nd at 21.50 CET, Daniel will perform and be interviewed by Frank Elstner on his... http://t.co/vSni962vZ8", "Tue Mar 19 18:54:04 ": "Today Daniel is on his way to Savannah GA. Tomorrow he launches the Savannah Music Festival 2013, celebrating his... http://t.co/etXJ8OWJEi", "Thu Feb 07 08:18:06 ": "Watch the BBC News feature on Daniel's 'Spheres' performance at Liverpool's World Museum and Planetarium.... http://t.co/ToWf1PXC", "Sun Feb 24 21:08:35 ": "Daniel returns to Sweden this coming week to perform Benjamin Britten's stunning Violin Concerto with the... http://t.co/11lF0Tb6cM", "Wed Apr 03 15:57:22 ": "And here's one after the concert... http://t.co/vRgaOjHFRM", "Fri Feb 22 01:52:09 ": "Hi Everyone! I am thrilled to let you know that we have decided to perform the complete \"Spheres\" programme live... http://t.co/sV3SRgXzEV", "Mon Apr 15 08:00:50 ": "'Spheres' is CD of the week on Australia's \"ABC Classic FM\" Radio station. Listen here:... http://t.co/XoywwgbdCn", "Sat Feb 23 13:20:40 ": "HOPE IN HEIDELBERG! Daniel will open the Heidelberg Frühling Festival on Saturday 16th March, performing the... http://t.co/3PhL9XUi13", "Sun Feb 17 15:05:30 ": "Klaus Maria Brandauer is one of the greatest actors of all time, a true inspiration. I am excited to launch our... http://t.co/YiyJyZHX", "Fri Feb 22 17:22:57 ": "\"Spheres\" has entered the German Itunes classical charts at No 4. What a great start! Thanks for all your support... http://t.co/uF7hmH7aHp", "Fri Apr 19 09:14:26 ": "Tomorrow, Saturday 20th April at 2pm UK Time: BBC Radio 3 will re-broadcast the first in a pair of two-hour radio... http://t.co/dpTDYgBoR6", "Mon Apr 15 16:06:53 ": "In today's \"La Vanguardia\", Catalonia's leading daily newspaper, the critic Jorge de Persia has high praise for... http://t.co/SjC9UCqtuK", "Tue Mar 19 12:01:17 ": "Great 'Spheres' CD review by Germany's 'Klassik Heute', praising Daniel's \"...stupendous ability and his highly... http://t.co/8TWeGxUO9h", "Thu Feb 28 13:54:24 ": "From March 20-April 6, Daniel celebrates his 10th anniversary as Associate Artistic Director of the Savannah... http://t.co/RYlUUb9YIo", "Tue Feb 05 18:06:27 ": "Thanks to the superb team at Liverpool's Planetarium for allowing me to perform a Spheres concert this afternoon.... http://t.co/0UXp6Lud", "Fri Mar 08 19:33:28 ": "DANIEL ERKLÄRT ITUNES: Kennen Sie das neue, hochqualitative Downloadformat \"Mastered for iTunes\"? \"Spheres\" ist... http://t.co/obDf25q6mD", "Sun Apr 07 22:58:18 ": "Daniel returns to Brazil's magnificent \"Sala São Paolo\" concert hall on Tuesday night, April 9th at 21:00h. He... http://t.co/CpaWhuZzll", "Thu Apr 18 15:31:25 ": "DANIEL RETURNS TO THE BBC PROMS, JULY 29: We are delighted to announce that Daniel will be returning to the BBC... http://t.co/QZ2NT3qzEM", "Fri Feb 15 16:48:43 ": "Mein neues Album „Spheres“ erscheint heute in Deutschland! \nMit Musik von Ludovico Einaudi, Philip Glass, Michael... http://t.co/oWAEOl7D", "Sun Mar 03 11:04:09 ": "March 2nd: Ernst Strobl of the Salzburger Nachrichten newspaper calls 'Spheres' - \"one of the most fascinating... http://t.co/Fvp447VlhP", "Sun Feb 17 02:42:36 ": "What a pleasure performing this week with Krzysztof Urbański and the Indianapolis Symphony. Thank you for great... http://t.co/Sf7epn4N", "Tue Mar 05 13:49:31 ": "Daniel was in London recently to perform a work by baroque composer, Johann Paul Westhoff for SINFINI MUSIC, the... http://t.co/fmnupdPT9d", "Mon Feb 25 00:56:14 ": "Singapore's \"Symphony 92.4 FM\" radio station has made 'Spheres' their CD of the week:\n\n\"Ever-resourceful... http://t.co/0MwnBU1wND", "Mon Apr 15 11:42:12 ": "Here's a live action shot from my concert last week at the beautiful Palau de la Música Catalana in Barcelona. The... http://t.co/5NBNvmkoH3", "Sun Apr 07 15:31:07 ": "Thank you Savannah! Our Music Festival ended last night, after more than 100 concerts in 18 days. You can see... http://t.co/faIv6MUuC5", "Mon Mar 11 09:21:08 ": "March 11: New York's Classical Music Radio Station - WQXR - makes Daniel's \"thought-provoking\" 'Spheres' their... http://t.co/8isvcv5eLy", "Fri Feb 08 00:03:12 ": "Great to share tonight's Yellow Lounge in Amsterdam with the marvellous cellist, Alisa Weilerstein. Thanks also... http://t.co/iveV94sM", "Tue Mar 12 21:40:10 ": "Remembering Yehudi Menuhin, who passed away 14 years ago today, March 12th 1999. We all miss you. http://t.co/yNjkIVL7z0", "Thu Apr 11 06:56:32 ": "In today's Wiener Zeitung, Daniel talks about his home town of Vienna. Read the full article here:... http://t.co/IfjhkiicAb", "Fri Mar 08 00:02:20 ": "My thanks to the wonderful Deutsche Kammerphilharmonie Bremen and concertmaster Gergana Gergova for a very... http://t.co/S4RmJqkV9V", "Thu Feb 28 23:53:02 ": "Rave review for Daniel's performance of the Britten Violin Concerto, last night with the Gothenburg Symphony and... http://t.co/PpQuLIOgQi", "Sat Apr 13 13:51:22 ": "G'day to my Australian Friends: My new album 'Spheres' is out today Down Under, and available to download on... http://t.co/Hgp2pVchSN"}