{"Thu Mar 21 04:38:55 ": "Gillard is gone as PM in a matter of hours. About time, she was never voted in to start with.", "Thu Apr 11 10:51:59 ": "@YoDa2k13 that's a question for the club, I can't answer it. I would like to be.", "Thu Apr 11 08:18:25 ": "@tayles_1 spot on T-bird. I'll be smashing some of those too. 3 and a half weeks till I'm back there.", "Mon Mar 18 07:48:38 ": "Great day at Rottnest Island with @louno . Solid 15km recovery bike ride, and some amazing beaches and views. http://t.co/2efX5HCROP", "Sun Mar 31 14:05:19 ": "@Blue9Chip @perthwildcats thanks kompis. Go do the same thing this week. You guys have a new BIG fan, @ToveyHeath #Uppsala", "Tue Apr 16 04:43:41 ": "@isaacforman @benfitz haha, Fair point.", "Fri Apr 12 07:30:56 ": "RT @clakkasclarke: Wishing the @PerthWildcats all the best tonight! Hope the lads and @rcarter15 tear em a new one! #RedArmy", "Sat Apr 20 10:17:44 ": "Everybody should follow @AngelaTsun . My captain, Damo said that she needs to get more followers to beat Barra. #helpingyoucatchbarra", "Mon Apr 08 01:11:13 ": "Surely @NBL will re-consider the second Melbourne team or the Brisbane team now. keep the league moving forward.", "Fri Apr 19 10:21:14 ": "“@Wortho44: Greatest quarter of offensive football I've seen @AFL #aflswanscats” how good is it!!! Lovin it", "Sat Apr 20 14:37:07 ": "@AkaGorski haha. De funkar bara i Sandviken. Ni två får kolla.", "Thu Mar 28 15:21:30 ": "@vinnie_mate cheers mate. Good to have u there as always.", "Thu Apr 18 00:01:47 ": "RT @rickygervais: I am about to watch my first live basketball game at Madison Square Garden. Go Knickers! \nIs that right?", "Wed Apr 17 10:53:23 ": "@DanielEade in touristy cities and areas most speak some. But not many in other areas.", "Sun Mar 24 13:37:51 ": "@JonssonOliver go get em!! @Blue9Chip @tjpoint5 @KWright44 @AkaGorski @johan_jeansson @MannosNakos @HardSmart2getha ill be watching from Aus", "Fri Apr 12 04:45:10 ": "RT @gramsy_1: Looking fwd to game 2 of the NBL finals tonight, hoping the @PerthWildcats can send it back to NZ. Good luck @rcarter15 #c ...", "Sat Apr 20 04:46:03 ": "RT @aussiehoopla: AussieHoopla'sl NBA Playoff Bracket is away, go to http://t.co/ReFTTIM8kv to compete against @SP_10 @rcarter15 for who kn…", "Sun Apr 21 04:52:39 ": "RT @billmaher: Here's to Boston cops, they did what so many men never have been able to do: they found the little man in the boat.", "Fri Mar 22 14:28:56 ": "RT @PerthWildcats: What does The Jungle look like when it's full? This. #RedArmy http://t.co/9YlXXE9pEo", "Thu Mar 28 15:30:05 ": "@ToveyHeath #middleofthehoop", "Thu Apr 18 05:37:37 ": "“@andrewbogut: #playoffs #dubnation #GSW #2013” good work mate! Great to see you back out there moving well after last week. Looking good.", "Sun Apr 07 01:37:25 ": "@kritapendlebury thanks mate.", "Sun Apr 07 00:10:06 ": "@SP_10 @perthwildcats thanks Dipp. Have a good 150th too.", "Sat Apr 20 16:05:20 ": "RT @the_ironsheik: For the 420 today I respect the Green Medicine #happy420", "Sat Apr 20 11:07:04 ": "@bipmorgan @lachy_reid I heard he can rap too. \"Here we go, britt, here we, here we go Britt\". Yeah, I've heard it.", "Fri Mar 15 12:49:25 ": "Good luck 2 my boys tonight\n@Blue9Chip @AkaGorski @MannosNakos @johan_jeansson @JonssonOliver @KWright44 @tjpoint5  @HardSmart2getha #SMguld", "Fri Mar 22 08:03:55 ": "@KWright44 I see your Harvard boys got it done in round 1. I know ur lovin that. Get out there and kill tonight! Good luck my man.", "Mon Apr 22 11:28:28 ": "0 pts in a tough loss tonight. Felt like I'd never played before. Apologies to @richo3000 . time for me to start training again.", "Fri Apr 19 02:07:48 ": "Amazing season from Kevin Durant making 50-40-90 club. 50% fg's, 40% 3's, 90% ft's. that is tough to do, especially the tough shots he takes", "Mon Apr 01 03:15:06 ": "@andrewbogut @nbl_tv @nbl only working on the iPad/ phone. Live TV games I think don't go live on the website.", "Fri Apr 12 08:32:39 ": "@edwyatt @m1kav thanks Ed.", "Thu Mar 28 07:31:57 ": "@BenFitz the rule doesn't apply once in the act of shooting. Doesn't matter about body or reaching.", "Thu Apr 11 08:13:33 ": "We can't do good bread here on Australia. We do lots of things well, but bread is not 1. Looking forward to a baguette next month in Sveden.", "Fri Apr 12 03:42:14 ": "@DanielEade @nbl @nbltv it's on the iPad app. Maybe it's only on that. I definitely watched it, it was ugly.", "Thu Mar 21 05:32:39 ": "RT @2FBS: Dear Tony Abbott, the keys to Australia are on the sun visor. You\"ll need to put some petrol in it. \nRegards,\n\nAustralian Labo ...", "Fri Mar 15 09:16:05 ": "Congrats to my man @tremenduz for signing with real Madrid. You deserve everything you get mate. #hardworker #goodbloke #honoraryAussie", "Wed Apr 03 06:38:15 ": "Shared the back court with my old mate Robbo today at training. First time playing together since 2003/04 Vic Giants. #Oldboys", "Thu Apr 04 06:13:10 ": "RT @PerthWildcats: Great to have @dannygreenboxer speak to the team this morning after training! #RedArmy http://t.co/hzvuV1ZLpQ", "Sat Mar 23 08:06:44 ": "Great job @KWright44 @Blue9Chip @MannosNakos @AkaGorski @johan_jeansson @JonssonOliver @tjpoint5 @HardSmart2getha . 1 more and move on!", "Thu Mar 21 05:13:14 ": "@Jon_Taneski haha ok, u got me. She has never lead her party to an election win. Got power through independents. #gocats", "Sat Mar 23 08:09:39 ": "@KWright44 and great job on getting årets center. Big time! Missin u too man. Keep Ballin.", "Fri Apr 05 05:51:52 ": "@goggles007 haha, as if u would have a game machine. #oldschool #antitech-nerd", "Sun Mar 24 11:09:39 ": "Well done to Kevin Lisch on All star 5 selection. Great player, great team mate, great guy.", "Sun Apr 14 05:20:06 ": "Watching the kid @SP_10 lead out the pies against the hawks. Should be a cracker, I'm on the pies at 2.40. Get it done for me Dippa.", "Mon Apr 15 10:46:14 ": "@louno Aussie blokes love the Swedish chicks. They're so easy. Hehe.", "Fri Mar 22 07:58:44 ": "Time to go to work. Huge challenge taking on NZ without my man Damo. Time to see what we r made of.#GameDay #RedArmy #Wildcats", "Tue Apr 16 04:19:19 ": "@BenFitz haha, I won't mate. If I don't get a job, then I'll start. ;-)", "Fri Apr 19 08:49:17 ": "@vinnie_mate was good to catch up at lunch today mate. You weren't wrong about that pizza, great stuff.", "Sun Apr 07 00:22:04 ": "“@gramsy_1: Goodluck to my man @rcarter15 in game 1 of the @NBL final today #x2champion #saleboy #RedArmy” my man g-tram. Thanks mate.", "Thu Mar 28 06:59:22 ": "“@BenFitz: James Harvey playing with 2 fractures in his arm #respect” very tough man.", "Sun Apr 14 14:33:20 ": "@jeffhwitz haha no worries mate. Just havin a barbie with some snags, and watching the footy while we knock the froth off a couple. #aussie", "Mon Apr 15 18:52:21 ": "@JonssonOliver men viktigaste statistik... Hur många reverse layups gjorde du? Och hur snabba var dem? #mellannamnärreverse", "Sun Mar 24 10:53:17 ": "@richo3000 you may be right. @DanielEade 's fan base is not players or the league, or journalists... But at least he has fans.", "Thu Mar 28 04:13:06 ": "RT @Lachy_Reid: Good luck to the great man @PerthWildcats @ToveyHeath on his playoff campaign. Deserves to go out in style with a champi ...", "Thu Mar 21 05:31:05 ": "RT @BenFitz: up to the people to do what the Labour party wont", "Thu Mar 28 14:45:36 ": "@Blue9Chip haha. Lets not. I'm still looking for my legs, they weren't there when I went to go up on that. Need to lose some weight.", "Wed Mar 27 06:25:18 ": "It is my belief that @greg4hire is scared, and won't make a move in #chesswithfriends . #juniorchampion #doubtful", "Thu Mar 28 15:44:43 ": "RT @ToveyHeath: @rcarter15 Uppsala!!!!", "Thu Mar 28 03:41:46 ": "RT @CJKRobinson: Congrats to Cam Tovey as he finishes up. Consummate team man who deserves a big send-off. @ToveyHeath #RedArmy", "Thu Mar 28 14:41:05 ": "@BenFitz haha, like lay it up over the rim and touch the net?? Haha, had no legs left.", "Tue Apr 02 12:47:17 ": "Big game @MannosNakos @Blue9Chip @AkaGorski @KWright44 @JonssonOliver @johan_jeansson @tjpoint5 @Schnecksamlaren @HardSmart2getha Good luck!", "Wed Apr 03 05:42:21 ": "“@DanielEade: When a player subs in for the Adelaide 36ers, he will \"come off the pew\". #NBL” your best work in a while here. Well done.", "Fri Mar 29 02:27:17 ": "Lakers lose in Milwaukee, and the 8th spot in the west is wide open! Who will get it??", "Fri Mar 15 13:10:43 ": "RT @edwyatt: Great shot of my man @tremenduz taking medical test before joining @RMBaloncesto (Real Madrid) #bigtime #congrats  http://t ...", "Mon Mar 25 01:39:34 ": "Florida gulf coast U to the sweet 16, really??? I agree with @lono610 , sounds like a resort. Got no business in sweet 16, but good on them!", "Mon Apr 08 15:00:42 ": "Lycka till @Blue9Chip @MannosNakos @Schnecksamlaren @KWright44 @johan_jeansson @JonssonOliver @tjpoint5 @AkaGorski @HardSmart2getha slå dom!", "Mon Apr 22 10:12:02 ": "About to make my debut in Monday night B-grade at WABC. Haven't trained in 10 days, hope I can perform. 6.20 tip off. Lets do it!", "Thu Mar 28 15:05:09 ": "@kristyj75 thanks a lot.", "Wed Apr 10 00:36:55 ": "RT @Andthefoulnet: Tonight we should get #SaveTheCrocs trending.. Retweet if you agree!", "Mon Mar 18 02:24:59 ": "@BenFitz thanks mate. Hopefully can carry it to playoffs.", "Mon Mar 18 02:30:41 ": "RT @fredjonzen: Dagens statline i basketettan, Odin Lindell: 31p, 20 ret, 5 ass, 2 blk. 50 i eff!!!! #uppsalabasket", "Thu Mar 21 04:57:55 ": "“@canion: @rcarter15 yes she was - at the last Federal election!” No! She sold out to get the support of independents. Not voted in!", "Mon Apr 01 03:36:12 ": "RT @nbl_tv: @mitchthomas87 @andrewbogut @rcarter15 @NBL Sorry guys, we cannot put it live on web until One HD screen it. It is live on t ...", "Mon Apr 01 03:24:59 ": "@andrewbogut @nbl_tv @nbl @nbl_tv I know what u mean. seems it's not live anyway. Not sure what is up.", "Sun Apr 14 14:54:09 ": "RT @al_davis1: “@SP_10: Must regroup n bounce back!”\nLucky Step Brothers is on tv to lighten the mood! #canwemakebunkbeds? #extraspacefo ...", "Sun Mar 24 14:04:49 ": "@Schnecksamlaren ur not forgotten at all. I thought ur identity was secret, not to be associated with the others. Good luck with samlaring.", "Thu Apr 11 08:29:44 ": "@brettcoffey thanks. I'll check them out.", "Fri Apr 19 03:03:46 ": "@BenFitz if you're not going to share it, then don't put out a teaser... I hope it's hoops-related.", "Fri Mar 29 23:16:34 ": "RT @FCBbasket: Màxims anotadors / Máximos anotadores / Top scorers @FCBbasket : @natejawai 22, @Joeingles7 20, @Huertas09 14, @alexabrin ...", "Mon Mar 25 07:50:50 ": "RT @mrjohnnywhite: @Jmac599 @danieleade don't judge it just on stats.. Madgen went from role player to MVP candidate and team leader.. I ...", "Mon Apr 01 08:46:34 ": "Shattered for my long-time good mate and captain, Damo. We will do all we can to fill the huge hole he's left. #bigchallenge", "Fri Apr 12 07:34:34 ": "RT @louno: Today is my favorite kind of day! GAMEDAY BABY!! GRAND FINAL!! Lets get it @PerthWildcats 🏀 #nbl #finals Lycka till @rcarter15", "Tue Mar 19 01:00:05 ": "RT @hoarey34: “@ygoslo: Bloggers, citizen journalists and their impact - My thoughts on Anstey's tweet. (tl;dr) http://t.co/GFh5onODq9”  ...", "Fri Apr 12 03:32:52 ": "@DanielEade @nbl @nbltv I've been watching the whole game on there. Not sure why yours is not working. I wish it didn't work. #notpretty", "Tue Apr 16 03:46:11 ": "RT @BenFitz: Wildcats have no players ( other than DP) rated less than 5 points.", "Sun Mar 24 04:56:14 ": "Any good SBL games on in Perth today?", "Fri Apr 19 03:02:11 ": "@goggles007 @stevenash @kdtrey5 yeah mate, some of the greats in that group. Your man Steve.", "Fri Apr 19 09:12:13 ": "@mrjohnnywhite I'm guessing you will have some Mexican Tomorro, in the form of a corona!!", "Sun Apr 07 00:09:07 ": "@BenFitz thanks mate", "Fri Mar 29 11:41:14 ": "@MannosNakos haha. Jag vill att din Lakers är med i slutspelet. Det blir spännande med Lakers mot Spurs kvartsfinal.", "Sun Mar 24 09:48:12 ": "@DanielEade why aren't u at the awards?", "Fri Apr 19 10:57:04 ": "RT @ShaneHeal: Great game of footy. Two class teams.", "Thu Mar 28 14:53:55 ": "Great win tonight, not my best shooting day, but lucky I got some great teammates. Up 1-0 but the job is not done. Off to the gong tomorro!", "Fri Apr 12 18:38:44 ": "@kelsch5 @mighta87 hes on his way. We all had dead phones. He just dropped us off in the cab.", "Sun Mar 24 15:42:05 ": "Wow! My boy @Blue9Chip is lighting up LF in the first quarter! 5/5 3's and 17 points. Uppsala up 10. Keep it rolling boys. @HardSmart2getha", "Sat Apr 20 14:40:46 ": "@mrjohnnywhite stop rubbing it in J-dub. I'm back in melb next week, u better be as friendly to ur wildcat boy. #throwback #goodolddays", "Fri Apr 12 07:32:24 ": "@clakkasclarke @perthwildcats thanks mate. Appreciate it.", "Fri Mar 29 23:19:18 ": "Way to play @Natejawai (22pts) and @Joeingles7 (20 points) in last nights big euroleague top 16 game for Barca. Aussies are Ballin!!", "Mon Apr 22 00:04:39 ": "@BenFitz interesting NBL maximum. Lucky they didn't put my name to it. That could've been embarrassing.", "Sun Apr 07 00:53:47 ": "@Lachy_Reid thanks mate. I definitely will."}