{"Sun Apr 21 20:13:56 ": "@rdelima 2.9m in girth", "Sat Apr 20 00:54:59 ": "Time to stand with our Islamic brothers and sisters in this difficult time. Don't let a few evil people dictate your perception.  #tolerance", "Fri Apr 19 23:50:49 ": "RT @BostonScanner: WATERTOWN: (Update) Commanders working to make sure they can get fire trucks on scene. Trying to protect nearby house.", "Fri Apr 19 23:20:51 ": "@LILGOVERNMENT please anything but Aerosmith!", "Sun Apr 21 20:15:23 ": "RT @Boston_Police: BPD Commissioner says suspect in critical but stable condition", "Fri Apr 19 23:51:44 ": "@EL_POSER @lilgovernment @gibblerz it's almost over, hang tight", "Sat Apr 20 00:31:11 ": "Slovakia with Czech Republic maybe, but Chechnya?!?!  Oy vay.", "Sat Apr 20 01:10:22 ": "@gibblerz It's good to cry.  We all need a good cry and LOTS of sleep.", "Fri Apr 19 23:06:50 ": "Fire fight in Watertown.  Semi automatic weapons.", "Fri Apr 19 21:18:16 ": "RT @watertowntab: RT @MetzgerBot Police dogs just came thru press briefing area in #Watertown", "Fri Apr 19 15:08:07 ": "ustream of BPD scanner http://t.co/WIdzXJm1tQ … remember, don't retweet police locales or ops.", "Fri Apr 19 23:59:44 ": "RT @BostonGlobe: BREAKING NEWS: Police believe bombing suspect still alive on boat; have seen him moving from State Police helicopter.", "Mon Apr 22 00:35:03 ": "Boards of Canada Released a Mysterious 12\" on Record Store Day http://t.co/TsexN1cJOh via @pitchforkmedia", "Fri Apr 19 23:54:57 ": "RT @watertowntab: RT @tigerteam More gun shots. We're in the basement #watertown", "Sat Apr 20 01:24:08 ": "Dzhokhar Tsarnaev @J_tsar gained 70,000 new followers on Twitter today.", "Fri Apr 19 22:52:28 ": "RT @Boston_Police: #CommunityAlert: Gov Patrick says residents need 2 remain vigilant because a dangerous man is still at large but he will…", "Sat Apr 20 02:42:04 ": "RT @GlobeAndrewRyan: Boston City Hall hotline getting calls of congratulations from China, England, Canada, Louisiana, Florida, and the gre…", "Fri Apr 19 23:40:08 ": "Suspect is not moving", "Fri Apr 19 23:45:45 ": "@gibblerz hearing conflicting stories", "Fri Apr 19 22:09:27 ": "RT @BostonGlobe: Patrick: Keep a wary eye, but return to your normal routines.", "Fri Apr 19 20:50:52 ": "RT @Will_Lynch: so fucking weird RT @DavidGrann: The WANTED Poster For Dzhokhar Tsarnaev http://t.co/KhZSyRPBml", "Fri Apr 19 15:12:13 ": "There's not a bear loose in Watertown.  That's police code for armored truck.", "Fri Apr 19 23:42:22 ": "Suspect is not moving.  Believed to be dead.  Yay?  Wanted to question him.", "Sun Apr 21 20:00:12 ": "@TroyChroi @YourAnonNews People don't need the use of their esophagus to communicate.", "Fri Apr 19 21:19:47 ": "RT @Boston_Police: Help Us Find Him: Community members wanting 2 aid the search can call(800) CALL-FBI or EMAIL at boston@ic.fbi.gov. http:…", "Fri Apr 19 23:57:00 ": "RT @BostonGlobe: BREAKING NEWS: Police appear to be preparing a robot with a camera to approach the boat. Globe reporters on scene hearing …", "Sat Apr 20 01:41:12 ": "@EDMshit That's Jeffrey Bauman Jr.", "Sat Apr 20 02:37:34 ": "RT @BOSTON_EMS: Monday started in celebration and ended in tragedy. Today began in tragedy and ended in celebration. You can't keep us down…", "Sun Apr 21 20:14:50 ": "an app to merge twitter accounts", "Sat Apr 20 00:13:44 ": "RT @YourAnonNews: #BREAKING NEWS: Police have taken the cover off the boat containing the man believed to be the Marathon bombing suspect. …", "Sat Apr 20 01:25:08 ": "RT @smeuse89: Fireworks going off in Mission Hill. People are celebrating in the streets! We got him!!", "Fri Apr 19 22:11:41 ": "RT @bostonherald: Developing: Gov. Patrick announces stay indoor order lifted, MBTA will open, effective immediately...", "Fri Apr 19 15:28:46 ": "Greater Boston is a ghost town today http://t.co/jmlmeuFzsN Hopefully not for much longer.", "Sat Apr 20 00:46:43 ": "he's lost a lot of blood, not sure if he'll make it.", "Fri Apr 19 23:32:03 ": "@YourAnonNews you guys are too much", "Sun Apr 21 20:04:42 ": "RT @YourAnonNews: ATTN: This is what will happen to #Twitter if #CISPA is passed. Your rights are limited. #CISPABlackout #EndCISPA http://…", "Fri Apr 19 15:22:03 ": "RT @firstpostin: Boston bombing: How Sunil Tripathi was wrongly identified as a suspect http://t.co/ND6vwNMGk7", "Fri Apr 19 15:09:01 ": "RT @BostonGlobe: 'I think it’s fair to say this entire week we’ve been in pretty direct confrontation with evil,’ Secretary of State Joh ...", "Fri Apr 19 16:05:09 ": "Even in times like this, the meter maid will ticket you in Boston. https://t.co/G8bNNsNYIj #levity", "Fri Apr 19 23:54:18 ": "RT @MichaelSkolnik: suspect was found using thermal imaging from helicopter.", "Fri Apr 19 23:28:31 ": "@gibblerz i think he is already too high profile. They'd lock him in G-Bay (maybe)", "Sun Apr 21 20:05:58 ": "RT @TroyChroi: @andreobin @YourAnonNews we already can surmise that there's some loose wires. what we need is some context", "Fri Apr 19 23:54:50 ": "RT @e_baldi: RT @VilleJournal: photog on Arsenal St. in #Watertown:  \"I'm hearing explosions, seeing bright flashes, holy shit..\"", "Fri Apr 19 16:05:32 ": "RT @BuzzFeedAndrew: NBC: Suspect may have been wounded by police during shootout.", "Fri Apr 19 23:09:38 ": "RT @BostonGlobe: BREAKING NEWS: Shots fired in Watertown; source says Boston Marathon terror bomb suspect has been pinned down.", "Sun Apr 21 19:55:04 ": "@YourAnonNews Y'all need to make a simpler CISPA blackout image to share (in addition to the one that you already have).", "Fri Apr 19 23:25:27 ": "RT @NotGayleKing: I vote for @andreobin as new President of @cnn [and also winner of best record of the year].", "Fri Apr 19 22:19:15 ": "from someone who has met the bombers... http://t.co/StO0OZrlIE", "Fri Apr 19 21:53:58 ": "Ok, doesn't seem like they're going to get this guy any time soon. I'm venturing outside. Can't live in fear.", "Sat Apr 20 01:07:06 ": "RT @watertowntab: RT @eabradley Feeling safer in #Watertown tonight. Thank you, law enforcement.", "Sun Apr 21 12:55:49 ": "http://t.co/8cibz2zv9v  Moscow had asked the FBI to look into the older brother Tsarnaev, who spent 6 months in Dagestan in 2012.", "Fri Apr 19 23:08:08 ": "RT @watertowntab: Reports: Body found on Franklin Street in #Watertown", "Fri Apr 19 23:07:26 ": "RT @YourAnonNews: RT @911BUFF: RIGHT NOW - MASSIVE GUN BATTLE IN WATERTOWN! 'ALL UNITS TAKE COVER'. SCANNER. #911BUFF", "Fri Apr 19 15:21:37 ": "RT @watertowntab: RT @Raging_Red Choppers in air, Russian being yelled out of bullhorns above #Watertown", "Fri Apr 19 16:06:10 ": "@residentadvisor Sir Tiga, how about SEI A?  I'm just curious how you meet your Turbo artists.  Love the tracks.", "Fri Apr 19 23:22:11 ": "RT @YourAnonNews: \"It's him,\" say journalists on scene in Watertown, where #Boston bombing suspect is \"pinned down\": http://t.co/sytPgGs8o7", "Sat Apr 20 01:25:50 ": "RT @TalesOfTheKidd: @andreobin 5 of his tweets have been deleted too. I checked earlier and it was 1,099 and now it's 1,094.....Weird", "Sat Apr 20 01:28:58 ": "law enforcement is praising twitter", "Sun Apr 21 19:52:47 ": "@YourAnonNews What the hell?", "Sat Apr 20 00:33:04 ": "@safesolvent now that's a fucking band name, Martin.", "Fri Apr 19 23:48:10 ": "Strangest thing to see the neighborhood I grew up in this context.", "Fri Apr 19 16:38:14 ": "RT @DigBoston: This afternoon, a controlled explosion over in Cambridge on Norfolk St. via State Police", "Sat Apr 20 01:56:52 ": "RT @watertowntab: Davis: It's been 40 hours at this point #watertown", "Fri Apr 19 23:49:28 ": "RT @EveVawter: After this is over, I demand @YourAnonNews engage in all sorts of epic WBC fuckery to cheer us all up", "Fri Apr 19 23:39:25 ": "RT @BostonGlobe: BREAKING NEWS: Police have taken the cover off the boat containing the man believed to be the Marathon bombing suspect. He…", "Sat Apr 20 01:50:34 ": "RT @BostonGlobe: Commish: Said suspect eluded them by being 'slightly outside' the 20 block perimeter of today's earlier search.", "Fri Apr 19 23:09:05 ": "RT @BostonScanner: WATERTOWN: (Update) It is believed the subject is wearing a bullet-proof vest.", "Sat Apr 20 01:41:01 ": "RT @EDMshit: The dude that got BOTH his legs blown off helped identify suspects. Dude deserves a fucking medal.", "Fri Apr 19 16:19:35 ": "@nikjames i consider anything destructive to free society orwellian in a way", "Fri Apr 19 23:50:35 ": "RT @YourAnonNews: Radio silence has been ordered.", "Sun Apr 21 20:02:27 ": "@TroyChroi @YourAnonNews and/or take an MRI of his brain and see what the fuck is going on in there.", "Fri Apr 19 23:31:47 ": "RT @YourAnonNews: For the lulz - FBI Fail: http://t.co/33WvTEiQ5L", "Sun Apr 21 20:01:11 ": "RT @TroyChroi: @andreobin @YourAnonNews my first thought exactly. give him a pen and paper as soon as he wakes up", "Fri Apr 19 15:29:56 ": "helicopters are flying overhead again", "Fri Apr 19 23:29:02 ": "RT @YourAnonNews: Boston mayor tells WBZ a man, believed to be suspect, surrounded by police in a boat sitting in a residential backyard", "Fri Apr 19 15:12:27 ": "RT @stopherRoss: @universalhub south Boston UPS building shut down. Would assume Watertown and sommerville buildings are as well", "Fri Apr 19 23:06:03 ": "RT @YourAnonNews: FBI now acknowledges they interviewed Tsarnaev 2 years ago at request of a foreign country about possible extremist ties.", "Fri Apr 19 23:07:36 ": "RT @BostonScanner: WATERTOWN: (Update) The suspect may have been hiding in/under a boat. EMS being requested right now.", "Fri Apr 19 15:22:45 ": "RT @bostonherald: RT @massstatepolice: RIP MIT Police Officer Sean A. Collier.Your family is in our thoughts.", "Sat Apr 20 01:07:51 ": "@gibblerz It's going to take some time.  Cats help.  ;)", "Fri Apr 19 16:26:54 ": "RT @YourAnonNews: Boston suspect Dzhokhar Tsarnaev became American Citizen on Sept. 11, 2012 -  http://t.co/uHlIhlt3bI", "Sat Apr 20 02:01:21 ": "RT @watertowntab: Davis: This an unprecedented event in the United States #boston #bostonpd #watertown #bostonmarathonbombing", "Fri Apr 19 22:20:23 ": "RT @BostonGlobe: Alben: \"We cannot continue to lock down an entire city or entire state. This is a dangerous person who we believe has kill…", "Sat Apr 20 01:00:32 ": "Thank you, @Boston_Police @CambridgePolice @MassStatePolice Amazing work.", "Fri Apr 19 20:53:02 ": "RT @CambridgePolice: This is a trying/scary time 4 everyone. We're working around the clock w/ our partners on investigation &amp; thank pu…", "Sat Apr 20 00:50:20 ": "RT @annesaurus: I love you, Boston. So glad this is over.", "Fri Apr 19 20:51:29 ": "RT @GarrettQuinn: This flier of Dzhokhar  Tsarnaev is currently in circulation. http://t.co/c9tfccz2Xx", "Fri Apr 19 23:06:24 ": "RT @LadieAuPair: Wow. Just walked out of a local grill I'm always at and the owner walked up and told me it was a \"Muslim free zone.\"  Wtf.…", "Fri Apr 19 23:57:19 ": "@jaylandry86 surprisingly calm", "Fri Apr 19 23:18:50 ": "RT @massgov: RT @massema: Thank you all for your cooperation today. We realize this was unprecedented, but your safety is our priority.", "Sun Apr 21 20:07:41 ": "@TroyChroi @YourAnonNews I hate to assume anything, but it appears that the older brother trained to do this while in Dagestan.  Who knows?", "Sat Apr 20 00:33:46 ": "@gibblerz looking like it.", "Sat Apr 20 00:30:26 ": "Maybe the saddest part of this entire ordeal is how many Americans confuse Chechnya with the Czech Republic.", "Sun Apr 21 20:04:54 ": "@YourAnonNews nevermind", "Sat Apr 20 02:11:24 ": "Last thing I'm going to say since tweeting 24 hours ago.. just because we got them doesn't give you a free pass to drive drunk. #besafe", "Fri Apr 19 15:15:22 ": "@Boston_Police @CambridgePolice Stay strong guys and girls.  You're doing a tremendous job and we all appreciate it.", "Fri Apr 19 23:18:30 ": "RT @YourAnonNews: Please take him alive. Killing isn't a fair trial.", "Fri Apr 19 23:18:17 ": "RT @gibblerz: i wonder if they knew where he was and announced the lift to lure him out?", "Sat Apr 20 00:44:48 ": "Suspect 2 in custody.", "Sat Apr 20 02:04:21 ": "Enjoy the weekend Boston!  #longestweekever"}