{"Wed Mar 13 11:31:26 ": "Got my break on today ✊ http://t.co/Evnp5H7P01", "Sat Feb 23 12:54:00 ": "Happiness by the kilowatt", "Mon Feb 04 20:53:18 ": "#pumped #readytokickoff", "Sat Mar 16 09:48:16 ": "RT @redbullAUS: @danielricciardo &amp; @corbinharris with Dan's first ever surfboard! @redbullmotors #agp #GivesYouWings @ToroRossoSpy h ...", "Mon Apr 01 17:36:02 ": "@Ben_dm I like it. Sounds like a bit of motocross metal ✊😉 cheers", "Mon Apr 01 08:40:45 ": "Been getting my dunk on lately with my mini hoop! http://t.co/ZpTziWZuhD", "Tue Feb 26 13:22:14 ": "My soundtrack: ♫  Here's to the Past by A Day to Remember http://t.co/8Zfl3zEvEx #soundtracking", "Sat Apr 06 11:38:51 ": "@michaelpatrizi @TroyBaylisstic good on ya boys. This stallion sounds like a good sort! Might have to open an online account 💲😊", "Tue Mar 19 04:28:37 ": "@therealdcf1 @jeanericvergne damn you. Looks like you opted with viagra for jev. This is awkward...", "Fri Apr 19 04:21:49 ": "... or myself? We seem way too excited about standing in 37 degree heat... Is it cos we live in England?? #icebox 😰 http://t.co/I99qBxi2GG", "Fri Apr 19 04:18:04 ": "Still trying to figure out who was more excited about our track walk. @johnnyherbertf1 ... http://t.co/PoTBmbQTur", "Sun Feb 17 09:34:35 ": "So got a lot of positive feedback about the harlem shake idea. Now just need to convince the others!", "Wed Mar 27 06:28:24 ": "@CRtwotwo glad to hear bud! Good news. Still had no trouble getting the holeshot on saturday! Can't wait to see you back out there", "Tue Mar 19 04:22:49 ": "@therealdcf1 @jeanericvergne could be a long flight. I wouldnt recommend sleeping gents. I may have some shaving cream within reach", "Sat Mar 16 07:53:58 ": "Sorry guys, particularly those who waited here in the rain for the session to continue. Wish we could have gone back out.", "Fri Feb 22 09:22:25 ": "..and improve so next week is going to be busy back on track, then all set for Melbourne. Time flys but cant wait to race &amp; escape the cold!", "Wed Apr 10 10:40:42 ": "@markbarbato30 sounds like the ideal honeymoon. You'll love it!", "Wed Mar 27 06:32:13 ": "Hey guys. Been absent the last few days. Needed some time away. First couple races havent gone as expected but it ain't gonna break me", "Mon Feb 11 17:54:27 ": "Solid day training. Ticking boxes. Now listenin... ♫  Come Let Go by @xavierrudd http://t.co/JoY5HhqG #soundtracking", "Sun Feb 10 17:03:15 ": "@CRtwotwo looked promising bud. It's coming 😤🏁", "Wed Apr 10 10:38:44 ": "@VickyPiria @conordaly22 @carlosainz haha yeah I saw it too. Good looking bloke that curly haired one. Don't know about the other 3 though 😄", "Mon Mar 18 01:51:17 ": "Yesterday sucked pretty bad. Tyre blanket probs were the reason for poor first few laps. Like driving on ice. Then exhaust problem to end it", "Sun Mar 31 08:08:30 ": "Happy easter everyone 🐰 Wishing you all a wonderful day with plenty of chocolate.", "Thu Feb 07 07:54:40 ": "Good two days testing. Great to get back in the car. Still too early to know where we are but it was a positive start. Keep chipping away", "Sat Apr 13 10:38:24 ": "Yo! Happy with the days work. Can't wait to get my head down tomorrow and do the honey badger proud. #letsgetit", "Sun Feb 17 09:36:43 ": "@josefnewgarden kudos bro. So good! Haha I'm trying man will see how we go. All the best this season bud, happy to see you up there 👊", "Mon Apr 08 12:57:36 ": "Another airport. More music to keep me company 😎 ♫ \"The Backwards Pumpkin Song\" by Dance Gavin Dance http://t.co/WGRFiwzt3a", "Fri Feb 22 09:24:29 ": "And regarding the Harlem shake... It's still a work in progress. By the time we do one it will probably be old news haha. I'll do my best", "Mon Mar 18 01:57:28 ": "At least I only have to wait a few days to get some redemption. Bring on hot and humid Malaysia. It's gonna get sweaty 😅", "Fri Mar 15 22:13:24 ": "“@wecameasromans: you might have the best taste in music in all of motor sports history. Hope u kill it in the Australian GP!” Thanks guys!!", "Wed Mar 20 02:02:49 ": "Had fun at the Qantas party last week and proud to become part of their Brand Ambassador family #Qantas http://t.co/uiX0bVanp6", "Fri Feb 08 10:46:48 ": "Hey guys for more 2013 pics from Jerez testing check out my website http://t.co/A67GYMmn", "Sun Mar 10 03:37:15 ": "In the great southern land!!! You beauty. http://t.co/Q5apR6LVgP", "Sun Feb 24 21:00:36 ": "Speakers are about to blow. Man I love it when they CRANK IT UP! #Daytona500 #yeehaa", "Wed Apr 17 15:24:36 ": "Good little friendly football game with team @SChecoPerez vs team Ricciardo. 7-4 team Ricciardo! Better luck next time boys 😉⚽", "Fri Feb 15 12:24:03 ": "My soundtrack: ♫  Detonation by Strike Anywhere http://t.co/8V5aVtYL #soundtracking", "Mon Feb 04 20:52:32 ": "The car launch was today. Looks good. But it can look as good as Victoria Silvstedt playmate of the year all it wants.. As long as its fast!", "Thu Mar 07 23:34:15 ": "“@MarciRicciardo: Its going to be fantastic @danielricciardo #GoDan http://t.co/ouNjkPTMh6” yep using Bell Helmets this year. Looks good!", "Sun Apr 07 20:46:27 ": "@CRtwotwo yeah one more week for both of us I hope. RV needs stopping 😉", "Fri Mar 15 23:03:35 ": "So there's a chance of rain today. Could make qualifying interesting. I ain't complaining with that.", "Sun Feb 24 19:54:36 ": "So whos watching the 500! Who y'all got your money on? Hoping my boy Dale Jr brings it home. Got some motherland love for Ambrose too 🏁✊🚗", "Mon Apr 15 04:51:18 ": "Hey guys thanks for all the kind wishes yesterday. Enjoyed the race a lot. Really pleased for everyone involved. No stopping here ✊", "Fri Mar 29 15:10:04 ": "Loving me some old school punk this week. High school classic. Good memo... ♫  \"Penguins &amp; Polarbears\" by Millencolin http://t.co/D8dZ6RAN3d", "Fri Mar 15 22:12:29 ": "RT @SebVettelArmy: A few hours until my 18th bday begins! It'll be a special day if can get a tweet/RT off @danielricciardo! Infact, it  ...", "Thu Feb 28 09:28:27 ": "I'm happy to say I'll be testing a new onboard camera this week in testing. It should rival the @GoPro 😄 http://t.co/PJUVtc1WSK", "Sat Feb 16 10:37:53 ": "Just saw this 'Harlem shake' business. I like it. Thinking all us F1 drivers should hang back after the drivers meeting &amp; do one! Thoughts??", "Fri Mar 29 15:13:46 ": "RT @laurenpoole_: @danielricciardo hey dan please can I have a birthday tweet, wishing you luck in china! 😁", "Wed Feb 27 18:54:09 ": "@MarciRicciardo @rodree5 only at Melbourne", "Fri Apr 05 07:43:17 ": ".. have some. So if you want one really bad I could suggest doing something gnarly like jump out of space &amp; im sure you'd get hooked up!", "Sun Apr 07 20:48:26 ": "He never left. He just moved aside http://t.co/ozMKWQ1fbk", "Sat Feb 23 17:56:14 ": "@Rodree5 don't have it yet. Will do once its designed", "Thu Mar 07 23:41:17 ": "@oggiemack normally the helmet company sorts a deal with the drivers and we receive them direct from them. Like a sort of sponsorship 😉", "Sat Feb 09 09:24:14 ": "@RiseofLex88 should be fine mate", "Fri Feb 15 20:04:18 ": "Good pedal this arvo with the boys @BrendonHartley #s-dawg http://t.co/9u1sjOWN", "Mon Apr 01 20:02:56 ": "Teaching the kids a bit of poker 😉 @BrendonHartley @carlosainz @Dany_Kvyat @NickCassidy_ http://t.co/yPCPArPRxP", "Sun Feb 10 16:55:40 ": "2013 World of Red Bull Commercial. Proud to be a part of this family. Love it @redbull  http://t.co/u5LbuWmZ", "Sun Feb 03 08:56:48 ": "@Joeingles7 in about two weeks time bud! I'll let you know and if you wanna come down and have a drive 😝", "Tue Mar 12 11:16:17 ": "Along with the race this weekend I am also highly anticipating @ufc 158! Gonna be one to remember http://t.co/36Jn9NmwNV", "Tue Mar 19 03:38:15 ": "@robertwickens thats nice bro. Sharp!", "Sat Feb 16 10:46:53 ": "“@_GrooveGirl: @danielricciardo @redbullAUS has already done one! :-) https://t.co/lKygXkAX” hahaha compliments @redbullAUS awesome", "Fri Apr 05 21:33:25 ": "Reminiscing on summer. Wish it would warm up Europe! @GoPro http://t.co/DkTJJGAqLf", "Wed Apr 17 08:16:41 ": "“@foxheadinc: #LiveForIt @CRtwotwo http://t.co/5o0h5mxjGm”\n\nThe life I dreamed \n#dreamBIG 2⃣2⃣” thats an awesome pic! Says it all", "Sun Feb 10 09:09:17 ": "@BrendonHartley unlucky cuzzy. Heard you gave it herbs though. Good stuff. See you soon son. The rain was preparing you for UK 😐", "Sun Feb 24 20:17:24 ": "@zoeforman @andy12341011 its on premier sports which is an additional ppv channel on sky. Not ideal but has to be done! 😏", "Mon Mar 04 12:42:23 ": "So testings over. See what everyone brings to Melbourne. Still think testing in winter is useless. Hotter climates are the way forward", "Tue Mar 19 01:55:37 ": "Short stopover in beautiful Sydney. Love Straya! http://t.co/MmlBtxHlt2", "Sat Feb 23 17:58:27 ": "Watching @nascar_nns live from Daytona. Then the big one tomorrow. Can't wait to see how @TravisPastrana goes. Off the 2nd row aint shabby!", "Thu Mar 07 23:37:30 ": "RT @RobbieMaddison: Eigo Sato, our dear friend, rest in peace. The FMX community lost one of the greatest men in our sport… http://t.co/ ...", "Thu Feb 07 07:54:19 ": "@MarciRicciardo I will look into it mate 😉", "Fri Feb 22 09:19:24 ": "Hey guys sorry for no updates from testing. Was a lot of stuff going on the past few days. We are progressing but still lots to understand..", "Sun Feb 03 14:00:12 ": "Ricciardo v Sainz. 6-3 2-6 7-6. #winner http://t.co/6lzp7K06", "Sat Apr 20 05:50:04 ": "@AussieGrit will start his 200th GP this weekend. Been a great asset for Australian motor sport. Good on ya!", "Wed Apr 10 10:57:06 ": "RT @calcrutchlow: I love this picture ! He looked the wrong way. I wanted to say hi !!! Check out the flame from exhaust … http://t.co/6 ...", "Tue Apr 16 15:17:51 ": "Hey guys my mate @WillSchofield is shaving his beard for a great cause. Donate here to get on board. Thanks! http://t.co/uK3KZWotRo", "Tue Feb 12 08:26:45 ": "@RobbieMaddison thats wicked buddy. Still a mad dawg hey 😜👊✊", "Thu Feb 07 07:54:29 ": "@VincenzoNici g'day mate. Thanks man looking solid for now. See how we progress. Hope all is well. 😉👊", "Sat Apr 06 15:29:29 ": "@robertwickens @brendonhartley boom! Miss those days. Lets get it done", "Sun Apr 07 21:32:10 ": "@sheenyfmx @xfighters the glamorous life on the road hey bud. Hope it goes well", "Sun Apr 07 17:13:11 ": "We got a good evening of motorsport ahead. MotoGP and Nascar. Sounds like it will be dinner on the couch!", "Sun Feb 03 08:59:32 ": "Morning! Just watched a replay of @SupercrossLIVE from A3. Great racing. What a season its shaping up to be. Hoping #22 gets a win in SD!", "Wed Feb 13 09:17:33 ": "31 more days! I'm not counting... 😯😊 http://t.co/YyYd2zim", "Mon Apr 01 12:39:02 ": "Watching Chelsea v United. Ba just scored a beauty. C'mon United fight back #FACup", "Tue Mar 12 01:14:27 ": "Hard morning... http://t.co/BjymTs1t3X", "Tue Mar 05 07:30:21 ": "Got drug tested early hours this morning. All of a sudden pissing in your own home becomes difficult with someone staring over your shoulder", "Wed Mar 27 13:23:16 ": "Here in @polimi with @redbullITA and lots of excited students! http://t.co/YA40tBYFG3", "Fri Apr 05 07:43:12 ": "Hey guys. I get lots of requests about red bull hats. Unfortunately you cant buy legit ones anywhere. Have to be a red bull athlete to...", "Sat Apr 06 15:32:09 ": "New @kseofficial album hasn't disappointed. Get onto it ✊ #DisarmTheDescent", "Thu Mar 21 12:01:30 ": "Keeping an eye on everyone's diet http://t.co/aek4vDbNp8", "Sat Feb 02 19:20:45 ": "@karl1910 I test first two days of Barcelona test &amp; for the second lot there I test the last two. Dont know the dates off the top of my head", "Fri Feb 08 08:32:14 ": "A classic. Feel good friday ♫  Time &amp; Confusion by @anberlin http://t.co/m6fBac9l #soundtracking", "Mon Feb 11 08:08:04 ": "RT @TravisPastrana: Left my car at longterm parking on christmas day. Thought I'd be home before now http://t.co/KgrklJaS", "Sat Mar 16 00:49:19 ": "Fans on form as always here in Oz http://t.co/OdlISpEAgb", "Mon Feb 04 21:04:20 ": "RT @djabuk: @danielricciardo it's my fiancées birthday today! Huge F1 fan any chance of a retweet for @laurag1984?", "Mon Feb 11 08:05:54 ": "@Joeingles7 congrats buddy!", "Mon Feb 11 09:45:35 ": "Snows back. Visibility? http://t.co/zeuqTlNY", "Tue Apr 02 12:39:02 ": "RT @soathehulk: Da best revenge is happiness cause nothin drives ppl more crazy den seein some1 actually havin a good life #LiveLife htt ...", "Wed Mar 27 06:47:02 ": "This is a classic! From Tony Hawks pro skater 1. Love this ♫  \"Superman\" by Goldfinger http://t.co/yjMLCqqe6B", "Sun Feb 24 21:44:53 ": "Wow what a finish. Junebug made a run and a half! Heart rate starting to stabilize... #Daytona500", "Thu Mar 14 05:38:06 ": "Honey badger is riding with me this year. http://t.co/3EuWeuyzTv", "Sat Apr 06 15:30:09 ": "@michaelpatrizi @troybaylisstic same thing 😉 sounds good son"}