{"Sat Apr 20 14:19:08 ": "Rockland Boulders ballpark's 2012 finances remain a mystery, worrying residents, NY officials http://t.co/bM0Q8urDE3 via @NewsdayNY", "Tue Apr 16 23:20:33 ": "Summit Park nursing home resident: \"We are a fragile group of Rockland County residents and you now make us feel that we are not valued.", "Tue Apr 16 23:15:41 ": "Legis. Harriet Cornell: make your comments as brief as possible, many people have signed in to speak, will be allowed 2-3 mins each", "Tue Apr 16 23:37:33 ": "A lot of CSEA speakers threatening to leave Rockland County, to no longer be its taxpayers, if Summit Park is closed", "Fri Apr 19 12:32:37 ": "First rate reporting in Boston by @Newsday's @NewsdayCrime. Be safe out there, Kev.", "Fri Apr 19 21:48:36 ": "Controversy surrounding East Ramapo forced school board prez Daniel Schwartz to quit: source http://t.co/QmF68tMXGJ via @NewsdayNY", "Thu Apr 18 23:22:13 ": "RT @STJTorch: The Peter King petition now has more than 700 signatures. The petition now includes more detailed notes on King. https://t ...", "Thu Apr 18 21:41:08 ": "Since birth... RT @NYDN_Henrick: @ArmaghanS Then I've BEEN verified for a while....", "Wed Apr 17 01:29:43 ": "15 min break before the legislators each speak out on LDC issue. \"Welcome to politics\" one of them told me.", "Thu Apr 18 23:58:20 ": "@FrancesAdomako was at class at Columbia U when bomb threat came in: \"It's so scary...you can't feel safe anywhere you go anymore.\"", "Fri Apr 19 12:30:00 ": "@ShelleyA I had the same problem. They sent 2 techs before replacing the modem &amp; that finally worked. And get some sleep, night owl!", "Wed Apr 17 02:04:27 ": "The mood has definitely changed here in the county legislature chambers. What was a powerful, moving 2 hour public hearing has turned somber", "Wed Apr 17 19:07:50 ": "CSEA plans suit over Summit Park nursing home sale http://t.co/lWK7h3yPDC via @NewsdayNY", "Thu Apr 18 00:55:07 ": "@KpopUNC1 please move back north! Need your expert touch to heal my knee once and for all -- UNC is so lucky to have you. You're the best!", "Fri Apr 19 12:46:34 ": "I stop for gas so much at the Sunoco on the Palisades above the GWB that the attendants know me by name. But I never gave them my name.", "Fri Apr 19 00:01:28 ": "Thanks for the update RT @MHermannPhoto: @ArmaghanS @francesadomako PD just cleared the scene, proper ID.", "Tue Apr 16 16:56:48 ": "@NYGovCuomo orders flags on state gov. bldgs to half-staff today, extends \"deepest sympathy\" to friends, family of Boston bombing vics", "Sat Apr 20 12:46:29 ": "RT @ShelleyA: 10 good things that happened this week that you understandably might have missed http://t.co/irDfF8wUPE via @Salon #fb", "Thu Apr 18 00:51:25 ": "LOL miss you O-Z! RT @OzelleM: Look at you with your little verified account! @ArmaghanS 😒 LOL!", "Tue Apr 16 14:40:15 ": "4 people followed me // automatically checked by http://t.co/gEMxjr02B3", "Thu Apr 18 17:45:22 ": "@GinaPiermont what's your next step?", "Thu Apr 18 00:20:48 ": "Thanks to the awesome @NewsdayNY social media guru @JillianSed for helping me get verified! #TeamNewsdayNY", "Wed Apr 17 14:47:52 ": "Crazy how it's 2013 and I still have to dial 4 diff numbers to call Iran and still can't get through. #infrastructure", "Mon Apr 22 15:13:47 ": "Exclusive: Bill Clinton endorses David Fried for Rockland County executive http://t.co/mg5Tor8luC", "Wed Apr 17 15:15:55 ": "P.T. Thomas, head of Rockland's CSEA, meeting with lawyers today to prep lawsuit against county for Summit Park LDC", "Wed Apr 17 23:32:34 ": "Thanks :-) RT @thegoodfellow: @ArmaghanS your reporting has a \"real\" impact in Rockland. Keep it up!", "Wed Apr 17 01:04:19 ": "Two hours of public hearing in Summit Park LDC... Still going on. I think Legis. Cornell will cap it soon.", "Thu Apr 18 18:37:53 ": "@reportermurphy took long enough! :-)", "Tue Apr 16 13:54:41 ": "Clarkstown police sending extra units to Palisades Center in wake of Boston bombings as extra precaution.", "Thu Apr 18 23:51:45 ": "Just spoke w/ @FrancesAdomako about bomb threat at Columbia U. NYPD has campus on lockdown. Trains &amp; buses in vicinity suspended.", "Wed Apr 17 02:05:08 ": "A woman sitting in front of me is keeping tally of how she thinks legislators are going to vote. So far, 3-0, in favor of LDC", "Thu Apr 18 20:55:08 ": "Debate heating up at my alma mater, St. John's, over 2013 commencement speaker Rep. Peter King. Hope @STJTorch is writing about this.", "Tue Apr 16 20:18:29 ": "Seven #Rockland judges recuse themselves from employee pharmacy lawsuit to avoid conflict http://t.co/h20dJWFSCo via @NewsdayNY", "Sun Apr 21 20:01:15 ": "During my basketball years, I watched Iverson in awe. Sad journey, great article: http://t.co/wEcn7ZLcQm", "Wed Apr 17 01:52:46 ": "Legis. John Murphy  had eye surgery this morning and is wearing black-out shades, but still here at meeting and now speaking on LDC", "Wed Apr 17 00:15:29 ": "P.T. Thomas says having public hearing after committee passed Summit Park LDC is \"mere mockery\" of public gov", "Sun Apr 21 14:28:08 ": "Interesting how all these \"free\" services start charging out of nowhere. Paid $1 to send a FB msg earlier in the week, now Pandora.", "Tue Apr 16 22:58:13 ": "County Legislative chambers are packed tonight w/ CSEA members for public hearing on Summit Park LDC http://t.co/iOGFVC953q", "Wed Apr 17 23:21:36 ": "Disconnecting at my new after-work spot. Except it's not really working since I'm tweeting about it. http://t.co/v1jUtnj2O6", "Fri Apr 19 15:47:47 ": "Spotlight is on journalists as much as it is on Boston, &amp; rightfully so. Confirmation of facts is key, always, &amp; especially now.", "Wed Apr 17 00:20:52 ": "P.T. Thomas already lodged a lawsuit against the county for closing its employee pharmacy", "Wed Apr 17 00:06:11 ": "Many CSEA workers want proof that closing Summit Park will help Rockland's financial crisis, say some studies show it will do nothing", "Wed Apr 17 15:41:31 ": "You're right. It's actually the year 1392 on their calendar :-) RT @font90: @ArmaghanS It is sad, but I dont think its 2013 in Iran...", "Tue Apr 16 16:15:40 ": "Thank you. RT @font90: @ArmaghanS thoughts and prayers with ur family", "Wed Apr 17 21:59:08 ": "Well, would you look at that. Twitter verified me. So that means I'm real, right?", "Tue Apr 16 15:39:47 ": "Another quake hits Iran. My father just got there two days ago. Awaiting word from family. Thoughts &amp; prayers for all affected.", "Wed Apr 17 02:22:43 ": "Legis. Aron Wieder: if county doesn't act today, the county will founder; state will take over &amp; Rocklanders won't have say in local gov", "Tue Apr 16 13:43:44 ": "Hey Rockland: if you or someone you know has an interesting immigration story to share, please let me know! Would love to interview you.", "Thu Apr 18 02:01:56 ": "@KpopUNC1 that's awesome! Congrats! Would love to meet the Mrs. one of these days. What a lucky woman :-)", "Tue Apr 16 23:42:31 ": "Meanwhile, Mayor Noramie Jasmin's campaign given money by $200/hr law firm Spring Valley hired http://t.co/rt7MxSza11 via @NewsdayNY", "Fri Apr 19 12:06:32 ": "@ShelleyA Good luck with your modem! Took me six months to get a TWC tech to come who actually could fix the problem.", "Thu Apr 18 21:13:42 ": "Spring Valley Mayor Noramie Jasmin &amp; Deputy Mayor Joseph A. Desmaret indicted today on federal charges for \"bribery scheme\" @NewsdayNY", "Tue Apr 16 23:18:47 ": "Roberta, who has been at Summit Park more than 10 years, has stage 2 breast cancer. \"Summit Park is the best care that there is.\"", "Wed Apr 17 23:50:04 ": "Glad some Rocklanders have my back ;-) @Sloatsburgny: Pulled some strings for you @ArmaghanS. Thought you needed a bump.", "Tue Apr 16 23:14:06 ": "Rockland County legislature about to begin public hearing on Summit Park LDC #newsdayny", "Wed Apr 17 02:02:25 ": "Dwindling Medicaid reimbursement dollars being mentioned continuously by legislators", "Wed Apr 17 02:01:41 ": "Legis. Michael Grant thanking the CSEA workers who provided care for his father that had spent time in Summit Park", "Mon Apr 15 21:46:33 ": "Google launches Person Finder in wake of Boston explosions: http://t.co/vytqkEovlC", "Wed Apr 17 00:32:44 ": "P.T. Thomas: Rockland needs to be on the side of creation and sustenance", "Mon Apr 22 18:14:26 ": "Visiting my alma mater, St. John's. Miss this place! http://t.co/llVWOGJjSu", "Thu Apr 18 00:53:16 ": "Yes, please! It's been way too long. When are you in NY next? RT @OzelleM: @ArmaghanS Miss you too girl! We have to catch up sometime!", "Wed Apr 17 02:13:57 ": "Legis. Jay Hood Jr. apologizing to the crowd, saying he has to support the LDC", "Fri Apr 19 12:04:56 ": "Unbelievable news out of Boston for the second time this week. Stay safe everyone.", "Sun Apr 21 19:16:27 ": "Perfect birthday dress: found. Six days until I'm a year older and a year wiser!", "Tue Apr 16 23:28:21 ": "David Schwall, CSEA worker: a \"disturbing trend\" that \"everything will be thrown overboard in the relentless [pursuit] of money.\"", "Sun Apr 21 20:54:35 ": "See what officials think are best mass transit options for you on new TZ Bridge: http://t.co/WOHP3cfNR7", "Wed Apr 17 02:17:26 ": "Legis. Toney Earl: \"I'm going to vote no because it's the right thing to do.\" Crowd applauds.", "Sun Apr 21 19:47:57 ": "I never understood why, after a nice leg massage, pedicurists (?) want to bang on your feet &amp; shins w/ closed fists. OW.", "Thu Apr 18 13:58:50 ": "Thursdays in the office. http://t.co/DQ4I5Fsqia", "Tue Apr 16 14:54:43 ": "RT @NewsdayCrime: Latest from Bstn“@Newsday: Friends and neighbors remember 8-year-old #Boston victim Martin Richard http://t.co/zZVgFk0 ...", "Sun Apr 21 22:24:58 ": "Haverstraw community garden grows jalapeños, cilantro, callaloo to adapt to Rockland's diversity http://t.co/QZKUue9ohE", "Mon Apr 22 00:05:50 ": "The things you see in midtown..... http://t.co/06jEq9E9Cn", "Wed Apr 17 02:24:47 ": "Legis. Chris Carey: We're going to be back here talking about the hospital as well bc of problem with managed care", "Wed Apr 17 00:02:37 ": "Retired Summit Park worker: \"Shame on you\" to legislators. \"We have done our jobs. With all due respect, have you done yours?\"", "Thu Apr 18 23:31:15 ": "It's still Throwback Thursday, right? I think I was 15 in this photo. W/ my bro &amp; cousins. http://t.co/C9hclgeDVL", "Thu Apr 18 23:46:33 ": "Are you ok?? Just tried calling you MT ‏@FrancesAdomako Bomb threat at Columbia university. streets have been blocked off.", "Thu Apr 18 20:17:59 ": "Great to hear my dad's voice for the 1st time since he left for Iran last week. Time zones &amp; infrastructure problems be damned.", "Thu Apr 18 20:56:35 ": "Street verification was all I ever needed RT @NYDN_Henrick: @ArmaghanS VERIFIED???", "Sun Apr 21 14:24:22 ": "Since when does Pandora charge for its \"free\" radio? http://t.co/f2UVeIqqpa", "Tue Apr 16 14:04:42 ": "Today is the last day to turn yourself in if you've been cheating STAR. Don't want jail time? Go see Zugibe ASAP.", "Thu Apr 18 18:39:44 ": "@reportermurphy I guess you needed confirmation that I'm \"real\"", "Sat Apr 20 15:23:19 ": "My poor baby :-( anyone have a good body shop guy I can go to? Hah http://t.co/1K3yi8IAyf", "Wed Apr 17 00:13:48 ": "P.T. Thomas, head of Rockland CSEA up next", "Wed Apr 17 00:23:07 ": "Some legislators have had their eyes fixed on each speaker; others have reverted to staring downward", "Wed Apr 17 02:03:26 ": "The crowd of CSEA workers, who were rowdy and enthusiastic before, are now crying and sniffling now that LDC seems inevitable", "Mon Apr 22 18:48:47 ": "Using a hair dryer to fix my dented bumper? It worked. Only at the Iron Triangle in Queens. http://t.co/WWCBt4OG5d", "Tue Apr 16 17:06:18 ": "\"My name is not baby, shorty, sexy, sweetie, honey, pretty, boo, sweetheart, ma.\" Tell 'em: http://t.co/OBPpofDbRN", "Wed Apr 17 02:00:25 ": "Cornell and Murphy the first two to step up and say the county simply cannot afford to continue to operate Summit Park.", "Wed Apr 17 00:20:07 ": "P.T. Thomas says LDC is illegal and the CSEA will seek public referendum and will sue the county", "Thu Apr 18 17:27:32 ": "@GinaPiermont How did the meeting go?", "Thu Apr 18 21:15:36 ": "Our story on Jasmin &amp; Desmaret's indictments by @NikBonopartis  http://t.co/XQV1qZcaPr via @NewsdayNY", "Mon Apr 22 12:35:15 ": "So, Rep. Peter King (R-Seaford) called St. John's students \"misguided and wrong\" for not wanting him to speak at commencement.", "Tue Apr 16 18:54:38 ": "RT @CouncilmanDF: Spoke to our PD Chief about community security. We activated our Hardening Plan &amp; are on heightened coverage of po ...", "Fri Apr 19 13:51:20 ": "NYS Comptroller Thomas DiNapoli worries for Rockland's budget, says tax revenue projections too high once again http://t.co/bA6XdZSnwL", "Wed Apr 17 23:54:01 ": "This is why I can't grocery shop w/ skinny @FrancesAdomako. Me: \"Wheat spelt bread is good-&amp; healthy.\" F: \"Yeah I don't do healthy\"", "Thu Apr 18 23:22:22 ": "RT @STJTorch: Rep. Peter King issues statement on students protesting his selection as commencement speaker http://t.co/B5owQp8aED", "Thu Apr 18 01:20:24 ": "Pls do-Hope school is great :-) RT @OzelleM: @ArmaghanS Probably some time in the summer. I am not sure yet but I'll definitely let you know", "Tue Apr 16 23:39:53 ": "Director of Social Work: Not one legislator has come up with creative business model for Summit Park; they just \"throw in the towel\"", "Thu Apr 18 01:11:53 ": "Lindsey Walker, Suffern teen hurt in Boston blasts, speaks to me about her ordeal http://t.co/7f3fuQnxHA", "Thu Apr 18 17:29:57 ": "Rocklanders: if you want to help your community on Earth Day, @davidcarlucci is hosting a clean up at Davies Farm in Congers, Sun. 10am-noon"}