{"Fri Apr 19 17:59:28 ": "RT @MTVHive: '@BRMCofficial's Robert Levon Been Revisits His Father's Legacy With the Call http://t.co/amKcrFzWcG", "Fri Nov 11 17:45:36 ": "Baby 81 and American X: The Baby 81 Sessions on vinyl coming Nov 25th. Click for more all the info http://t.co/Oza8I25Y", "Wed Mar 20 22:52:40 ": "This week only, our new album 'Specter At The Feast' is available on @amazonmp3 for $5! http://t.co/UXQYaUWwgG", "Wed Oct 05 15:14:34 ": "Today only - we're selling the Dreamcatcher shirt for 50% off! http://t.co/cDPjg4RV", "Thu Apr 18 00:31:15 ": "RT @pledgemusic: Interview: BRMC’s (@BRMCofficial) Robert Levon Been on The Call (@thecallband) Reunion http://t.co/HqkOVoD0ap #rock", "Tue Nov 29 21:20:51 ": "Thanks to everyone that came out to the shows in Mexico, South America and Cape Town. It was an amazing experience for us", "Tue Aug 02 19:33:06 ": "I favorited a @YouTube video http://youtu.be/33xRGYjysyY?a Black Rebel Motorcycle Club - War Machine & Mama Taught Me", "Fri Aug 12 18:05:14 ": "RT @TrueBloodHBO: EXCLUSIVE: Find out what's on your Season 3 soundtrack. (via @ew) http://itsh.bo/nedat4 #trueblood", "Thu Sep 15 22:27:19 ": "Hey Buenos Aires - We're playing a 2nd show at Niceto on November 9th!", "Tue Feb 26 18:29:07 ": "Gear is shipping out to Ireland now for final stage of production rehearsals before the tour. See you… http://t.co/vzOuw8j3WQ", "Wed Nov 09 20:29:18 ": "Thanks to everyone who came to Niceto last night. Great to be back in Buenos Aires! Tix still available for Niceto tonight. See you there!", "Wed Jan 09 15:01:07 ": "Our new album \"Specter At The Feast\" will be released Mar18 (UK/Euro) and Mar19 (US/Can)! See the cover and tracklist http://t.co/GQeMcPTu", "Mon Sep 17 17:50:31 ": "We've partnered with Not For Sale on a limited edition t-shirt. Check it out http://t.co/jXpOXQKi", "Sat Dec 24 19:57:00 ": "Here's a free download of \"The Absent\" Happy Whatever Day you like to call it. Peace, Love and all that stuff from us. http://t.co/7GeDdtEB", "Thu Sep 08 00:43:58 ": "Listen to our song 'Shadow on the Run' that will be featured on the 'Batman: Arkham City' soundtrack at Rolling Stone http://t.co/giKCzEW", "Mon Aug 01 17:29:39 ": "Buenos Aires!! We're coming back - Nov 8th at Niceto Club. Tickets go on sale tomorrow - and we'll post that link. More announcements soon.", "Tue Nov 15 19:37:09 ": "Starting today and through the 21st of November - all women's items in our merch store are 25% off. http://t.co/I2klzEAa", "Fri Aug 26 18:35:12 ": "new women's tank design now available in the webstore. http://t.co/ZiHbR96", "Mon Jan 14 17:15:46 ": "North American Headline Tour Announced. Head over to our site for complete list and on-sale information! http://t.co/VM5FdVOg", "Fri Jul 01 17:07:22 ": "Just added AYA from \"Live From London\" to YouTube. Check it out if if you haven't seen or ordered the DVD yet http://t.co/bQk4MbX", "Fri Apr 05 13:33:44 ": "Vote for Leah!  http://t.co/yd09sFCV1B is giving you the chance to vote for your favorite female drummer.  http://t.co/vFLk7ZnJhM", "Thu Aug 11 21:35:43 ": "Check out our cover of the True Blood theme song \"Bad Things\" thats feat on the True Blood Vol 3 Soundtrack http://t.co/p9dxpTQ", "Thu Dec 22 18:58:49 ": "ltd edition hand screened poster from south america/mexico shows. 100 avail and we're signing 20 http://t.co/28oEcOFe http://t.co/zW4mtsTQ", "Sat Dec 31 00:09:18 ": "Happy New Year, thanks for all the support this year. See you in 2012. 'Til then here's a free download of \"The Absent\" http://t.co/PxmlzX6X", "Thu Sep 08 00:58:42 ": "Just announced - headline at Teatro La Cúpula in Santiago, CL on Nov 11. Tix: http://t.co/QBTQ4JR", "Thu Apr 04 14:34:34 ": "New video for the Call's pledge campaign: http://t.co/oPqD1Axgfz", "Thu Apr 11 03:02:37 ": "US tour begins soon.  Do you have your tickets yet?  We hope you join us.\nhttp://t.co/WR3P5jUxec", "Wed Aug 03 23:26:55 ": "Hey New York - we're heading east to play for you Labor Day Weekend (Sept 5th) as part of Quiksilver's Pro Series. \nhttp://t.co/hxnnR7M", "Wed Jun 22 18:21:36 ": "More merch items rolling all summer, starting today with the \"Dreamcatcher\" shirt. Available in both men's and women's http://t.co/A3JGH6U", "Sun Jul 31 21:08:19 ": "I favorited a @YouTube video http://youtu.be/P6l7qYdU3TQ?a Black Rebel Motorcycle Club sound check \"Beat The Devil's T", "Wed Apr 17 15:58:22 ": "Two artist additions to the April 19 show at the Troubadour", "Wed Feb 13 19:38:12 ": "Share what \"Let The Day Begin\"means to you on Instagram with #letthedaybegin to unlock a new album track soon http://t.co/7Cw0tgJb", "Sun Jul 31 21:08:05 ": "I favorited a @YouTube video http://youtu.be/1iehvaMkSBM?a black rebel motorcycle club, LA TURISMO EXCURSOA SWU spread", "Tue Feb 19 16:07:26 ": "Specter At The Feast is now available for iTunes pre-order in the US feat. 3 additional b-sides. http://t.co/onIm2yiU More info soon.", "Fri Apr 05 14:06:38 ": "http://t.co/fCkQXUIwT5 http://t.co/ujuZIHhSBk", "Thu Mar 21 22:18:58 ": "You can now listen to our new album 'Specter At The Feast' on @Rdio: http://t.co/Y6gyyJ1M1k", "Thu Apr 11 13:05:08 ": "For those in the LA/San Fran area, Robert Been will be performing with @thecallband on April 18 and 19: http://t.co/oPqD1Axgfz", "Sat Apr 06 01:26:06 ": "We want to see your best BRMC photos. Tag your your favorite live shots with #BRMCphoto", "Sat Mar 30 12:51:01 ": "Ready for tonight?  http://t.co/4L9UErMu9Y", "Thu Apr 11 19:34:13 ": "Let The Day Begin video premiere:\nhttp://t.co/jEzE2dr2Aj", "Tue Aug 02 19:32:40 ": "I favorited a @YouTube video from @Capital_M http://youtu.be/1N54DQAackM?a Black Rebel Motorcycle Club - \"Berlin\" - Live", "Wed Jul 20 16:24:58 ": "\"River Styx (Demo Version)\" is feat. on the new 3-disc compilation \"Live From Nowhere Near You Vol 2\" - check it out - http://t.co/r91KdjF", "Wed Apr 24 21:23:34 ": "RT @vagrantrecords: Black Rebel Motorcycle Club (@BRMCofficial) is tonight's musical guest on The Tonight Show with @JayLeno. Be sure to tu…", "Thu Feb 21 20:07:09 ": "First physical copy has arrived!\n#letthedaybegin http://t.co/RsxDQ8vILv", "Mon Nov 28 22:28:56 ": "It's Cyber Monday - so all merchandise ships FREE to the domestic US. Also, accessories are still 25% off.", "Mon Aug 01 03:16:12 ": "It's official. We're coming to Brazil to play the SWU Festival on November 14th. More announcements coming soon!", "Wed Apr 03 02:33:47 ": "Our Facebook events page has been updated with our US dates: http://t.co/Z7oCjZJndc", "Sun Jul 31 21:07:52 ": "I favorited a @YouTube video http://youtu.be/CEipoAXYN9c?a black rebel motorcycle club LA TURISMO EXCURSOA SWU YouTube", "Thu Aug 04 16:26:22 ": "We'll be playing two shows in China in Sept. - 11th in Beijing (Inter City Music Festival) and 13th in Shanghai (Headline @ Maolivehouse)", "Sun Jul 31 21:07:41 ": "I favorited a @YouTube video http://youtu.be/tuc5LWvjsWI?a Black Rebel Motorcycle Club - Berlin & Six Barrel Shotgun (", "Wed Apr 11 22:30:05 ": "Howl and The Howl Sessions are finally available on vinyl worldwide April 21st but you can pre-order now. More info http://t.co/ShqZxZkA", "Tue Mar 06 02:20:56 ": "We’ve started – day one in the studio recording the new album – same console that we did Punk and Spread and Rifles on http://t.co/Z6JhLNL1", "Wed Apr 24 20:24:44 ": "The band will be playing The Tonight Show with Jay Leno. We are outside Tom's room, waiting for him to come out ;) http://t.co/iDstwrrmgC", "Sun Jul 31 20:59:18 ": "I favorited a @YouTube video http://youtu.be/ViYZxeD_Nh0?a Black Rebel Motorcycle Club - \"In Like The Rose\" @ Del Mar", "Tue Nov 08 17:26:44 ": "We're in Buenos Aires for two shows starting tonight at Niceto Club.", "Fri Mar 29 12:51:12 ": "@thecallband just released a campaign to raise funds for a live album/DVD, featuring Robert of BRMC on vocals/bass. http://t.co/ox7nC0SbRJ", "Wed Nov 09 00:51:57 ": "Today thru Nov 14 - 25% men's t-shirts at our store: http://t.co/VTT49RIv", "Wed Apr 17 16:30:43 ": "Interview with Robert Been about @thecall shows:\nhttp://t.co/1Z3dNRHzX2", "Wed Jul 06 20:05:15 ": "Counting down to the Down Syndrome LA Benefit Show \"TWENTYWONDER\" this coming Saturday http://t.co/xaKliGn", "Tue Aug 09 01:14:42 ": "“@portugaltheman: The gear is going to be hard to recover. Please continue the RTs. HUGE help from you Chicago! So great. Thank you!”", "Fri Nov 18 21:15:02 ": "Tonight we'll be featured on Last Call with Carson Daly. He'll be airing a performance of \"666 Conducer\" - check local listings and set DVR!", "Thu Aug 30 23:47:31 ": "\"Conscience Killer\" is being used in a new commercial for Miller Lite to see why we allowed it to happen. Click here http://t.co/ShqV0pjG", "Mon Jan 21 01:37:04 ": "Word on the street is @KatCorbett is going to play our new single tonight on Local's Only around 9pm pacific or so tonight! Stream it online", "Tue Apr 16 06:58:20 ": "RT @RomiTheWriter: #BRMC’s Robert Levon Been joins his father’s bandmates to bring back #TheCall http://t.co/MIo5ADWpr8", "Thu Apr 18 20:55:46 ": "RT @slimssf: TONIGHT! @TheCallBand feat. Robert Levon Been of @BRMCofficial + @Jeffertitti's Nile + DJ Dan Mancini: http://t.co/bmkBE1CtG4", "Thu Apr 11 13:36:38 ": "Here's a video from our acoustic set at Saturn in Cologne.  \"Lullaby\"\nhttp://t.co/ha6lwCMoAi", "Wed Feb 22 17:55:03 ": "We've been busy writing the next album - but grab Beat The Devil's Tattoo on sale for $7.99 on @iTunesMusic now http://t.co/tAglrKpL", "Tue Apr 16 09:08:36 ": "Magic Mirror has been added to the Call performance at the Troubadour in LA (Friday, April 19) - tickets available: http://t.co/57LiQkWRZY", "Fri Mar 29 22:21:56 ": "Album review from the Guardian in Glasgow.  Written by @graemevirtue.\nhttps://t.co/3VIhVSF36L", "Fri Oct 14 00:15:00 ": "Today and tomorrow - get out our classic skull and pistons logo shirt for 50% off while supplies last http://t.co/cMeU5IpQ", "Sat Mar 30 17:35:47 ": "HVM : REVIEW (Black Rebel Motorcycle Club) http://t.co/eG7lrpwD4e @highvoltagemag", "Tue Mar 19 18:52:06 ": "European tour is going great! Our new album 'Specter At The Feast' is out today on @iTunesMusic: http://t.co/R8nQBasa7O see you soon, BRMC", "Sat Nov 12 15:35:48 ": "Playing the Maquinaria Festival in Santiago, Chile today at 4pm on the Sony Erickson stage. See you all there.", "Tue Nov 01 21:56:42 ": "We're headlining Synergy Live in S. Africa on November 26th - http://t.co/d4FJYgb2", "Tue Sep 25 20:19:40 ": "We're partnering with @NFS to fight slavery. We have a limited edition t-shirt for sale &amp; all money goes to help http://t.co/tIYgMSlL", "Wed Jul 06 19:02:28 ": "Just launched our own digital music store. Exclusive digital bundles, \"For Murder,\" \"Screaming Gun,\" and MORE. http://t.co/9EtHV0M", "Wed Sep 28 16:48:08 ": "24 Hour Flash Sale on the Sugar Skull shirt. Get it today for only $8. http://t.co/e1guKHnX", "Thu Jul 14 19:09:04 ": "We're beyond excited to announce that we will be coming to SANTIAGO, CHILE to participate in the Maquinaria Festival on November 12th!", "Sat Apr 13 17:11:33 ": "Let The Day Begin http://t.co/jnt23qRbYM", "Thu Aug 18 19:23:52 ": "Our hearts go out to everyone at Pukkelpop - the fans, bands, and crews.", "Sat Apr 06 11:16:52 ": "RT @shoottherhona: @BRMCofficial #BRMCphoto http://t.co/NHIi9be8r6", "Thu Nov 15 18:04:37 ": "We're excited to announce our new album is slated for release in March and just put the first leg of the tour on sale http://t.co/ShqV0pjG", "Thu Jul 14 21:10:26 ": "Just announced: Maquinaria Festival in Santiago, Chile - November 12th. More info: http://t.co/fb1bO3G.​cl/. More announcements soon!", "Fri Apr 20 23:02:58 ": "We're saddened by the passing of our dear friend Levon Helm. Our thoughts and prayers are with his family during this difficult time.", "Tue Nov 22 22:11:17 ": "Starting today, all accessories in our webstore are 25% off. http://t.co/avSCmFYy  http://t.co/F58ibw6t", "Sun Feb 24 03:07:42 ": "Getting Leah's new drum kit ready for tour. Many thanks to SONOR @playhohner for making this custom kit… http://t.co/C5PTAa4eEY", "Tue Aug 16 14:27:51 ": "MEXICO!! It's official - we're headlining the Ibero Fest November 5th at the Universidad Ibanomerica. Tickets on sale end of the month.", "Mon Jun 06 16:23:31 ": "We'll be headlining a free show at the Del Mar Track as part of their summer series on July 29th! http://t.co/ECbdSHj", "Tue Aug 09 00:28:34 ": "I favorited a @YouTube video http://youtu.be/E9zqGjxN34w?a BRMC Black Rebel Motorcycle Club   Spread Your Love, Glasto", "Tue Aug 02 19:32:58 ": "I favorited a @YouTube video from @Capital_M http://youtu.be/m8B9EEJMVo0?a Black Rebel Motorcycle Club - \"Weight of the W", "Wed Oct 19 18:04:04 ": "Today only - our Women's Dreamcatcher shirt is available for 50% off. Grab one now while supplies last http://t.co/6gxxFY7p", "Sun Jul 31 21:07:29 ": "I favorited a @YouTube video http://youtu.be/Hp34ysDNG74?a Black Rebel Motorcycle Club - Am I Only & Feel It Now Jam (", "Tue Oct 04 18:55:34 ": "Our new song, \"Shadow on the Run\" is available now on the Batman: Arkham City soundtrack - http://t.co/kw8OOqj0", "Mon Apr 01 14:41:04 ": "We are having a great time in Europe with you all...thank you to everyone for coming out.  Picture… http://t.co/5K2CEqFfr7", "Thu Jul 05 22:50:34 ": "Head over to TwentyWonder benefiting Down Syndrome Association of LA this Saturday NIght Use code FRIENDS15 for 15% off http://t.co/jTaHi9qH", "Sat Mar 30 20:53:39 ": "The Call has launched a Pledge Music campaign for a new album feat Robert on bass/vocals. Learn how to get involved: http://t.co/ox7nC0SbRJ", "Fri Apr 19 18:04:07 ": "Robert Levon Been of @BRMCofficial will be performing with the Call TONIGHT at the Troubadour. Come join us LA. @thecallband", "Sat Apr 06 11:16:31 ": "RT @ICFADCO: @BRMCofficial \"Breaks in the light only shape what you see\"... #BRMCphoto http://t.co/p3ZKisUndF", "Thu Apr 11 15:02:43 ": "Great photos @neolydcom …. thank you for sharing your work with us. http://t.co/eyR0Ogqwhu http://t.co/qoBqONcf47", "Mon Jan 21 05:35:08 ": "@KatCorbett just played our first single \"Let The Day Begin\" - info on how to get the track tomorrow around noon!"}