{"Wed Mar 20 16:00:46 ": "Man blows himself up in truck &amp; destroys home in revenge attack on owner http://t.co/x2c4T8FDpb by @MailOnline The IED is a global threat", "Thu Mar 21 19:17:56 ": "Seattle man arrested, bomb materials confiscated from home http://t.co/KJjeYfqMCM The domestic #IED threat is REAL.", "Fri Apr 19 16:05:58 ": "Today, we remember the 168 lives lost and countless others that were changed by the OKC bombing in 1995", "Thu Mar 21 17:48:04 ": "We must protect national security interest against threats that span regional boundaries &amp; can rapidly assume global dimension.", "Mon Apr 08 20:19:03 ": "Jharkand #India: #Maoists blow up rail track and blast buildings during 48-hr bandh http://t.co/hk9qJZSDHM The #IED is a global threat.", "Tue Apr 09 17:33:03 ": "Ugandan forces train with U.S. #Marines for #Somalia mission http://t.co/Z2wR35MYtm via @USAfricaCommand @DVIDSHub", "Tue Apr 16 17:03:56 ": "Former military intel analyst explains how IEDs work http://t.co/nsUvJ0B7EF\n#BostonMarathon", "Fri Mar 08 21:20:38 ": "Five AFG officers killed battling poppy production http://t.co/WB8JPzcnkh The #IED is weapon of choice along the entire threat continuum", "Wed Mar 20 19:49:50 ": "RT @natlsecuritycnn: FIRST ON CNN: Bounty on two Americans tied to Somali terror group. @EliseLabottCNN reporting now on #CNN http://t.c ...", "Wed Mar 27 12:42:13 ": "RT @DaveedGR: Gen. Carter Ham: \"It is very clear to me that al-Qaeda intends to establish a presence in Tunisia.\" http://t.co/Wg5FHqhOpB", "Thu Mar 14 19:51:09 ": "Virtual training prepares service members for IEDs http://t.co/zs11KLPgTy A well-trained warfighter, best tool in the C-IED toolbox.", "Mon Mar 25 16:00:53 ": "#MilitaryMonday EOD Airman who's rendered 200 IEDs safe; receives 5th Bronze Star http://t.co/rPoqEW8lzQ via @usairforce", "Wed Apr 10 19:55:46 ": "Legislation needed on use of fertilizer in explosive devices http://t.co/p4z7YWO3Ew HME remains the main charge used in IEDs in AFG.", "Tue Apr 16 19:34:04 ": "Pres. Obama: \" Any time bombs are used to target innocent civilians it is an act of terror.\" http://t.co/5vl6I9lOfQ via @WhiteHouse_Blog", "Wed Apr 17 15:33:06 ": "Mayors Menino, Giuliani Praise 'Brave' First Responders in Boston http://t.co/XCi8nlkux2 via @ABC", "Wed Mar 13 20:08:05 ": "DoD defeating IEDs through innovative IT http://t.co/tymCX3DoPd via @FedNewsRadio", "Fri Mar 29 20:34:14 ": "#USArmy Engineers training to clear routes &amp; save lives http://t.co/fGkq0DmxuM A well-trained warfighter, best tool in the C-IED toolbox", "Tue Apr 16 13:25:39 ": "RT @WTOP: Listen live to an #FBI press conf on the #BostonMarathon bombing at 9:30 am. Tune to 103.5 FM or visit http://t.co/AaGjxXZ2If", "Thu Mar 21 20:03:54 ": "Nitrate misuse in IEDs: legislation sought http://t.co/4udQTkhR27 More than 60% of IEDs in AFG are ammonium nitrate-based.", "Thu Apr 04 20:16:26 ": "@ElSnarkistani @AthertonKD Please take a look at our 'Attack the Network' page https://t.co/tZadlmN329", "Fri Apr 12 20:38:48 ": "ANA soldiers receive certification as counter-IED master trainers by @USArmy engineers http://t.co/huCOBev5XO via @DVIDSHub", "Mon Apr 15 16:46:51 ": "The #IED is a global threat, 34 civilians killed in suicide bombings in #Somalia http://t.co/GHZl22WlSn via @ZeeNews", "Mon Apr 15 18:00:12 ": "We must do more to stop the access of the use of AN in IEDs http://t.co/zgxUhdZDIy China latest with #IED problem, HSR train bombing", "Thu Apr 11 17:08:08 ": ".@USArmy EOD Officer transitions from bomb detection to teaching robotics http://t.co/5aMMBuCPoV @GoArmy", "Mon Mar 11 21:15:19 ": "#MilitaryMonday Wounded veteran inspires others with skydive http://t.co/rl36uwJtlo", "Thu Apr 18 22:09:56 ": "Contact FBI @ 1-800-CALL-FBI if you know these men. Suspect #1: http://t.co/HBaPZYj8fw Suspect #2: http://t.co/SxYHlVUhgV", "Mon Apr 08 19:32:38 ": "#India: Commandos undergo C-#IED training based on the real-life experiences of the instructors http://t.co/m3ajB6s4Qk", "Wed Apr 17 15:51:39 ": "Why people put themselves in mortal danger to save others  http://t.co/XnyYLkKG9X via @TIME", "Mon Apr 01 19:40:22 ": "Islamic extremists attack #Timbuktu in North #Mali http://t.co/bEWnH0k4w7 Where the threat network goes, the #IED follows", "Fri Mar 08 19:09:10 ": "Irish medics see 1st hand decrease in #IED injuries and deaths over the past\ndecade http://t.co/mGZu2LCBOM The IED still a global threat", "Mon Apr 01 18:53:08 ": "#MilitaryMonday MOH recipient Sgt. 1st Class Leroy Petry &amp; other wounded warriors return to AFG for OP Proper Exit http://t.co/r7djSwb5cV", "Fri Apr 12 11:27:35 ": "RT @etribune: (News) Doctors escape attempted bomb blast at EPI office http://t.co/rnUSg8xtGK #Pakistan", "Mon Mar 11 19:25:04 ": "Small bomb explodes at Greek courier firm in Athens http://t.co/B8kPcIGIkw The\nIED is a global threat", "Fri Mar 08 17:32:24 ": "India: AR nabs largest AN cache, 100 kg of explosives http://t.co/xWWuNQrlk8 Since Nov '12 FERT w/45% of AN illegal http://t.co/ZhbDZbm1E7", "Thu Apr 18 19:54:25 ": "What is ammonium nitrate, and why do we use it? http://t.co/LEBP4Mxzi4 HME remains main charge used in IEDs in AFG", "Thu Apr 04 15:02:02 ": "Admiral Locklear @PacificCommand has growing concerns about increase in use\nof #IEDs in south and SE Asia.", "Fri Mar 08 14:19:51 ": "@RiesDay @SenBobCasey Highly trained individuals test fertilizer.", "Tue Mar 12 17:34:32 ": "Powerful time bomb found at a bus stand in Assam http://t.co/OXUMd7F2ZP the #IED is a global threat", "Tue Mar 19 16:59:30 ": "#Nigeria: Bomb blast at a bus park in Kano kills 25 http://t.co/fV3s0NyAQ1 Where the threat network goes, the #IED follows.", "Mon Mar 11 20:10:25 ": "Afghan and coalition forces discover a weapons cache of 45lbs of HME\nhttp://t.co/GreTkBJ5GH HME remains main charge in IEDs in AFG", "Fri Mar 15 19:03:58 ": "Security forces in Afghanistan defuse truck bomb packed with nearly 8 tons of explosives http://t.co/mltJu1F35b", "Thu Apr 11 19:26:27 ": "Violence in America: Looking at the real problem http://t.co/oW7ln4QGdz The #IED is a domestic threat http://t.co/nxAdGVESqO", "Fri Mar 08 15:58:21 ": "@joshuadettman @SenBobCasey Those stats are just for AFG.", "Thu Apr 18 18:53:41 ": "CAB preps Marines to handle injuries caused by IEDs during combat http://t.co/hMYArZ0D6z A well-trained warfighter, best tool in CIED toolbx", "Thu Mar 28 19:45:08 ": "Bomb near #Acropolis shakes central #Athens http://t.co/55qcggUjkU The #IED is a global threat", "Fri Mar 15 20:21:25 ": "New, cost-effective way for soldiers to combat IEDs http://t.co/qmZUCKlgcJ A well-trained warfighter, best tool in C-IED\ntoolbox", "Fri Mar 29 18:11:49 ": "On this day in 2010: Two female suicide bombers hit the Moscow Metro system at the peak of morning rush hour, killing 40.", "Fri Mar 22 20:53:41 ": "Only a 3% decline in IED events in AFG in 2012 despite a 32% decrease in boots on the ground.", "Fri Apr 19 18:33:11 ": "Police arrest 5 in AFG for alleged suicide-bombing plot, seize suicide-bomb vests and explosives http://t.co/eQd0AVQjcx", "Fri Mar 22 20:16:30 ": "#Syria: 14 dead in bombing that kills top preacher http://t.co/vmHkVqoPVx via @USATODAY  Where the threat ntwk goes, the #IED follows", "Fri Apr 05 19:51:33 ": "Afghan policeman 'mastered' the art of the bomb; he's diffused or reduced approx. 120 IEDs  http://t.co/TzQjID8ylO via @DVIDSHub", "Thu Mar 07 20:54:03 ": "\"@SenBobCasey: Fatima Group voluntarily halts production of AN http://t.co/VBouLhPWhd\" HME remains main charge used in IEDs in AFG", "Tue Apr 02 18:16:59 ": "Ten bombs defused in AFG operations http://t.co/ANb2XHWbnG A well-trained warfighter, best tool in C-IED toolbox @ISAFmedia #IED", "Mon Apr 15 11:56:02 ": "#Syria: Civilian casualties from explosive weapons rise by 26% since 2011 http://t.co/GRaHTGPsyP The #IED is a global threat.", "Tue Apr 16 17:45:37 ": "@hackneywick1 no, we support military not state/local. We're tracking situation &amp; stand ready 2 support domestic security partners if asked", "Fri Mar 22 21:06:06 ": "More than 700 IED-related events occur outside of Afghanistan each month.  #IED #GlobalThreat", "Tue Apr 16 17:42:48 ": "@monopod 1st responders &amp; domestic security partners are well-trained &amp; doing a great job. JIEDDO not showing up in Boston.", "Mon Mar 25 18:41:45 ": "Technology no match for a dog's snout http://t.co/b8HyQVlMbp by @susanschrock", "Thu Mar 07 19:41:30 ": "#Yemen: Qaeda militant killed while planting bomb http://t.co/CcYnOj8vWF The #IED is a global threat", "Tue Apr 16 03:15:02 ": "Pres. Obama: we will find out who did this and we will hold them accountable.  Our prayers are with Boston tonight.", "Wed Mar 20 19:22:08 ": ".@USNavyEOD Mobile Unit 6 train Kenyan Soldiers on EOD techniques http://t.co/mO2LffuNPQ A well trained soldier, best tool in C-IED toolbx", "Thu Apr 04 19:08:06 ": "#NIGERIA: Why #BokoHaram targets Lagos? http://t.co/0rtCiFoGVD Where the threat network goes, the #IED follows.", "Mon Mar 11 17:42:57 ": "Afghan police officer embraces suicide bomber to save others http://t.co/qqWdUNwiRk", "Fri Mar 22 18:38:01 ": "There is no single solution to defeat the #IED threat — we need to integrate a range of efforts, supportd by a whole-of-govts approach.", "Thu Mar 28 16:19:56 ": "#Nigeria: Police recover explosives, ammunition in Kano http://t.co/e94zMp4JLT Where the threat network goes, the #IED will follow", "Wed Apr 03 19:51:05 ": "Port of Vizag in #India bans bulk ammonium nitrate imports http://t.co/htoRZJbAEq HME remains main charge used in IEDs in AFG via\n@bsindia", "Mon Apr 01 20:02:50 ": "'@ArmyResearchLab scientist's deployment results in new electro-optic device' http://t.co/Da4xo92rUs", "Wed Apr 10 20:10:35 ": "There's an app for that? @USNavy researching apps that can help with bomb disposal http://t.co/p7h0qFasnh @USNavyEOD", "Tue Apr 16 18:31:50 ": "What is an #IED? http://t.co/5g0CZ8RBph The IED is a domestic threat #BostonMarathon", "Wed Apr 17 12:07:36 ": "RT @marklevinshow: General warned about IEDs in America last year\nhttp://t.co/hV7uAwuMv3", "Wed Apr 10 19:11:26 ": "RT @NaomiOhReally: OSCE condemns bomb sent to @la_stampa \"string of cases where journalists have been attacked and intimidated in Italy\" ...", "Thu Apr 18 18:04:33 ": "MT @fedscoop: JIEDDO CIO Jim Craft on mobility trends http://t.co/LefzRVe7Va #mobilegov ‏@WinWinJim", "Mon Mar 25 20:30:52 ": "Unfortunate use of empty kegs? Keg packed with 130 lbs of HME defused by British Army http://t.co/vvDa4qH5s9 The IED is a global threat", "Mon Apr 08 20:09:16 ": ".@JohnsHopkins alum &amp; 4 othr Americans killed in AFG bombing http://t.co/4n3HhaSRhV Thoughts w/the families as we cont. 2 fight this threat", "Wed Apr 03 19:10:31 ": "Syria: According to data, 970 people killed &amp; more than 2,400 wounded in #IED incidents btwn Jan &amp; end of Dec '12 @glubold @foreignpolicy", "Wed Mar 13 18:03:22 ": "Syrian rebels launched 401 homemade bomb attacks last year http://t.co/pGZZqQjcpu The #IED is a global threat", "Wed Apr 17 03:23:15 ": "@JCTorrisi those are IEDs found in AFG. No official confirmation on Boston devices. Won't know until FBI completes analysis.", "Tue Mar 12 19:02:55 ": "Violent #IED attacks still occur in Iraq http://t.co/5iOYO6Gc7F", "Sun Apr 07 06:36:48 ": "Thoughts &amp; prayers w/ families, friends &amp; colleagues of the Americans lost during Sat deadly IED attacks in AFG.", "Fri Mar 08 14:45:58 ": "@joshuadettman @SenBobCasey Yes, AN made from CAN is HME. 86% of IEDs have HME as main charge, 63% use AN derived from Pak-produced CAN", "Thu Mar 14 19:00:19 ": "Shin Bet: Hamas increasing suicide bomb efforts http://t.co/mC86FJWpsE Where the threat ntwk goes, the #IED follows", "Mon Mar 11 18:12:58 ": "Fake #IED got past Newark airport screeners, report says http://t.co/JAhKVqQCcJ", "Thu Apr 18 03:35:48 ": "The IED will be a threat both operationally and domestically for decades. http://t.co/zYJ5n62YVk", "Tue Apr 09 19:36:22 ": "VADER System developed by @DARPA @CERDEC for the war, finds new mission in Arizona http://t.co/K5pclw6yjZ", "Fri Apr 19 17:22:16 ": "Why fertilizer can be an explosive mixture http://t.co/A6dRib3FYg #USArmy estimates 95% of IEDs made by militants in southern AFG  have AN", "Thu Apr 11 15:23:01 ": "Al-Qaida in #Iraq reportedly merges with Syrian jihadist group http://t.co/0zWPKOREed Where the threat network goes, the #IED follows.", "Thu Mar 14 17:06:03 ": "Pakistan: Kids young as 8 used as bombers http://t.co/9etVWv0XrN One suspect confessed to Jan. 10 blast that killed 11 and wounded 67", "Tue Apr 02 19:41:30 ": "#Kenya: Police investigate failed bus bombing http://t.co/sKCNLAOz4T Where the threat network goes, the #IED follows", "Mon Apr 08 18:29:47 ": "Brazilian Special Forces simulate bombings on Rio's metro system to prep for #WorldCup &amp; Olympic Games http://t.co/eurGSNOWOQ @brazilgovnews", "Wed Apr 17 03:45:37 ": "@JCTorrisi no worries. We just really don't know at this point if Boston IEDs are similar to those in AFG. FBI hard at work to ID components", "Fri Mar 22 21:00:09 ": "We're seeing an increase in cooperation among global threat networks — sharing of funds, training and explosive materials. #GlobalThreat", "Mon Mar 18 20:13:57 ": "#MilitaryMonday Female Royal Artillery Officer loses leg after bomb blast in\nAFG, training to race to South Pole   http://t.co/6Mt9PhiUMv", "Thu Apr 04 20:16:40 ": "Armed Forces of Liberia soldiers developing skills before deployment to #Mali http://t.co/BllYjRIvd3", "Fri Apr 05 19:15:08 ": ".@NCNationalGuard CST react 2 simulated IED during CBRN training http://t.co/muPB4lj3cA A well-trained warfighter, best tool in C-IED toolbx", "Mon Mar 11 16:36:29 ": "#IED attacks leave 19 dead, coincide with #SecDef Hagel's visit http://t.co/jEIYZS7pBO   \nIEDs are still the #1 threat in AFG", "Tue Mar 19 15:19:06 ": "Iraq capital torn apart; 56 killed by bomb attacks on 10th anniversary of US invasion http://t.co/HGA4eKtQh2 The #IED's an enduring threat", "Wed Apr 17 13:24:18 ": "MA @USNationalGuard #Soldiers did #BostonMarathon wearing 40-lb 'rucks', then helped save lives http://t.co/vQQeBGpId5", "Fri Mar 22 21:03:08 ": "Military march to the sounds of the guns — threat networks march to the signs of instability and take the IED with them. #IED #GlobalThreat", "Mon Apr 08 19:55:14 ": "Deadliest attacks on Americans in 5 yrs in AFG. http://t.co/JkffREoYoR We're focused on the current and future threat #JIEDDOMission", "Tue Mar 19 18:19:31 ": "Somali Islamists claim deadly car bomb http://t.co/7VdUkXfpdf The #IED is a global threat."}