{"Tue Apr 09 19:51:59 ": "Everyone invoked \"Lean In\" asking @BuzzFeedBen for raises. http://t.co/6YzTvKo8Q6 BUT BEN, did you give them the raises or not?! #noseyin", "Thu Apr 18 14:01:21 ": "Now that Peter Dinklage has discussed being a DwILF, we must ban all terms that end in -ILF forever. http://t.co/BnQGNLvJTx #TwILF", "Mon Apr 15 16:58:41 ": "Since I basically live-blog my blogging experience on Twitter, if I incorporate tweets in a post, does that create an infinite loop?", "Wed Apr 10 19:44:09 ": "Saw a lady doing this with a crop top last night --&gt; Freezing, Coatless Woman Has Decided It Is Spring http://t.co/Tk9YBi0sNz via @TheOnion", "Fri Apr 12 18:45:27 ": "@ryantate btw by taking 24 hours to reply to that tweet, I hope you lost track and thought I was just shaming you", "Thu Apr 18 16:08:25 ": "\"Whoops, there goes the president we meant to arrest for murder conspiracies. That reminds me, gotta find that spare set of keys I lost.\"", "Mon Apr 08 02:03:10 ": "God it's like they let ME write an episode of Mad Men. This is supermarket off-brand Mad Men, the cereal in a bag instead of a box.", "Mon Apr 15 16:04:04 ": "Best thing abt this article: zooming on Imelda Marcos' double-French-tipped manicure and BODY SPIRIT MIND workbook http://t.co/7dplSoc3WU", "Tue Apr 09 15:06:36 ": "RT @CharlotteCowles: \"To make and save a sex tape, in 2013, requires a level of trust higher than the asking price for most sex tapes\" - ...", "Mon Apr 08 16:13:48 ": "Margaret Thatcher's life in pictures. http://t.co/1WuJYhhm14 Here's my fav: http://t.co/IqcpOzPpj4", "Tue Apr 09 21:20:51 ": "@maybealexislost Oh you found my secret commenter alter ego", "Thu Apr 18 12:35:33 ": "Jenny Sanford is waging a \"brutally effective passive-aggressive campaign\" against Mark's congressional campaign http://t.co/okoGIf3yXF", "Tue Apr 09 15:17:58 ": "RT @petesouza: Guess who's paws? http://t.co/LEviKdCoUW", "Wed Apr 10 20:11:15 ": "It's still sad, but of the \"You're so pretty! No, YOU'RE so pretty!' variety, not some nefarious girl attack zone http://t.co/dhUqjZMZtg", "Wed Apr 10 14:04:09 ": "DON'T WORRY EVERYONE I have already penned an opus on how the hell Huma failed to recognize her husband's dong http://t.co/hjaURLmQFM", "Wed Apr 10 15:26:20 ": "My other Weiner fascination is how social media fed some kind of insecurity spiral. @elspethrb ties to Clinton: http://t.co/7zj6wMFymb", "Wed Apr 10 12:22:07 ": "Maybe the real lesson here is, when your husband denies tweeting a picture of his erect dick, LOOK AT THE PICTURE BEFORE YOU DEFEND HIM", "Wed Apr 10 20:10:00 ": "Are we sure Instagram \"beauty contests\" are a real thing? I'm going through #beautycontest, can't find any like this: http://t.co/VbT2sDgNgF", "Tue Apr 09 15:24:35 ": "I keep re-reading this, and still not understanding it. \"French president’s camel eaten in Mali http://t.co/CLZaZtyYO8 via @Salon \"", "Tue Apr 09 22:21:02 ": "RT @marcatracy: h/t @tanehisi, there is an \"Accidental Racist\" RapGenius entry. It is completely brilliant. http://t.co/3xh4ES7syK", "Mon Apr 15 18:01:48 ": "Maybe writing personal essays about addiction is the 13th step of the program? That sounds sarcastic, but I actually mean it.", "Thu Apr 18 19:40:17 ": "Urban Dictionary says \"cunt punt\" is either a vagina kick, or the lesbian version of \"cock block.\" Which could add a FASCINATING twist.", "Thu Apr 11 15:25:10 ": "Really curious what kind of anti-\"swatting\" measures the LAPD is enacting http://t.co/eY8lPiIPFo", "Sun Apr 07 19:36:44 ": "@PLFino #subtweetaftermyheart", "Mon Apr 15 12:30:43 ": "On the other hand, he can yell TRY HARDER YOU LITTLE GIRL with impunity now", "Thu Apr 11 19:28:39 ": "People who pronounce it like the peanut butter are monsters. RT @hreins MSNBC currently discussing the pronunciation of GIF.", "Thu Apr 18 18:48:27 ": "NERDS BEAT JOCKS FOR SORORITY PRIZE -- John Cook, college movie star RT @johnjcook just to keep it in context http://t.co/183CcAPcpx", "Fri Apr 05 19:24:42 ": "@adriananova_ Maybe my passive-aggressive outburst just now is making a bot god somewhere stir and alter his algorithm.", "Wed Apr 10 14:04:31 ": "#penismysteries #penisteries", "Fri Apr 19 15:48:28 ": "I think Ruslan Tarni was the first time I've seen someone driven to belligerence from shame. That was heartbreaking.", "Wed Apr 10 12:18:56 ": "Re: Huma/Weiner profile: I am most intrigued by Huma failing to recognize a picture of her husband's penis. http://t.co/gKn7ferAYe", "Thu Apr 18 18:39:47 ": "Since Deadspin and Gawker simultaneously stole the sorority girl email from one another, I think I should be allowed to steal it too.", "Sat Apr 06 22:07:45 ": "Heard a really good conspiracy theory abt Ware's leg: ADIDAS SHOES. Too much grip. See also: Ricky Rubio, Derick Rose. #warelegspiracy", "Fri Apr 05 20:21:07 ": "RT @crampell: China is building buses so enormous that cars can just drive underneath them http://t.co/r9eBTMgfJb", "Tue Apr 16 14:44:23 ": "Beyonce's crystal fake-nipple outfit is the couture version of one of those beach cover ups painted like bikini babes http://t.co/Z42f0IeiJ3", "Mon Apr 22 18:44:52 ": "Solution to Florida's python problem: POSH HANDBAGS. Srsly http://t.co/9uVNRcG3tp", "Tue Apr 09 15:04:44 ": "The celebrity sex tape is dead. Short lived the celebrity sex tape. Sixteen years, to be exact. http://t.co/nov9nEcT94", "Wed Apr 10 22:06:05 ": "RT @nitashatiku: \"it's now trendy to be a Cathy cartoon or a Liz Lemon at 24\" http://t.co/R9RgZRRFQJ", "Wed Apr 10 13:55:02 ": "RT @Choire: I've thought about this a lot and I believe I could identify photo-tweets of my spouse's nethers with total accuracy.", "Mon Apr 22 15:31:59 ": "@lizcgoodwin On the other hand, we have TOTAL LICENSE to attack her as viciously as we want, now.", "Mon Apr 22 14:51:00 ": "Satellite of love / Venn diagram of hate", "Mon Apr 15 16:50:26 ": "Hey cool people who smoke cigarettes and stuff: Is this a bag of loose tobacco? Or is it a juice box? Sunblock??? http://t.co/DZ7BkbB4V8", "Fri Apr 19 15:00:13 ": "Existential crisis RT @ErikWemple CNN: Chris Cuomo asks terror expert \"How can you be a good person and a terrible person at the same time?\"", "Mon Apr 15 16:52:27 ": "Mystery solved! http://t.co/aR2OH3tSrB RT @snmrrw It's Coco Cafe: espresso and milk mixed with coconut water.", "Sat Apr 13 22:00:01 ": "RT @politicalwire: Mayor drops re-election bid after arrest for kidnapping man and shooting guns while asking him for sex\nhttp://t.co/nY ...", "Wed Apr 17 16:20:39 ": "I might have just gasped out loud? RT @hreins Alcoholic Dippin' Dots Are Real http://t.co/brR4SGEbZ4", "Thu Apr 18 22:30:33 ": "LEAN THE FUCK IN YOU GODDAMN BONERS: If Sheryl Sandberg wrote the sorority rant http://t.co/iEPBMhoY3F --inspired by weird shit @emmacargo", "Mon Apr 22 18:44:23 ": "@michaelroston They're appetite-shaming us.", "Mon Apr 22 18:46:06 ": "RT @Gawker: .@anthonyweiner Hi! http://t.co/4XjW4qyNUK", "Wed Apr 10 12:21:38 ": "\"‘Let’s fight! Defend! I don’t understand. Why don’t you just say this is not your picture?’ I was with him. One hundred percent.\" --Huma", "Mon Apr 15 18:02:08 ": "Christina Huffington on addiction: http://t.co/Fn51NVPeib", "Tue Apr 09 13:47:30 ": "BULLSHIT RT @yokoono I would like to see a sky vending machine on every corner instead of the coke machine. We need more skies than coke.", "Mon Apr 22 15:19:56 ": "Princeton Mom gave a fucking LECTURE at Princeton, hosted by a campus debate society. Those tools. http://t.co/NddnILDb4Q", "Wed Apr 10 15:37:17 ": "You're supposed to get one of those when you go shopping for extra-long bed sheets and books that will help you \"find yourself\" and stuff", "Wed Apr 10 12:26:21 ": "RT @ryanfarkas: @maureenoco At the very least, you’d think she’d recognize the underwear.", "Tue Apr 16 14:44:43 ": "What are those called anyway? Trompe Bikini. Trompkini.", "Sat Apr 13 21:11:15 ": "The \"songs about money\" playlist I created to make doing my taxes more tolerable is really backfiring. #notrichasfuck", "Tue Apr 09 15:44:54 ": "@igerner OMG! This is an all-out scandal.", "Mon Apr 22 18:57:33 ": "All I see is an erect penis in the middle of that logo. RT @anthonyweiner http://t.co/7YVX0Nqri2", "Mon Apr 22 14:50:04 ": "My exhaustive analysis of WHY WE HATE the 20 most-hated celebrities. There is a Venn diagram. http://t.co/W8UA7wgxo6 http://t.co/hArHqNLa1b", "Wed Apr 10 13:56:13 ": "@Choire I'm actually not that confident. I think I'd recognize the undies, bcs commercial products are more memorable to me than humans.", "Fri Apr 05 19:18:39 ": "@lizzieohreally Weeping into a night vision camcorder right now", "Mon Apr 22 15:20:25 ": "That said, I totally would have gone to that lecture if I'd known it was happening. Me tool.", "Thu Apr 18 14:50:06 ": "Introducing \"tittooing,\" wherein ladies tattoo their nipples to improve their hue. http://t.co/kswZJjqkh6", "Tue Apr 09 16:47:31 ": "@BrianJMoylan I am actually really impressed with how evenly she gains weight. Exact same proportions as before! It's a certain genetic gift", "Fri Apr 05 20:31:38 ": "Child Does Not Want to Kiss Prince William http://t.co/WcWhaAxwAU via @thecut", "Thu Apr 18 16:07:13 ": "The video and pics of Musharraf fleeing arrest are so surreal. http://t.co/1QwfRd3hnm Everyone just standing there, pointing at the car.", "Thu Apr 18 17:00:39 ": "Holy SHIT this is the most amazing sorority freak-out ever http://t.co/m6ttVSJGGe from @deadspin @drewmagary", "Mon Apr 15 12:29:28 ": "Oh good, that crazy Rutgers basketball coach also coaches his 12-year-old granddaughter's basketball team http://t.co/081CcR4n4B", "Tue Apr 09 19:57:49 ": "All Females 'Lean In' at the Same Time, Office Building Topples Over on Side", "Thu Apr 11 19:31:04 ": "The Winklevii are into bitcoin! This is a tipping point. http://t.co/dXaC43Y1a4", "Wed Apr 10 02:46:33 ": "So there I was, catching up on Daily Show reruns, and @avizenilman's dad is talking about pubic lice going extinct. http://t.co/IthuUbKgHT", "Fri Apr 05 19:05:54 ": "@adriananova_ And every single one from a different throwaway account", "Mon Apr 22 18:18:41 ": "Take-out restaurants always include more forks than I need, as if to say, \"You are eating enough for four people, you fucking cow.\"", "Thu Apr 11 17:06:31 ": "North Korea's female soldiers in 4-in. heels http://t.co/bFdh3XKyHL Least important NK news ever, BUT STILL http://t.co/zBOGJo991v", "Wed Apr 10 14:07:39 ": "Do I write about famous people's private parts too often?", "Fri Apr 12 18:45:05 ": "@ryantate SHAME", "Mon Apr 15 17:44:44 ": "Andrea Peyser wrote about Gwyneth Paltrow's rock-hard body BUT @HAMILTONNOLAN IS ON SABBATICAL WHAT NOW?! http://t.co/Bsc0T2c7ew", "Fri Apr 19 04:05:03 ": "RT @doctorveritas: @Bro_Pair Reddit Crime Lab desperately tries to downvote evidence that its work has led to 15 innocent men spending time…", "Mon Apr 15 16:51:32 ": "@snmrrw Ahh!!! Thank you!", "Mon Apr 15 19:37:34 ": "The 26th mile of the Boston Marathon had a special marker to honor the survivors from Newtown. http://t.co/3dVW87lpUw http://t.co/SStR9IpBo7", "Wed Apr 17 17:28:18 ": "RT @pareene: FBI uses Lord &amp; Taylor accessory wall wisely", "Wed Apr 10 15:36:23 ": "Not upset Yale women feel washed-up at 21. Upset that \"thinks about getting a vibrator\" means they don't have yet?! http://t.co/szDjQPbhyb", "Fri Apr 19 15:49:12 ": "@eugeniedfranval Not at all -- it's horrible. I don't think I've ever seen that combination of emotions before.", "Mon Apr 15 16:51:22 ": "Actually I looked again and it's totally Coconut juice isn't it. Dammit. It's in LiLo's brother's hand: http://t.co/UZH0yMgruX #needscandal", "Tue Apr 09 17:43:17 ": "I'm just watching it, over and over and over.", "Fri Apr 05 20:24:42 ": "RT @TheTinaBeast: I introduced Oprah to my beloved housekeeper, Cynthia. Very happy moment. #WIW13", "Wed Apr 17 16:30:02 ": "@hreins I worked at an ice cream shop as a teen, so my first drinking experiences were pilfered Kahlua and Creme de Menthe. HORRIBLE", "Thu Apr 18 17:00:49 ": "\"FRATS DON'T LIKE BORING SORORITIES. Oh wait, DOUBLE FUCKING NEWSFLASH SIGMA NU IS NOT GOING TO WANT TO HANG OUT WITH US IF WE FUCKING SUCK\"", "Tue Apr 09 15:28:47 ": "GLORIOUS Quora: \"What is the politician situation in the Mario universe?\" Yoshi's Island is theocracy. http://t.co/CR3GVZ9bvp", "Fri Apr 19 23:47:16 ": "RT @daveweigel: Most exciting boat of the year (non-poop-filled category)", "Sat Apr 13 21:13:14 ": "Rich As Making Out on the Sofa With Some Light Over-the-Sweater Action.", "Fri Apr 05 19:25:28 ": "@lindseyweber WAIT WUT", "Tue Apr 09 17:42:38 ": "oh my god @danamira's video duet for Taylor Swift and French president's dead camel actually made me cry http://t.co/x3u3RUcVCG", "Wed Apr 10 14:10:21 ": "@johnjannuzzi \"It's just your beat.\" You calling me a handjob ho?", "Wed Apr 10 17:40:21 ": "World's Trendiest Sandwich: \"Salted Caramel Angry Lobster Fatty Melt,\" feat. \"cheddar curds, Brooklyn smoked ricotta\" http://t.co/9X14WLh5Aq", "Tue Apr 16 17:45:24 ": "@brittanyleee_ How do you know he was going to propose?", "Mon Apr 22 12:25:10 ": "RT @samfbiddle: Good morning, I'm happy to announce my latest pivot: Valleywag is back http://t.co/4g0h0dPY8t", "Fri Apr 19 15:44:04 ": "The bombers' uncle on CNN right now is making my heart race. The level of stress/anger/fear/pleading/shame is just unreal.", "Wed Apr 10 12:20:41 ": "Are disembodied crotches, in underwear, so easily confused? Looking back at the pic  (memory lane! http://t.co/MEKns4ofPB) I can't decide"}