{"Wed Nov 07 00:08:58 ": "The Threshold track \"Ashes\" is featured on a FREE SAMPLER DOWNLOAD celebrating 25 Years of Nuclear Blast at... http://t.co/JZCefipw", "Tue Sep 11 01:36:18 ": "MARCH OF PROGRESS will be OUT in North America tomorrow! Below are just some of the places where you can get it... http://t.co/AHOPPZtL", "Sat Apr 13 17:43:45 ": "Threshold's next show will be Celebr8.2 Prog Festival in Kingston upon Thames on 11 May. Threshold will be... http://t.co/0r4FTgP6Af", "Tue Sep 11 20:14:31 ": "Find MARCH OF PROGRESS at at Metal Club store near you! http://t.co/8S2NtuMI http://t.co/goto38ks", "Fri Apr 19 15:57:16 ": "RT @nuclearblasteu: ENSLAVED, BLACK STAR RIDERS, THY ART IS MURDER, THRESHOLD and FREE FALL on their love of vinyl… http://t.co/en3vTOvyhQ", "Sat Jan 12 11:07:20 ": "THRESHOLD will be supported by British progressive rock band Enochian Theory for their upcoming \"March Of... http://t.co/vfL0MyxY", "Sat Aug 11 12:53:44 ": "March of Progress T-shirts now available at the Threshold store at \nhttp://t.co/mT7qm6Ns http://t.co/yN2vYCrt", "Sat Mar 23 11:56:03 ": "New THRESHOLD long sleeve shirts now available at the official store http://t.co/Nc0UdFG0x0 http://t.co/HkcpQdDQBc", "Fri Aug 24 12:23:42 ": "THRESHOLD -- „March Of Progress\" Euphoria http://t.co/EjH18hIM", "Sun Sep 30 09:46:07 ": "THRESHOLD will headline the first day of Celebr8 Point Two at The Hippodrome in Kingston, UK next year. Joining... http://t.co/BPVm2C8B", "Tue Dec 11 16:22:37 ": "Here's the official album trailer for My Soliloquy featuring Threshold's very own Pete Morten. http://t.co/VQwPQULj", "Wed Mar 27 11:00:58 ": "RT @nuclearblasteu: Photo: UK fans! You have just FOUR days to get your hands on a FREE 15-track Nuclear Blast sampler... http://t.co/ea ...", "Fri Aug 24 00:51:12 ": "Want to represent Threshold on your own Facebook page? Get your own Threshold cover photo for your page below.... http://t.co/8VYzzN8Y", "Mon Nov 05 10:43:17 ": "So now we can reveal your TOP 5 THRESHOLD SONGS! Amazingly 80 different songs received votes! But here are your... http://t.co/fTiDm5Ez", "Sun Jan 27 08:38:06 ": "THRESHOLD's first two albums Wounded Land and Psychedelicatessen are out now on 180g vinyl from the Nuclear Blast... http://t.co/gkfQdwOK", "Fri Sep 07 10:35:55 ": "THRESHOLD are excited to announce that they’ll play a show at next year’s Rock Hard Festival that will take place... http://t.co/dCiKxKMX", "Fri Aug 03 19:40:49 ": "THRESHOLD's \"March Of Progress\" already at #4 on Amazon Heavy Metal Chart from pre-orders alone!", "Tue Feb 26 23:34:06 ": "Please note Threshold's show in Rotterdam on Sunday is an early show, doors 3pm, first band on at 4pm. See... http://t.co/0BG4uAbOGp", "Wed Mar 20 20:41:14 ": "Footage from behind the scenes of Threshold's official 'Staring At The Sun' video has been released today. The... http://t.co/1ewFlr45ab", "Thu Dec 06 09:57:30 ": "THRESHOLD will headline ProgPower Oslo in Norway on Saturday 16 November 2013, marking the band's first ever... http://t.co/ceUMF19O", "Fri Aug 24 00:12:23 ": "Went to represent Threshold on your own Facebook page? Get your own Threshold cover photo for your page below.... http://t.co/PT8Mscx7", "Thu Feb 28 20:36:46 ": "Let the March begin..!\n\n01 March - London, England \n02 March - Helmond, Netherlands \n03 March - Rotterdam,... http://t.co/S85HEj2ZBC", "Fri Aug 24 12:19:25 ": "\"March Of Progress\" out now and looking good on Amazon! Currently no.1 in France, no.1 in Germany, no.4 in UK heavy metal charts!", "Tue Nov 27 08:42:32 ": "THRESHOLD will be touring Europe in March 2013 to promote their new studio album \"March Of Progress\". Here are... http://t.co/ou9SLZpe", "Thu Apr 18 18:38:58 ": "March Of Progress T-shirts are now back in stock at the official Threshold store. Available as short sleeve and... http://t.co/8Il0KnEFYg", "Thu Sep 06 23:27:53 ": "There's been a lot of questions about where MARCH OF PROGRESS can be purchased (EU) or pre-ordered (for those in... http://t.co/J62srAfm", "Fri Aug 24 00:49:18 ": "Went to represent Threshold on your own Facebook page? Get your own Threshold cover photo for your page below.... http://t.co/oBsDDBHI", "Wed Aug 08 12:37:03 ": "THRESHOLD have recently uploaded the first of two track-by-track videos for their upcoming new masterpiece \"March... http://t.co/FiDlYMRo", "Mon Mar 25 15:46:30 ": "UK fans: you have less than a week to get your hands on a FREE Nuclear Blast 15-track sampler from Amazon UK! See... http://t.co/fzvsQDeSfL", "Mon Nov 19 17:10:57 ": "http://t.co/oXlgn7Kl", "Wed Aug 29 01:38:17 ": "I posted a new photo to Facebook http://t.co/3Wt62cmD", "Sat Feb 09 08:11:30 ": "Tour rehearsals start today, European tour starts in three weeks. Which shows are you coming to? http://t.co/7NwmUQxw", "Fri Oct 05 15:51:02 ": "Full line-up of Celebr8 2013 announced! 11-12 May 2013, Kingston upon Thames, UK. Day 1: Threshold, Frost*,... http://t.co/t6K9AqbV", "Thu Feb 07 19:59:29 ": "Issue 10 of Threshold's online fan magazine \"Beyond\" is out now. http://t.co/01Rloefc", "Tue Sep 25 19:09:27 ": "New interview with Richard West at http://t.co/MtwWbEjc http://t.co/YHnuycwJ", "Thu Feb 28 20:24:35 ": "THRESHOLD annouce last minute show in ITALY! The band have added an extra show to their \"March Of Progress\" tour... http://t.co/adoUXb0dZB", "Sun Sep 02 18:13:24 ": "Threshold's \"March Of Progress\" has entered the UK Rock Chart at position 23.", "Thu Dec 13 11:26:35 ": "A beautiful 7\" vinyl single is out now featuring vocals by Damian Wilson and piano by Richard West. http://t.co/bU0dtXlX", "Fri Sep 14 19:36:11 ": "Something for the weekend. http://t.co/Sk1viIVn", "Sat Sep 01 00:29:45 ": "MARCH OF PROGRESS is out in Europe already and comes out on September 11 in North America.\nWatch videos, enter... http://t.co/a7El6e6z", "Mon Sep 10 17:06:32 ": "Following the release of their new album \"March Of Progress\", THRESHOLD are celebrating album chart entries in... http://t.co/C96pPyTr", "Fri Aug 24 18:39:53 ": "MARCH OF PROGRESS is now available on iTunes! Listen to snippets or put in your order at  http://t.co/SHEpCBWW http://t.co/dr8mi4M9", "Thu Mar 21 21:22:49 ": "Threshold are confirmed for a Saturday performance at Metalfest Loreley in St. Goarshausen, Germany on 22 June 2013.", "Thu Feb 07 19:58:02 ": "http://t.co/ACgq4rYI", "Wed Aug 22 00:33:20 ": "March Of Progress is now available for pre-order on Amazon! http://t.co/qoabNB0D http://t.co/jw6FRTbq", "Thu Dec 06 11:31:02 ": "Dead Reckoning T shirts and long sleeve shirts are now back in stock at the official Threshold store. http://t.co/XZpmzPrU", "Thu Nov 15 10:34:12 ": "One more from the recent video shoot. http://t.co/1ptt3OGg", "Fri Oct 05 14:58:27 ": "So let's end the week as we started it, with some more of Glynn Morgan, this time performing with Threshold's... http://t.co/iySNSeKT", "Fri Nov 16 11:07:19 ": "Critical Mass (Definitive Edition) comes with a slipcase and 3 bonus tracks: \"Do Unto Them\" and \"New Beginning\"... http://t.co/rA1P8HYD", "Sun Mar 10 11:28:26 ": "Unfortunately tonight's Threshold show in Italy is cancelled because police closed the venue last night. We're... http://t.co/V5HVE7uy6e", "Fri Apr 19 16:45:46 ": "Damian caught up with Nuclear Blast EUROPE recently to talk about vinyl in celebration of Record Store Day, which... http://t.co/iRPwVdzmLa", "Fri Aug 10 12:41:43 ": "With only two weeks to go until the release of THRESHOLD's brand new studio album \"March Of Progress\", you can... http://t.co/EwpFAWlY", "Fri Nov 16 11:07:07 ": "Hypothetical (Definitive Edition) comes with a slipcase and 3 bonus tracks: Live versions of \"Light And Space\",... http://t.co/JPHkJqwv", "Thu Aug 30 02:27:58 ": "Everything you need to know about MARCH OF PROGRESS at ONE location! The new THRESHOLD LANDING PAGE is now online... http://t.co/hJFdaclM", "Wed Nov 14 12:14:11 ": "Staring at the sun... http://t.co/qxc8Orss", "Fri Feb 22 15:32:17 ": "THRESHOLD start their European tour in London next week to promote their latest album \"March Of Progress\".... http://t.co/UXEpbeTTJg", "Fri Apr 05 19:28:48 ": "Threshold are confirmed to be performing on the Sunday night at this year's Rock Hard Festival which takes place... http://t.co/i1UoxfBRFl", "Fri Dec 07 09:10:06 ": "THRESHOLD's first two albums Wounded Land and Psychedelicatessen will be released on 180g vinyl next month by... http://t.co/SVLXgiPv", "Wed Mar 27 11:02:17 ": "UK fans, you have 4 days left to get the FREE 15 track @nuclearblasteu sampler with us on it! http://t.co/Dm3Y7GTWkl http://t.co/oDy8fysAWo", "Mon Dec 24 23:14:54 ": "Happy Christmas everyone, thanks for your awesome support this year. We're looking forward to seeing you during our tour in 2013!", "Thu Feb 07 13:22:06 ": "Threshold's appearance at Sweden Rock is confirmed for 5 June 2013. http://t.co/Q6wPo6kv", "Wed Sep 05 21:20:37 ": "Less than a week left for MARCH OF PROGRESS to be released in NORTH AMERICA! Pre-Orders are still available at... http://t.co/teDqVdBI", "Fri Oct 19 14:43:37 ": "THRESHOLD have been confirmed for next year's Sweden Rock Festival which takes place in Sölvesborg on 5-8 June... http://t.co/Ou6ocezQ", "Tue Aug 14 16:51:30 ": "A gold medal for the Brits! According to a German review of \"March Of Progress\" on http://t.co/jWwTOptV:... http://t.co/OxmziOth", "Mon Nov 12 10:32:23 ": "THRESHOLD are confirmed for next year's edition of Metalfest Germany which takes place in St. Goarshausen on... http://t.co/wXOtEB3c", "Mon Oct 01 08:03:40 ": "Great news for fans of former Threshold vocalist Glynn Morgan. http://t.co/0sShUfKh", "Wed Sep 12 10:02:34 ": "If you haven't started yet: Pick up your cam and take part in the contest! http://t.co/gUrovJOC", "Sat Feb 02 08:51:16 ": "Welcome to the weekend! Here's the brand new video for 'Staring At The Sun' by Threshold. http://t.co/YlFpiKzK", "Wed Nov 07 12:02:41 ": "Here's an interesting thought. http://t.co/nLjYCmaN", "Fri Aug 03 07:26:46 ": "One year on from the sad passing of Andrew 'Mac' McDermott we've uploaded some previously unseen footage of one of... http://t.co/aPW6ShXr", "Wed Oct 24 08:46:01 ": "The winner of the Threshold video contest for \"Staring At The Sun\" is Achim Bieler from Southern Germany -... http://t.co/uergUXWd", "Thu Nov 29 11:35:06 ": "Don't miss Threshold's very own Damian Wilson on tour with Maiden uniteD. http://t.co/KkmPfJcG", "Fri Aug 31 19:47:10 ": "Threshold's \"March Of Progress\" has entered the Dutch Album Top 100 at position 70.", "Mon Feb 25 21:22:32 ": "Damian caught up with Classic Rock Presents Prog recently - check out the video interview below: http://t.co/ScmkvMiFXL", "Thu Sep 13 21:03:59 ": "North Americans! MARCH OF PROGRESS is available at a FYE store near you or at their online shop at... http://t.co/lTdTgmq2", "Fri Aug 10 18:02:08 ": "Those in North America, can order MARCH OF PROGRESS from the Nuclear Blast USA store! http://t.co/H8sKUXpQ http://t.co/gMJN8cxx", "Mon Oct 01 09:53:52 ": "And here's a rare video of ex-Threshold Glynn Morgan and Jay Micciche performing the Mindfeed single \"My Heart... http://t.co/RWaHiPyk", "Mon Aug 20 23:52:39 ": "STARING AT THE SUN VIDEO CONTEST: Have you sent your video yet? http://t.co/gdTqcyzc http://t.co/8H7FekYr", "Wed Nov 07 14:40:50 ": "And your final clue... http://t.co/OcMQiQ8d", "Wed Aug 08 12:36:18 ": "THRESHOLD and Nuclear Blast kick off the official fan video contest for the track \"Staring At The Sun\" today!... http://t.co/BH1kPqyg", "Mon Mar 18 18:02:48 ": "Threshold are back from their European tour. The band would like to thank everyone involved for such a wonderful... http://t.co/n4tr62S4yy", "Wed Aug 15 08:46:09 ": "You can now watch the second track-by-track video for THRESHOLD's upcoming album \"March Of Progress\" (out on... http://t.co/gDhMrSoI", "Fri Sep 07 19:06:33 ": "The lyric video for \"Don't Look Down\" is now on YouTube! Check it out and let us know what you think! http://t.co/E0z4XK0K", "Sat Jan 26 09:08:15 ": "The new official 'Staring At The Sun' video will premiere next Wednesday on http://t.co/TKTA3Zt2. Read the full... http://t.co/JMljozbI", "Mon Apr 15 16:36:25 ": "On March 4, http://t.co/3Hq7vgTHWZ conducted an interview with keyboardist Richard West of British progressive... http://t.co/iuelrLEUWV", "Wed Mar 20 20:42:16 ": "THRESHOLD - Making of \"Staring At The Sun\" http://t.co/aSUSb75mam", "Wed Nov 07 12:51:18 ": "Here's another clue. http://t.co/imRIVA7z", "Wed Aug 08 12:35:19 ": "Nuclear Blast are happy to announce the \"THRESHOLD Definitive Editions\" - a reissue of the entire THRESHOLD... http://t.co/NP7oxOPu", "Tue Nov 13 10:53:26 ": "thanks to our label Nuclear Blast EUROPE's 25th anniversary our album \"Dead Reckoning\" is discounted on iTunes... http://t.co/agR3JDUe", "Wed Jan 16 21:33:47 ": "German progressive folk rockers Cryptex will open for THRESHOLD on their upcoming \"March Of Progress\" European... http://t.co/6vhFYBbz", "Tue Sep 18 03:59:06 ": "What's your favorite track from MARCH OF PROGRESS? \n\nIf you're still having trouble locating the album in North... http://t.co/Pyx5MWWo", "Fri Nov 16 17:58:20 ": "Something for the weekend... here's one of the bonus tracks from Subsurface (Definitive Edition) out now. http://t.co/69RBnmrU", "Fri Nov 16 09:55:58 ": "The new Definitive Editions of THRESHOLD's classic albums \"Hypothetical\" (2001), \"Critical Mass\" (2002) and... http://t.co/JHHHXncM", "Fri Sep 07 10:39:17 ": "After the phenomenal reactions to THRESHOLD’s new album \"March Of Progress\", Nuclear Blast is now happy to offer... http://t.co/Zrs4nI4J", "Fri Nov 02 10:30:10 ": "What's your favourite THRESHOLD song of all time?", "Wed Sep 12 00:03:48 ": "Find a Metal record store near you that carries MARCH OF PROGRESS (USA only) at http://t.co/glXUquh9! http://t.co/tKzthBFa", "Fri Feb 15 23:12:36 ": "Threshold's latest single \"Staring At The Sun\" has now been playlisted on Planet Rock. For those of you who... http://t.co/JEGYFrzv", "Thu Nov 08 08:54:18 ": "So some of you correctly guessed, Threshold vocalist Damian Wilson recently travelled to Southern Germany to film... http://t.co/ra6N0vre", "Sat Sep 01 08:13:38 ": "It's the first day of the month, the perfect time to buy Threshold's new album \"March Of Progress\". Available for... http://t.co/PhnTr5oQ", "Fri Nov 16 11:07:32 ": "Subsurface (Definitive Edition) comes with a slipcase and 3 bonus tracks: \"What About Me\" from the original... http://t.co/kI8ZU2aD"}