{"Fri Apr 19 16:15:03 ": "RT @johnjcook: @max_read get it under 70", "Thu Apr 18 19:46:43 ": "@tinatheatre I meant it!", "Sun Apr 21 02:48:05 ": "RT @themarkberman: I mean I'm not saying they were definitely hacked, but I'm saying they were probably hacked. http://t.co/lA7beQyIq2", "Thu Apr 18 21:51:01 ": "@scarequotes schmancy! thanks", "Thu Apr 18 18:09:55 ": "People complaining about not getting subtweeted about are the worst #worst", "Sun Apr 21 02:49:47 ": "@jfagone it's not for ENJOYING, Fagone, just be grateful to be in the same UNIVERSE as him, jesus", "Thu Apr 18 21:34:27 ": "Dear Internet: If @slatebooks wanted to host a great event in Seattle where would we do it? Requirements: Space, booze.", "Fri Apr 19 17:49:39 ": "RT @bubbaprog: Every cable network's crawl runs at the exact same speed: http://t.co/OUgzMFZhTj", "Mon Apr 22 18:26:11 ": "@stevensonseth that's what it says on Laketop High's yearbook", "Mon Apr 22 15:11:49 ": "Can Amazon reinvent the TV development process? Also: Video of Bill Murray's awesome ALPHA HOUSE cameo http://t.co/2TWXo4AiqV", "Thu Apr 18 19:23:55 ": "@macwrites i'm on it https://t.co/FUDBqyq8LP", "Thu Apr 18 15:59:33 ": "@dansaltzstein @thehighsign @meghanor wait dan you wrote meghan's profile of wallace shawn?", "Fri Apr 19 14:06:37 ": "@geneweingarten faaaaaaaaaaake", "Thu Apr 18 17:19:43 ": "@macwrites i will fucking cunt punt you", "Thu Apr 18 17:22:26 ": "@mkirschenbaum have you ever had her as a student?! she seems awesome", "Thu Apr 18 21:48:52 ": "@KeithArsenault @brookejarvis @SlateBooks @ElliottBayBooks ooh nice thanks", "Thu Apr 18 17:25:47 ": "@mkirschenbaum EXACTLY. When I was teaching I wouldve KILLED to have a student who wrote like that", "Thu Apr 18 15:01:00 ": "@ctklimek @scott_tobias 2 stars", "Thu Apr 18 17:44:26 ": "@joereid @williamfleitch I'll do mine by speakerphone", "Thu Apr 18 19:56:40 ": "\"But wouldn't their enormous blue balls make them sink to the bottom of the pool?\" I ruin the @DoubleXMag Gabfest https://t.co/61LnCMSlfM", "Fri Apr 19 13:54:52 ": "I think it's the sunglasses vs. the goofy hat that's feeding it for me", "Thu Apr 18 19:57:15 ": "@TashaRobinson @NoelMu so many TAs left unfucked", "Mon Apr 22 03:51:04 ": "@DanAmira you couldn't be more wrong. peggy crushed it. don's extremely like ACTUAL mediocre heinz ad http://t.co/NDUcW5WNub", "Mon Apr 22 22:18:09 ": "That $2.10 I spent to go thru turnstile at Farragut West, wait10 minutes at top of escalator, then leave was money well spent @drgridlock", "Thu Apr 18 15:35:36 ": "Again! Please tweet at me with your favorite profiles of authors in recent years. Especially interested in profiles by women!", "Mon Apr 22 04:15:38 ": "Just your quarterly reminder that grapefruit is fucking delicious and @xwaldie is insane", "Thu Apr 18 17:23:56 ": "@SamuelAAdams is it \"cunt punt\"?", "Thu Apr 18 19:46:01 ": "@emmaroller I bet Mary Nohl didn't! http://t.co/t3hPNquWNR", "Thu Apr 18 16:45:31 ": "@thehighsign That is super nice!!!", "Fri Apr 19 14:13:22 ": "@jamiattenberg Yes! I keep turning it on and then turning it off again.", "Thu Apr 18 17:05:34 ": "@macwrites she seems perfect, like anne cone for the 21st century", "Sun Apr 21 02:21:40 ": "isitstill420 dot com", "Thu Apr 18 16:55:50 ": "I would definitely hire this woman http://t.co/i7aFIMDWzX", "Mon Apr 22 05:10:47 ": "RT @ill_iterate: If you want to make God laugh, tell him you're making flan.", "Sat Apr 20 03:36:13 ": "RT @Choire: This week is ending and none of us hired that amazing sorority person, we should all p ourselves in the c.", "Sun Apr 21 02:19:32 ": "RT @lawscribe: .@xwaldie gets it exactly right RT @Slate: Is it legal to interrogate someone when he's in serious medical condition? http:/…", "Tue Apr 23 00:27:45 ": "@misterpatches Jack Reynor definitely Tom Cruise's finest role", "Mon Apr 22 05:10:27 ": "Joan may not feel like a trailblazer, but she is one. @HannaRosin on MAD MEN http://t.co/gpeXMgPiYv", "Thu Apr 18 16:38:04 ": "If you want one, tweet me your favorite recent bad book review. That is, a bad book review that was nonetheless great.", "Thu Apr 18 18:01:41 ": "@joereid @nprmonkeysee someone better be flooding the zone", "Mon Apr 22 15:16:02 ": "FFS would someone please youtube Fry saying \"I'm literally angry with rage!\" from \"Where No Fan Has Gone Before\"", "Fri Apr 19 13:52:24 ": "@DanAmira seems awfully british. \"Liverpool are a joke of a football club\"?", "Mon Apr 22 17:29:49 ": "@xwaldie @ForrestW OMG are you fucking kidding me grapes are fine IN A TRANSFORMERS LUNCHBOX BUT WE ARE ADULTS, KATY", "Fri Apr 19 14:06:17 ": "RT @juliweiner: Kid on CNN just described Tsarnaev as “an actual angel” who “smokes a little weed” but is not, like, “some foreign dude.”", "Fri Apr 19 16:35:34 ": "@DanAmira that is a Deep Thought, by Jack Handey", "Thu Apr 18 19:37:41 ": "(I assume it is not cool to call it the Witch's House, sorry, world-famous artist Mary Nohl)", "Thu Apr 18 17:47:02 ": "Also, college students have a lot of energy! I don't even have it in me to PREgame nights out, much less postgame", "Thu Apr 18 16:59:18 ": "@Ingrid_Norton @sophieelmhirst ooh that was a good one", "Thu Apr 18 16:39:28 ": "(This is the book. It's about the life of a Hawaiian singer and the amazing afterlife of his song: http://t.co/n2QE2YeGD8 )", "Thu Apr 18 17:37:46 ": "@joereid in", "Mon Apr 22 17:33:39 ": "@RobKendt ideal cast: David Shiner and Teller", "Thu Apr 18 21:36:18 ": "@brookejarvis @SlateBooks Town Hall potentially TOO much space. that showbox lounge looks pretty sweet", "Thu Apr 18 14:09:44 ": "@donpappy he said it was great!", "Fri Apr 19 14:05:36 ": "RT @Wesley_Morris: RT RT @jeremyscahill  Look at the tiny news scroll at bottom of screen http://t.co/sknF5pFjHJ", "Mon Apr 22 15:28:24 ": "@macwrites did that come out in the last 25 years?! seems timeless.", "Thu Apr 18 17:20:41 ": "@stevensonseth agreed! if she is not hired by gawker by tomorrow i will eat my hat, @johnjcook", "Thu Apr 18 17:54:12 ": "RT @nprmonkeysee: Any women's a cappella group that came up with an arrangement of even parts of that viral sorority letter would instan ...", "Mon Apr 22 21:17:22 ": "FINALLY. http://t.co/j4YibPPHix #literalllyangrywithrage", "Thu Apr 18 19:21:22 ": "@fmanjoo this is why, farhad. because it's great!", "Thu Apr 18 17:36:41 ": "@KTHeaney @gabrielroth have you never been to a sports game", "Fri Apr 19 02:36:31 ": "@CenturyBallroom thanks! we'll be in touch", "Thu Apr 18 19:18:18 ": "@fmanjoo you sound like a little asswipe that stands in the corners at night or a weird shit that does weird shit during the day", "Fri Apr 19 13:50:23 ": "TODAY 7:00-11:00 AM. Scheduled: world's largest game of pong; dieting; Ryan Lochte; frugal tips.", "Thu Apr 18 18:11:12 ": "RT @Chris__Richards: Find out why Ashley Monroe sings sad songs with her eyes closed - and listen to an acoustic version of \"Like A Rose ...", "Thu Apr 18 18:05:03 ": "@bobbyfinger Get That Look!: Ben Bradlee's tie", "Mon Apr 22 03:43:11 ": "RT @dbhaglund: https://t.co/LhPCzeT8Di RT @PeterVigneron \"Police: Boston bomb suspects lost hostage while buying snacks\" http://t.co/zTjpMF…", "Sun Apr 21 21:35:43 ": "@jaycaspiankang #theangerisrage", "Mon Apr 22 03:41:29 ": "RT @alexrossmusic: The return of the Electric Circus http://t.co/m5QuOJdqGG", "Thu Apr 18 14:09:22 ": "@scott_tobias Cruise just optioned this tweet", "Thu Apr 18 16:42:05 ": "@BenMathisLilley I did not! Thank you for telling me.", "Sun Apr 21 02:50:02 ": "@jfagone (anyway that's what it feels like sometimes)", "Mon Apr 22 17:44:30 ": "@xwaldie @ForrestW RIGHT NOW, AT MY DESK", "Mon Apr 22 15:04:51 ": "Easiest Criticwire survey in months! http://t.co/Cvjh5jS8wz", "Thu Apr 18 16:40:24 ": "(I'll favorite them all, and if you want a book email me your address)", "Thu Apr 18 17:04:51 ": "@teamsweeting that is spectacular", "Thu Apr 18 17:23:25 ": "@loganhill33 @AnnaKendrick47 would crush this", "Sat Apr 20 03:59:53 ": "@theanthonyking http://t.co/UEOx43MaPE", "Thu Apr 18 15:56:39 ": "@WmAnthony All of the above!", "Thu Apr 18 16:37:27 ": "So thanks to Target Hawaii returns I have a whole bunch of gently shelfworn copies of my book FACING FUTURE. I am gonna send them out!", "Thu Apr 18 16:52:46 ": "@natechinen thanks Nate!!!", "Mon Apr 22 18:26:15 ": "RT @stevensonseth: Okay @dankois I binge-watched Top of the Lake this weekend. Jeeeebus! It's like if Twin Peaks had been written by Andrea…", "Sun Apr 21 22:29:50 ": "@jaycaspiankang that's some sweet Gary Sheffield action there", "Fri Apr 19 15:57:41 ": "RT @Wesley_Morris: (The frantic scribbling you hear is Anna Deavere-Smith taking notes.)", "Sun Apr 21 02:16:35 ": "@erik_henriksen oh man, that is a cool book", "Mon Apr 22 15:06:24 ": "@smkuenn I disagree! Looks/style/affect are totally part of live performance. But it is possible to discuss w/o being a dick", "Thu Apr 18 15:01:20 ": "@unclegrambo yes! he is like a west indian version of that guy", "Thu Apr 18 17:10:59 ": "Extremely heartened by this. Usually undergrads take a lot longer to find their voice. She can write a SENTENCE, man http://t.co/i7aFIMDWzX", "Thu Apr 18 17:48:40 ": "@davebry9 we should put her in charge of the grand jury report when they finally catch the bomber", "Thu Apr 18 19:34:19 ": "@AlyssaRosenberg @ninashen @JessGrose @stevensonseth @fmanjoo seems pretty basic -- like pussy placekicking but without the tee", "Thu Apr 18 18:13:03 ": "@SamuelAAdams http://t.co/aFVNCCwnwl http://t.co/ZOBM5AyaYk", "Thu Apr 18 16:53:08 ": "@zinoman oh god they almost all are", "Mon Apr 22 14:56:17 ": "The Problem With Buying a Dragon in an Illiquid Market: @mattyglesias on the Economics of Ice &amp; Fire http://t.co/NbzZhm3pqI", "Thu Apr 18 21:45:47 ": "@Tedster @brookejarvis @SlateBooks ooh thanks!", "Fri Apr 19 13:54:24 ": "Anyone else already cooking up elaborate sad backstory of radical older brother browbeating younger brother into terrorism?", "Thu Apr 18 18:01:19 ": "@joereid it's not their fault that Delta Gamma currently fucking sucks", "Thu Apr 18 15:34:33 ": "RT @publicroad: You can tell a website hates America if they make you scroll all the way down to click \"United States\" instead of puttin ...", "Thu Apr 18 15:04:22 ": "@literaryeric bulls do", "Thu Apr 18 19:37:17 ": "The amazing @tinatheatre has a book deal! For a book about the WITCH'S HOUSE, no less. This is gonna be great. http://t.co/QX6Ezmzb5E", "Thu Apr 18 17:38:16 ": "RT @nprmonkeysee: The good news is that if you like awkward and boring people, now you know where they hang out.", "Mon Apr 22 03:38:44 ": "@LaneBrown @ntabebe holy fucking fuck"}