{"Mon Mar 25 01:43:07 ": "RT @aruptom: There is now a Dept of Industry, Innovation, Climate Change, Science, Research and Tertiary Education  - or DIICCSRTE - I m ...", "Mon Apr 15 11:33:05 ": ". @jonaholmesMW right on #mediawatch - the media needs to be more upfront about behind-the-scenes deals on 'drops' and exclusives", "Tue Apr 23 01:51:03 ": "RT @CraigDButt: Watching the population counter on the ABS website: http://t.co/rQXLykVCZv Just 445 to go", "Wed Mar 20 22:39:32 ": "RT @rwillingham: Great stuff jac. “@JacquelineMaley: Everybody copes differently with a crisis, right? Today's Under the Flag: http://t. ...", "Sun Mar 24 11:26:51 ": "RT @byTonyWilson: Posted a longer version of 'School Behind Bars' on my website. Too long for GW, but has nice extra detail. http://t.co ...", "Fri Mar 15 00:28:15 ": "@Boughtadogtoday  thanks", "Mon Apr 15 13:36:41 ": "@dylanwelch I am sure there are thousands of readers who read your missives from the troubled places in silent awe!", "Mon Mar 18 01:36:03 ": "God knows I've had many FOI failures but here's a win! Self-represented against govt and its FOI guru Mick Batskos http://t.co/JLZ61JTVvf", "Mon Mar 18 02:37:29 ": "@Melbcity very interesting", "Mon Mar 18 22:12:20 ": "RT @guardian: Have you seen the world's largest concentrated solar power plant? It's @GuardianEco's big picture http://t.co/1dsYGYFY23", "Thu Mar 21 06:23:23 ": "@bencubby Indeed!", "Mon Mar 25 01:40:43 ": "Australia's community of climate change sceptics no doubt rejoicing at the appointment of ex-Woodside lobbyist Gary Gray as energy minister.", "Wed Mar 20 22:08:06 ": "RT @tonyowright: Day's real story slips out back door as all eyes focused on the front http://t.co/NATpUmNZiv via @NationalTimesAU", "Thu Mar 14 22:48:07 ": "RT @pennells: Gina Rinehart's children in pact to share payouts: http://t.co/TVZ0eXISR2", "Fri Mar 15 00:27:53 ": "@Boughtadogtoday  It's not clear at this stage.", "Thu Apr 11 10:03:13 ": "@Fiona_HS I think you should put it in your computer and then quickly take five steps backwards.", "Tue Apr 02 06:04:43 ": "@deanhepburn mfyfe@theage.com.au", "Thu Apr 18 06:56:31 ": "@docjen59 indeed, a relief", "Tue Mar 19 05:04:09 ": "@t_shaped so goddamn jealous", "Mon Mar 18 22:03:34 ": "@MicLooby seems perfectly sensible.", "Thu Apr 25 02:50:19 ": "For Radiohead fans: a great interview with Thom Yorke by @ABFalecbaldwin on his radio program @heresthething", "Wed Apr 24 05:50:32 ": "@sarahjanenotes Nick M retweeted that to highlight the problem with @fitzhunter's email to Nick. See @fitzhunter's twitter stream.", "Mon Apr 15 12:37:58 ": "@dylanwelch I have no idea what you are saying in your tweets but I dig them nonetheless.", "Wed Apr 03 04:26:33 ": "RT @d3wic: 4 stars from @michellegriff for @tombinns' mystical Ian D Montfort http://t.co/GRSThn9vSD. More #MICF reviews via http://t.co ...", "Tue Apr 02 06:04:02 ": "Here's the http://t.co/DqEOqKPYb2 petition on Rinehart's push for @pennells and @adele_ferguson to reveal sources https://t.co/SDpyjZGeqP", "Tue Apr 09 22:22:57 ": "@Mileshef @pennells @adele_ferguson it seems @corrslawyers share their client's misunderstanding of the role of sources in journalism.", "Sun Apr 07 00:57:48 ": "@JaneCaro great column today", "Mon Apr 22 10:58:16 ": "RT @ICIJorg: Google's Eric Schmidt defends his company paying just £6m in UK corporation tax http://t.co/i1SCGL2qlV", "Sat Apr 20 04:59:19 ": "... Booth at 3.45pm. What will happen if someone whispers \"Riewoldt is number 12\" in his ear? It pays to be curious...So there you go fans", "Fri Mar 29 04:10:05 ": "@deanhepburn ok, perhaps send me an email?", "Tue Apr 02 06:05:38 ": "RT @Ageinvestigates: Video from today's MEAA press conference on threats to journalists' sources  http://t.co/iR9yEpMmZu", "Sat Apr 20 10:29:05 ": "@jillastark @rwillingham true. Can't argue with that.", "Sun Apr 21 09:21:54 ": "RT @sianprior: I really cannot stand the way the #RACV claims to speak for me in demanding more roads when all I pay them for is rare roads…", "Tue Apr 23 02:50:11 ": "RT @nytimes: Christina Amphlett, Divinyls Singer, Dies at 53 http://t.co/4UQizR2jxQ", "Sat Mar 16 01:04:52 ": "@t_shaped it might appear here at some point, it was a cracker http://t.co/xlEj4cJNDs", "Thu Apr 11 10:14:54 ": "That's the first time I've seen a television program bust the myths on Australia's milk industry #thecheckout", "Sun Mar 24 11:26:13 ": "+1 “@michellegrattan: All good wishes to Katharine Murphy and Lenore Taylor as they start their new Guardian lives.”", "Fri Mar 15 09:05:01 ": "Great in-your-face speech by Rachael Griffiths at the #quills", "Sat Apr 20 04:54:26 ": "Am off to see the Saints game today. If anyone else is going @theage has a Forever Curious comp running. Will tweet clue in a sec.", "Sat Mar 16 01:03:57 ": "@deansbennett It may appear here at some point http://t.co/xlEj4cJNDs and no, but I will!", "Thu Apr 25 02:58:40 ": "Here's the link. For Radiohead fans: great interview with Thom Yorke by @ABFalecbaldwin on his program @heresthething http://t.co/xoO0hfD6nv", "Sat Mar 16 01:10:16 ": "@BrigidWD which injury?", "Mon Mar 18 02:37:02 ": "@jennylmackinnon thanks Jenny", "Thu Mar 21 03:08:25 ": "Strong performance from Gillard under such pressure #qt", "Mon Apr 08 11:37:28 ": "Has Stephen Conroy got time for #lateline with all this Gellibrand stuff going on?", "Wed Mar 20 12:08:33 ": "RT @nycjim: Powerful @nydailynews front page. http://t.co/RuUrjEOagw", "Wed Mar 20 04:33:00 ": "RT @abclandline: Tree clearing laws relaxed in Queensland http://t.co/8lY1los8Ky", "Wed Apr 03 20:55:01 ": "RT @leighsales: Great piece “@MichaelWolffNYC: Getting unaccustomed levels of agreement on Hitchens deconstruction. Makes me nervous. ht ...", "Wed Mar 27 10:37:26 ": "RT @melbgreens: From 9 April, audio recordings of all City of Melbourne Committee and Council meetings will be uploaded to the website!  ...", "Mon Mar 18 05:02:53 ": "@purplepumprnckl Do you mean put all my FOI applications up on Twitter?", "Thu Apr 11 11:50:59 ": "@fionaparker1 @crpanky will check it out", "Mon Mar 18 07:30:44 ": "I'm not overjoyed about Conroy media reforms but is it really THAT bad? The media needs to address concerns sensibly, not like Henny Penny.", "Sun Apr 07 00:56:42 ": "RT @MrSamPang: I just rang 1194 to check the time. It's been too long but great to hear 'Time Guy's' voice again. He sounds well. Life m ...", "Mon Mar 18 06:30:19 ": "RT @BrendanDonohoe7: Dumped Minister Richard Dalla-Riva speaks out on who undermined Ted Baillieu. \"It ended up like a blood sport in th ...", "Mon Apr 15 13:41:33 ": "@DanielMOakes @dylanwelch am positive it's not indifference.", "Tue Apr 02 06:41:15 ": "RT @FOIcentric: List of submissions received for Australian Review into Freedom of Information Laws: http://t.co/2A7ES6swqU #foi #foia # ...", "Thu Apr 25 00:53:09 ": "RT @Gay_Alcorn: Dan Flitton pulls no punches re indefinite detention. He calls it a crime. http://t.co/uyqL59kI1J", "Mon Mar 18 07:21:15 ": "@GreenJ if Conroy had struck closer to hacking scandal news ltd couldn't have howled so loudly.", "Mon Apr 22 04:30:16 ": "@ScottMur89 my pleasure", "Mon Apr 22 06:27:17 ": "RT @leighhenningham: Farewell Chrissie Amphlett! http://t.co/PPiqMPcyYp @theage #amphlett #divinyls http://t.co/2zRZCklXpu", "Tue Apr 02 06:39:44 ": "@deanhepburn yes", "Sun Apr 07 00:55:59 ": "@_M_86 fashionwise, me too. But that's all!", "Fri Apr 05 07:56:47 ": "RT @mtoy88: Former Age investigative reporter Gerard Ryle heads up Wikileaks-sized global investigation on tax havens http://t.co/ryY4c2m1mJ", "Thu Mar 21 05:41:05 ": "Love #spill #nonspill days for all the live footage we get to watch of people walking up and down the corridors of parliament.", "Mon Apr 15 12:34:12 ": "@DanielMOakes So true Mr Oakes", "Wed Apr 03 00:36:23 ": "RT @the_underage: Featuring a guest talk from award-winning investigative journalism team Richard Baker &amp; Nick McKenzie. All welcome ...", "Mon Mar 25 01:56:35 ": "@dondcruz No, not at all", "Thu Mar 21 12:15:14 ": "RT @DuskaSulicich: A view of #thespill from @tonyowright  http://t.co/FOI1zJ7kPk", "Mon Apr 08 11:25:17 ": "Beautiful stuff #4Corners.", "Mon Apr 15 00:26:15 ": "RT @FarrahTomazin: Point Nepean master plan: http://t.co/Vxrud1alqT Plus Age video on the redevelopment (by @tessavanderriet) http://t.c ...", "Mon Mar 25 01:35:45 ": "RT @MeddlesomPriest: New energy minister Gary Gray once declared that global warming was “pop science”. http://t.co/eznY8GMuPf", "Mon Apr 22 23:51:36 ": "RT @FOIcentric: Update to Australian Taxation Office #FOI disclosure log. Most recent - employee share schemes, MRRT: http://t.co/11EK8Bnq1…", "Tue Mar 26 02:11:30 ": "RT @newmatilda: Who are the women on the nation's editorial pages? What are they writing about? The Women in Media project continues htt ...", "Sat Apr 20 09:03:52 ": "@rwillingham try being a saints supporter", "Mon Mar 18 23:11:13 ": "RT @tonymahercfmeu: The books are being cooked on 457 visas. Tim colebach nails the rort. http://t.co/Sm4i8jT6Av", "Mon Mar 18 08:54:25 ": "RT @7NewsMelbourne: Minister dumped in Denis Napthine's cabinet reshuffle said destabilising Baillieu as Premier became a \"blood sport\"  ...", "Mon Mar 18 02:37:54 ": "@GeorgiaWesten very time consuming indeed", "Thu Apr 18 04:57:57 ": "Nick McKenzie &amp; Richard Baker just had a court win: judge has set aside the witness summons asking for their sources in Securency case.", "Sat Apr 20 02:20:37 ": "RT @byTonyWilson: \"If Dunkies closes, the terrorists have won\". Great piece on one night stand in lockdown Boston. http://t.co/HvZiTyXpfK (…", "Sat Apr 20 04:57:52 ": "Clue for Saints v Essendon game: watch out for Saints fan with Forever Curious on back of his jumper at Gate 5 near ticket collection ...", "Fri Mar 15 03:58:40 ": "So @MartinPakulaMLC will stand for Tim Holding's seat of Lyndhurst. Sets up an interesting dynamic for Labor in the lower house #springst", "Mon Apr 08 12:32:35 ": "@HoareD right on", "Fri Apr 12 23:34:13 ": "RT @ringsau: The best analysis on the drugs in Australian sport crisis yet published. A must read by McKenzie and Baker of The Age http: ...", "Mon Mar 18 07:19:04 ": "@BrendanDonohoe7 he didn't say who did the undermining!", "Thu Apr 11 09:59:32 ": "RT @macleanbrendan: Surely, it must be clear to someone at Channel Ten that @charliepick deserves his own Daily Show style program. Go t ...", "Sun Apr 14 02:25:04 ": "@katelangbroek  lovely column in the paper today", "Sun Apr 07 00:32:03 ": "Women's minister Heidi Victoria says gender equality in parliament 'naive' goal. She's wound clock back today not one hour but to the 1950s", "Tue Apr 23 00:21:51 ": "RT @ClayLucas: What Terry Mulder had to say about \"monster trucks\" in 2008: http://t.co/0vR20Ewls1 #springst", "Mon Mar 18 08:26:50 ": "RT @mediaguardian: Press regulation deal hailed by Labour after last-ditch talks http://t.co/YaGRfK7taQ", "Mon Mar 18 22:13:46 ": "RT @adamlmorton: Liberal MP @KellyODwyer backs same sex marriage http://t.co/OR3aRt6tdM", "Sun Apr 14 04:11:52 ": "@katelangbroek yes I didn't realise the odyssey was quite so grand in scale. I have stump pic, which I am pretty sure I texted to your hubby", "Tue Apr 02 06:04:56 ": "@tony_robbo thanks Tony", "Sun Apr 21 00:27:45 ": "@tom_cowie great to meet you Tom. Call any time if you need help with FOI.", "Sun Apr 14 22:36:32 ": "RT @benschneiders: The always entertaining Ben Butler on free speech, Rinehart and the conflicted IPA http://t.co/OF5qC6oEYM", "Thu Mar 14 22:04:47 ": ". @774melbourne news just said Don Coulson resigned. That may be the government's spin but he was actually sacked. With no explanation.", "Sun Apr 14 04:12:43 ": "@katelangbroek it's a great pic! Also texted it to James.", "Thu Mar 21 22:41:23 ": "@dugaldjellie yes. Also good days on the Metro ship under captain @greenj OK, nostalgia stopping now.", "Thu Apr 11 11:50:23 ": "@Pod_Legal I think, then you are pretty much on the right track. No mention of bobby calves.", "Thu Apr 25 00:30:40 ": "RT @jamesmassola: Terry Moran says public servants should be allowed to brief journos - a very good idea, IMHO http://t.co/efGkTBWMdK", "Sat Mar 16 01:19:18 ": "@BrigidWD oh no! So the learning how to jog is off the cards?"}