{"Wed Jun 20 01:48:59 ": "Very excited to be playing Icthus festival in Kentucky this week!", "Sun Sep 16 18:04:08 ": "So stoked for our show in Hutchinson Kansas tonight!!!  6:30 PM at Venue 302, tix at the door for $5!!   Don't miss it!", "Sat Nov 26 20:05:54 ": "Hey guys, just a reminder that our Black Friday sale is on ALL weekend long! Start shopping now at... http://t.co/tZsFwZEB", "Thu Sep 13 22:53:43 ": "It's been a fun week of shows so far in  Texas and Oklahoma. Here are a few shots taken by @skeletonkeyphotography! http://t.co/K9OpR2gq", "Sun Oct 16 20:54:38 ": "Check out this interview with Barry from Kiros on CMZ!!  http://t.co/P9nc8OKc", "Fri Mar 23 14:35:33 ": "Bus crash this morning :( http://t.co/ndxrEnou", "Tue Aug 28 17:52:30 ": "Does anybody live in Reno Nevada, or have family or friends in Nevada who would be willing to put up a Kiros band... http://t.co/Iwyn7lfW", "Mon Jul 02 20:28:14 ": "Playing the final Cornerstone festival in Illinois tomorrow.   Come hang out at 12:30 pm at the Underground Stage!", "Fri Mar 23 14:33:23 ": "http://t.co/4J8bbO07", "Fri Dec 02 02:17:08 ": "Have you downloaded our new single \"Unshaken\" yet?  Free on Fuse TV! http://t.co/Uc8Og6tj http://t.co/eChrGa0L", "Sat Oct 15 15:46:45 ": "Hey Missouri and Kansas!  We've got shows coming up, and we'd love to see you!!", "Thu Feb 09 18:00:19 ": "Own an Android phone, and want the new Kiros CD for 7.99?  Done. http://t.co/cv6Ijxss", "Mon Oct 24 13:18:02 ": "Kiros show in Wichita Kansas tonight (with Ryan Cabrera!!) Come party!", "Fri Jan 25 05:13:04 ": "RT @ChassDoll_Davis: I still can't get enough of @Kiros. #OneOfMyFavorites.", "Thu Dec 08 23:48:25 ": "Did an interview with AMP magazine today!  Should be in the January issue, so make sure you pick it up!!", "Thu Nov 24 23:17:55 ": "KIROS IS HAVING A MASSIVE BLACK FRIDAY SALE!!! Head on over to our online store at http://t.co/F2AdboYw and... http://t.co/ekvBiJhZ", "Sun Apr 07 02:29:16 ": "@Neilklammer #wellplayed", "Sat Sep 22 02:23:05 ": "Yesterday we were in Oklahoma. Tonight we play Western Canada! #cantstop #wontstop http://t.co/U4Wnbhlx", "Fri Sep 28 01:01:14 ": "Announcing Auditions!!\n\nAs many of you know, Ryan and Tyler have both retired from road life.  We love them, and... http://t.co/iNTBqQMd", "Thu Feb 16 00:28:43 ": "\"Unshaken\" is featured on the Century Media Records Roadkillers Sampler! Go download it for free!!... http://t.co/BJ3GvCpw", "Sat Mar 10 04:29:17 ": "Sold out gig in Dallas. Legit! http://t.co/vFIqtgLY", "Tue Feb 21 23:05:35 ": "Kiros is featured on http://t.co/PtqoHM83, and in the March issue of Alternative Press Magazine!  Check it out!!! http://t.co/rADFwSiM", "Sat Feb 25 06:57:31 ": "Our guitar tech, Jordan Landers is the best ever!", "Wed Apr 18 02:42:05 ": "Download the FREE Roadkillers Sampler from Century Media Records on iTunes featuring \"Unshaken\"!!... http://t.co/u3iIG4SS", "Wed Oct 05 05:38:24 ": "Jackson Tennessee tomorrow, then 3 shows Michigan!", "Tue Sep 25 13:03:59 ": "Thanks to all who made the Hope For More event a success! It was great to see such a turn out from the hometown! http://t.co/0XRTKTsR", "Fri Nov 09 00:05:32 ": "The Awakening Tour starts tomorrow!!  If you live in Alberta, we're playing close to you this month!  Come hang... http://t.co/FjZiFCCO", "Sat Sep 08 01:01:22 ": "After one of the craziest, most challenging weeks Kiros has ever faced, to be about to step on stage for these people in Dallas is worth it!", "Thu Nov 24 23:16:42 ": "KIROS IS HAVING A MASSIVE BLACK FRIDAY SALE!!! Head on over to our online store at http://t.co/F2AdboYw and... http://t.co/SXQBjxLL", "Sat Mar 10 01:49:50 ": "About to go on in Dallas!! http://t.co/8rCe1ymZ", "Tue Jul 31 20:16:04 ": "Parting Ways:  A letter from Ryan Guerra to all the friends and fans of Kiros\n\nAfter touring full time in Kiros... http://t.co/sQRuhiQt", "Sat Sep 22 02:19:59 ": "Yesterday we were in Oklahoma. Tonight we play Western Canada! #cantstop #wontstop http://t.co/JztsZIa5", "Thu Dec 15 03:31:52 ": "Kiros is featured in the December issue of HM Magazine! Check it out in stores or free online version here :... http://t.co/esaHj6rB", "Sun Dec 25 04:33:52 ": "A little Christmas present from Barry...check out this cover of \"little drummer boy.\"   Merry Christmas everybody!!", "Sun Apr 07 02:15:10 ": "Kirosband would like to announce that as a band we are all firm believers and fans of the Vancouver #canucks. We bleed blue", "Tue Mar 06 13:27:19 ": "RT @SurrenderMag: @Kiros have you seen the new issue?? with you on the COVER!", "Thu Feb 16 16:48:57 ": "iTunes has just dropped the price of our new full length CD \"Lay Your Weapons Down\" to only $5.99!!  Download now!! http://t.co/B1HNAcBn", "Fri Jan 06 03:12:10 ": "Our plane is about to leave for Our European tour!!  We're so excited to be coming back to Denmark!!", "Mon Jan 09 22:08:12 ": "We have a new website!  And its got our new song posted on it! And our album release date!  And upcoming tour... http://t.co/a0t8LJFR", "Sat Jan 28 23:28:41 ": "Have you checked out the NEW PREORDER FOR OUR NEW CD YET?  http://t.co/WFvfjPUS http://t.co/bahJPmva", "Wed Feb 22 04:12:42 ": "We just added a brand new T-Shirt to our online store!! Go to http://t.co/F2AdboYw and pick one up along... http://t.co/BCSsiBBv", "Wed Feb 22 19:36:41 ": "We are picking a winner for the facebook contest tonight at midnight, and it will be announced on a new video... http://t.co/VuN0VTCw", "Thu Dec 06 20:41:37 ": "RT @dougieparker: such a great weekend! and with that we're done for the year. gonna miss this @kiros boys", "Fri Mar 09 23:32:38 ": "We're LIVE on Power FM right now! Tune in here: http://t.co/Tvuj80MU", "Wed Dec 14 00:25:02 ": "More big news: We are touring the USA feb/mar with @redmusiconline, @officialtfk, @manafest, and @ninelashes. Get stoked!!!", "Tue Oct 11 15:38:14 ": "A huge thank you to everyone who came out to see us on Music with a Mission tour!!! It means to world to us!", "Sat Feb 04 07:01:37 ": "See our profile pic? Make it your own and tag Kiros in it to win tickets to our next U.S. tour with RED, Thousand... http://t.co/QIK2nsYc", "Fri Feb 24 19:26:50 ": "Does anyone know anyone with Hookups for DisneyWorld or Islands of Adventure in Orlando?  The reward will be... http://t.co/3rRw71im", "Mon Feb 06 15:24:06 ": "New Album comes out tomorrow! Who is going to pick it up?", "Fri Oct 07 20:45:23 ": "@KeptOnHold Troy Michigan tonight!!", "Wed Feb 22 00:03:55 ": "Boys night out in Nashville!  Predators game!! http://t.co/GxSHy0AY", "Wed Apr 25 15:34:32 ": "A whole bunch of new tour dates posted up!  Western Canadian CD release show dates (starting this weekend!), a... http://t.co/1PGqchb3", "Thu Jan 26 22:16:29 ": "Hey Everyone! We have a cool contest going on you should check it out. We will give you a hint: It involves winning free RED tickets!!!!!!!!", "Fri Jun 29 17:39:05 ": "Playing at #lifelightfestival tonight!  Free show Missouri!  We hit the 360 stage at 9:30 pm!!", "Tue Feb 05 23:31:08 ": "Kiros started at a youth group in 2000.  As 16 year old kids, we thought it would be fun to put together a punk... http://t.co/5x40uwIR", "Wed Sep 26 06:17:03 ": "We're very excited to annouce that Kiros has been nominated for 2 GMA Awards!!!\n\nRock/Modern Rock Album of the... http://t.co/7eT77W5Z", "Mon Feb 06 19:22:38 ": "KIROS album is streaming for a week on http://t.co/OF9FmgGe.  The new album comes out tomorrow! \n \nLink:... http://t.co/YZfCifnq", "Sat Feb 25 20:19:12 ": "Have you checked out the new Kiros video blog yet?? http://t.co/V9TNGDmy", "Fri Oct 12 17:48:53 ": "New tour dates posted!  Kiros is playing some home area shows with @dougieparker! #awakeningtour", "Wed Dec 14 00:31:24 ": "Dear USA.  You're cute! How about a date?  How about Feb/Mar 2012, along with Red, Thousand Foot Krutch, Manafest and Nine Lashes? Done.", "Thu Jan 26 22:16:50 ": "Check out our facebook page for the contest!", "Tue Jan 10 04:54:13 ": "Check out this video: Unshaken - http://t.co/P4eEeFdo", "Sun Apr 07 03:02:26 ": "But seriously. Love them Canucks!!!!!!", "Wed Jan 18 09:26:54 ": "Lots of USA tour dates just posted on www.kiros.com", "Fri Mar 09 23:10:44 ": "So excited for a sold out show at \"the door\" in Dallas tonight!  Love this city!", "Fri Feb 24 00:02:18 ": "NEW KIROS VIDEO BLOG!!!  Introducing a new t-shirt, the guys compete to not be the display model.  Also... http://t.co/nSrl5xSv", "Thu Jan 26 22:40:10 ": "Hey Everyone-\nHere is the information on the contest! http://t.co/WyuazTvL", "Thu Feb 23 05:42:45 ": "Noah from @ninelashes modeling our new t-shirt!! http://t.co/fkdzuUq7", "Sun Sep 16 07:43:28 ": "We used our day off to check out the Kansas State Fair! #somuchfood #youcanfryanything", "Fri Mar 29 16:55:18 ": "Already 30 shows confirmed for the farewell tour, and lots more in the works! Can't wait too see ya'll!!", "Fri Jun 08 20:38:20 ": "Thanks @decorepair for providing such a hard working tech in @tylerjuell.   Our bus windshield is good to go!", "Tue Feb 07 03:47:30 ": "Our new CD comes out tomorrow!!!!  #overdue", "Fri Aug 03 04:38:49 ": "We're so excited to be playing at The Soul Fest in Gilford New Hampshire!  Check us out at 5:35 on the Deeper... http://t.co/GsrXGHLb", "Sun Mar 25 04:54:07 ": "The REDvolution tour has come to it's end, and we've had an amazing 2 months! Thanks to everyone who came and made this the best tour yet!", "Thu Oct 27 15:06:47 ": "Headed home after an amazing tour!  Thanks everyone for coming and seeing us!  We've got some big upcoming tour... http://t.co/1v30Zo0Z", "Sat May 05 22:30:28 ": "Aaawww Yeeaahh!!  It's that time!!! http://t.co/2uekI5ww", "Sat Oct 08 15:41:47 ": "Playing in Muskegon Michigan tonight at the LC Walker Arena!", "Tue Dec 04 04:00:40 ": "Thanks to everyone who came out to the Awakening Tour!  We had a blast!", "Fri Mar 16 22:28:09 ": "Show in Redlands California tonight!  In-n-out burgers are mandatory.", "Wed Feb 15 01:36:08 ": "New Release Tuesday's weekly Podcast has posted an interview with Barry, talking about the New Record!   Check it... http://t.co/lAYfeDW9", "Tue Aug 14 03:22:54 ": "Nothing more poetic than breaking down 1 hour away from home at the end of tour.  #whereismyfairytaleending", "Wed Feb 08 16:39:12 ": "Itunes USA has our new record \"Lay Your Weapons Down\" available for $7.99 right now! http://t.co/6yscJb6x", "Tue Sep 04 00:44:06 ": "We're excited to be kicking off our September tour this Friday in Irving, Texas! Come hang at DFW New Beginnings!", "Thu Jan 26 21:56:34 ": "Pre-order LAY YOUR WEAPONS DOWN via CM Distro! http://t.co/xrhaHL6x", "Sat Feb 16 20:40:57 ": "If you are interested in booking Kiros on their farewell tour, contact Ryan Guerra on Facebook or by email at ryan@kiros.com.", "Fri Sep 28 22:56:54 ": "Kiros is playing tonight at St. Andrews United Church in Regina Saskatechewan tonight!!  Party!!", "Thu Dec 01 04:33:00 ": "WANNA FREE DOWNLOAD OF THE BRAND NEW KIROS SINGLE?  FUSE TV has it!!  Check it out :... http://t.co/UnpMAVUR", "Wed Mar 28 15:59:59 ": "Thank you everyone who come and saw us on the REDvolution tour!  We had an incredible time!!", "Fri Jun 08 20:39:16 ": "Only 2 shows left in our Canadian tour! Thanks everyone for coming out!!  It's been an amazing tour!!", "Tue May 15 02:04:16 ": "Kiros Reality TV!!  For the next 3 days we've got a tv crew following us, capturing a behind the scenes view of our lives on the road!", "Tue Mar 06 07:19:46 ": "Es", "Thu Nov 24 23:18:46 ": "KIROS IS HAVING A MASSIVE BLACK FRIDAY SALE!!! Head on over to our online store at http://t.co/F2AdboYw and... http://t.co/tum7grcE", "Mon Feb 06 21:42:36 ": "RT @CMZINE: KIROS – Lay Your Weapons Down (Review) http://t.co/MUVb1SwI @kiros", "Thu Feb 09 17:33:48 ": "Prefer to get a physical copy of the CD?  All the links are on http://t.co/Am9aq4BF now! http://t.co/ytd9NQN6", "Tue Dec 13 22:21:19 ": "RT @Team_David_Lei_: @Kiros Why not 1001 times?", "Fri Mar 09 16:53:49 ": "Starting the day off right with an interview and acoustic performance on Power FM in Dallas! http://t.co/N0gy5Wlw", "Tue May 22 19:34:12 ": "Make sure to go LIKE our record label Aint No Grave Records!! \n\nhttps://t.co/1VMLYPiu http://t.co/yaNdnsdy", "Sun Dec 25 04:35:15 ": "Merry Christmas everybody!  Here is a little Christmas present from Barry, a brand new cover of \"little drummer boy\" http://t.co/1snJSr4h", "Tue Feb 07 04:28:35 ": "AVAILABLE ON ITUNES NOW!!! http://t.co/DnCHyIjU", "Tue Dec 13 22:19:30 ": "Our new single \"Unshaken\" has been released to radio!!!  Please call your local radio station and request it 1000 times!!"}