{"Mon Apr 01 19:36:46 ": "On this date in 1946, the Maestro led the premiere of Marc Blitzstein's \"Airborne Symphony\" with the NYCSO...", "Tue Mar 26 13:38:26 ": "March Madness continues with our friends at http://t.co/xKx21jyVQH...select the best musicals in a head to head... http://t.co/D9YMAJb6WL", "Tue Apr 23 17:30:15 ": "ATTENTION Boston area fans... http://t.co/hglK2gU4wg", "Wed Feb 27 18:09:57 ": "RIP Van Cliburn... http://t.co/LDCoGEoNFb", "Wed Mar 13 14:46:37 ": "ATTENTION Fans in Pennsylvania... http://t.co/lUuJ8pQS98", "Tue Feb 26 17:03:55 ": "For the past week we have been sharing memories from the past 60 years of Wonderful Town...Last year an AMAZING... http://t.co/QE6Mk5mrIi", "Wed Mar 13 18:49:50 ": "While the white smoke subsides, here is a picture of the Maestro with Pope Paul VI...picture courtesy of the NY... http://t.co/IrnKFzE6g5", "Fri Mar 08 15:10:07 ": "Happy Friday...One of our favorites covers of a Bernstein tune is Nina Simone singing 'Who Am I'...The song was... http://t.co/W7IaXLFx26", "Mon Apr 15 14:21:13 ": "And in other exciting news....SonyMasterworks is rereleasing the 1958 Rite of Spring conducted by the Maestro http://t.co/yZm83rWjkG", "Tue Apr 16 14:40:52 ": "It is heartwarming to see the Maestro's quote being posted on many a timeline over the last 24 hours...It is... http://t.co/E9zCUMUi0f", "Thu Feb 21 20:48:43 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the next few days will be... http://t.co/FO70DTgKBf", "Thu Mar 14 14:26:25 ": "March Madness continues with the Maestro leading the NY Phil (1967) in Mendelssohn's War March of the Priests... http://t.co/tBL30d2TRz", "Tue Apr 16 14:22:27 ": "There are thousands of recordings of the world's greatest works of classical music. iTunes Essentials: Classical... http://t.co/fA9qQQkKom", "Thu Mar 07 16:27:01 ": "Take in our version of March Madness with the Maestro conducting \"March to the Scaffold\" from Symphonie... http://t.co/L4myYWU1jZ", "Mon Feb 25 15:55:18 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the past week we have been... http://t.co/nR7eR4a0rM", "Wed Jan 23 21:19:19 ": "There is nothing like standing on a cold subway platform when all of the sudden a beautiful brass band strikes up... http://t.co/Y9LWpa7E", "Mon Apr 15 14:29:35 ": "And here's a littler something for this lovely spring morning...The Maestro leading the Orchestra dell'Accademia... http://t.co/1uTfOPFwpx", "Thu Apr 18 19:35:51 ": "Joshua Bell was absolutely wonderful last night playing the Maestro's \"Serenade\" http://t.co/GR0ewxTcCd", "Thu Mar 14 19:45:43 ": "March Madness continues with an American classic...The Stars and Stripes Forever...with the Maestro leading the... http://t.co/3EVaeFtzkl", "Wed Mar 06 17:04:58 ": "Looking for a gift for the music lover in your life...check out our store... http://t.co/bEC9oXACeq", "Mon Mar 18 14:26:07 ": "March Madness Monday...The Maestro conducts the Royal Concertgebouw Orchestra in the Funeral March from Mahler's... http://t.co/zs5mLzPBMD", "Mon Mar 25 19:20:38 ": "We are saddened to hear of the passing of Derek Watkins, noted trumpet player who performed with the Maestro... http://t.co/PVshdaUbEp", "Fri Mar 29 14:35:00 ": "nice interview with the Penn State faculty members involved with their most recent production of MASS... http://t.co/MU8C4Ywlou", "Tue Apr 09 18:53:52 ": "Nice interview with our own Jamie Bernstein as she talks about MASS which will have its Oklahoma premiere this... http://t.co/jYL3hlxViv", "Wed Mar 27 17:54:07 ": "CONGRATULATIONS to the team behind Wonderful Town at The Lowry...Winner of Best Design and Best Production at the... http://t.co/sN7Xk6NUOm", "Thu Feb 14 15:14:04 ": "Happy Valentine's Day !!!! http://t.co/6bw0MBYd", "Wed Mar 13 20:45:49 ": "Now for a little more March Madness...Here is the Maestro conducting the Grand March from Aida with the NY Phil... http://t.co/xCa63iK9cJ", "Tue Feb 26 18:02:11 ": "60 years ago today Wonderful Town premiered on Broadway at the Winter Garden Theater...Over the past week we have... http://t.co/qPbOmYqQFB", "Thu Feb 21 21:29:40 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the next few days will be... http://t.co/GJish4Hyd0", "Mon Mar 11 15:05:45 ": "23 years ago today, the Maestro conducted the Vienna Philharmonic Orchestra at Carnegie Hall.  This was his last... http://t.co/bbpH3Xu3At", "Mon Apr 22 17:31:22 ": "April 21 is also the anniversary of the premiere of the Maestro's 'Missa Brevis' in 1988 with the Atlanta... http://t.co/acew3Vdku2", "Wed Apr 17 19:38:44 ": "The Leonard Bernstein Office seeks a Special-Projects Coordinator (Marketing and Social Media)\n\nChief... http://t.co/18xRHCIaSK", "Fri Feb 01 19:39:30 ": "THANK YOU TO ALL OF OUR FANS...WE REACHED 90,000 FOLLOWERS THIS AFTERNOON...!!!!!", "Wed Mar 13 15:52:50 ": "We love March Madness around here...Here is the Maestro conducting Semper Fidelis with the NY Phil in 1967... http://t.co/bItQvLoTKw", "Wed Feb 27 16:36:28 ": "http://t.co/DDyMDpsTDU... http://t.co/jrG20JzSH1", "Mon Jan 28 19:33:56 ": "\"But it was his perfect portrayal of the bad boy in \"West Side Story\" that was most entertaining. As he heard the... http://t.co/FSn7NU1F", "Tue Jan 29 15:41:28 ": "it seems to have slipped by us accidentally, but 69 years ago yesterday was the premiere of Symphony No. 1... http://t.co/wfbz5lZn", "Wed Mar 13 13:39:17 ": "Great interview by Mo Rocca with the one and only Rita Moreno from CBS Sunday Morning... http://t.co/b48vo4Hetz", "Wed Feb 27 16:41:01 ": "ATTENTION Huntington, NY area fans...Here is your chance to meet the amazing Rita Moreno... http://t.co/CQlYD1D0AR", "Thu Apr 04 18:00:29 ": "Something fun this afternoon....:) http://t.co/kHFvTlPz9g", "Mon Apr 08 18:50:18 ": "RT @artfullearning: Evolved science/art OriginalCreation@ Jackson MS - Four views of a pathogen w/the effect on social structures &amp;  ...", "Thu Mar 07 16:41:11 ": "Check out this great review of FIRST LIGHT from our very own Craig Urquhart. http://t.co/3DL29CYRJK", "Mon Feb 25 15:57:49 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the past week we have been... http://t.co/Feyhywx2sj", "Fri Mar 29 18:56:46 ": "FYI...check out Gustavo Dudamel this weekend on Sirius XM radio... http://t.co/UPYtcAuYnc", "Wed Jan 23 15:07:49 ": "Happy 80th Birthday to the wonderful Chita Rivera !!!! http://t.co/aaWQTgFX", "Tue Mar 19 15:16:07 ": "March Madness continues with the Maestro leading the NY Phil in Bizet's March of the Smugglers... http://t.co/aEY3obTpIA", "Tue Feb 12 16:12:01 ": "Check out this 1950 roundtable discussion about American music featuring the Maestro, Aaron Copland, Lukas Foss,... http://t.co/ymq6Ocnb", "Wed Jan 23 20:04:02 ": "A great review of a newly arranged violin/orchestra showpiece by David Newman with Sarah Chang http://t.co/gs8I4eZP", "Tue Apr 02 18:32:32 ": "On this date in 1956, the Maestro signed his first long-term contract with Columbia Records (later CBS Records)...", "Wed Apr 24 14:47:47 ": "Leonard Bernstein, who was a visiting Music professor at Brandeis from 1951 to 1956, founded the Leonard Bernstein... http://t.co/R6hItZ8Kdn", "Fri Mar 15 16:00:44 ": "March Madness continues with Elgar's March of the Mogul Emperors from The Crown of India...The Maestro leads the... http://t.co/5JuOjCObIW", "Tue Feb 26 16:41:19 ": "Sometimes the mind can play trick on you at this age...turns out that TODAY is the 60th anniversary of the... http://t.co/53evk7URBR", "Thu Jan 10 15:15:26 ": "In case you missed during the hustle and bustle of the holiday season, here is a great interview with our own... http://t.co/BYFSGuAS", "Fri Mar 22 16:43:52 ": "HAPPY BIRTHDAY STEPHEN SONDHEIM !!!! http://t.co/WCiK6Ngyil", "Thu Apr 11 15:01:33 ": "A nice interview with the team that is presenting MASS this weekend at Oklahoma City University in conjunction... http://t.co/LgtShu2jef", "Thu Mar 07 20:34:04 ": "ATTENION Long Island, NY area fans... http://t.co/FzNdGcKkmx", "Thu Feb 21 20:53:24 ": "I posted 2 photos on Facebook in the album \"\" http://t.co/BTcpOGpuR1", "Thu Apr 18 18:35:40 ": "with the NY Phil presenting 'Serenade' with Joshua Bell, how appropriate that they found this in the... http://t.co/ooq4MsrkSu", "Mon Apr 22 17:21:36 ": "Over the weekend we celebrated two special anniversaries of the Maestro.  April 21, 1939 saw his first appearance... http://t.co/AoCVtjP0m0", "Mon Feb 11 14:58:32 ": "Nice review from the NY Times covering Jonathan Cott's book \"Dinner With Lenny: The Last Long Interview with... http://t.co/WiQcrhIK", "Mon Feb 11 20:34:23 ": "Sounds like a very cool project... http://t.co/9xXNIHhY", "Fri Mar 08 19:07:56 ": "In honor of International Women's Day...Here's the one and only Billie Holiday singing a Bernstein tune... http://t.co/1pHOTE1HPB", "Tue Feb 26 19:31:50 ": "Over the past 60 years, Wonderful Town has delighted many a theater patron...In 2010 WT truly became an... http://t.co/f8h1jbKaAI", "Thu Apr 18 15:03:18 ": "\"Late Night with Bernstein\" heads to Brandeis University http://t.co/xfpLcCROH3", "Thu Mar 07 14:38:45 ": "Everyone here at the Leonard Bernstein Office would like to say thank you as we have reached 100,000 fans...!!!!", "Thu Mar 28 18:42:10 ": "We are saddened to hear of the loss of Robert Zildjian...RIP...our cymbals are at rest... http://t.co/7NmC73ILaU", "Fri Mar 22 14:47:53 ": "HAPPY BIRTHDAY STEPHEN SONDHEIM !!!! http://t.co/8ZbZJToxGk", "Wed Feb 27 16:37:48 ": "ATTENTION Huntington, NY area fans...Here is your chance to meet Chita Rivera... http://t.co/emVC9IetCE", "Fri Mar 15 17:44:29 ": "March Madness continues with this Russian favorite...Tchaikovsky's Marche Slave...The Maestro conducts the NY Phil... http://t.co/P7FvICr97i", "Tue Apr 02 17:19:40 ": "ATTENTION Boston/Cambridge area fans... http://t.co/V21JBcbEpa", "Tue Mar 26 19:54:18 ": "March Madness continues with the DCI Blast Marching Brass Theatre performing Gee Officer Krupke... http://t.co/AFPpuv2kML", "Mon Apr 01 17:11:40 ": "ATTENTION fans in Oklahoma... http://t.co/wIz6aJ3J1V", "Fri Feb 01 19:31:30 ": "Hello", "Wed Apr 03 17:22:41 ": "@dahlhalla My body has been dead for almost 23 years...My music lives on...My spirit would prefer to be left out of this", "Sat Apr 13 12:38:40 ": "Looking forward to hearing Joshua Bell and the NY Phil perform the Maestro's Serenade this week... http://t.co/KNh0q41NnD", "Mon Feb 11 18:23:59 ": "ATTENTION London fans... http://t.co/4gdRMjV0", "Thu Mar 28 18:44:44 ": "March Madness is down to the Elite Eight...I encourage everyone to get out there and help send West Side Story to... http://t.co/Ld8PNnVmwk", "Wed Feb 20 18:45:51 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the next few days we will... http://t.co/LToUvNm8", "Wed Apr 10 15:01:47 ": "wonderful to hear things are going well for Amarillo Opera... http://t.co/W29XnoUNar", "Thu Feb 28 15:51:42 ": "HAPPY BIRTHDAY to Bernadette Peters...!!! http://t.co/WcciNVRXnc", "Mon Jan 21 23:50:10 ": "Check out the LGBA playing \"Tonight\" at President Obama's 2013 Inaugural Parade earlier today... http://t.co/2MAgoNh2", "Mon Mar 18 15:45:32 ": "We are saddened to hear of Mr. Relyea's passing... http://t.co/kVhzJvKeio", "Mon Apr 15 13:54:37 ": "We couldn't be more excited about this upcoming concert with the NY Phil... http://t.co/HGJCnxby9n", "Thu Feb 21 16:32:52 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the next few days will be... http://t.co/gBHmxdWV10", "Tue Apr 16 14:03:50 ": "After the tragic events in Boston yesterday, I felt like this anecdote seemed appropriate...Here the Maestro... http://t.co/pULTbwZ2w4", "Tue Jan 29 19:34:16 ": "It seems that actress Anne Hathaway is a Bernstein fan...Anne and her husband Adam Schulman were photographed... http://t.co/4W2TVrxS", "Thu Mar 07 19:54:10 ": "The Ravinia Festival has announced its programming for the 2013 season including a premiere of a new chamber... http://t.co/1v8AjB4h32", "Thu Mar 28 15:23:38 ": "March Madness continues as West Side Story beat out A Chorus Line to move on to the next round...Click the link... http://t.co/qqK9V8rkkh", "Mon Apr 22 15:03:31 ": "10 years ago today we lost a true artist...Here she is singing the Maestro's 'Who Am I'... http://t.co/kEtENSvnVj", "Tue Mar 12 14:14:05 ": "For those of you who haven't seen this program, check it out...Our own Jamie Bernstein is one of many people... http://t.co/9c6fwNHiBr", "Wed Feb 27 18:27:15 ": "Here is the piano piece that the Maestro wrote for the Sixth Van Cliburn International Piano Competition (1981) http://t.co/A8YbERTxiY", "Thu Apr 18 20:28:38 ": "Look what's coming to the NYC Ballet this spring... http://t.co/GEx0KyAPGN", "Thu Apr 04 19:21:23 ": "45 years ago today we lost a true leader with the assassination of the Rev. Dr. Martin Luther King, Jr.\n\n\"This... http://t.co/94gBUvp6Am", "Thu Feb 28 16:02:17 ": "@Tom_Godell however we have almost reached the 100,000 mark on our Facebook page...", "Thu Apr 11 17:26:46 ": "Congratulations to Hershey Felder for receiving an Elliot Norton Award nomination for Outstanding Solo Performance... http://t.co/c9hXn4dSxk", "Thu Feb 28 17:50:37 ": "HAPPY BIRTHDAY to Bernadette Peters...Here is a photo of her as Hildy in the 1971 revival of \"On The Town\" http://t.co/CQAguK79Ka", "Thu Jan 31 16:30:20 ": "What a nice treat for a Thursday afternoon...the good folks at the Novosibirsk Opera &amp; Ballet Theatre in Moscow... http://t.co/XXu5ZRNP", "Mon Feb 25 18:33:30 ": "On Feb. 23, 1953, Wonderful Town opened on Broadway at the Winter Garden Theater...For the past week we have been... http://t.co/0Psju2bHsp", "Fri Jan 11 15:44:28 ": "check out \"Dinner with Lenny, The Last Long Interview With Leonard Bernstein\" by Jonathan Cott - courtesy of WNYC... http://t.co/kGgul21p", "Fri Mar 08 17:57:08 ": "Let's hear it for our own Jamie Bernstein.... http://t.co/aHGKtz6NFh"}