{"Thu Mar 28 14:39:17 ": "RT @thtlinks: FanGraphs and Baseball-Reference unify replacement level: http://t.co/yJwCWnpaPQ", "Wed Mar 27 20:26:06 ": "No wonder the kids were rowdy @NewsdayNY Cops: Duo had cocaine kilo in car while driving with 5 kids http://t.co/ov0G2jcqNb #NewsdayNY", "Mon Apr 22 02:35:43 ": "RT @dandrezner: BREAKING:  Don Draper is against the war in Vietnam.", "Fri Feb 15 19:19:31 ": "#FF NJB folks @BigBlueTT @MLepselter @HeroOfTheYear @RobertAitkenBR @MTed528 @ndepas @CraigPOb @ShadyProof420 #FantasyBaseball", "Wed Apr 17 17:49:21 ": "RT @chrislhayes: Everyone reporting on possible suspects today, please take a moment to read this: http://t.co/QewxWq8sOT", "Tue Apr 09 16:25:39 ": "Great game story by @MarcCarig via @NewsdayNY #Mets pound Halladay, Harvey frustrates Phillies http://t.co/UJwal1ssvx", "Tue Apr 02 14:13:15 ": "RT @MikeFrancesaNY: But if youah gonna come aftah us youah bettah bring moah dan peashootahs, cawse I'm not goin anywheah *stares into c ...", "Wed Mar 27 20:58:09 ": "Great stuff @NewsdayNY The 25 biggest home runs hit in New York http://t.co/XlirFk3LI1 #NewsdayNY", "Wed Apr 17 22:44:42 ": "RT @ShelleyA: Woot. Verified. That is all.", "Fri Feb 15 19:08:20 ": "RT @FantasyJudgment: #FF @FFAdvisorapp @CavghtLooking @coachesser @FantasyJudgment @Jeffrey_Gross @BChad50 @Karl_de_Vries @fangraphs @As ...", "Sat Apr 20 00:56:57 ": "RT @Boston_Police: Suspect in custody. Officers sweeping the area. Stand by for further info.", "Mon Feb 25 03:07:54 ": "RT @BillPascrell3rd: Terrible decision by Record to let #cartoonist @JimmyMargulies lose his job - He has given so much to so many  http ...", "Sat Feb 23 17:20:01 ": "Spring Training games are the O'Douls of baseball: It's not as enjoyable as real beer, but at least you get that beer taste. #Mets", "Sat Apr 20 20:04:34 ": "RT @FantasyJudgment: The #Mets would be much better off with @hughhefner pitching than Jeremy Hefner.", "Wed Apr 17 22:21:04 ": "@ultracasual Unless you count my weekly PSA spots for Pale Kids of America, not really.", "Fri Mar 08 12:25:13 ": "School closings, heavy snowfall mark Friday morning in Hudson Valley @NewsdayNY http://t.co/6GRkpKOiMK #NewsdayNY", "Wed Apr 03 17:55:18 ": "Katonah man charged in $62K insurance scam @NewsdayNY http://t.co/o825CMAf4R #NewsdayNY", "Tue Mar 19 16:03:20 ": "It's never a good thing when you eat lunch you prepared and sit around wondering when the food poisoning will set in. #ThisShouldBeFun", "Sat Feb 23 18:51:58 ": "Nice obit by @NewsdayMarcus about cameraman who shot famous Carlton Fisk '75 World Series home run reaction http://t.co/eT7OAm38Bz", "Fri Mar 29 17:16:58 ": "If you think cab rides are costly, try jail @NewsdayNY Cops: Ulster hitchhiker stabbed man over ride http://t.co/QlTVIo3k2z #NewsdayNY", "Thu Mar 07 14:10:12 ": "Hey @snooki congrats on the weight loss. What's the secret?", "Tue Apr 09 12:09:35 ": "RT @jackweiland: Axford out; Henderson in. I'm starting to think @Karl_de_Vries and I know what we're talking about.", "Thu Apr 04 19:37:53 ": "RT @Suntimes: There is a hole that can't be filled. One of the greats has left us. Roger Ebert has passed away at the age of 70. http:// ...", "Thu Apr 18 19:11:45 ": "RT @GlobeSox: #RedSox add B Strong logo to Green Monster. http://t.co/FCjmPrzwe8", "Tue Apr 16 21:59:01 ": "RT @coutinho9: Be careful about invites to donate $ for Boston victims: Check it out first--unfortunately scam artists abound during tim ...", "Mon Feb 25 02:33:38 ": "Haven't been watching the #Oscars but I heard the telecast is not going well. That makes me think I should be tuning in.", "Fri Mar 29 10:54:18 ": "My latest for @THTFantasy: NL Waiver Wire: Week 1 http://t.co/QGFBFVn7Qx #FantasyBaseball", "Mon Feb 25 03:06:51 ": "RT @OldHossRadbourn: People singing about being French is not my idea of progress.", "Wed Mar 27 17:45:45 ": "Tappan Zee Bridge project: Environmental groups back new span http://t.co/ZsXK8mP9QC by @BettyMingLiu via @NewsdayNY", "Mon Apr 22 15:36:55 ": "A look at Quintana, Nava, Gregorius &amp; Hicks in my latest waiver wire column for @THTFantasy http://t.co/bpKRXHHHj2 #FantasyBaseball", "Fri Feb 15 16:29:19 ": "RT @elliottjustin: the onion had the last word on cruise ships a couple years ago http://t.co/m0lDewhj", "Tue Apr 09 17:02:40 ": "Trying to convince my colleagues @santiago_kat and @ryanchatelain that cats eat their deceased owners. Not sure they're on board yet.", "Wed Apr 17 19:39:56 ": "@MLepselter @BigBlueTT @HeroOfTheYear Nah. But I could see Tim picking up Carlos Gomez just to flip him to Dave", "Fri Apr 19 16:00:06 ": "A journo equivalent of the 3-run homer @DanGoldbergSL via @StarLedger #Boston suspects' sister speaks out http://t.co/riIfdMnBgt", "Thu Feb 21 16:26:57 ": "Cops: Pa. woman pawned Stony Point friend's jewelry @NewsdayNY http://t.co/dDpJkQolFT #NewsdayNY", "Wed Apr 10 12:04:59 ": "Rosenthal, Herrera, Maxwell and Richards on my latest @THTFantasy waiver wire column http://t.co/jlGuqRzWFV #FantasyBaseball", "Wed Feb 20 14:58:51 ": "RT @beebow: a very merry midweek to you, Twitterpie - how's life on your side of the monitor?", "Fri Apr 05 11:23:26 ": "My latest for @THTFantasy: Cowgill, Ross, Fujikawa and Heisey on the NL waiver wire http://t.co/ZaUqfOy7hT #FantasyBaseball", "Fri Feb 15 14:06:51 ": "Journo log, 9:05 a.m. Quiet Friday morning so far. Too quiet. Makes me nervous.", "Sat Mar 02 21:47:00 ": "I work with interns who are too young to remember Teenage Mutant Ninja Turtles or Vanilla Ice. #DearGod #ImOld #GoNinjaGoNinjaGo", "Fri Feb 15 17:18:00 ": "RT @jaclynejimenez: It's a bittersweet last day for me. But I'm excited for a fresh start at new organization beginning Tuesday. Cheers  ...", "Tue Apr 16 14:27:13 ": "RT @Newsday: Here's our wraparound cover on the #BostonMarathon in today's Newsday: http://t.co/MV0vWTuyov", "Wed Mar 06 19:51:19 ": "@blootch Believe me, I've tried my best over the years to do exactly that.", "Thu Mar 14 01:32:04 ": "RT @LedgerTWP: .@CoryBooker and @hodgman faced off in Star Trek trivia on @scharpling's show last night! I wrote about it: http://t.co/B ...", "Thu Mar 21 12:50:01 ": "I have Don Henley's \"All She Wants to Do is Dance\" stuck in my head. Not that that's a bad thing. #DanceDance", "Fri Apr 05 16:11:44 ": "Just ate a turkey sandwich that's been in my briefcase for a full 24 hours. #Mmm #BonApetit #AmIGoingToDieToday", "Mon Feb 25 05:15:55 ": "RT @tanlines: Daniel Day Lewis is definitely doping, right?", "Sat Feb 16 14:39:41 ": ".@Timothy_OConnor strikes again @NewsdayNY Mt. Vernon's Davis: I altered docs after fed probe began http://t.co/ozJv2d3D #NewsdayNY", "Mon Apr 08 21:31:20 ": "Great stuff from @jackweiland in the ongoing search for hidden fantasy gems via @THTFantasy http://t.co/j7f15MHNI4", "Wed Mar 27 17:21:02 ": "RT @AdamSchein: I love Tim McCarver. He's opinionated and smart. An all-time great.", "Thu Mar 07 20:06:28 ": "When does early voting begin? @NewsdayNY Poll: Hillary Clinton leads rivals in 2016 prez race http://t.co/ySmO1bLvRP #NewsdayNY", "Sat Mar 02 22:08:17 ": "Give it up to @RachelSenatore for a fascinating look at the NYC subway system through the years http://t.co/EbEh3JVzxO #NewsdayNY", "Sat Apr 06 17:29:16 ": "RT @BigBlueTT: #MetsViking", "Thu Feb 14 20:04:13 ": "OK. But did he get the girl? @NewsdayNY V-Day prank leads to school evacuation http://t.co/qO0NjTnI #NewsdayNY #LoveIsInTheAir", "Fri Feb 15 19:59:28 ": "RT @baseballcrank: Passengers: \"that was the worst cruise ever!\" Katie Holmes: \"Not so fast...\"", "Wed Apr 17 23:17:43 ": "@AmyKup It's not all it's cracked up to be. For one thing, all my speaking engagements are either held indoors or outside on overcast days", "Tue Apr 16 19:54:56 ": "Expert: #BostonMarathon bombing likely a domestic plot @Timothy_OConnor &amp; @BettyMingLiu via @NewsdayNY http://t.co/84U8HXhOSX #NewsdayNY", "Mon Feb 25 03:00:27 ": "I like Jim Carrey's version of \"I'm Telling You\" on Larry Sanders better. #Oscars", "Sat Apr 20 17:37:19 ": "RT @JeffPassan: If there is any justice in the world, the FCC will pretend like that never happened, because that was awesome.", "Sat Mar 30 12:03:36 ": "@kevindamp No reason other than an oversight on my part and the fact he was MIA for much of the spring. Just updated. Thx for the heads up", "Wed Mar 06 18:56:05 ": "Today's assignment: Put together a photo gallery of the biggest dance crazes of all time. Lot of bad memories are surfacing. #ElectricSlide", "Wed Mar 20 17:48:45 ": "This is what we call an occupational hazard @NewsdayNY News12 reporter mugged in #Yonkers http://t.co/DeHuQVVILP #NewsdayNY", "Tue Apr 09 17:07:32 ": "@rachelsenatore @santiago_kat @ryanchatelain I like cats. I just fear them and don't want them gorging on me when I die.", "Wed Apr 17 19:30:09 ": "@MLepselter @HeroOfTheYear @BigBlueTT Frankly I would give some thought to that deal. HanRam can be kept, and Anderson / Cingrani are good", "Thu Apr 11 19:25:19 ": "Schneiderman: Dutchess duo sold elephant-feet stools http://t.co/v1Ndj3pFEJ #NewsdayNY", "Sat Mar 02 21:49:26 ": "@ultracasual Why, a sage, of course.", "Sat Mar 30 15:26:39 ": "RT @djshort: Wow, the Rockies are moving into their 21st season as a franchise. That's my most depressing tweet ever.", "Fri Apr 12 15:39:21 ": "Coding bootcamps flourish across U.S. @NewsdayNY http://t.co/qYHqynveTt #NewsdayNY", "Mon Feb 25 05:03:13 ": "RT @Bencjacobs: Excited for Mitch McConnell to be a special guest presenter at the Tonys after this", "Fri Feb 15 14:10:11 ": "RT @nycjim: Nice. RT @BuzzFeed: Straight From 1875, The Oldest GIF In Baseball History http://t.co/K5fV2oQv", "Wed Apr 17 23:31:56 ": "RT @ShelleyA: Heartbreaking: Partial list of victims of Boston Marathon bombing http://t.co/7xMLKbFnk3 via @BostonGlobe", "Sat Apr 20 17:03:15 ": "RT @AmyKup: Trending: Boston heads week of tumult, prayer, trauma http://t.co/KHinVMMPfa http://t.co/HjhPva8O09 Photo: EPA/Neighborhood Hou…", "Sat Feb 23 18:38:27 ": "Touche @DanGoldbergSL Spring Training baseball is foreplay. An enjoyable buildup.", "Fri Feb 15 16:41:26 ": "RT @KevinWGlass: Red Son! RT @michaelauslin Did anyone check the meteorite site to make sure there wasn't a baby in a spacecraft at the  ...", "Wed Feb 20 00:53:50 ": "@tomwp It had an invisible car. Pffft. Like I believe that.", "Tue Apr 09 19:01:14 ": "Did she land on her feet? Of course. @Timothy_OConnor via @NewsdayNY Yonkers kitten survives 3-floor fall http://t.co/7FzgqakXlu #NewsdayNY", "Tue Apr 16 19:39:08 ": "RT @sportingnews: Yankees will play 'Sweet Caroline' to honor #bostonmarathon bombing victims - http://t.co/P3GCdhnUXR", "Wed Apr 17 22:54:57 ": "@AmyKup Many thanks. Next step: Trying to match the volume of your Twitter legions.", "Wed Apr 17 23:00:37 ": "@ArmaghanS It's like we're waking up at the end of some modern day Twilight Zone episode to discover that we're TweetBots", "Tue Mar 12 18:12:39 ": "Taking pity on me and my ham sandwich, @santiago_kat and @kschach just gave me spring rolls, brown rice and a salad. True story. #charity", "Wed Feb 20 00:44:42 ": "\"Die Another Day\" is on. Not one of Bond's best moments. Not one of human history's best moments, for that matter.", "Wed Feb 20 00:45:41 ": "RT @MarcCarig: Sandy Alderson said that when the Yankees traded Rickey Henderson to A's in '89, the deal was finalized on a gas station  ...", "Wed Apr 17 22:17:03 ": "More fantasy goodness from waiver wire wingman @JackWeiland via @THTFantasy http://t.co/66XvSvyOvH #FantasyBaseball", "Fri Apr 12 15:00:56 ": "Ruggiano, Tepesch, Hafner and Wood examined in my latest waiver wire piece for @THTFantasy http://t.co/TXh52MV8Fu #FantasyBaseball", "Tue Apr 02 14:02:45 ": "Gonna be an interesting story to follow @NewsdayNY Spring Valley mayor swept up in NYC corruption probe http://t.co/jMxnc3o5Fy #NewsdayNY", "Fri Feb 15 11:25:17 ": "For @THTFantasy, @FantasyJudgment, @DAmbro74 and I take a look at lessons learned in last week's mock draft http://t.co/UWZ6cgrK", "Fri Feb 15 13:15:03 ": "RT @newsday: #RussianMeteor sets off blasts that injure more than 500: http://t.co/AzqlQ2Tq via @AP http://t.co/KtLmHYHK", "Sat Apr 20 17:56:37 ": "RT @ShelleyA: David Ortiz: Boston, this is our (non-bleeped) city ... the video http://t.co/WBh2E0Up7y", "Tue Apr 09 17:10:26 ": "@santiago_kat @rachelsenatore @ryanchatelain Right. But when he wakes up and you're dead, it's feeding time.", "Wed Apr 17 22:13:51 ": "I'm verified, bitches! Extremely cool. Many thanks to my also-verified Twitter sensei @JillianSed. #Woot", "Mon Apr 22 03:55:00 ": "RT @FantasyJudgment: Dear @Cardinals: we hear you may need a closer. You can have Frank Francisco in exchange for some baby back ribs. Sinc…", "Sat Feb 16 23:51:56 ": "A maddeningly congested and clausterphobic train ride was made much worse by my inexplicable decision to listen to a George Michael album.", "Fri Feb 15 20:00:58 ": "RT @LensReality: If you can read this message,  the Twitter satellite is still working fine. “@starledger: We survived! \nhttp://t.co/vnm ...", "Wed Apr 17 19:18:50 ": "@HeroOfTheYear @BigBlueTT @MLepselter Honestly that's probably one of his best attempts in a while at a fair trade.", "Mon Feb 25 06:29:29 ": "RT @TheOnion: Commentary By Daniel Day-Lewis | While I'm Glad I Won, I Personally Believe Abraham Lincoln Deserved To Die http://t.co/sd ...", "Tue Mar 19 13:50:33 ": "Just took a profile photo for work. The photog actually had to put a film on the flash to give me the illusion of skin pigment. #Irish", "Thu Apr 18 19:12:08 ": "RT @THTFantasy: Every time Matt Cain gets rocked, an xFIP angel gets its wings", "Mon Apr 22 02:43:15 ": "RT @bombscribe: Wanted to cuddle and my dog rejected me.\n\nI'm already down, life. Stop kicking.", "Fri Apr 19 22:17:57 ": "Snaps to @BrianPolicyMic on his @NewsdayNY debut: Passengers stranded at Penn in wake of #Boston lockdown http://t.co/r2POxxGFVV #NewsdayNY", "Mon Apr 22 02:37:24 ": "RT @jaketapper: Ted McGinley!!!!!"}