{"Wed Feb 20 20:02:56 ": "\"INFINITE IN IT'S NOTHINGNESS\" the brand new exclusive Lock Up track recorded especially for Decibel magazine is... http://t.co/aUrlC10I", "Wed Jan 23 01:34:26 ": "♫ New Date: Winnipeg, Canada - May 25 at Garrick Centre http://t.co/8UNCG2jM", "Wed Jan 23 01:38:34 ": "♫ New Date: St Paul, MN - May 26 at Mill City Nights http://t.co/e13fr55t", "Fri Feb 01 15:10:05 ": "Countdown to our Euro tour has begun. Here#s a little something to get you in the right mood...... http://t.co/u2tZJfdk", "Wed Jan 23 00:57:38 ": "♫ New Date: Houston, TX - May 10 at Fitzgerald's http://t.co/rUst7eS8", "Mon Mar 25 09:54:18 ": "♫ Just Announced: Frankfurt (Oder), Germany - Aug 31 at Beach Rock Festival http://t.co/bBgRUPYR86", "Wed Feb 13 01:56:27 ": "♫ Just Announced: Seremban, Malaysia - Apr 28 at TBA http://t.co/cInHoatJ", "Tue Mar 05 11:36:00 ": "♫ New Date: Warschau, Poland - Jun 26 at Metalfest Afterparty @ Progresja http://t.co/FWQjpEjqJJ", "Thu Jan 10 23:24:24 ": "♫ Just Announced: Steenwijk, Netherlands - Jul 27 at Stoneheng festival http://t.co/SMQ94Bul", "Wed Jan 23 00:57:20 ": "♫ Just Announced: Houston, TX - May 10 at Fitzgerald's http://t.co/L7fsgIGO", "Thu Apr 18 02:06:17 ": "Lockup - Metal Fest Chile 2013 http://t.co/TuP2hbnhK6", "Wed Mar 13 18:49:47 ": "R.I.P. Clive Burr.........Such sad news!!!\n\nhttp://t.co/ZvgAfYGV2r http://t.co/CE374IlGrU", "Thu Dec 13 12:48:31 ": "On the last night of the Barge to Hell cruise, Tompa joined Exodus (wearing tuxedos) on stage for \"Bonded by Blood\". http://t.co/02v0MPiq", "Wed Jan 23 01:12:40 ": "♫ New Date: Portland, OR - May 18 at Wonder Ballroom http://t.co/zfsmreiv", "Sat Apr 13 19:00:31 ": "♫ Today: Santiago, Chile - Apr 13 at The Metal Fest http://t.co/TMQJHRdFXE", "Tue Feb 26 18:21:11 ": "Got Sirius? Then tune in to BLOODY ROOTS Weekly Metal History Show :: Sirius XM Liquid Metal today at 3PM EST and... http://t.co/FimvAXfsVs", "Thu Jan 10 10:20:51 ": "Here's your chance to win free tickets for the London show:... http://t.co/l3gzxwbg", "Fri Feb 01 15:10:49 ": "Countdown to our Euro tour has begun. Here's a little something to get you in the right mood...... http://t.co/GRIw06ae", "Wed Dec 05 17:36:13 ": "a crushing show on the  barge to hell cruise !!! cheers for the response !!", "Wed Jan 23 01:19:08 ": "♫ New Date: Edmonton, Canada - May 23 at The Starlite Room http://t.co/aeVxitDL", "Wed Jan 23 01:16:51 ": "♫ New Date: Calgary, Canada - May 22 at MACEWAN BALLROOM http://t.co/5T1vcVj6", "Wed Jan 23 01:44:39 ": "♫ New Date: Detroit, MI - May 29 at Harpos http://t.co/C4OeoPh7", "Mon Mar 04 15:11:33 ": "9 out of 10 live review of the London show in Metal Hammer! http://t.co/QRvVQ7B6MA", "Tue Jan 29 13:59:50 ": "Does anyone know a company that can make cheap 1 colour vinyl stickers in the U.K.???", "Sat Apr 13 20:43:36 ": "Santiago you guys were ducking great !!! Cheers !", "Tue Mar 26 11:04:30 ": "\"An unparalleled standard of speed and intensity!\" - Live review of our recent London show in Terrorizer! http://t.co/8FqISvDD7Z", "Thu Mar 21 09:59:27 ": "♫ New Date: Obersinn, Germany - Jul 27 at Eisenwahn http://t.co/cn55vsIyC8", "Wed Mar 20 09:59:00 ": "♫ Just Announced: Osnabruck, Germany - Aug 8 at Bastard Club http://t.co/M6TKGyMmma", "Wed Jan 23 01:01:18 ": "♫ Just Announced: Tucson, AZ - May 14 at The Rock http://t.co/bDpW3Rqe", "Wed Jan 23 01:05:15 ": "♫ New Date: Ramona, CA - May 15 at Ramona Mainstage http://t.co/MR59VKJ1", "Wed Jan 23 01:42:43 ": "♫ New Date: Minneapolis, MN - May 26 at Mill City Nights http://t.co/qkkAxACw", "Wed Jan 23 02:03:20 ": "♫ New Date: Orlando, FL - Jun 12 at The Beacham Theater http://t.co/r2UuY32a", "Fri Mar 22 09:44:33 ": "♫ New Date: Des Moines, IA - May 27 at Wooly’s http://t.co/scwgbgMP0P", "Wed Jan 23 02:02:11 ": "♫ New Date: Atlanta, GA - Jun 11 at Masquerade http://t.co/dqzjHvof", "Mon Apr 08 09:30:19 ": "♫ Just Announced: Rasnov, Romania - Aug 30 at Rockstadt Extreme Fest http://t.co/0Qsgera7wt", "Fri Mar 22 09:44:24 ": "♫ Just Announced: Des Moines, IA - May 27 at Wooly’s http://t.co/TcvXilYUdB", "Mon Feb 04 10:52:26 ": "♫ Just Announced: Jakarta, Indonesia - Apr 27 at Hammersonic Festival http://t.co/KyIPASPl", "Wed Apr 17 08:56:19 ": "♫ Just Announced: El Paso, TX - May 13 at Tricky Falls http://t.co/Vdu36E6km7", "Sat Jan 12 21:21:14 ": "http://t.co/R3V5ktx0", "Mon Feb 11 15:50:22 ": "Notorious TL and the ghettoblasters! http://t.co/IvOQvQOq", "Tue Mar 19 09:30:28 ": "♫ New Date: Karlsruhe, Germany - Aug 3 at New Noise Festival 8 http://t.co/23ZhGF86k8", "Wed Jan 23 01:43:42 ": "♫ New Date: Chicago, IL - May 28 at Bottom Lounge http://t.co/2bO4FDsm", "Wed Jan 23 01:49:51 ": "♫ New Date: New Haven, CT - Jun 4 at Toad's Place http://t.co/4bavWcaZ", "Wed Feb 20 20:02:36 ": "A limited amount of issues containing the Lock Up Decibel flexi are available for purchase here:... http://t.co/bY80ufS8", "Tue Jan 22 14:00:20 ": "♫ Today: Trier, Germany - Jan 22 at Exhaus http://t.co/NLrLq4Ej", "Fri Feb 01 20:10:15 ": "INDONESIA AWAITS!!!", "Wed Feb 06 07:23:26 ": "Europe, are you ready for the Bestial Invasion?\nhttp://t.co/ziADWZLd http://t.co/gtVTAj93", "Sun Feb 03 18:26:41 ": "♫ Just Announced: Santiago, Chile - Apr 13 at The Metal Fest http://t.co/QMNnt9kq", "Wed Jan 23 01:11:44 ": "♫ Playing Live: Oakland, CA - May 17 at Oakland Metro Opera House http://t.co/GxxeUnsE", "Fri Feb 15 07:08:13 ": "Last night's show in Prague was killer. Czech Republic is our spiritual home! We're having a great time on the... http://t.co/94wkeh23", "Thu Jan 24 22:44:37 ": "Evisorax Guitarist Viciously Attacked, Facing Major Surgery | Gun Shy Assassin http://t.co/zY7b95Ia", "Sun Jan 06 13:41:24 ": "if you feel like some old school tongue in cheek heavy metal !! http://t.co/HxL6htQH", "Wed Mar 20 09:59:08 ": "♫ New Date: Osnabruck, Germany - Aug 8 at Bastard Club http://t.co/yzeLWYq0WR", "Wed Jan 23 01:51:52 ": "♫ New Date: Brooklyn, NY - Jun 5 at Music Hall of Williamsburg http://t.co/K9tiHhsQ", "Wed Jan 23 01:49:03 ": "♫ New Date: Boston, MA - Jun 2 at Royale Boston http://t.co/ZntC2cFe", "Tue Feb 12 11:23:48 ": "♫ New Date: Antwerp, Belgium - Jul 13 at mXm Hardcore Fest http://t.co/v9Bovwuu", "Fri Feb 08 01:20:29 ": "http://t.co/aABTMVum", "Mon Jan 28 05:45:04 ": "As stated on Blabbermouth:Shane will unfortunately miss the upcoming Lock Up tour next month due to conflicting... http://t.co/L1kAERV2", "Tue Mar 19 09:30:20 ": "♫ Just Announced: Karlsruhe, Germany - Aug 3 at New Noise Festival 8 http://t.co/dqCSnLWBcG", "Wed Jan 23 01:07:27 ": "♫ Playing Live: Santa Ana, CA - May 16 at The Observatory http://t.co/dY4mlHLI", "Fri Dec 14 19:40:51 ": "Anton is now officially endorsed by EMG pickups! http://t.co/5jsBDKvl", "Sun Jan 06 13:32:42 ": "http://t.co/x9KKmwGl http://t.co/e19ZEfW7", "Wed Jan 23 01:59:45 ": "♫ New Date: Saint Louis, MO - Jun 9 at Pop's Nightclub http://t.co/vJFETqRT", "Sat Feb 09 17:20:33 ": "Thanks for the brilliant turnout in London last night. Despite two more metal shows in town you people chose us.... http://t.co/8S5ACK6N", "Tue Feb 12 23:02:17 ": "Mr Barker's new Paiste RUDE Wild China is destroying ear drums every night,on and off stage apparently....So we've named it \"The Bastard\"!!!", "Tue Feb 12 20:14:19 ": "http://t.co/gY5jGKjY", "Fri Apr 19 09:05:35 ": "♫ Just Announced: Spital Am Semmering, Austria - Aug 9 at Metal Invasion O.A. http://t.co/XYeVT8xaXC", "Wed Jan 23 01:23:45 ": "♫ New Date: Regina, Canada - May 24 at Riddell Centre- University of Regina http://t.co/sFFjTcD5", "Wed Jan 23 01:46:20 ": "♫ New Date: Buffalo, NY - May 30 at Town Ballroom http://t.co/nHpeNtno", "Tue Mar 05 11:35:56 ": "♫ Just Announced: Warschau, Poland - Jun 26 at Metalfest Afterparty @ Progresja http://t.co/EZD6EvBfb3", "Sat Feb 09 17:23:53 ": "Soundchecked and ready to grind Paris!", "Wed Apr 10 23:10:12 ": "Here In Santiago ! Great rehearsal today,new riffs coming along awesome for the next album a good start !!!", "Wed Jan 23 01:56:48 ": "♫ New Date: Cleveland, OH - Jun 7 at Peabody's http://t.co/Vebs824T", "Sun Feb 10 10:39:36 ": "Merci Paris. Je m'apelle ARRGH!", "Fri Jan 25 13:05:41 ": "Come and see LOCK UP live,up close and personal at THE BORDERLINE Friday Feb 8th(next door to the captials No.1... http://t.co/x2gSqQSz", "Wed Jan 23 01:48:15 ": "♫ New Date: Montreal, Canada - Jun 1 at CLUB SODA http://t.co/LpU8cFyi", "Mon Feb 04 10:56:36 ": "The tour countdown continues... Get ready for TOTAL DESTRUCTION!\nhttp://t.co/byP7hefj http://t.co/SqfZ7OHb", "Fri Jan 25 02:15:45 ": "Check out Mr Barker's Mix Tape feature in the Febuary issue Terrorizer Mag..... http://t.co/BxOqbVg7", "Sun Dec 02 17:51:40 ": "In Miami,preparing for the Barge To Hell cruise tomorrow..", "Sat Feb 16 17:18:13 ": "Tonight the necrometer will be on 11 in Berlin-Kreuzberg!", "Thu Jan 10 23:19:25 ": "♫ Just Announced: Budapest, Hungary - Jul 24 at Durer Kert http://t.co/wMX0eXjR", "Wed Jan 23 01:55:06 ": "♫ Playing Live: Philadelphia, PA - Jun 6 at Union Transfer http://t.co/14QM1J4l", "Wed Jan 23 01:13:37 ": "♫ New Date: Seattle, WA - May 19 at El Corazon http://t.co/mptS3jrF", "Tue Feb 05 10:05:36 ": "Metal war starts in 3 days!\nhttp://t.co/21BaO4BK http://t.co/sEQ4Tr8h", "Fri Jan 25 15:37:56 ": "LOCK UP are playing the borderline,London February 8th ! This is an exclusive show for the Death Grind super... http://t.co/nD81Bwd6", "Wed Jan 23 00:58:19 ": "♫ Just Announced: Dallas, TX - May 11 at Trees http://t.co/Jx0EyAqo", "Tue Feb 26 07:22:59 ": "Brujeria @the house of blues this coming Wednesday !\nhttp://t.co/JPheCt1J1H", "Tue Dec 11 19:18:01 ": "@officialND @NAPALM_DEATH @NAPALM_DEATH \nShane's other band lock up on tour Feb 2013 in Europe http://t.co/VBJyQsPs", "Mon Jan 28 03:27:28 ": "Check Out Mr Barker in the Febuary issue of TERRORIZER magazine.... http://t.co/UoY8oneF", "Wed Jan 23 01:47:08 ": "♫ New Date: Toronto, Canada - May 31 at Phoenix Theatre http://t.co/RH9EMYEh", "Sat Feb 02 01:32:35 ": "New Exclusive Lock Up track recorded especially for Decibel magazine's Flexi series \"Infinite in it's... http://t.co/YUiyMimK", "Fri Jan 25 22:05:29 ": "♫ Playing Live: San Antonio, TX - May 12 at Backstage Live http://t.co/uvNOt1yH", "Wed Jan 23 01:01:57 ": "♫ New Date: Tucson, AZ - May 14 at The Rock http://t.co/IpojEZDS", "Thu Apr 18 14:29:33 ": "This awesome backdrop was hand-painted in Chile by W. Goldor. Check out his work here:... http://t.co/5lFwjCUx4f", "Fri Dec 21 11:02:24 ": "Listening to some brutal new riffs from Anton for the 4th Lock Up album !!", "Thu Apr 18 02:06:55 ": "Lockup - Metal Fest Chile 2013 http://t.co/GWEb9oAqsF", "Wed Jan 23 00:58:26 ": "♫ New Date: Dallas, TX - May 11 at Trees http://t.co/czXex9xf", "Wed Jan 23 01:14:52 ": "♫ New Date: Vancouver, Canada - May 21 at Commodore Ballroom http://t.co/xRc3i3Mq", "Tue Apr 23 11:38:12 ": "Check out some pictures from our recent show at The Metal Fest Chile!... http://t.co/dndHscE0ic", "Fri Feb 08 20:41:02 ": "One more hour before Darkness Descends upon the borderline,London !!"}