{"Mon Oct 08 14:48:20 ": "So we've just been discussing distribution with the label of Human Remains, as we've never actually seen the... http://t.co/4TtL4jjg", "Sun Jul 08 18:47:41 ": "The Inbox from HELL \\m/ http://t.co/A538u7YP", "Mon Sep 10 19:34:08 ": "Thanks to Alberto Cano Cárdenas of Tarragona, Spain :) http://t.co/m3U7vUz8", "Tue Jul 24 09:18:48 ": "300,000 hits - 1,700 comments - 2,480 likes - favourited 1,518 times. Thanks everyone \\m/ http://t.co/xHmvaQaR", "Mon Dec 17 19:24:15 ": "Only 50 'Likes' to go. So who is going to be our 10,000th fan on here? \\m/", "Sun Nov 11 22:25:54 ": "Have YOU got YOUR tickets yet? Meet up with fellow HELL fans from England, Ireland, Scotland, Wales, Germany,... http://t.co/fJv7LItv", "Mon Jul 02 23:10:19 ": "http://t.co/md9GyMcp http://t.co/XEpNiXqA", "Mon May 28 23:25:27 ": "The ROCK HARD show will be broadcast by WDR in Germany on the 16th July. Details on the linked website \\m/ http://t.co/wz69Pdt3", "Fri Dec 28 18:15:42 ": "Outstanding picture of David - courtesy of Harald Hirmuinen of Helsinki, Finland \\m/ http://t.co/SEgttkUg", "Mon Feb 25 22:53:06 ": "Another review... http://t.co/MtoPVjw6VM", "Wed Jul 25 17:01:32 ": "ELM STREET and BAKKEN added to TWISTED WRATH and RABID BITCH for the Dublin lineup on 25th August. WHAT a night... http://t.co/QLMwdsSj", "Mon Mar 18 13:10:56 ": "http://t.co/Q2wvilZiQj http://t.co/huhD1wzZ7v", "Mon Aug 27 20:38:57 ": "Pre-show downtime in Venice :) Image grab from the pub webcam \\m/ http://t.co/urBBBPyZ", "Fri Nov 30 08:31:18 ": "The first of several upcoming show announcements - HELL confirmed for BANG YOUR HEAD Festival - Balingen,... http://t.co/sjCbWhbL", "Tue Feb 19 14:01:59 ": "Part 2 \\m/ http://t.co/F2CbOxSA", "Sun Oct 28 10:47:46 ": "The biggest show production we've ever staged is already 50% sold out and there will be no 'pay on the door'... http://t.co/hw5mUUoF", "Tue Sep 04 18:34:01 ": "Following the great reception we received at your awesome PPM and Alcatraz festivals, HELL will be returning to... http://t.co/TpISabgK", "Thu Sep 13 17:36:22 ": "We can now announce HELL's return to Belgium - with a headline show at CONCORDIA MAASMECHELEN, October 20th. Some... http://t.co/eUqobsVG", "Mon Aug 27 10:58:12 ": "Fantastic gig in Dublin on Saturday night. Many thanks to all the people who came and made it so special - just so... http://t.co/ZN3gaHOM", "Mon Jul 23 17:18:17 ": "After tens of thousands of air, sea and road miles across 14 different countries, the show in Dublin on 25 August... http://t.co/wF7ruGIK", "Wed Sep 26 23:23:37 ": "With Metal Hammer Gtr competition winner Ben Lacey at tonights rehearsal. Nice to meet you Ben, well done fella! http://t.co/Ec2j2CEu", "Tue Jul 17 00:23:02 ": "IRELAND -  we promised you we would be back soon, and here it is; http://t.co/hHOtrrsU", "Mon Jul 02 22:15:08 ": "Andy &amp; Kev, Sweden Rock Festival 2012 http://t.co/Oumc8E55", "Tue Aug 28 12:24:44 ": "We're sorry to have disappointed fans at our last few European shows (we sold out of shirts) - but ALL merch is... http://t.co/erjumAZ1", "Tue Dec 04 18:08:28 ": "Thanks to the fantastic guys at Rommelrock and their order today for 46 tickets - we have to warn HELL fans that... http://t.co/6xbVgpkn", "Sat Feb 23 06:28:43 ": "Derby, 0630, and the start of a long, long day for the band and stage crew. Let Battle Commence.....\\m/ http://t.co/CHandrLEyq", "Sun Jan 06 18:21:43 ": "I posted a new photo to Facebook http://t.co/8CZgR7Ec", "Thu Jan 03 13:41:32 ": "Derby Show now officially SOLD OUT! http://t.co/S2gXfVr4", "Sun Aug 19 13:35:51 ": "Massive demand and an instant sellout. So another print run of 'Save Us' baseball shirts arriving soon \\m/ http://t.co/RT9AHwlk", "Tue Jun 12 13:13:43 ": "New Hell  Save Us shirts now available at http://t.co/zwxcdPDj http://t.co/j9NPnpmv", "Fri Dec 21 17:31:29 ": "We'd like to wish all of our fans a fantastic Christmas and a prosperous New Year. Thanks for all your support... http://t.co/WJudMHEV", "Mon Jun 11 16:23:33 ": "New Hell Save Us Baseball and plain T shirts now available!!... http://t.co/SRn0qMEB", "Mon Oct 22 09:01:58 ": "The 40th and final show of the 'Human Remains' tour ended in Belgium last night. It's been a thrilling metal... http://t.co/ULNY3vJr", "Mon Mar 04 19:11:08 ": "Great German review of the Derby show from rocktimes.de \\m/ http://t.co/cczPmTYBht", "Tue Sep 11 19:36:45 ": "Next show 28th September - ¡ HOLA CATALUNYA ! http://t.co/n2QL2azC", "Mon Dec 03 23:41:46 ": "Just incase you missed the announcement last week, Plague Doctor shirts are back in stock and new Military style... http://t.co/WyCZWB9H", "Sun Jun 03 18:26:31 ": "Thanks a million to all those who stood in the cold and the rain at MUSKELROCK watching us play. You are total legends \\m/", "Thu Aug 30 16:27:37 ": "You loved our Xmas shirt, you loved our Pope shirt - and now you're going to love this. A LIMITED EDITION run of... http://t.co/U0pMSvYz", "Thu May 31 19:33:06 ": "Hell hat no fury! \nHell beanies now in stock, follow the link to merch page\nhttp://t.co/jRtXu7n4 http://t.co/EF84k0YT", "Fri Mar 01 16:04:12 ": "A handful of limited-run 'Devils Arse' shirts from the Derby show are still available. Also just five A1 posters.... http://t.co/RIzCWkReWI", "Sat Sep 01 15:38:10 ": "Over 80% of 'Plague Doctor' limited shirt run sold in under 48 hours. Thankyou everyone, we're very happy that... http://t.co/eX3WFlWT", "Thu Jan 17 13:57:02 ": "Hell added to Bloodstock Open Air, mainstage Saturday August 10th 2013... http://t.co/0jA8KMy8", "Wed Jun 13 23:12:57 ": "If you Scandinavians liked what you saw over the last two weekends in Sweden - get yourself a ticket for this. Up... http://t.co/HPTZnrI9", "Fri Jul 20 09:59:57 ": "Are you ready Holland?\nhttp://t.co/jLCmX7UV http://t.co/DYCCjRyd", "Sun Jun 10 21:38:17 ": "SWEDEN ROCK was simply amazing. Our thanks go to the whole Sweden Rock organisation for their outstanding... http://t.co/6OGN5mKP", "Sat Aug 04 13:14:16 ": "Next upcoming HELL shows;\n\n10th August METALCAMP - Tolmin, Slovenia\n11th August INTO THE GRAVE - Leeuwarden,... http://t.co/kxp8mBRx", "Wed Sep 05 14:22:21 ": "Here's a great story to brighten your day - and a story which perfectly shows why fans of this band are the best... http://t.co/EGSoSPV9", "Mon Feb 18 09:52:35 ": "Kev talks to Ali Blackdiamond about the next HELL album, playing mainstage at Bloodstock Festival again, the... http://t.co/4Az9Cb9j", "Tue Aug 14 09:54:59 ": "Next show - Dublin Ireland, 25/08/12 Cheap flights, cheap hostels, cheap beers and the legendary Irish craic.... http://t.co/cVY7cyYO", "Thu Jul 26 09:36:09 ": "I posted a new photo to Facebook http://t.co/KdViZtjc", "Mon Jul 30 14:55:42 ": "How many of our fantastic German fans recognise themselves from the front row of this show? Are any of you in this... http://t.co/ramzAhL2", "Wed Oct 31 22:27:54 ": "Happy Halloween to all our fans :) Pumplin courtesy of Dean Harrison (UK) \\m/ http://t.co/oWW9GxGK", "Wed Oct 31 22:29:52 ": "Happy Halloween to all our fans :) Pumpkin courtesy of Dean Harrison (UK) \\m/ http://t.co/NYZdAOOe", "Thu Jul 05 18:37:34 ": "Highlights of last month's HELL performance at the Rock Hard Festival (Gelsenkirchen Amphitheatre) last month. To... http://t.co/Amrrwwo9", "Tue Feb 05 22:02:50 ": "FEBRUARY 23RD DERBY SHOW UPDATE - We know that many fans will be arriving in Derby in the afternoon for this... http://t.co/Hgdrq7sm", "Thu Jul 26 08:38:57 ": "HELL is coming to BARCELONA \\m/ Announcement soon........ http://t.co/zW4Tfz6x", "Tue Feb 19 14:03:27 ": "Part 1 of the Metal Mayhem interview with Kev today - part 2 posted below \\m/ http://t.co/L7Ih0qFi", "Tue Feb 26 21:29:06 ": "'Something Wicked This Way Came' \\m/ We would like to say a heartfelt THANKYOU to all of our wonderful fans who... http://t.co/Xx9XBYbUz9", "Mon Jun 18 13:44:42 ": "Strange goings-on in Denmark..... http://t.co/vWRxSrhL", "Sat Sep 29 19:37:52 ": "Ever wondered what makes a HELL show so special in the eyes of our fans? Watch this show report, listen to the... http://t.co/CJpiUKph", "Mon Aug 13 21:13:52 ": "METALCAMP, INTO THE GRAVE  and ALCATRAZ were fantastic. Thanks to all the stage crews and organisers for the... http://t.co/1fdkRZcY", "Thu Feb 21 09:02:03 ": "OK HELLfans - final production rehearsals for the Derby show taking place tonight, the brand-new songs in the set... http://t.co/l4c5p901oM", "Wed Nov 28 13:02:30 ": "S-o-o-o-o many of you have asked for high-quality art prints of the Derby show poster. You also asked us to... http://t.co/8szrWZKp", "Sun Sep 02 17:15:01 ": "Last few left, get one while you still can....\nhttp://t.co/vUM58gHX http://t.co/No4YErgh", "Tue Oct 02 23:48:23 ": "Belgium, we are coming back!! http://t.co/YyiXIGcB", "Tue Aug 28 12:20:56 ": "We're sorry to have disappointed fans at the last few European shows (we sold out) - but ALL MERCH is now back in... http://t.co/DAThQMFE", "Thu Jan 17 12:13:15 ": "Hell added to Bloodstock Open Air, mainstage Saturday August 17th 2013... http://t.co/i5BXwl1E", "Mon Jun 04 10:43:25 ": "More pics from Rock Hard festival http://t.co/22cJxaOs http://t.co/k8iafLMK", "Sat Aug 04 13:32:55 ": "Next upcoming HELL shows;\n\n9th August METALCAMP - Tolmin, Slovenia\n11th August INTO THE GRAVE - Leeuwarden,... http://t.co/p51oYKjI", "Fri Mar 29 09:35:55 ": "UK fans - we'll see you on the mainstage at Bloodstock Festival in August - and we'll be bringing the full... http://t.co/J9L1gmaktg", "Sun Feb 24 14:26:45 ": "First review up..... http://t.co/qsok2jUjUx", "Fri Jan 25 19:53:34 ": "Connecting ... http://t.co/fJVTXJxb", "Tue Feb 05 18:59:48 ": "Lots of new fans on here!! Check out our merch page - some cool items with worldwide shipping \\m/ http://t.co/m74i30HT", "Thu Mar 28 18:58:05 ": "And second on the list hot on today's news stands - Powerplay Issue 152, review by Harry Paterson. \"It's only... http://t.co/iq4ETF8kvW", "Sat Jun 23 12:22:59 ": "3 pages of HELL in the new metal hammer, chance to win an ESP V and watch Hell rehearse at Backstage studios.... http://t.co/DhYooH7m", "Thu Jul 26 09:41:26 ": "I posted a new photo to Facebook http://t.co/ZU1z5vgk", "Tue Jan 29 07:06:42 ": "HELL confirmed as day 3 headliner for R-MINE METALFEST, Tongeren (BE) - 23 June 2013 \\m/ http://t.co/EJNJU4gb", "Fri Jan 25 19:58:10 ": "Kev talks to Ali Blackdiamond about the next HELL album, playing mainstage at Bloodstock Festival again, the... http://t.co/dO7zyyd8", "Tue Sep 25 20:46:47 ": "Bloodstock Open Air 2013 - HELL is currently the second most requested mainstage band for 2013 on the BOA forum.... http://t.co/DzPocnNG", "Sat Dec 29 18:14:48 ": "Update from Derby Live Box Office - ONLY 20 TICKETS LEFT FOR THIS SHOW. Last chance.....  \\m/ http://t.co/ZvBAZzUP", "Tue Oct 02 21:32:19 ": "HELL COMES HOME \\m/\n\nTRANSMEDIA PRODUCTIONS in association with DERBY LIVE presents;\n\nHELL 2013 TOUR LAUNCH... http://t.co/45Ak4w6T", "Sun Mar 03 12:10:16 ": "Fascinating facts about 'Human Remains' \\m/ http://t.co/03Upzjl53Y", "Tue Jun 05 10:19:27 ": "some great pics from muskelrock thanks to Soile... http://t.co/WcOkmxYJ", "Sat Sep 29 19:29:18 ": "BARCELONA Molins de Rei was a blast. A massive THANKYOU to all the awesome Spanish fans who supported us so well... http://t.co/qouz2df7", "Tue Jul 17 00:02:12 ": "HELL rocking hard in the German sunshine - live performance in Gelsenkirchen @ Rock Hard Festival. Streaming link... http://t.co/d3ZMERAr", "Thu Dec 06 18:12:53 ": "Free T Shirt going out to Nathan Harrison for his excellent photography skills in Manchester HMV last month. Keep... http://t.co/p66MHmU4", "Tue Jul 17 00:18:07 ": "Two amazing shows this past weekend in Denmark and the Czech Republic. Our thanks to the organizers and crews at... http://t.co/Gga8v58L", "Mon Feb 04 12:12:40 ": "OK Hell fans - here's the ULTIMATE merch item, in a limited edition of just ONE !! It's one of Kev Bower's spare... http://t.co/DKpfFylc", "Tue Dec 11 15:14:42 ": "The latest issue of the awesome METAL HAMMER, complete with the essential 2013 free pull-out metal calendar. Even... http://t.co/fQH2Gzgh", "Sun Nov 18 19:19:16 ": "A friendly heads-up for HELL fans:\n\nFacebook is trying to make us pay to promote every post/update from this... http://t.co/AzaV73Me", "Sun Jul 29 16:05:12 ": "A new batch of full-colour A1 'Human Remains' posters just arrived - so take a FREE Fanpack with every shirt... http://t.co/EJI9wpxn", "Mon Aug 20 11:09:28 ": "HELL comes to BARCELONA \\m/ http://t.co/5m4MTuOo", "Sat Apr 13 16:08:37 ": "The best fan video we've ever seen :) Thanks to LESTER LESTEGAS for this \\m/ http://t.co/H3PKggpmo0", "Mon Feb 11 22:58:05 ": "12 days to go \\m/ Are you all up for this? Are you going to be wearing your corpsepaint for the DVD recording? :) http://t.co/xf8v8izB", "Wed Sep 12 11:03:53 ": "Congratulations to Mr Ben Lacey! Winner of the HELL ESP guitar competition in Metal Hammer. One LTD V50 plus trip... http://t.co/kIoCnCmn", "Wed Mar 27 16:46:46 ": "Don't forget that HELL will soon be returning to Belgium to headline day 3 of the awesome R-Mine Metal Festival... http://t.co/DyjWU6a3Ws", "Tue Jun 26 09:56:25 ": "Some great pics of Sweden Rock by Marco Manzi right here... http://t.co/0euPnERz", "Wed Jul 25 11:34:19 ": "I posted 97 photos on Facebook in the album \"HELL - Scandinavia 2012 by Soile Siirtola\" http://t.co/OAzPxi7X", "Mon Jun 04 19:58:28 ": "We look forward to slaying SWEDEN ROCK next weekend!! One of the best lineups ever? http://t.co/jouvNHnb", "Sun Mar 10 21:43:25 ": "Some amazing pictures of the Derby show -  thanks to our good friend Andrea Chirulescu. Click 'play slideshow' on... http://t.co/znuwEcj3yd"}