{"Wed Mar 06 04:08:53 ": "@NastyNesto @ryanmcmillin you can't associate the culinary skills of @L28witko with the whole apartment, just isn't fair", "Thu Mar 07 19:13:29 ": "RT @MBeurmann: Happy Birthday!! @DeKeyser5  Miss youuu http://t.co/GBVylerhet", "Wed Feb 06 22:01:46 ": "@MBeurmann you won't be complaining when you don't have to go to class", "Wed Mar 13 17:33:01 ": "Hopefully this means the Lions will have  a running game! #Reggie", "Wed Mar 13 23:33:20 ": "#WMU students get your @wmuhockey playoff tix at Waldo stadium ticket office from 10-5:30pm. $5/game, must have bronco ID #LawsonLunatics", "Fri Feb 22 21:54:21 ": "Big home series against Notre dame this weekend, tonight's being broadcast by CBS college sports, check us out at 7:30 #GoBroncos", "Mon Apr 15 04:03:54 ": "RT @Jtootoo22: Thank you Nashville fans for all your support. Always great to see many familiar faces.", "Sun Feb 03 21:35:58 ": "@JerryKuhn35 @amandalyneab congrats you 2, well done kuhner!", "Mon Jan 28 03:32:52 ": "Alright wmu, it's freezing rain/snow/thunderstorm outside let's just all agree to cancel classes for tmrw #GoBroncos!", "Thu Feb 21 01:18:28 ": "RT @RobFacca: Please RT- Here is info about this weekends Ice Duchenne event at Western Michigan. Great PSA! #nobaddays #Louie  http://t ...", "Fri Jan 18 17:42:47 ": "RT @JulieRobenhymer: People, hockey season doesn't start tomorrow. It started in October. It is, however, NHL Season Eve &amp; that is s ...", "Thu Mar 14 20:24:15 ": "@MBeurmann can't change what's working, long hair and facial flow, must be #playofftime", "Tue Feb 05 22:04:29 ": "You can never have enough lake effect snow #love every second of it", "Tue Feb 12 22:33:40 ": "RT @kidrauhlscrowd: Just by tweeting #BellLetsTalk or retweeting tweets with that hashtag, 5 cents gets donated to mental health program ...", "Sun Apr 07 20:46:53 ": "RT @SteveOwczarek: Like a little kid. Waiting to see my buddy's first NHL home game #DeKeyser @DeKeyser5 http://t.co/8zRrsUn2XT", "Thu Feb 21 01:25:35 ": "Ice duchenne weekend is here, check out the link to help my assistant coach (@RobFacca)'s son Louie or to donate http://t.co/EqePgbrYPU", "Tue Jan 29 13:59:02 ": "@MiHockeyNow nice pic, thanks alot", "Thu Feb 14 15:35:28 ": "RT @MiHockeyNow: .@USAHockey's Hockey Weekend Across America starts tomorrow - who's wearing a jersey to work/school?", "Sat Feb 02 16:45:50 ": "RT @DennisBrown11: \"Don't be mad just cause you want the TV back\"- @DeKeyser5", "Sun Apr 14 16:34:45 ": "RT @ShooterMcGavin_: Another great sports moment that occurred 17 years ago on this date http://t.co/ZIhD3ovUYn", "Thu Apr 04 16:01:44 ": "RT @MBeurmann: Please take this survey for my marketing research class! https://t.co/Ha4ufKoOrD", "Thu Mar 14 20:20:55 ": "@PartyAtWMU What better way to start off your st Patty's day weekend than your broncos taking on those wolverines from UMich?", "Mon Mar 18 17:08:58 ": "RT @ShooterMcGavin_: 24 days until ‘The Masters’", "Fri Apr 19 23:51:13 ": "@M_Leone2 @berschy24 @HaarDaddy4 body by tim workouts start yet?", "Sun Feb 03 04:28:03 ": "RT @hounds91: Played at Ferris today...Got to see @DeKeyser5 play!#nicestitches", "Tue Mar 19 22:58:21 ": "@berschy24 how much Taco Bell do you think you could get for the price of that?", "Fri Mar 01 01:21:42 ": "RT @MiHockeyNow: These guys this weekend. @WMUHockey http://t.co/90eVvXx0qS", "Fri Mar 01 02:30:05 ": "@SteveOwczarek @bsullivanucf well that weather makes me feel better atleast", "Tue Mar 05 17:15:09 ": "@MBeurmann hopefully you are soaking up the rays down there...No ☀ up here just lots and lots of ☁❄☔", "Sun Mar 03 06:14:09 ": "@NastyNesto haha hey I haven't had a good pic in forever", "Thu Mar 14 21:08:59 ": "@mbeurmann @chaser9216 you might need a pick for that mop job you got going on #whatisthat #terrible", "Fri Feb 15 03:23:01 ": "RT @L28witko: @erinblew asked for help with her homework assignment. What do you think @DeKeyser5 can u help? @realbeeberfever ?? http:/ ...", "Sun Apr 14 01:49:14 ": "Congrats former teammate and fellow Michigander clinton bourbanais for scoring the game winner in the national final for Yale @clintdog15", "Thu Mar 07 22:33:42 ": "@J_Goryl33 thanks big guy!", "Mon Apr 01 17:37:17 ": "Good day to be in the D! #openingday #GoTigers #GoWings", "Sun Jan 27 04:18:01 ": "RT @beckyy_shem: Our hockey team is bomb 💣 maybe next time wolverines", "Sat Jan 26 21:02:49 ": "RT @MiHockeyNow: Happy birthday to the greatest place on Earth for hockey. Michigan turns 176 today. #176YearsOfAwesome #MittenPride", "Fri Mar 08 04:49:59 ": "@secksycanI @rkesti thanks alot yoopers!", "Sun Feb 03 23:28:27 ": "Why do they have to use Roman numerals, just put the number 47 after superbowl, way less confusing", "Tue Jan 22 01:52:52 ": "RT @Drew_on_WMU: See photo of Superbowl coach John Harbaugh and father Jack on #WMU sidelines in  1980s | http://t.co/dPkgiNtV", "Sun Jan 27 04:13:21 ": "Some of the best fans in the land right here @Lawson_Lunatics are the best. Thanks for a great weekend once again! http://t.co/dr2OTspR", "Wed Jan 23 03:14:02 ": "It's been snowing in kzoo for like 3 days straight now #sheesh", "Tue Feb 12 02:39:11 ": "RT @heather_m_marks: Downtown dinner with @chaser9216. #gottabefresh http://t.co/SAIg4Ikh", "Thu Feb 21 02:29:32 ": "RT @dwalt23: Proof he does his homework @Dekeyser5 http://t.co/MA9bhrLeZ7", "Thu Feb 14 01:40:32 ": "Jessie J Domino just came on the radio and reminded me of @Kaner19 and the old days #hispartysong #goodtimes #beauty", "Wed Jan 30 22:03:41 ": "@ktrumble16 sorry bud!", "Wed Jan 23 22:41:25 ": "RT @MensHumor: #WordOfAdvice Whenever a woman says “do whatever you want” do NOT do whatever you want.", "Wed Jan 23 14:51:17 ": "Good luck parking services and Buskirk on writing parking tickets today, keep your snow brushes handy!", "Mon Jan 28 22:55:23 ": "“@MensHumor: 10 times out of 9, people are exaggerating the story.” @realbeeberfever ?", "Sat Apr 06 17:18:07 ": "Unforgettable experience playing in my first NHL game last night, was a night I will never forget. Thanks everyone for the support #GoWings", "Sun Feb 03 19:17:19 ": "@brizznickka ha nice I didn't know at first", "Sun Apr 21 21:33:26 ": "Good to be back in good ole' @PureMichigan big week ahead!", "Thu Jan 31 14:14:03 ": "People that say they despise snow are the first ones to tweet about a snow day #fairweatherfans", "Thu Mar 14 15:39:17 ": "RT @_Happy_Gilmore: Greg Jennings will most likely sign with Vikings if he can pass their physical which involves 45 push ups with a jet ...", "Thu Feb 07 15:38:47 ": "Never a good sign being the last person to turn in your test of a 150 person lecture hall", "Wed Jan 23 03:43:12 ": "RT @L28witko: Ol dirty Dan the garbage man @DeKeyser5 caught in action. @droops21 http://t.co/QaODfZv3", "Sat Mar 30 20:50:31 ": "@dwalt23 thanks bud good luck this week yourself, #gogetem", "Fri Feb 08 12:55:23 ": "RT @PureMichigan: Happy Friday! RT this if you're loving the #snow today.", "Tue Mar 19 14:06:07 ": "Just went back through my notes and papers from this semester and noticed I've been putting '12 as the year for the last 3 months #getwithit", "Tue Mar 19 15:25:57 ": "Stop and look both ways people. How does this happen at a 4-way stop on campus, really? http://t.co/mzLWVsLcgA", "Tue Jan 15 17:33:09 ": "@Shannon_Hogan is that game going to be on TV or no?", "Sat Jan 26 21:10:19 ": "Game 2 against Michigan tonight at 7:35. Lawson will be rocking, get there early or check it out on FSN Detroit #GoBroncos!", "Thu Feb 21 01:25:56 ": "RT @L28witko: This little guy is @RobFacca 's (my assistant coach) son Louie. He has Duchenne. Check link: http://t.co/LtoOlhIOkj http:/ ...", "Thu Jan 24 15:30:14 ": "@FontyFresh @bodnarwmu you can thank @L28witko for that one", "Fri Jan 25 20:48:08 ": "At 7am you're waking up for math class, by 7pm you're in a showdown against Michigan at Lawson Arena. See you there, #LetsGoBroncos!", "Wed Jan 16 23:10:40 ": "Don't start packing up yet, I still have 23 seconds", "Fri Mar 01 01:26:36 ": "Have fun in the south on the sandy beaches everyone, spring break so that means more hockey and more @PureMichigan", "Sat Jan 19 16:12:19 ": "Welcome back NHL, nice to finally watch some games again #missedya", "Wed Feb 20 16:11:42 ": "@mhennessey15 I wish I could, but I can't. I'm sorry...", "Tue Mar 19 23:44:37 ": "@berschy24 @chaser9216 I was thinking either that, or a variety pack of 50 count Doritos?", "Tue Jan 22 15:13:40 ": "Forgot that today is already Tuesday. I could definitely get used to this whole \"Monday off\" thing that's for sure.", "Thu Feb 21 16:40:52 ": "@mhennessey15 and the only reason is because it would be an ncaa violation", "Thu Jan 24 22:03:17 ": "Outdoor practice today @heather_m_marks @MBeurmann ? Nice day for it #GoodLuckFindingYourBall", "Wed Jan 30 22:24:02 ": "Get this nasty, ugly rain outta here and give me some snow! #IllTake2Feet http://t.co/nLFc5xQK", "Fri Jan 25 17:11:01 ": "@patricknagorsen there's only one problem, that requires a goal first", "Wed Feb 27 15:04:17 ": "Why do parking officers think it's cool to ruin people's days? Find something better to do. Like big Daddy says #IveGotARealJob!", "Wed Jan 23 22:57:10 ": "Hour and 15 minute class with 2 slides....Boooring. Only thing left is for this snow to hit us hard tonight and hope for a #snowday tmrw", "Fri Mar 15 12:23:41 ": "@themoore_uneed ha thanks brotha hope everything is going good, hope you still got that flow going #beauty", "Thu Feb 28 14:39:36 ": "Class, then a trip to east Lansing for the weekend with the boys for a big series against Michigan state #grindtime", "Wed Feb 27 03:40:05 ": "“@CommonHkyPlayer: *goes game 7 in pond hockey but tells his friends he's not trying*” @joshpitt10", "Fri Jan 18 03:10:25 ": "Watching a few episodes of impractical jokers, these guys make me 😂 so hard #hilarious", "Thu Jan 31 18:43:40 ": "RT @kananmj: “Probably the most meaningful three years I had in coaching or my life,” John Harbaugh said this week of his time at #WMU @ ...", "Tue Mar 12 21:21:50 ": "RT @Hockey_Humor: 11 games on the NHL schedule tonight. Who's ready for a night on the couch?", "Tue Jan 29 13:57:57 ": "RT @PureMichigan: Good morning!", "Thu Jan 31 13:53:07 ": "RT @KAMIKAZEMadMax: @DeKeyser5 looks like you got your snow day! #Miraclesdohappen", "Sat Feb 02 16:53:00 ": "RT @MikeCichy: Happy birthday to @heather_m_marks boyfriend @chaser9216 #finally21", "Thu Feb 21 03:31:58 ": "@bsullivanucf reppin the knights sull you'd be proud", "Mon Jan 28 15:25:05 ": "@beckyy_shem Thanks!", "Thu Jan 17 23:49:36 ": "\"Oh hey squirt!\" @berschy24", "Thu Jan 17 00:26:35 ": "Good to see @SilkySmooth25 back out on the court again tearing it up. He's battled through alot #broncos", "Fri Mar 15 19:18:39 ": "Big tilt tonight at Lawson against Michigan to open the playoffs! Game's at 6:30 on fsn Detroit. #GoBroncos!!", "Sat Apr 20 16:55:47 ": "@Yanick51 yes please do, thanks", "Fri Apr 12 14:48:30 ": "@joshgracin thanks man, way to rep wmu yourself, always a good day to be a #bronco", "Tue Mar 05 17:04:54 ": "@Kaner19 don't get sick!", "Tue Jan 22 13:26:36 ": "Ugh these are the days I check my email every 2 minutes just hoping classes are cancelled 😤 http://t.co/uyudoW5m", "Wed Jan 23 13:11:12 ": "Come on WMU! Mix in a snow day like once every 10 years!! ❄❄⛄⛄ #NonStopLakeEffect", "Thu Apr 18 21:27:04 ": "Not around for finals this semester, but just thought I'd give a shoutout to all the broncos grinding it out this next week #wmu #kzoo", "Sun Feb 03 04:22:55 ": "@Drew_on_WMU haha lets hope so", "Thu Feb 21 13:30:55 ": "Just stepping foot off the bed in the morning is half the battle", "Thu Jan 24 01:44:27 ": "Just knocked out a 2 hour math tutor sesh with @BWards27 thankfully @DK1Ate is on our team and knows everything #rocketappliances"}