{"Sat Apr 20 00:49:08 ": "RT @GabrielPomerand: Lives have been lost, only assholes would make jokes about this.", "Sat Apr 20 00:49:24 ": "@GabrielPomerand ok, you got me. I'll leave you alone", "Wed Apr 24 01:25:51 ": "@StvX NO! as far as i know it is being moved and maybe into a rad spot. more soon.", "Fri Apr 19 23:25:01 ": "@TAIREIsDOPE @j_tsar yeah sorry, spreading sickness. Seems insane. Who are these other evil twitter people?", "Mon Apr 22 11:29:02 ": "@spideretc somebodies up early", "Wed Apr 24 00:13:16 ": "LEarn ALL My QUick SECRETS 4 STAYING THIN ALL WINTER LONG!!! 1. EAT TONS OF SUGAR. 2. EAT PILES OF MEAT 4. STAY HYDRATED 3. LAY ON THE COUCH", "Mon Apr 22 18:37:33 ": "had they installed video cameras in public places in the 70s I would never have been born cause my parents only had sex in parks", "Sun Apr 21 03:42:44 ": "@jiyahkelly @thisisjohnbook there's always next time", "Sat Apr 20 01:22:23 ": "how about we Don't report what hospital he is at", "Tue Apr 23 21:33:05 ": "hippy on the line http://t.co/QospCQUcZA", "Tue Apr 23 22:04:52 ": "i am grateful for the defenders", "Sat Apr 20 00:13:23 ": "@GabrielPomerand I couldn't sleep last night cuz Twitter had me convinced the bomber was a friend of friends of mine, this shit is too much", "Fri Apr 19 23:58:18 ": "@jameskeithford @cnn no I'm a fool, I'm just sitting in a make believe tower filtering the same poison shit as everyone else! But thanks", "Sun Apr 21 00:48:38 ": "I'm pretty sure my cat just said \"rrrrrhode island!\"", "Tue Apr 23 22:41:37 ": "@spider_cider @footvillage what a jerk!", "Sat Apr 20 00:39:04 ": "I'm going to make another joke", "Sat Apr 20 01:04:30 ": "this isn't the beginning or the end", "Mon Apr 22 18:22:45 ": "they moved from a hard gridded tile area to a vast soft furry area, where they were given a map by a man with furry lips", "Wed Apr 24 14:11:59 ": "a sneeze broke my glasses. The glasses store got robbed and I was kidnapped. The kidnappers drove off a cliff. I found a sunken treasure", "Tue Apr 23 02:09:41 ": "you can blow your friends but don't blow your friend's circuits", "Tue Apr 23 21:23:29 ": "Hey @footvillage this Black Pus 0 Ultimate Beat Off test pressing sounds sick. Thanks. Now.... Covers", "Sat Apr 20 03:54:50 ": "@NateBell4AR you are truly a douchebag, sir", "Wed Apr 24 15:47:28 ": "his speech was slow all day, and I noticed he was leaving an oily residue everywhere he went. Thought I saw a slimy tail wiggle in his ear", "Mon Apr 22 03:34:14 ": "it's a dye or get dyed world", "Fri Apr 19 23:57:00 ": "@GabrielPomerand I'm sorry. I've been trying to walk a serious line,feeling very shitty about it all, but that line just really grabbed me", "Sun Apr 21 21:34:32 ": "Really? http://t.co/Xxx1KnUPxq", "Tue Apr 23 22:03:46 ": "you give someone a present who has expectations about it and nobody is happy", "Sat Apr 20 01:14:03 ": "@spideretc gonna punch you again later tonight Ddogg . And you @AlexiconTom", "Tue Apr 23 22:36:42 ": "@nufable_jp been feeling Bastardous", "Sun Apr 21 02:55:04 ": "@colinpeden uhg. Yup", "Sat Apr 20 01:08:55 ": "@spideretc be good to people Mickey. I think I dislocated a knuckle punching you. You're too firm", "Sat Apr 20 00:46:11 ": "RT @Boston_Police: Suspect in custody. Officers sweeping the area. Stand by for further info.", "Mon Apr 22 00:56:50 ": "@hola_soymilk \"I've arrived\"", "Sat Apr 20 00:03:34 ": ".@GabrielPomerand I hope he's alive, I wish his brother was alive, I wish everyone who died this week was alive. I said nothing otherwise", "Sun Apr 21 22:25:48 ": "@hola_soymilk that thing just showed up a week ago. Out of the blue. I'm now the official Chirpendale representative", "Wed Apr 24 18:53:22 ": "\"We like spring cause its open hunting season on bicyclists\" - Cars", "Tue Apr 23 23:46:30 ": "Quick Secret to Staying Asleep ALLNIGHT Bike UpAndDown Big Hills In the DEEP NIGHT Then take HOTTEST SPERM KILLING SHOWER EVER. pass out", "Tue Apr 23 22:24:38 ": "@footvillage @spider_cider i just want critics to give it a couple listens and talk about specifics. that's all .then they can trash it.", "Sun Apr 21 21:32:59 ": "grasshands http://t.co/PE05Dpg9UL", "Wed Apr 24 15:25:36 ": "she's not hungry this morning. Perhaps she killed and ate a wild bird", "Mon Apr 22 00:56:23 ": "yeah I'm at your costume party, dressed as a more than convincing wall", "Sat Apr 20 18:19:26 ": "fuck the pigs http://t.co/vD6veLeiL5", "Tue Apr 23 18:45:08 ": "new Wolf Eyes is good Wolf news http://t.co/69cDZmKyPD", "Mon Apr 22 01:23:22 ": ".@fleetwoodzakk you gotta be careful drinking the water up here, I've been pissing in the reservoirs for years", "Wed Apr 24 14:00:19 ": "skin is amazing", "Tue Apr 23 15:46:27 ": "i'm too big to slip into my phone and follow this spam text (lose weight quick!) back to its source to strangle the sender", "Tue Apr 23 19:18:38 ": "for no real reason", "Sat Apr 20 07:20:57 ": "stupid kid", "Wed Apr 24 01:44:57 ": "we've been alive the whole time", "Sat Apr 20 01:00:23 ": "I feel elation that suspect's alive to defend his case, and so the abstract force \"life\" wins one small battle. With all respect to victims", "Sat Apr 20 00:27:31 ": "RT @JasonKendall: This is crazy tense. Please, no more deaths.", "Fri Apr 19 23:39:26 ": "i hope they bring him in alive", "Mon Apr 22 01:01:50 ": "you didn't see me watching you brush your teeth? I've got this perfect soap dish outfit", "Sat Apr 20 07:19:06 ": "if you get up the stairs before the door closes behind you something positive will happen", "Tue Apr 23 23:09:29 ": "my brains commute to space everyday is wearing me down", "Sat Apr 20 00:15:52 ": "it's cool, I delete tweets too.", "Wed Apr 24 01:19:18 ": "the van is a touring bands most important instrument", "Tue Apr 23 21:49:10 ": "my album got trashed in a video! but a Pus Hero defended it in a new comment! go thumb up the comment!! or not! http://t.co/27TZVK8ojM", "Wed Apr 24 01:02:47 ": "@alexisnorman haha!! Thanks !!! I still like him as a reviewer most of the time, he's a funny guy", "Wed Apr 24 14:07:08 ": "it's not how good I slept, it's not how well I ate. It's all about how nice the weather is", "Sun Apr 21 02:09:25 ": "I hated this week. Lost lives, lost limbs, and a blood soaked 19 year old hiding in a boat, having made the worst decision of his short life", "Sat Apr 20 02:30:28 ": "RT @ElaheIzadi: Obama's comments on not labeling entire groups of people the most bold pronouncement of this kind made by a high-ranking of…", "Wed Apr 24 01:10:31 ": "this stuff is legit!! http://t.co/YiOL2bQHiJ", "Tue Apr 23 22:52:08 ": "@jiyahkelly @cory_drinksalot oh man that's my favorite mic", "Sat Apr 20 00:00:37 ": "@GabrielPomerand read my other tweets or loose respect, whatever you wish", "Mon Apr 22 01:01:59 ": "RT @footvillage: @AhaFan88 \"I must be drunk, that wall looks like it's tweeting.\"", "Wed Apr 24 15:48:30 ": "Oh my god I can print a 3D printer with my 3D printer", "Tue Apr 23 21:52:47 ": "hahahahahahahahahahaaa!!!", "Tue Apr 23 17:10:09 ": "he lost his third eye to adulthood but he still saw some phantom pain", "Fri Apr 19 23:55:49 ": "unless of course you're looking to escape into something other than a land of the living", "Fri Apr 19 23:32:34 ": "@OnPointRadio what scares me is if you read the suspects twitter feed @j_tsar, there are other malicious twitter accounts in support of him", "Fri Apr 19 23:51:57 ": "dude you gotta put the boat in a body of water if you want to escape in it", "Wed Apr 24 01:15:34 ": "@quartertonality grab the phone", "Mon Apr 22 19:39:03 ": "RT @Lazybastid: Oh, humanity.  MT @karenmcgrane: Last two speakers of dying language refuse to talk to each other. http://t.co/hhxDJYC7n7", "Wed Apr 24 16:22:28 ": "FUCK YEAH!!! my Twitter just got updated to VEVO!!!!!!", "Tue Apr 23 21:53:04 ": "RT @RicRoyer: Food Court humor: \nknock knock.\nWho's there? \nOrange. \nOrange who? \nOrange chicken, try a free sample!", "Tue Apr 23 22:02:07 ": "my face hasn't changed a bit since yesterday, and yesterday it was the same as the day before. I looked. Nothing is different day to day", "Tue Apr 23 22:49:21 ": "I'm in the kitchen cooking listening to a news report on how no one cooks anymore", "Sat Apr 20 15:30:49 ": "@Andrea_RN @natebell4ar true! Sorry!", "Wed Apr 24 03:52:04 ": "I may have to report my friend here to the fart police", "Sat Apr 20 01:13:22 ": "\"God bless America\"? I don't know....how about....\"Spirits everywhere bless LIFE\"", "Tue Apr 23 21:56:34 ": "@Cory_Drinksalot I guess so! I don't mind people trashing my music but at least put a couple minutes into it and hit me with some specifics", "Sat Apr 20 01:01:16 ": "I can't believe how much I've been tweeting", "Sat Apr 20 00:41:29 ": "meanwhile in a Watertown MA backyard, suspect is apparently holed up in a boat that is a full scale replica of the Titanic", "Wed Apr 24 15:51:05 ": "RT @jessevondoom: @AhaFan88 This is how the world ends. Not with a whimper or a bang, but with an infinite pile of 3D printers printing 3D …", "Tue Apr 23 21:24:22 ": "is it better to blow than suck? tough questions", "Wed Apr 24 15:50:42 ": "my 3D printer is printing out another 3D printer but I didn't ask it to", "Sat Apr 20 01:08:06 ": "RT @spideretc: @AhaFan88 its always the middle", "Fri Apr 19 23:39:08 ": "@TAIREIsDOPE twitter is surely not to be trusted. if some are jokes, they are cruel uneducated jokes. Obviously a lot of people hate the US", "Sat Apr 20 00:45:37 ": "@spider_cider I might have been too late with that one, seems like they might have him , alive", "Sat Apr 20 22:00:29 ": "RT @Lord_Giovanni: @AhaFan88 for a good time ask the crazy crystal lady about 'cumberlandite,'", "Tue Apr 23 02:13:40 ": "time for a quick inspection; I don't seem to have any rust on my body, i'm not leaking fluids and I don't stall out on the bumps. ok, good.", "Mon Apr 22 01:20:00 ": "I'm hiding in that copy of Game of Thrones on your coffee table", "Tue Apr 23 03:18:52 ": "grudge http://t.co/jp2bDCgfKI", "Tue Apr 23 21:55:33 ": "i can't seem to get addicted to anything right now and it's causing me problems", "Sat Apr 20 01:00:35 ": "when I get nervous I tell jokes", "Mon Apr 22 01:02:53 ": "I bought the google glass that comes with the full body shrinkage feature and the black hole bag", "Tue Apr 23 20:13:05 ": "I'm told @RicRoyer is the King of the Food Court but I am here in the mall in that very court and the man sitting on the throne is not he", "Wed Apr 24 01:53:07 ": "RT @tindesert: Should I get an ice cream cone tattooed on my face?", "Mon Apr 22 03:52:42 ": "@thejc3 we were fixing some garden paths. Man, sorry I haven't gotten to the Goalie stuff yet!!"}