{"Sun Mar 17 00:20:17 ": "performing for SXSW Lamberts 9:05pm to 9:45!", "Fri Sep 14 23:19:58 ": "I'll be singing and playing at the Driskill Bar tonight from 9 to 11pm -  Meet me early for a cocktail!", "Fri Jul 20 20:58:23 ": "We play at 10pm tomorrow night with the fabulosos \"Big Sandy and the FlyRite Boys\"! Continental Club Austin Saturday the 21st", "Tue May 22 20:17:42 ": "Happy Hour with T Jarrod Bonta and Jim Stringer at the Broken Spoke this evening, 6-to 8pm. My set starts at 7 with these awesome players.", "Sun Apr 01 02:57:11 ": "Duff's garage in Portland Oregon tonight! Marti Brom and I on a rockabilly rampage!", "Fri Jul 20 21:06:25 ": "@leonijansen \nThank you love, I know you feel it all the way over there in the Netherlands.", "Sat Dec 31 19:42:27 ": "James Intveld and I will be singing n ringing in the New Year tonight at Big's Grill in Fullerton, & Karling and the Kats!", "Sat Feb 09 19:27:13 ": "http://t.co/av4rZkMK", "Fri Sep 28 17:03:17 ": "http://t.co/XTQYKkU", "Thu Feb 14 18:22:39 ": "Friends,Hope you know  that you are loved and appreciated in my life.", "Thu Jul 26 20:37:52 ": "Claim your 30% off on carpet, tile and upholstery cleaning at Green Steam! http://t.co/USDlkmq", "Thu Jul 19 02:53:28 ": "@AndyKindler how do we get you and Susan Maljan back to Austin?\nThis town needs some KindlerMaljan around!", "Mon May 07 19:33:18 ": "Performing Tonight for Ronnie Macks- Gene Vincent/ Eddie Cochran Tribute at Joe's Bar in Burbank on Magnolia blvd.", "Thu Mar 08 17:09:14 ": "Hey FB friends in Austin~\nTONIGHT Continental 6:30-9:30 the magic  Casper and I join forces on them strings", "Mon Apr 22 18:53:34 ": "Tonight: The Four Seasons lounge presents my Blue Moon Jazz Combo with T Jarrod Bonta, Jim Stringer, Larry Eisenburg, and me", "Sat Jul 07 23:25:56 ": "My White Horse showtime tonight is MIDNIGHT after Ruby Dee and the Snake Handlers", "Sun Apr 14 01:40:31 ": "Playing the 10pm slot tonight at the White Horse, Austin's eastside rockin Honky Tonk! Wayne Hancock at Midnight!!", "Wed Sep 05 20:03:47 ": "\"Working Girl's Guitar\" is being premiered over at MTV Hive, right now: http://t.co/qkZe6dZ", "Wed Nov 14 07:09:37 ": "Gonna be a blast and an honor!  https://t.co/iPnLY4l", "Thu Dec 06 23:11:50 ": "Steve Poltz tonight at The Saxon Pub 9pm http://t.co/510nKIX", "Sat Feb 09 19:32:15 ": "Austin Scottish Rite Theater 1pm on Sunday, Rosie Sock Hop for the kids!", "Fri Jul 20 20:58:13 ": "My heart is so heavy for the families and friends in Colorado. It will be remembered for a very long time.", "Tue Feb 19 01:15:04 ": "Scoot Inn 7:30 Saturday night!! http://t.co/5r4c9AdC", "Tue Nov 15 05:23:54 ": "Started recording my record in Minneapolis today, so exciting and so fun!", "Fri Nov 02 01:29:35 ": "Gettin ready to rock Knucklheads in Kansas City with Marti Brom http://t.co/GiiDSCg", "Fri Nov 02 01:29:48 ": "Gettin ready to rock Knucklheads in Kansas City with Marti Brom http://t.co/vM73FkU", "Tue Nov 13 19:38:25 ": "Yay!", "Mon Feb 18 21:24:24 ": "@adogsmile lovely to know you for so many rock rolll years! Since 76.. lee barns-the screamers!", "Wed Mar 13 02:15:15 ": "Luv u leoni", "Fri Sep 28 17:05:17 ": "This Sundays' Weekend Edition at 9:45am please listen to my broadcast with Rachel talking all about our Janis Martin's new release out now!", "Sun Jun 17 02:13:24 ": "White horse in Austin 10 pm tonight \n500 Comal", "Thu Feb 02 18:13:46 ": "No shows as of now im working on some projects here in austin", "Tue Dec 11 15:13:12 ": "Rosie Flores with Dallas Wayne on SIRIUS/XM  - Outlaw Country (#60) will be airing on Tuesday 12/11, 9 AM ET + Thursday  12/13, 8 AM ET", "Fri Oct 26 17:13:54 ": "http://t.co/nCxXQ9V", "Thu Mar 08 22:48:26 ": "No plans for LA at this time, give me your email and ill put you on list honey  xo", "Thu Jul 19 02:45:43 ": "@dannybharvey \nwe miss you down here in Austin Danny B, rock on bro!", "Sat Jan 26 20:18:26 ": "Slick n Flores on the Trussart guitars at NAAM http://t.co/0keBVW1", "Sat Feb 23 18:13:23 ": "JOin me and the Rivetors tonite-Scoot Inn Austin,Tx 7:30pm", "Sun Dec 02 01:49:20 ": "Hitting the stage with Marti Brom for our JAnis Martin Tribute CD release show the Continental Club at midnight.", "Thu Nov 17 19:02:06 ": "Excited to play some new songs at Lee's Liq Lounge in Minneapolis tonight!\nNov. 17th is finally here :D", "Sun Mar 10 00:53:54 ": "I'm too sick to perform tonight folks, cancelling the White Horse in Austin :(\nbooooooo!", "Sun Mar 10 18:54:04 ": "Back in the saddle today for my show at Continental club 3:30pm, here goes somethin!", "Mon Jul 30 05:38:27 ": "@MichaelKeaton \nthanks for remembering me in the Grantland interview  xoxo", "Thu Jul 26 03:32:46 ": "Hint hint..Continental Club in Houston with Mike Stinson Friday night :)", "Tue Dec 11 15:05:41 ": "Rosie Flores  with Bill Cody on WSM 650 in Nashville on Thursday, December 13th 9:15am\n http://t.co/EbttVCH", "Thu Aug 02 01:13:18 ": "Join me at Sahara Lounge tonight from 10pm for my Trio Deluxe Juke Joint Jam! http://t.co/9MpJnhB", "Fri Feb 08 18:05:49 ": "Relix - Features - Woman At Work:   Rosie Flores\n   With the title latest album Working Girl's Guitar\n   http://t.co/3RbXGN2s...", "Thu Feb 07 07:54:58 ": "Woo hoo!!\nhttp://t.co/TDMaSuRw", "Thu Dec 29 23:32:45 ": "http://t.co/hTIuxEF", "Sat Sep 29 15:46:20 ": "Rosie Flores on NPR's Weekend Edition Sunday talking about the late Janis Martin and her final album, the Blanco Sessions 9:45 ET", "Thu Apr 05 23:50:09 ": "Luckenback Texas! Friday night the 6th singing with guest Ruby James! 8pm to 11:30!", "Thu Sep 27 00:24:22 ": "My new single is finally out! Dig this!! http://t.co/PScf8P2", "Sat Apr 21 21:51:17 ": "Rosie Flores &The Rivetors playing The White Horse- Tonight in East Austin! Special Guest, Greg Leisz on pedal steel midnight show", "Mon Dec 05 14:31:04 ": "RE: Dec 5th-Playing in San Antonio tonight at Sams Burger Joint Swing night at 8:30!\nPatricia Vonne will be joining me on vocals and guitar!", "Mon Jul 16 01:13:04 ": "when it rains in Austin...I just plain smile more", "Tue Jul 24 17:34:28 ": "Hi everybody getting ready to ship Janis Martin to the Kickstarter folks!!!!", "Sat Dec 10 02:15:19 ": "Dec. 9th=Heading down to the Mercy Lounge in Nashville  to sing for Imagine No Handgun Violence/ John Lennon Tribute.", "Tue Jan 03 01:11:27 ": "Tonight!  Ronnie Macks Anniversary Barndance. I'm singin around 10:30pm\nJoe's American Grill in Burbank, CA", "Sat Jul 28 00:35:02 ": "Us too its fun!", "Thu Mar 28 06:43:07 ": "http://t.co/WhJUyZQaYD Vote for me please :)", "Sun Sep 30 15:35:44 ": "http://t.co/nZFH0XT", "Fri Oct 26 20:14:09 ": "Sweet love the McPherson! I approve this message", "Wed Oct 10 01:25:43 ": "http://t.co/PBkk4RD", "Tue Dec 11 03:37:41 ": "Women of the Bakersfield Sound Take Center Stage at Country Music Hall of Fame and Museum http://t.co/TJJtP1m via @sharethis", "Wed Mar 28 23:30:21 ": "Seattle's Slim's Last Chance is where Marti Brom and I will be singing on Friday night the 30th- great music great chilie!!", "Sat Mar 24 01:00:29 ": "Rosie and the Rivetors Tonight at 10pm at the White Horse in East Austin followed by Roger Wallace!", "Sat Mar 17 18:40:28 ": "Rosie and the Rivetors -Austin Java House on Barton Springs \nreckless sweaty rocknroll!  Showtime 8:15! +guitarist Anne McCue", "Tue Nov 27 02:59:06 ": "Rosie Flores performance on KUT radio 11/27 at 2pm CT  \ntune KUT at 90.5 FM in the Austin area, or on-line at: http://t.co/cJddjJ5", "Mon Jul 16 01:17:13 ": "@GeorgeHarrison \nI just recorded While My Guitar Gently Weeps, thanks for writing such a gorgeous song to play and sing!", "Fri Jul 20 21:05:07 ": "Thank you love", "Mon Sep 10 18:10:45 ": "Danny b and me for birthday lunch at Patsys cowgirl cafe,  come see us play at Cont Cub tonite T 10!! http://t.co/NVmATQv", "Sat Jan 12 19:28:25 ": "Come to the Moody Theater for a celebration of 35 years of Alejandro Escovedo's music\n\nhttp://t.co/fO7c4HB", "Sat Aug 25 18:15:59 ": "http://t.co/LpL9AKm", "Mon Sep 17 19:08:19 ": "Joint me tonight at the Continental Club for my birthday celebration 10 til closing!\nAustin rocks!", "Mon Dec 12 15:58:40 ": "@dqkidd \n Have you seen our Austin Rocks video? http://t.co/ObwhPgQ", "Mon Feb 04 06:40:15 ": "Takes one to know one slickster!", "Mon Jul 30 21:20:03 ": "Please come to the my Juke Joint Jam at \"Sahara Lounge\" in Far East Austin Wednesday nights! BBQ Trailer too w veggie options!", "Sun Feb 03 00:03:53 ": "Im here now", "Fri Feb 03 17:13:15 ": "Yay you too . Love r", "Fri Oct 05 11:09:31 ": "@MichaelKeaton http://t.co/JxhBvWd", "Thu Feb 23 19:42:48 ": "Loving being in Memphis and heading to Folk Alliance for tons of fun!\nFYI- My set is at 9pm at Natchez just after Bill Kirtchen", "Tue Mar 13 00:27:56 ": "my SXSW showcase Tuesday night at FRANKS at 11pm!", "Tue Nov 15 19:30:32 ": "FYI~MInneapolis show at Lee's Liquor Lounge is Thursday night, headline slot.", "Thu Feb 14 18:23:02 ": "Tomorrow my Austin  friends are invited for a free show at Patsy's Cowgirl Cafe\n 6:30 to 8:30pm, great food great decor Patsy style!", "Fri Oct 05 11:09:06 ": "http://t.co/JxhBvWd", "Fri Aug 31 05:01:08 ": "Steel Drivers in Austin tearin it up at Antones!! http://t.co/qjKf0ek", "Sat Mar 17 15:46:53 ": "Will try i have too many shows ans meetings! But will try my shows are at my website :)", "Tue Sep 18 16:23:22 ": "Official CD Release TODAY for Janis Martin \"The Blanco Sessions\" http://t.co/BQ0BYUc", "Tue Feb 19 01:18:09 ": "The Austin Music Map comes to life with MapJam http://t.co/ZECuueeU", "Thu Oct 11 00:24:20 ": "http://t.co/hNNA4Bl", "Sat Aug 25 18:21:07 ": "ROCKIN THE  TRIO DELUXE Tonight at the WHITE HORSE in East Austin\nMidnight to 2am~ NO SISSYS!", "Wed Jun 27 20:48:36 ": "Join me  TONIGHT at the Continental Club at 10pm. My band plays before\nthe amazing and talented songwriter MIKE STINSON", "Wed Sep 05 20:04:25 ": "@MichaelKeaton  \n\"Working Girl's Guitar\" is being premiered over at MTV Hive, right now: http://t.co/qkZe6dZ", "Wed Mar 14 18:41:13 ": "I will be singing 2 songs at the Austin Music Awards show with Alejandro Escovedo -10:20 pm WEd. 14th!", "Tue Oct 02 20:03:11 ": "Just added: playing the Continental Club opening for the Supersuckers!! Lisa  We go on at 10pm, in time to rock!", "Mon Apr 15 20:04:36 ": "Tonight I'll be rockin the 4 Seasons lounge on San Jacinto Blvd... happy hour 6 to 8pm Sunset~awesome view!", "Wed Feb 29 17:40:11 ": "Hi leoni!! El paso is 12 hrs drive by car to austin. I will be around you can stay if you come, love to see you", "Sun Mar 10 16:26:56 ": "Thank you leoni kisses back to you and haarlem xxx", "Sun Feb 03 00:52:26 ": "Well actually phone is the only way. I can visit cause im taking the train to san diego tomorrow\nxo call me", "Sat Sep 08 16:33:04 ": "Tonight at the White Horse in Austin Texas at Midnight!\nRosie Flores and Trio Deluxe!!!"}