{"Tue Feb 12 10:03:54 ": "3. At the end of tour, Jimmy and I will pick our 5 favourites and send out 5 Pure Love packages!! Easy. Now get moving!", "Fri Feb 15 13:56:24 ": "@stephenswainjr I'll make the decision easy for you. Which show do you want to come to?", "Thu Apr 18 22:45:17 ": "@LaurenceHebberd yes! I knew I could count on you mate! Haha", "Mon Feb 11 00:17:17 ": "@smallngorgeous you're welcome. Glad you enjoyed yourself.", "Wed Feb 13 01:14:41 ": "We will be at the merch every night after we play. To meet you all, sell you merch and then write nice things on it! Thank you ALL!", "Sun Feb 10 15:28:31 ": "@_MirrorBoy you're welcome.", "Wed Feb 20 00:26:40 ": "RT @hermefes: may have two spare tickets for @therealpurelove, @turbogeist, at @Lepub tomorow...", "Thu Feb 14 10:23:26 ": "RT @PALOFFICIAL: Spreading love and joy by adding @passengermusic and @therealpurelove to #pal13 Happy Valentine’s Day! &lt;3 http://t.c ...", "Wed Feb 13 13:38:47 ": "@hunklebink permission granted.", "Wed Feb 13 18:09:13 ": "@LuckyStarGirl you are on the list.", "Sat Feb 23 19:36:52 ": "BEDFORD last night of tour. Let's get weird!", "Thu Apr 18 22:46:04 ": "@totaluprawr weird, pretty sure I'm in the van on my way home instead haha", "Fri Feb 22 14:34:57 ": "RT @Alli734: Got a spare ticket for @therealpurelove in Birmingham tonight!!! Can meet outside the venue, face value or a few drinks!!!  ...", "Mon Apr 15 20:36:05 ": "RT @hello__emily: Got 2 tickets for broco at koko, face value @DONBROCO @decadeofficial @therealpurelove rt please?", "Sun Feb 10 15:23:51 ": "@smallngorgeous you're on the list tonight.", "Tue Feb 12 11:09:20 ": "@KelKelWantsYou upload it to our Facebook then!", "Sun Feb 10 15:27:02 ": "@TomCrowther5 we're feeling generous so you got it too. See you tonight!", "Sun Feb 10 15:23:32 ": "@_MirrorBoy you're on list for tonight.", "Thu Feb 14 16:17:18 ": "We keep seeing a lot of familiar faces at more than 1 show! That fucking rules and you are amazing. Thanks for showing us so much love", "Tue Mar 05 17:42:25 ": "RT @firebrandlive: Pure Love (@therealpurelove) Brand New Limited Edition Screenprints now available online!... http://t.co/DUh0q6gc3v", "Thu Feb 21 16:41:19 ": "@curtjones_17 it's not sold out yet.", "Thu Apr 18 09:29:19 ": "RT @relentlessdrink: Here are your 2013 Relentless Artists: @professorgreen, @zanelowe and @therealpurelove  http://t.co/6SyZ8yDqsE http ...", "Sat Apr 13 11:47:36 ": "RT @53degrees: ..and supporting @DONBROCO tonight are @therealpurelove who are here for their 3rd show with us in 5 months. #weloveyoupu ...", "Mon Feb 11 17:19:25 ": "All of our upcoming shows can be found here: http://t.co/puZayXNy", "Tue Feb 12 10:01:29 ": "Competition Time.  Here are the steps to winning some Pure Love packages.\n\n1. Go and like our facebook page.", "Mon Feb 11 17:15:22 ": "Only a few tickets left for our Valentine's Day show at XOYO! Get em before they're gone! http://t.co/JRU3AwYJ", "Thu Apr 18 17:53:14 ": "Come on then London lets see what you're made of..", "Sun Apr 14 20:55:58 ": "Thanks Preston and Wolverhampton. And thanks @Donbroco for having us. We miss you baaabes", "Sun Feb 17 13:56:25 ": "@jon_vidler How about we put you on the list +1?", "Wed Feb 13 13:29:31 ": "OK. Who is coming to see us Norwich Arts Centre tonight?  Spread the word. Come down. Get loose. Have fun!  See you there x", "Thu Feb 14 21:01:29 ": "This is going to be fucking AMAZING. London, you look lovely tonight.", "Thu Apr 11 15:10:12 ": "RT @ZoeeeTurner: Got two free tickets for @therealpurelove tonight if anyone fancies it :)", "Tue Feb 12 23:44:25 ": "RT @_ReynoldsNick: I am selling one ticket for @therealPureLove at XOYO this Thursday. Any takers??", "Wed Feb 13 00:26:35 ": "RT @Radio1PunkShow: Here goes another awesome @Radio1PunkShow @OWTH acoustic @the_bronx, @snglmthrsgang @therealpurelove @wearepalmreade ...", "Mon Feb 11 21:48:17 ": "NOTTINGHAM TOMORROW. Who's coming out to party with us?", "Thu Feb 21 11:23:25 ": "RT @blondie3405: @therealpurelove anyone got spare tickets etc for tonight's gig in Bristol? Amazing album would love to see them. RT pls😘", "Wed Feb 13 13:38:30 ": "13 tickets left for the show tomorrow in London at XOYO! Get em quick and don't miss our first anniversary show!", "Sun Feb 24 16:06:29 ": "@KClarkzz the signed booklets will go out separately. Sorry for the confusion.", "Wed Apr 10 15:34:24 ": "MANCHESTER!! Are you ready for tomorrow? Hope you have your inflatables at the ready it's going to be chaos!", "Wed Feb 20 12:49:04 ": "RT @rhyssjoness: @Lepub Unfortunately I can't make it to @therealpurelove show tonight, so I have a spare ticket. RT please?", "Fri Feb 22 00:33:15 ": "BRISTOL that was insane. Highlight was watching Jared play drums 10 foot above everyone... You guys were amazing. We will see you next time!", "Tue Feb 19 17:31:13 ": "@sarahclaireyeah you have two tickets to the show tonight! Just say your name at the door! Thanks", "Wed Feb 13 18:13:24 ": "Stage times tonight at Norwich Arts Centre: the Vestals 8:00, Turbogeist 8:45, Pure Love 9:45.", "Tue Feb 19 17:18:26 ": "If you live in SOURHAMPTON and you want to come see us TONIGHT tweet is your full name right now. First 3 people get guest list! GO!!", "Wed Feb 13 09:43:59 ": "@ben_brice92 hello mate! How many Tickets do you need for tonight?", "Tue Apr 16 23:14:17 ": "@itchsspeeches good to see you tonight. Next time lets get a drink and a catch up. Be good!", "Sun Feb 10 15:16:23 ": "Who lives in Preston and wants to come to the show at 53degrees tonight? First 3 people to tweet us your first and last name get in free.", "Sun Feb 10 15:34:20 ": "@testedmelon yup. You and a friend are on the list under your name Tuesday.", "Tue Feb 12 12:50:54 ": "NOTTINGHAM. I'm feeling fucking Weird today. Get your arses down to the bodega tonight and witness absolute rock and roll carnage!!", "Fri Feb 15 00:58:12 ": "HAPPY FUCKING VALENTINES DAY! Our first anniversary show was a storm. We love you all you beautiful animals. See you next year! Thanks x", "Thu Apr 18 09:44:36 ": "Proud to be part of the Relentless family! Follow @relentlessdrink for news on gigs, comps, exclusive content and more.", "Wed Feb 13 10:11:48 ": "@ben_brice92 it will be you on the list with a plus 2! See you tonight.", "Thu Apr 11 12:19:10 ": "RT @firebrandlive: Pure Love (@therealpurelove) Brand New Red Heart T-Shirt now available on the official store. Also remember to... htt ...", "Mon Feb 18 19:17:05 ": "Who's coming out to rock and roll in Brighton tonight?  So close to the sea we want to see some good inflatables tonight!", "Wed Feb 13 18:10:42 ": "@EdChalu you are on the list tonight.", "Sun Apr 14 17:52:01 ": "We play at 8:15 tonight at Slade Rooms in Wolverhampton. Come see the much anticipated debut of Rastababy.", "Thu Feb 21 16:43:08 ": "To everyone looking for spare tickets to tonight's show in Bristol, it is not sold out yet! Get your tix at the door.", "Wed Apr 17 18:30:10 ": "RT @dalewilliams__: @therealpurelove @DONBROCO can you ask if any1 is driving from Cardiff to London for you tmrw and has room for two?  ...", "Wed Feb 13 17:06:29 ": "If you live in Norwich and want to come see us for free tonight at the Arts Center hit us back with your full name. First 5 people. Go!", "Wed Feb 13 18:09:41 ": "@jjbeeson you are on the list tonight.", "Sun Feb 17 19:18:42 ": "@jon_vidler you're welcome, see you then.", "Tue Feb 19 17:32:32 ": "Ok guest-list giveaway is over!  See you all tonight. Its gonna be messy!", "Sun Feb 10 15:25:10 ": "@testedmelon prove to us you bought it and we'll get you in Tuesday.", "Sat Apr 20 16:12:46 ": "Bristol! We are playing at Thekla at 9pm. Come rock the boat.", "Tue Feb 19 14:49:40 ": "RT @olobersyko: The new @therealpurelove album is real good, go listen", "Wed Feb 13 18:52:13 ": "RT @WeThreeClub: .@therealpurelove tour prints have been doing so well, there's another ltd ed. colorway available from tmw onwards! htt ...", "Sat Feb 23 01:03:24 ": "Birmingham you were out of hand! It was raining inflatables!", "Wed Feb 13 00:29:31 ": "NOTTINGHAM was awesome. had to stop playing because someone tackled Jared off his drum kit?  The best tour ever. Love you all x", "Mon Feb 11 00:16:27 ": "@ltpilkington you're welcome, thanks for coming.", "Thu Feb 21 00:47:07 ": "BEST PURE LOVE SHOW EVER. THANK YOU NEWPORT, THAT WAS FUCKING MENTAL!!!!  So much fun. Thanks Sam and everyone at Le Pub! Love x", "Tue Feb 19 00:03:16 ": "BRIGHTON was fucking mental. Thank you all for coming out and singing along  and staying around to talk to us. Happy birthday Neil haha!", "Fri Apr 12 10:44:44 ": "Thanks to everyone that came out last night. I thought the venue was going to collapse in on itself. Did you like our new song?", "Tue Feb 19 17:30:39 ": "@dandonnelly_ you have 2 tickets for tonight! Just say your name on the door!  Have fun", "Thu Apr 11 17:33:38 ": "New song is sounding heavy. We hope you like it Manchester. You were good to us last time, you set the bar high. Don't get scared!", "Mon Feb 11 00:14:18 ": "Preston! We love you. Thank you for coming and singing along to every fucking song while you danced yourselves silly around Jared!", "Tue Feb 12 19:11:01 ": "RT @bodeganotts: Psyched for @Therealpurelove tonight! \n\nSet times: \n\n7.00 - Doors\n7.15 - @TheVestals\n8.00 - @Turbogeist\n9.00 - Pure Lov ...", "Thu Apr 11 19:16:31 ": "We play at 9pm tonight! Don't be late", "Sat Apr 20 17:08:22 ": "At hit the deck festival. Someone just told me that @thetedwakefieldofficial is here?!", "Sun Feb 24 15:28:47 ": "Endless thanks goes out to everyone who came out on this tour.  You've set the bar high for us and I hope we've done the same for you.", "Tue Feb 12 10:02:21 ": "2.  Upload the best pictures you have of us playing on this tour and tag PURE LOVE in them.", "Thu Feb 14 12:10:04 ": "Tonight is the 1st Anniversary of our first ever show!  We will be celebrating in style at XOYO in London! Come down early and get loose!", "Sun Feb 24 15:29:45 ": "Also, big thanks to @TheVestals and @Turbogeist for being great tour bros.", "Fri Feb 15 13:58:51 ": "@stephenswainjr you're on the list +1. Now go buy the record!", "Mon Feb 18 16:41:43 ": "RT @NoiseyMusic: We photographed @therealpurelove's sweaty Valentines day performance @XOYO_London: http://t.co/znmA9V8G", "Thu Feb 14 09:41:07 ": "XOYO is now SOLD OUT! See you all tonight.  Let's make it a rager!", "Wed Feb 13 18:10:23 ": "@Matttrolli you are on the list tonight.", "Wed Apr 17 23:00:38 ": "RT @s0phiewest: This guy tho!! @therealpurelove http://t.co/x9amhUgc1t", "Tue Feb 19 17:31:37 ": "@ambermilesaway you have two tickets to the show tonight! Just say your name at the door! Have fun!", "Tue Apr 16 09:37:23 ": "RT @natalie_ihw: 1 spare ticket for @DONBROCO @therealpurelove @decadeofficial at Concorde, Brighton TONIGHT.", "Sun Feb 10 15:24:10 ": "@DanJamesParry you're on the list tonight.", "Thu Feb 21 16:40:38 ": "RT @stededG: @therealpurelove any tickets for Bedford Saturday I need to see these - amazing album please RT #help", "Mon Apr 15 20:37:34 ": "Boston friends, we hope you are all safe. X", "Thu Feb 21 16:59:57 ": "Whoops, just kidding. Tonight is sold out. Sorry kids.", "Wed Feb 13 18:09:29 ": "@JoelSullivanC you are on the list tonight.", "Wed Feb 20 12:15:06 ": "SOUTHAMPTON was a banger! Thank you for coming out and partying with us. This tour has been amazing. THANK YOU!!  Newport see you tonight!", "Thu Feb 14 13:17:37 ": "@jkerrawn the vinyl doesn't ship until the 28th of February! Sorry", "Wed Feb 13 18:09:57 ": "@alextweetsjunk you are on the list tonight.", "Sun Feb 10 15:14:05 ": "@johnorp we are serious. See you Tuesday.", "Tue Apr 16 19:13:18 ": "@ChrissyCragg90 @craggy103 @emmagretton @imogenlily18 @missc016 did you get in ok? We go on in 10 mins!", "Sun Apr 21 18:06:05 ": "Nottingham! We play Rescue Rooms at 9pm."}