{"Fri Feb 15 20:00:33 ": "The latest thinking on development economics - my column http://t.co/gOPAhrXn #EconomicsHSC #EconomicsVCE", "Sun Mar 17 22:52:22 ": "Tax facts contradict voters' perceptions - my column http://t.co/z8nRxcaqdj #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sun Dec 23 00:21:58 ": "@alexxdouglas Thanks. Have ordered it.", "Tue Mar 19 23:21:23 ": "Economists show racism alive and well in Oz - my column http://t.co/AjaKIAzin5 #ausecon #auspol", "Sun Mar 24 22:27:30 ": "Labor and Liberals must end their budget dishonesty before we can cast informed vote - my column http://t.co/zlPSXVmmGz #ausecon #auspol", "Wed Apr 24 00:58:48 ": "Don't be the last to hear: both sides give up on budget surplus - my column http://t.co/6SQqGBIjrg #ausecon #auspol", "Mon Feb 04 10:19:33 ": "@cponzi @mick_power real life is the TV news?", "Thu Nov 08 04:34:36 ": "Looking forward to being 'in conversation' with @annabelcrabb at launch of my new book, Gittins' Gospel, at Gleebooks tonight, 6.30", "Wed Apr 24 08:13:32 ": "Thought for the day: behind every successful person is a substantial amount of coffee.", "Mon Dec 31 06:53:56 ": "The four business gangs that run the US economy - my column http://t.co/wgZXyXvz #ausecon #auspol", "Sat Dec 08 01:22:40 ": "Slowing, not dying; a non-sensationalist reading of latest national accounts - my column http://t.co/MScULkCs #EconomicsHSC #EconomicsVCE", "Wed Mar 13 05:07:13 ": "Europeans control leadership of @IMFNews; yanks same for @WorldBank; Italians controlled papacy for 456 years. Now rest of Europe gets turns", "Fri Nov 09 23:21:33 ": "Why new state govts are cutting their spending so hard - my column http://t.co/gg9tNuHM #ausecon #auspol", "Tue Dec 25 21:14:52 ": "@gr33nrust thank. You have a good Christmas too.", "Wed Feb 27 00:47:06 ": "The pros as well as the cons of the mobile revolution - my column http://t.co/o27Qh2dNRK #ausecon #auspol", "Tue Feb 12 23:03:15 ": "It's official: Gittins an old fogy from today. And what I've taken 39 years to learn - my column http://t.co/6BKnPM6C #ausecon #auspol", "Sat Nov 03 01:43:11 ": "How Asia is catching up with the rich West - my column http://t.co/dnf4vMO8 #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sat Feb 02 00:54:03 ": "Gillard talking surprisingly tough in an election year - my column http://t.co/Z7i4mHqO #ausecon #auspol", "Fri Feb 15 19:59:22 ": "What little we know about how poor countries become rich - my column http://t.co/gOPAhrXn #ausecon #auspol", "Sun Dec 09 23:17:12 ": "A closer look at rights and wrongs of interest rate changes - my column http://t.co/WxTshxZ5 #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Thu Jan 31 21:30:01 ": "Note to Julia Gillard's speechwriter. Forego: to go before; forgo: to go without. You wrote the former, but meant the latter.", "Sat Dec 22 00:36:31 ": "Bureau of Stats working to include the environment in the national accounts http://t.co/2DShw13g #ausecon #auspol", "Wed Feb 27 07:21:38 ": "@redfoxash No. All my own work. But on a laptop, not a smartphone.", "Wed Oct 31 01:00:17 ": "Asian century white paper reveals Gillard's 'overarching narrative' warts and all - my column http://t.co/aMlQnHGY #ausecon #auspol", "Wed Mar 13 05:01:19 ": "From @TheEconomist: more than half church's 140 cardinals live in Rome #Conclave2013", "Sat Oct 27 04:17:50 ": "@KenGunn963 @smh suggest you read it again.", "Sat Feb 09 00:48:46 ": "How demography is affecting our jobs market - my column http://t.co/zlYTzr31 #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sun Feb 17 22:59:15 ": "@wombat2012 I see you didn't read past the headline. May I suggest you have another Look?", "Wed Feb 06 00:55:04 ": "@MattVersi https://t.co/cdpTTPmE", "Sun Feb 17 23:00:11 ": "@ColonelSandersP @farmeister I see you didn't read past the headline. May I suggest you have another look?", "Wed Feb 20 08:59:53 ": "Geeks' joke (courtesy @TheEconomist): there are 10 kinds of people in the world: those who understand binary numbers and those who don't.", "Sun Feb 10 23:23:32 ": "How Reserve Bank copes with its (inevitably) inaccurate forecasts - my column http://t.co/7W543Ad5 #ausecon #auspol", "Tue Dec 18 23:17:00 ": "Making sense of fuss over a budget surplus - my column (see video also) http://t.co/HeFYvVze #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sun Feb 17 23:08:12 ": "@nqcowboy_ @TonyAbbottMHR You clearly didn't read past the headline. Can I suggest you have another look?", "Tue Mar 19 10:55:56 ": "Cinemas being overrun by oldies' movies. Hollywood's 'Performance' (Philip Seymour Hoffman etc) least funny but by far the most powerful", "Wed Mar 13 05:08:46 ": "RT @bluntshovels: @1RossGittins Any chance you could raise this petition about cuts to @ABSStats? Thanks! http://t.co/TOZh9xcKkl", "Wed Mar 13 04:25:35 ": "Off to Brisbane to add my tuppence worth to @ABSStats #NatStats2013 conference tomorrow", "Sun Apr 21 23:53:02 ": "Great piece by @1petermartin on misuse of economic modelling by miners and other biz lobbyists http://t.co/EKclINduSV #ausecon #auspol", "Fri Mar 22 23:09:36 ": "Why business &amp; econocrats see economy so differently - my column http://t.co/vRcI0hluVv #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Mon Feb 18 04:55:20 ": "@mark_perry309 @plbrocks @smh I am a shareholder &amp; understand the trouble new technology is making for us &amp; how hard our execs are trying.", "Sat Feb 09 22:20:57 ": "@dajashby participation rate is proportion of the population OF WORKING AGE either with a job or actively seeking one.", "Tue Jan 29 23:17:45 ": "Why the economy hasn't been as bad as many imagine - until now. My column http://t.co/5Ck7kKqI #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sun Feb 17 22:58:06 ": "@MattCowgill Perhaps the exception to the rule is tax reform in general. Bipartisanship easier to achieve on non-tax reforms", "Fri Mar 22 23:08:11 ": "RT @NGruen1: Nobel Prizes won (in my own mind). On runs? 18. In the shower? 4. In my dreams 1. At my desk 0 zilch, nada . . .  :(", "Sun Dec 16 23:54:21 ": "Push for lower company tax explained by executives' self-interest - my column http://t.co/ZaaHjbfp #ausecon #auspol", "Tue Feb 19 23:51:15 ": "How to cut crime and the cost of crime - my column http://t.co/7ixaCyQu #ausecon #auspol", "Fri Nov 02 07:44:05 ": "My tip for new head of Prod'y Com: Don Russell. Has perfect Treasury hardhead, trusted Labor adviser, senior bureaucrat CV #ausecon #auspol", "Sun Feb 17 23:12:07 ": "@laneworks @ianfarrow But if you want a good laugh, make sure you don't read it properly.", "Sat Dec 15 07:43:16 ": "Economic case for lower company tax rate surprisingly weak - my column thanks to Australia Institute http://t.co/rV35PDQR #ausecon #auspol", "Sun Apr 21 23:56:13 ": "@GoneHomeR @Schnappi5 Ever hear of annual leave?", "Sun Mar 10 22:57:46 ": "If we ever had a real problem with productivity it seems to have gone - my column http://t.co/vlaSEWEuF4 #EconomicsHSC #EconomicsVCE", "Wed Mar 13 04:52:19 ": "courtesy @TheEconomist: Vatican bank has only ATM in world with instructions in Latin #Conclave2013", "Sun Feb 17 23:02:16 ": "@farmeister You clearly didn't read the article. Or do you misrepresent everything you don't agree with?", "Sat Mar 30 05:39:56 ": "@AkuV sorry, where do think Gladwell got it from? Gigerenzer isn't just another journo.", "Mon Feb 11 20:53:57 ": "@LeahWReid This is semantics Like other econ'sts, RBA (I was quoting) use CI to mean something different 2 what you &amp; others use it to mean", "Wed Nov 07 00:02:59 ": "Climatically adjusted, our farmers' gains from Asia's food boom won't come easily - my column http://t.co/Tl3Yvvai #ausecon #auspol", "Tue Mar 05 23:28:42 ": "Labor first out of blocks in race to mislead voters - my column http://t.co/IBTUdfVnJS #ausecon #auspol", "Thu Mar 14 05:21:51 ": "RT @LukeRingland: @1RossGittins I read your article re: ABS Work, Life, Balance Survey and started an online petition. http://t.co/2ssMy ...", "Sun Mar 03 23:00:10 ": "Joe Hockey much underestimated - my column http://t.co/mN6qXoL0sx #ausecon #auspol", "Sat Dec 08 00:49:53 ": "Fairfax-Lateral Economics wellbeing index shows better than GDP what we have to show for mining boom http://t.co/VroBtFPN #ausecon #auspol", "Sat Mar 30 00:21:39 ": "Relying on gut feelings is often better than logical analysis - my column http://t.co/Yah94XqVSo #ausecon #behavioraleconomics", "Tue Mar 12 23:30:11 ": "'Wealth creators' push materialism at expense of social side of life - my column http://t.co/b2QjVp1xaR #ausecon #auspol", "Tue Dec 04 23:27:51 ": "Leading economist says what we hardly dare to think - my column http://t.co/heyAAiwe #ausecon #auspol", "Mon Nov 05 00:53:27 ": "Biggest weakness in Asia white paper: it assumes away the environment - my column http://t.co/uc80DPSh #ausecon #auspol #climatechange", "Tue Feb 05 23:04:18 ": "The four industries with most pull in Canberra - my column http://t.co/vawwOqBd #ausecon #auspol", "Sat Mar 16 00:43:25 ": "The no-spin reason @SwannyDPM can't get to surplus this year - my column http://t.co/EazDEIvszI #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sun Mar 31 11:43:46 ": "@swissfondue63 Sorry, you seem to be talking about a different economy to me.", "Sat Feb 09 00:50:47 ": "@AUSFreeMKT You can run markets without governments enforcing property rights and contracts.", "Sun Nov 11 21:43:47 ": "What big business needs to learn about politics - my column http://t.co/7mv0r6QE #ausecon #auspol", "Sun Feb 24 21:56:06 ": "Swan tries to legislate for budget honesty - my column http://t.co/UNfc6gslwj #ausecon #auspol", "Sat Dec 08 01:21:08 ": "Slowing, not dying; a non-sensationalist reading of the national accounts - my column http://t.co/MScULkCs #ausecon #auspol", "Sat Dec 01 01:06:12 ": "Size of gap between 2-speed economies exaggerated; new figures ignored - my column http://t.co/qTyNmw1r #ausecon #EconomicsHSC #EconomicsVCE", "Sat Dec 22 05:45:15 ": "@alexxdouglas No, I don't. Can you give me more details? I'm interested.", "Sun Feb 17 23:00:58 ": "@PStirrer I see you didn't read past the headline. May I suggest you have another look?", "Sat Feb 23 04:36:58 ": "The economy's 'fast track' is bigger than you think - my column http://t.co/OWMT8YeNFf #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Sat Dec 01 01:11:15 ": "RT @Chartered_Accts: #CharterMag featuring @1RossGittins was runner up in Cover of the Year (custom mag) at 2012 Publishers Australia Aw ...", "Sun Feb 17 23:11:10 ": "@gongboy2000 Are you utterly incapable of seeing any contribution to the policy debate in other than party political terms? Read it again.", "Mon Nov 05 00:54:23 ": "Biggest weakness in Asia white paper: it assumes away the environment - my column http://t.co/uc80DPSh #sustainability #eco #environmental", "Fri Mar 22 23:09:51 ": "RT @NGruen1: Ex Labor Staffer to me: This week showed us 2 things we already knew:\n\n- Kevin can't make decisions \n- It's always about Kevin", "Sun Feb 17 22:45:10 ": "Message from mining tax stuff-up: no bipartisanship, no reform - my column http://t.co/EpwKoTJo #ausecon #auspol", "Sun Feb 17 23:06:51 ": "@LRussellWolpe True. But should this mean we can have no bipartisanship on anything? Must all opposition criticism be blanket opposition?", "Sun Dec 02 22:46:13 ": "Stand by for more changes to super - my column http://t.co/bEQvvhVh #ausecon #auspol", "Sat Dec 15 07:37:36 ": "@johhno2 True. See my column on Monday.", "Wed Feb 06 04:54:38 ": "@grantwyeth because sophisticated markets like ours can't exist without property rights, eg, which are granted and enforced by the state.", "Sun Mar 10 22:56:58 ": "If we ever had a real problem with productivity it seems to have gone - my column http://t.co/ED3yKxiJQZ #ausecon #auspol", "Wed Mar 13 04:33:46 ": "Great @TheEconomist Schumpeter column on the pope as CEO of a big transnational corp http://t.co/EFVFoUNX7O #Conclave2013", "Tue Mar 26 23:34:48 ": "How global IT coys and others pay little tax on their profits anywhere in world - my column http://t.co/0NvtmJBWbm #ausecon #auspol #tax", "Tue Dec 11 23:06:12 ": "Poverty, social disadvantage rise as you move from the centre - my column http://t.co/WO8DZeEl #ausecon #auspol #EconomicsHSC #EconomicsVCE", "Fri Nov 02 07:46:49 ": "@TomMurphy1995 yes. this weekend I hope.", "Sun Feb 17 23:09:44 ": "@FakePyne @smh Thank God the real Christopher Pyne has better powers of reading comprehension than you do.", "Sun Oct 28 22:42:19 ": "Why budget promises are important and should be kept unless things really turn bad - my column http://t.co/tzCpz9PD #ausecon #auspol", "Tue Mar 19 10:42:24 ": "French Film Festival: Welcome Aboard: another oldies' movie, but lovely. Grumpy old man and unhappy teenage fix each other.", "Fri Nov 02 11:54:59 ": "@TomMurphy1995 no, i've got it.", "Sat Mar 02 00:24:57 ": "How Reserve Bank retains control of interest rates despite the banks - my column http://t.co/wjbA7NUBk0 #ausecon #EconomicsHSC #EconomicsVCE", "Mon Apr 22 00:04:41 ": "@WhalleyRob subsidising super to make us less dependent on govt is a contradiction in terms. Welloff wont save for old age without subsidy?", "Fri Feb 01 03:52:44 ": "@ernmalleyscat See my column tomorrow.", "Mon Nov 05 03:14:42 ": "@Noreast223 To economists it usually means national income (GDP) divided by population. Quality of Life a broader, less materialist concept", "Mon Feb 04 00:43:07 ": "Why voters see the economy as in bad shape - my column http://t.co/sJwhSrsj #ausecon #auspol", "Wed Mar 13 04:58:52 ": "@TheEconomist reminds me Catholic Church has same problem as @IMFNews: too eurocentric when all growth is in developing world #Conclave2013", "Sat Mar 09 00:55:21 ": "Accounts show economy slowing as mining changes gear - my column http://t.co/zseVlWkjU0 #ausecon #auspol #EconomicsHSC #EconomicsVCE"}