{"Thu Apr 18 17:37:58 ": "RT @stereogum: Check out \"Human Nature,\" a new track from Guantlet Hair http://t.co/onZMavfQbL", "Wed Apr 17 20:08:38 ": "Just got 4 e-mails telling me about Macklemore's new video. Dear publicists, I'd like MackleLESS updates, please. #Mackle", "Wed Apr 17 21:59:48 ": "@lindseyweber Humblecomplaint?", "Wed Apr 17 22:45:43 ": "Watch a 13-year-old movie starring Nick Offerman and Louis C.K. http://t.co/VMMm9KMXlL", "Thu Apr 18 18:34:09 ": "RT @vulture: Leading men age, but their love interests don’t. Full findings, with charts: http://t.co/j1ctK0RrsH http://t.co/0RQJm1xIwm", "Wed Apr 17 20:35:10 ": "@Greggenheim Thanks, GEM", "Tue Apr 16 18:13:07 ": "RT @vulture: Check out the Mad Men Kidz! http://t.co/ojBdm2OLI9 http://t.co/scho8sqfAD", "Tue Apr 16 21:03:12 ": "If someone can think of an alt for asparagus for when trying to punch up a peeing scene, they'd get all the sitcom staff writing jobs.", "Tue Apr 16 18:55:25 ": "@BiffSavage Trust me, I own all the rest. Just felt like people should get a peek behind the curtain of that tweet.", "Thu Apr 18 20:41:09 ": "Check out Peter Dinklage's killer scarf game: http://t.co/uoFugRnzsn", "Tue Apr 16 20:27:41 ": "Some random site no one ever heard of says NBC is doing a Friends reunion, IF THE CAST SIGNS ON. Can't w8, AMIRITE!? http://t.co/oS4qqnXeAJ", "Wed Apr 17 21:22:10 ": "Just noticed I got sunburnt from sitting BY the window at a coffee shop today. Not leaving my apartment all winter really paid off, guys", "Wed Apr 17 20:49:16 ": "@BonusCake @verified That's a fast improvement from when I was just bad and an ass.", "Fri Apr 12 14:18:12 ": "RT @mariskreizman: Renata Adler / Seinfeld: http://t.co/9cfbo37dZU", "Wed Apr 17 19:38:07 ": "\"What's the deal with Greenpoint? There's no grass or spikes -- they should call it 'Greysmooth.'\"-- From my special \"Live From Greenpoint\"", "Wed Apr 17 18:11:33 ": "Dear #Headphone company reading this tweet, if you give me free #headphones, I'll tweet about them 5-12 times, depending on quality. THX", "Sat Apr 20 13:25:33 ": "The Simpsons still got it. http://t.co/XAlWqRvJ4c", "Tue Apr 16 21:17:35 ": "@elizaswift 100% perfect. \"Oh no!, am I pissing blood or did I eat beets last night? OR DID I EAT BLOOD LAST NIGHT!?\"", "Wed Apr 17 19:31:51 ": "@gilbertcruz It's WEIRDLY about news. It's like 50% advertisement for news and 50% romcom.", "Fri Apr 19 20:22:59 ": "In all seriousness, Mondrian would've LOVED this. #Art http://t.co/EiQPfZ7gyS", "Sat Apr 13 11:32:51 ": "@Jessica_StClair @baratunde It's a hell of a haircut. Be proud. Ready for this one: http://t.co/8QKC1zPPCh (cc @jondaly)", "Wed Apr 17 22:51:27 ": "Put a shirt on that pet. http://t.co/oRjTJnzGLT", "Sun Apr 14 16:13:44 ": "I'm live-tweeting the MTV Movie Awards tonight for @vulture. Be there or be over 20-years-old!", "Tue Apr 16 19:12:33 ": "Would it B kewt if I spelled green tea \"greenty?\"", "Tue Apr 16 20:57:11 ": "Let Maggie Smith improve art 4 U. (via @lindseyweber via @Vulture) http://t.co/QUkyOLUkhe", "Wed Apr 17 19:34:57 ": "@gilbertcruz Will Holly Hunter's voice be there? That's all I care about.", "Thu Apr 18 17:47:15 ": "Super proud of my alma mater, guys: http://t.co/0gxrOe0z8m", "Mon Apr 22 15:19:58 ": "Cayucas (formerly Oregon Bike Trails) is releasing the year's best Vampire Weekend record.    http://t.co/Rz14oaeUDF", "Fri Apr 12 19:53:36 ": "@jewcymag @tabletmag They should've assigned 'Why Aren't They Evil' to really challenge those kids.", "Thu Apr 18 19:23:33 ": "Tig Notaro is a genius and Jeff Goldblum loves this bit. http://t.co/XHaeEGN4cU", "Fri Apr 19 18:48:00 ": "RT @vulture: Watch Bill Murray curse while brushing his teeth in the new Amazon pilot Alpha House: http://t.co/51OH5eGOet", "Tue Apr 16 15:25:49 ": "RT @lindseyweber: The Hood Internet recreates the R. Kelly/Phoenix Coachella duet: http://t.co/xLwIDmxZKU", "Tue Apr 16 19:00:49 ": "Are there \"beer before liquor\" esque rules for switching from black tea to green tea?", "Tue Apr 16 17:46:13 ": "What if you were in hell and it was exactly as portrayed in TV and movies, but the devil was yellow instead of red? #ItWouldBeWeird #Tweet", "Wed Apr 17 17:14:28 ": "This is very exciting and a great fit. Welcome, @jodyrosen  http://t.co/8pdSfiRGji", "Mon Apr 15 05:08:03 ": "RT @vulture: You can bounce a quarter off anything. That expression doesn't make sense. #MTVMovieAwards", "Tue Apr 16 18:47:30 ": "RT @celesteballard: Check out this piece I wrote!! @thehairpin A Guide to Coachella FOMO http://t.co/j8XceSGiVq", "Wed Apr 17 16:02:48 ": "RT @vulture: .@pattonoswalt’s eight-minute Stars Wars-filled @parksandrecnbc filibuster is amazing: http://t.co/xfcOWHws2a", "Mon Apr 15 02:00:48 ": "@slitsky thanks!", "Wed Apr 17 21:16:07 ": "I wear my sunglasses at day/So I can, So I can/Keep track of the visions in my eyes/Also because otherwise it would be too bright #ImWeirdAl", "Fri Apr 12 01:22:14 ": "dog cat mouse", "Wed Apr 17 22:38:12 ": "Of the 125 scripted dramas that aired this season or will air, 109 featured rape or murder. Amazing, @margeincharge \nhttp://t.co/wvoD8KqiEp", "Wed Apr 17 19:11:10 ": "@stefanjbecket Appropriate response.", "Thu Apr 11 14:00:19 ": "RT @Splitsider: Bill Cosby Was Great Again on 'Jimmy Fallon' Last Night http://t.co/QgVyPCsHmT", "Wed Apr 17 18:04:28 ": "@coobs In all seriousness, Archie. Caroline in the City was my Friends.", "Fri Apr 19 17:35:10 ": "RT @vulture: Quiz time: Can you guess which movie each of these Tom Cruise hairdos is from? http://t.co/IVwIDcZsjT http://t.co/JuwbgmkCXj", "Wed Apr 17 21:27:09 ": "Are any of you guys illustrators? If so, can you draw me a picture of The Great Catsby for me to hang on my fridge or tattoo over my heart?", "Thu Apr 11 17:36:57 ": "RT @vulture: .@thebenshow and @nathanfielder talk to @denisemartin with some advice for doing cringe TV without getting punched: http:// ...", "Tue Apr 16 20:30:04 ": "@stefanjbecket BREAKING NEWS!!!! Front page status.", "Wed Apr 17 20:34:20 ": "@jonbaltz That's why I do what I do.", "Wed Apr 17 20:32:07 ": "Thanks to @stefanjbecket for helping to get my Twitter @verified -- an achievement that will make 0 sense to my Bubbe.", "Tue Apr 16 18:51:03 ": "Meth Odd Man, is my Method Man tribute band, in which we swap all his weed lyrics for ones about meth. #PSIHateThisJokeTooDontWorry", "Thu Apr 11 21:13:33 ": "Fellow nerds, here is a photo from a 2002 Harold Night. Commented on by @baratunde So kewt. http://t.co/rYfkPwrgsH", "Thu Apr 18 15:28:46 ": "Sadly, I was 101 on @TIME's list. Next year!", "Wed Apr 17 18:02:50 ": "There's going to be a Friends reunion! Sorry, I didn't mean to capitalize that \"F.\" I just meant I'm seeing some friends later.", "Thu Apr 11 19:45:55 ": "RT @HuffPostEnt: Longtime Woody Allen collaborator &amp; TV writer dies at age 77 #RIP http://t.co/YFI3tgdKRb", "Mon Apr 22 14:28:12 ": "RT @stereogum: Stream Cayucas's supremely fun debut album Bigfoot http://t.co/PgCIg5bji5", "Tue Apr 16 20:29:59 ": "Is there anyone who actually wanted the new Iron &amp; Wine album to sound like mellow Hall &amp; Oates? (This tweet was sponsored by ampersands.)", "Mon Apr 22 16:58:24 ": "The music in 'Trapt In The Closet' is awful.", "Fri Apr 19 15:42:17 ": "@mariskreizman You!", "Sat Apr 20 19:04:59 ": "Just spit coffee on my computer from laughing at this. http://t.co/5r3LDMpMbu", "Tue Apr 16 15:17:03 ": "RT @vulture: Watch: @ConanOBrien and four other writers discuss @TheSimpsons http://t.co/xeSv9mh09f", "Thu Apr 18 20:11:33 ": "RT @HuffPostComedy: Gotta love Ralph http://t.co/QTcTzS24UI", "Thu Apr 18 21:24:24 ": "\"You know that G's not that bad.\" This made me terribly sad. http://t.co/GZJN5Pangw", "Thu Apr 11 15:54:32 ": "I think I'm going to call in sick to watch this 4 times. (Guys, don't tell @JoshSWolk)  http://t.co/Az7wyGXR6v", "Wed Apr 17 01:50:06 ": "RT @sarah_frank: Fell down a YouTube rabbit hole of bar mitzvah videos and was rewarded with a pretty great Bridesmaids parody: https:// ...", "Wed Apr 17 20:22:26 ": "\"More like Zom-Ayyyy\"--Zombie-Fonz elbowing zombie-jukebox. (He can talk.)", "Fri Apr 19 15:15:48 ": "RT @vulture: Our art critic @jerrysaltz on his first time in high heels. \"My God. The misery began at once.\" http://t.co/Lsi1PXOG7h", "Thu Apr 18 14:54:34 ": "RT @vulture: Why House Tyrell is actually wealthier than House Lannister: http://t.co/lRHpnEeMYu", "Mon Apr 15 00:26:22 ": "I am going to start live-tweeting the MTV Movie Awards super soon. If that's something you're interested in, follow @Vulture.", "Fri Apr 12 19:51:32 ": "RT @bobbyfinger: Oh mylanta. RT @jeffbaum: @bobbyfinger Hey this new kickstarter project seems up your alley.  http://t.co/h3nylgJxoi", "Mon Apr 22 18:21:28 ": "RT @vulture: Our annual game of F, Marry, Kill, the 2013 Summer Movie Edition: http://t.co/WAgNO6ij7b", "Wed Apr 17 19:19:37 ": "Also: Duh Gr8 Gatz-B", "Sun Apr 21 02:04:20 ": "RT @jeremypgordon: The Nets and Bulls jerseys play so well off each other; feel like we're watching two squads of White Stripes backup danc…", "Sat Apr 20 16:03:30 ": "http://t.co/lemrDuP3Wz #NeverForget", "Wed Apr 17 20:26:31 ": "RT @TheInSneider: Wanna see 30 photos of LeBron James, or just one? http://t.co/210qIyO8hF", "Wed Apr 17 20:18:37 ": "@jonbaltz Can't tell if this is sarcastic. Either way, THANKS!", "Wed Apr 17 20:36:19 ": "@stefanjbecket You are the social media expert. Will do.", "Fri Apr 19 17:35:44 ": "RT @vulture: \"If you're creepy, you're creepy.\" How to pick up strangers, by Julie Delpy: http://t.co/cW255GFDUw", "Fri Apr 12 13:31:47 ": "Man, there are a lot of big character choices in this sketch http://t.co/aKh42eWoNO", "Thu Apr 11 21:18:36 ": "When I think about, all of my arrangements are edible arrangements.", "Tue Apr 16 20:31:39 ": "@julesdwit I don't get. JK, I get it!", "Wed Apr 17 20:20:43 ": "My twitter account has been officially verified on what has been arguably my dumbest tweeting day ever. Thanks/sorry, @verified", "Thu Apr 18 20:24:36 ": "RT @vulture: .@JesseDavidFox put together a tribute to Peter Dinklage's winter clothes as scarf-and-hat weather comes to an end: http://t.c…", "Wed Apr 17 18:25:32 ": "At least 3 times as many people will watch this Patton Oswalt 'Parks &amp; Rec' clip than will watch Thursday's episode. http://t.co/QnZl5d3xx7", "Fri Apr 19 15:42:01 ": "RT @mariskreizman: Lorrie Moore / SNL: http://t.co/ZVfwgkCmxz", "Fri Apr 19 13:17:44 ": "RT @vulture: Listen to Daft Punk's new song here: http://t.co/Gp8sQorX30", "Tue Apr 16 20:53:54 ": "RT @TVMoJoe: WBTV confirms the FRIENDS revival rumor is...\"not accurate and not true.\" #Sorry #Duh", "Sat Apr 13 14:02:55 ": "@Jessica_StClair @baratunde @jondaly How could he resist? It was a very smart look.", "Mon Apr 22 19:04:56 ": "RT @JuddApatow: Me @hannibalburess and Mel Brooks.  Just hanging out.  We do that sometimes. http://t.co/WR5eMLZirr", "Wed Apr 17 19:53:45 ": "It's weird that it would be weird to dip potato chips in ketchup.", "Mon Apr 22 13:47:27 ": "RT @Splitsider: The must-watch web series 'High Maintenance' is back, with @HannibalBuress as a nice bonus http://t.co/goEQAS1NpH", "Thu Apr 18 19:24:07 ": "@tomreynolds It was well-crafted.", "Sun Apr 21 15:51:16 ": "More like SUNda-- Oh wait, never mind.", "Wed Apr 17 19:10:18 ": "\"This paper is really good. I'm giving it a Gats-A!\"-Something I'd say if I was a HS English teacher/Reason why I'm not a HS English teacher", "Fri Apr 12 18:41:13 ": "RT @foyzeric: #FF special foxx @foxx5121 @foyzbern @foxnthecity @JesseDavidFox @meganfox", "Wed Apr 17 20:08:45 ": "RT @djtannerismymom: \"I'm always alone. Sad face emoticon.\" @AlMadrigal gets it. http://t.co/Mp8VeByhyS", "Thu Apr 18 14:21:11 ": "RT @vulture: Is it too much to ask for a TV drama without rape or murder? @margeincharge on her exhaustion with TV violence: http://t.co ...", "Thu Apr 11 15:47:30 ": "RT @Splitsider: Conan Reunited a Bunch of 'Simpsons' Writers for a Long Interview, Coming April 15th http://t.co/I3vjBNRiST", "Tue Apr 16 20:00:37 ": "RT @NikkiFinke: ‘Luther’ And ‘Pacific Rim’ Star Idris Elba Is In Play At The Big Agencies http://t.co/TDxiYNDIFf via @Deadline"}