{"Sun Apr 14 14:23:55 ": "RT @mrbenjaminlaw: Apparently in mainland China, some people are taught that Australian accents are so broad, the word \"today\" is pronou ...", "Sat Apr 13 02:15:45 ": "@KabukuPR Hi - urgent media request. can someone pls contact me on 92822984? Thanks Esther", "Fri Feb 01 23:22:45 ": "Roxon and Evans quit parliament. Damaging blow to Julia Gillard. http://t.co/OjS1wexf", "Tue Jan 29 10:56:43 ": "Canned air for sale in China, as blanket of smog returns http://t.co/tp13SsnE via @smh", "Wed Jan 23 06:04:07 ": "RT @natwang3: When Tibet loved China http://t.co/NIJSzyrF", "Sat Apr 06 03:17:07 ": "My friend Jina Hong wrote this piece: Waking up to the plight of North Korea: http://t.co/TU4mLHfSMp", "Thu Feb 28 08:32:08 ": "@JakeSaulwick just crossed the bridge. Saw six men in fluro vests huddling on the footpath, but no one actually on the tracks. Too slow!", "Sat Mar 02 04:35:03 ": "Drench yourself in Kpop! http://t.co/31eiIwhx6X", "Fri Jan 25 23:36:38 ": "RT @emilydparker: \"Google Earth Exposes North Korea's Secret Prison Camps\" http://t.co/acR3T8bl", "Mon Mar 18 02:53:41 ": "Lunch at Dee Why's Sea Change - grilled barramundi with chips and salad http://t.co/LzdoO78v5D", "Sat Apr 13 22:33:23 ": "(A tweet that never was sent:) Loving the music at the Domain http://t.co/A6fUSVLTlR", "Tue Mar 26 23:26:06 ": "@williams_yasmin Hi Yasmin - do you represent Sean Connolly? Can you pls get in touch with me asap? Thanks! or ehan@smh.com.au", "Wed Apr 24 13:10:46 ": "RT @paulwiggins: MediaShift Idea Lab . How a Computer Can Organize Thousands of Documents for a Reporter | PBS http://t.co/kBdUbqjG1T", "Sat Dec 15 03:40:02 ": "RT @normanswan: The Geography of U.S. Gun Violence - Neighborhoods - The Atlantic Cities - http://t.co/O2hLvgda", "Fri Mar 29 06:46:42 ": "@bilpinapplebar Hi, would like to speak with Michael for a Sun Herald story  - would be great if he could get in touch asap ehan@smh.com.au", "Mon Apr 15 22:51:46 ": "@peta_barclay @taylors_wines @juliepower must mention the food by @eatarttruck. Beef spare ribs with chickpeas, olives and mash in the pic.", "Sat Jan 26 01:29:01 ": "@SimonThomsen Hi Simon, mind if you follow me asap so I can direct message you? Cheers, Esther", "Sat Apr 13 02:34:26 ": "@Syd_Comedy_Fest Hi - would like to speak to somebody from the festival (urgent) for SMH article. Pls contact me at ehan@smh.com.au, Cheers", "Thu Jan 24 23:59:08 ": "Death of Foodstagram? Restaurants Ban Customers From Taking Food Pics http://t.co/HoR6Gq8G via @mashable", "Fri Apr 19 11:17:07 ": "Tracking whole colonies shows ants make career moves. Scientists tagged every single worker in entire colonies an... http://t.co/jZ0j7wZI2h", "Fri Mar 01 05:15:20 ": "@joelwerner that's right, with no tabloid taste", "Mon Mar 11 11:51:59 ": "@kalvin_ng those pesky accordion players! I'm still writing (and nibbling and sipping now) for a living. You working as a journo?", "Fri Mar 29 06:47:37 ": "@michaeljaggard Hi Michael, Esther from the SMH here, writing a foodie story for the SH. Would like a chat - ehan@smh.com.au Thanks!", "Mon Mar 11 12:13:12 ": "@kalvin_ng gigs sound great!! And you will soon be fluent in French. Haha, fund are tight.Don't think a food trip will happen any time soon.", "Tue Dec 18 03:34:34 ": "Are you waiting for the post- #Christmas sales to buy discounted pressies for your friends or children? Pls contact me ehan@smh.com.au", "Wed Jan 23 06:03:12 ": "RT @RachaelLonergan: Newspapers represent 8 out of Top Ten news site destinations via Twitter http://t.co/6OcBwiqd via @mumbrella", "Sat Apr 20 14:19:02 ": "RT @XHNews: Death toll rises to 156 in the 7.0-m quake in China's Sichuan as of 8:50 p.m Sat, according to the China Earthquake Administrat…", "Thu Feb 14 09:56:11 ": "Stellar wines chosen for tonight's dinner http://t.co/QOkicsCG", "Wed Apr 24 01:10:48 ": "@AASCA Hi, from SMH, need to speak with a coffee expert, please email asap ehan@smh.com.au", "Mon Mar 11 00:25:51 ": "@nami_kwon I'm now a big fan of the McWilliam's morning light botrytus semillon, you should try it!", "Sat Apr 20 14:28:42 ": "@SophieGyles @michaelmeloni didn't think a segment on a topic as serious as gun control could make me laugh so much. pro-gun guy is a loony!", "Sat Apr 20 14:25:40 ": "RT @SophieGyles: So good. “@michaelmeloni: Oh lord, the Daily Show segment on gun control with John Howard is pure awesome: http://t.co/v85…", "Sat Dec 15 03:44:08 ": "RT @GMegalogenis: Australia suffered 13 mass murders between 1981 and 1996. In the 16 years since our gun law reforms: zero. No more exc ...", "Sun Mar 10 10:10:38 ": "@EstherHjHan the xifia http://t.co/UEUOSiVpk5", "Mon Apr 15 11:15:14 ": "Spoiled with fine art @artgalleryofnsw and good @taylors_wines whites and reds (the cab sav!) with @juliepower http://t.co/D7gtZrlUir", "Mon Mar 04 23:18:05 ": "It's a good article, not a petty piece. http://t.co/ewgV18g9iA", "Fri Feb 08 21:14:13 ": "@hornery with the latest \"Aussie-Korean\" goss #davidchang http://t.co/aRGcIuPI", "Sun Apr 14 03:35:04 ": "RT @TheEconomist: North Korea has advised foreigners in South Korea to leave before the coming \"thermonuclear war\" http://t.co/4Hf3oWSpmm", "Wed Apr 17 11:38:50 ": "RT @teamdb: China turning its back on top Bordeaux http://t.co/KTxXHoeVu3 #wine #finewine", "Mon Apr 15 22:57:03 ": "Was shocked and saddened by this morning's news: Chaos as twin blasts rock Boston Marathon http://t.co/ntPsCErjdV via @smh", "Sun Mar 10 10:08:25 ": "Bbq xifia alexandrias in Xanthis dukkah, with a caper wild rice pilaf and a tomato and mountain tea jam. Translation: swordfish, Greek-style", "Sat Dec 15 04:59:23 ": "Last night China celebrated 40 years of diplomatic ties with Australia. http://t.co/qJsWfLYV", "Sun Feb 03 10:58:46 ": "The view from Taronga this afternoon, stunning! http://t.co/XlRTdCjY", "Thu Apr 04 05:59:53 ": "@CIL83 Hi, thanks for responding. can you email me and we can continue talking? thanks ehan@smh.com.au", "Tue Apr 16 12:57:52 ": "Join @sherrillnixon for @SydWritersFest Coffee and Papers with The Sydney Morning Herald #swf2013 http://t.co/2sJvYdIZHJ.", "Thu Feb 28 09:15:34 ": "RT @lisazdavies: Celebrating the proud broadsheet history of the @smh broadsheet... \"But bring on Monday's compact!!\" says @SarWhyte htt ...", "Thu Apr 04 09:46:35 ": "Travelling through Italy (by food) courtesy of Nepresso at signorelli gastronomia. http://t.co/mu8RWniNqM", "Fri Mar 15 04:54:31 ": "Aung San Suu Kyi heckled by hundreds of farmers angry about copper mine http://t.co/h2Mfrn4ulc http://t.co/OyyGxtAC6P via @smh", "Fri Mar 01 05:05:29 ": "About to get a sugar hit with an smh cupcake!! http://t.co/Ds521dpFnU", "Mon Apr 22 12:03:56 ": "Creating Fake Twitter Accounts for Boston Suspects Is Stupid and Dangerous http://t.co/wOzKmTkOO5", "Fri Mar 29 01:49:46 ": "Would you like to eat here? If you can't stand the height, stay out of the restaurant http://t.co/dDWtB7XasP via @smh", "Thu Mar 07 08:12:39 ": "More on froyo! Cold comfort: Frozen yoghurt's no-so-healthy halo http://t.co/SAv6G6ETOt via @goodfoodAU", "Fri Mar 01 23:06:52 ": "The Growers market at Pyrmont is buzzing with activity this morning. Come on down! http://t.co/HmmLPpXWRh", "Sat Mar 09 05:17:00 ": "More on other creditors and upset former employees. Byron Bay Cookie company crumbles after Oscars showcase http://t.co/fCTqbkg1qV via @smh", "Sat Feb 16 03:52:28 ": "RT @goodfoodAU: Grow It Local comes to TEDxSydney @chefmattmoran @jilldupleix http://t.co/grUYm9UK via @goodfoodAU", "Fri Mar 15 04:55:26 ": "Beijing jamming Radio Australia http://t.co/6Ui2plxkOg via @smh", "Wed Apr 24 13:13:56 ": "RT @AsCorrespondent: Cost of SIM cards in Burma being cut from $125 to $2 today. They cost $2,000 in 2008. http://t.co/diPDpRb7EG #Myanmar …", "Wed Apr 17 11:37:42 ": "RT @_TaraHarrison_: Applicants wanted: One-way ticket to Mars http://t.co/Dfm1iTAfYw", "Tue Mar 12 05:52:26 ": "An appeal to the mother of Korean baby, Ahn. Search for mother of 'beautiful baby' Ahn, abandoned at Sydney hospital http://t.co/OeyRiXolZy", "Thu Mar 07 06:18:49 ": "The latest: Cookie company crumbles over unpaid taxes and super http://t.co/Z1rvvAvD7i via @goodfoodAU", "Thu Feb 14 09:23:31 ": "Lots of wines to try tonight. @sydneyroyal wine show awards http://t.co/2hsnIn79", "Thu Apr 04 04:43:52 ": "Have you been struck down by food poisoning? Spent days in a hospital? keen to hear your story asap ehan@smh.com.au", "Mon Mar 18 21:23:22 ": "RT @Colvinius: RT @rynobi: Burma holds off on press law following criticism, for now. http://t.co/qNzUX1LIH1", "Sun Mar 03 21:50:29 ": "RT @SarWhyte: Online yoga may stretch safety, a look into the world of yoga online #consumeraffairs #yoga http://t.co/tC6QJ61tpU via @smh", "Mon Mar 11 00:35:08 ": "RT @StephanieAWood1: 'We’re a restaurant that’s known for perfection, and suddenly there’s a stain on us.' Noma's bad February... http:/ ...", "Sat Apr 13 13:25:57 ": "@rachelt25 Wow great work! Your story is inspiring. All the best :)", "Fri Mar 15 04:52:45 ": "'China at crossroads as Xi Jinping takes wheel' by John Garnaut http://t.co/MbeF6m5uMb via @smh", "Sat Jan 19 01:00:00 ": "North Korea Dips Toe Into Australian Waters http://t.co/ppnwiwsQ via @TheGlobalMail", "Sat Apr 13 02:26:59 ": "@LiveNationOzNz Hi, can a media person from Live Nation pls get in touch with me asap? ehan@smh.com.au Thanks - urgent media request", "Fri Jan 25 22:46:10 ": "RT @curious_scribe: Good feature by @PhilipWen11 and @Mattonews on growth of Chinese tourism in Australia, and what's next for the indus ...", "Wed Mar 13 02:36:29 ": "NKorea threatens to 'wipe out' SKorean island http://t.co/STjdMJzx8v via @smh", "Tue Apr 16 12:55:45 ": "Foodies and writers, learn to combine your two loves: @SydWritersFest Food: New Writing #swf2013 http://t.co/swTBJokn4o", "Wed Apr 03 02:04:33 ": "Community cuisine specialising in compassion http://t.co/WyV2IKl5vP via @goodfoodAU", "Mon Mar 11 00:30:59 ": "New toppings and square basis - domino's biggest announcement in 20yrs. 'Game changer' campaign backfires http://t.co/KC68wm9N4N via @smh", "Mon Feb 04 10:37:42 ": "@estherbit haha, you're on my list, and you will be called upon! :)", "Sun Mar 03 22:03:12 ": "RT @9NewsSyd: Peter Harvey's desk this morning - jumper still draped over his chair. You will never be forgotten in the 9 Newsroom http: ...", "Sun Apr 07 03:34:00 ": "Rats, bugs and kitchen filth are fodder for naming and shaming restaurants http://t.co/DAi1D59xNm via @smh", "Mon Mar 11 08:31:32 ": "Cafe Sopra in Waterloo, best restaurant at the Good Food under $30 awards tonight at the ivy! Congrats http://t.co/yLtyNJrsyo", "Mon Mar 11 11:42:50 ": "@kalvin_ng Watchya doing Paris? Apart from gorging on delicious French pastries at a table with a view of the Eiffel Tower..", "Sun Mar 03 21:50:20 ": "RT @pitthen: A tip  for reading the opinion pages in the compact smh: pull out the business section", "Wed Apr 24 13:13:07 ": "RT @meadea: Two rare but excellent reporting jobs going at JJJ's Hack:  http://t.co/aAiG4GdPb5", "Mon Apr 08 02:29:32 ": "\"Rats, bugs and kitchen filth are fodder for naming and shaming restaurants\" story now at GoodFood\nhttp://t.co/rjlgAuT2kJ", "Sun Mar 10 10:04:59 ": "Bbq xifia (swordfish) served at the launch of the two-month long Greek festival at Xanthis, with Greek red wine!", "Wed Feb 27 06:06:35 ": "RT @goodfoodAU: Ten simple but flavoursome ideas for dinner during the working week. #recipes http://t.co/syMOP93ksZ", "Mon Mar 11 00:33:41 ": "RT @rachelolding: $500,000 wine theft in Sydney's west http://t.co/77MlkVULNx via @smh", "Sat Apr 13 21:48:11 ": "@sarahjanenotes what was the final count @danilic ?", "Fri Jan 25 23:01:19 ": "RT @SarWhyte: Investigation, day one: Restaurants' dirty secret revealed http://t.co/an7UqPY9 via @smh @claylucas", "Sat Apr 13 02:16:48 ": "@KabukuPR Specifically Lisa Barnes, it's a Q re Comedy Festival. Many thanks, Esther", "Sat Apr 13 03:45:42 ": "@ellyranga Hey Elly, I'm an SMH reporter. Have a quick question for you for a story tomorrow, can you follow me and I can DM you? cheers!", "Wed Feb 27 04:07:47 ": "@RichHargreave Hi Richard, can you follow me - need to DM about an SMH wines story", "Mon Mar 11 00:24:08 ": "@nami_kwon Should be copies lying around on level 4! It was by Stephanie Wood, though can't find a weblink", "Sat Apr 13 05:12:04 ": "@LiveNationOzNz Hi, no worries, it's all been sorted. Thanks for getting back to me.", "Sun Apr 14 03:23:20 ": "RT @GuillaumeAtB: Some of the 40 new producers coming on to the wine list - exciting stuff! #wine CM http://t.co/XiZhyvfnjW", "Fri Feb 08 02:33:50 ": "@StephenMcDonell Great AM report today re Chinese New Year. I'm a snake year person as well! Gotta find something blue now..", "Mon Mar 04 23:24:29 ": "@curious_scribe I knew of a guy whose surname was Rainbow. Imagine that!", "Sat Dec 15 03:36:52 ": "RT @Wendy_Bacon: Strong piece :\"Child Killing Lobby - sorry the Gun Lobby\" http://t.co/9GARviXU via @NewYorker", "Wed Apr 10 14:04:56 ": "RT @TheCruMedia: Dine The Block all the girls with Anthony @TCHBondi #dinetheblock @estherHjHan @rachelolding http://t.co/rAeLLCnsW0", "Mon Apr 22 12:03:15 ": "A Journalist's Guide to Tweeting During a Crisis Like the Boston Bombing http://t.co/q4fsrL8mPR", "Fri Mar 15 04:49:03 ": "\"Bayswater Road is surely one of its most blood-stained streets in recent times\" http://t.co/yYnnc0s2r6 via @goodfoodAU", "Sat Apr 20 15:24:44 ": "So many delicious rice dishes to try.. which one should I start with?! http://t.co/aUf1FMBTNV via @goodfoodAU"}