{"Fri Apr 19 06:31:49 ": "@BostonGlobe first to say with certainty that the first suspect from tonight is a Bombing Suspect. Hope they're right http://t.co/2KmzmqU8fs", "Mon Apr 15 19:56:22 ": "Reports say police still finding devices RT @AdrienneLB: BREAKING NEWS: Police will have controlled explosion on 600 block on Boylston St", "Mon Apr 22 04:42:57 ": "Sources say Cincinnati Bengals have reached out to Rolando McClain's representatives to talk trade (FAKE)", "Sun Apr 14 23:49:22 ": "Odds on Bubba crying during this: 10/1?", "Fri Apr 19 08:42:23 ": "@KeithOlbermann @BostonGlobe Twitter had the now dead marathon suspect as dead two hours ago", "Mon Apr 15 20:06:03 ": "RT @Boston_Police: 22 injured. 2 dead #tweetfromthebeat via @CherylFiandaca", "Mon Apr 15 19:17:34 ": "Explosions at Boston Marathon injure several people. http://t.co/AFRW1gkdbb", "Fri Apr 19 21:47:29 ": "Check out all the 2013 NFL Draft Prospect Profiles we've done at Rant Sports, all in one spot! http://t.co/bNs4leI4Ei", "Mon Apr 22 05:05:11 ": "Kordell Stewart must be one of the first people in the world to break divorce news to his wife in 140 characters or less #ShortNsweet", "Mon Apr 15 22:25:33 ": "Curacao Spring Giveaway: Win some great prizes here http://t.co/cpmsSJKIb7", "Mon Apr 15 00:54:08 ": "@JeffSteffn @CRoss1075 Chris, is Jeff a Angel Cabrera fan or a Steve Williams hater? Haha", "Thu Apr 18 04:50:39 ": "RT @YourAnonNews: At least 200 people injured in West, Texas, plant explosion, 40 critically, Department of Public Safety spokesperson s ...", "Thu Apr 18 01:02:28 ": "America, F*** Yeah!\n\nhttp://t.co/oTcPCCedbv", "Mon Apr 15 19:59:44 ": "Please everyone get out of Marathon area RT @BostonGlobe BREAKING NEWS: Police will have controlled explosion on 600 block on Boylston St", "Sun Apr 21 18:31:44 ": "RT @RantSports247: VIDEO: Luis Suarez Bites Branislav Ivanovic in Digusting Act http://t.co/LAJWccKb3o", "Mon Apr 15 00:58:28 ": "@JeffSteffn @CRoss1075 How can someone hate one of the best caddies of all time!?", "Fri Apr 19 04:05:08 ": "@JDrumUK Are you trying to say Tim Couch was a good pick? His career record was 22-37 with 64 TDs to 67 INTs…that's not great for a top pick", "Fri Apr 19 06:05:33 ": "@anushkapatil @YourAnonNews is the handle to follow", "Wed Apr 17 22:17:56 ": "Check out the Amazing Spring Giveaway if you haven't already! Beats Headphones, Gucci Bag, and more\n\nhttp://t.co/cpmsSJKIb7", "Tue Apr 16 13:27:26 ": "Our salute to those first responders in the Boston Marathon tragedy.  http://t.co/A4UqP8lquv #Pray4Boston", "Fri Apr 19 07:52:44 ": "@kevinshvrk @bbhrusty @NotBillWalton Sure seemed to just randomly appear tonight. What site was this mysterious post posted on?", "Wed Apr 17 02:00:05 ": "@JoshLowery_11 Fair in my book!", "Fri Apr 19 07:16:31 ": "RT @jdubs88: Sunil Tripathi went missing Fri, Mar. 15. FBI was meeting w/his parents by Mar. 22. Highly unusual. What did they know already?", "Sat Apr 20 00:48:08 ": "Boston Globe reporting Suspect #2 is in custody! Props to all law enforcement officials involved, they are true heroes", "Sun Apr 21 19:31:48 ": "@ryanthonyfoster I'll take that bet!", "Thu Apr 18 23:39:44 ": "15 Biggest NFL Draft Busts of All Time http://t.co/Wu3RTbSFrX", "Mon Apr 15 19:51:47 ": "RT @darrenrovell: From @ABC: Mass General Hospital confirming 2 dead from Boston Marathon explosions.", "Mon Apr 15 01:28:35 ": "2013 Masters: Adam Scott Used Scott Williams' Read on Final Putt http://t.co/J0zzrW6pWG via @RantSports247 #RantGolf", "Mon Apr 15 19:52:31 ": "RT @Twitsnoop: POLICE asking people on Social Media to tweet get out of the Boston Marathon area immediately. DO NOT STICK AROUND", "Fri Apr 19 06:26:03 ": "RT @BostonGlobe: One Marathon bombing suspect has been caught, and another is on the loose in Watertown after a firefight with police, o ...", "Tue Apr 16 18:29:44 ": "Top 20 Quarterbacks in NFL History: One legend is not ranked as high as you might think. http://t.co/hCT9mUOgd0", "Sun Apr 14 23:42:43 ": "For a guy who couldn't make a putt all day, he made the 2 biggest ones when he needed them #adamscott #TheMasters", "Thu Apr 18 22:45:00 ": "@EricCarlizle810 Hey we don't mind…makes us look good for doing it first!", "Fri Apr 19 01:03:38 ": "@terrence31313 He's definitely up there. Not sure he's worse than JaMarcus", "Fri Apr 19 17:43:38 ": "Check out the final Rant Sports 2013 NFL Mock Draft http://t.co/UCz48PBBHb", "Thu Apr 18 03:41:27 ": "If this is the true explosion, WOW. Hoping for the best in a bad situation for all those close to it http://t.co/Csw1dGybar", "Fri Apr 19 05:01:33 ": "@JManziel2 give a shout out to @Jeff_Shull Probably the loudest Aggie fan in the world who called your Heisman in Oct http://t.co/eWeYGrII19", "Mon Apr 15 20:15:40 ": "RT @katz: Boston scanner: \"Incendiary device\" possible at JFK Library. Advising people to get away immediately.", "Mon Apr 22 18:28:59 ": "Check out which teams in the NBA playoffs have the highest home ticket prices --&gt; http://t.co/HB0geetF9I Thanks to @VividSeats for the info", "Tue Apr 16 19:20:53 ": "Boston Marathon shows good will always triumph evil. #Pray4Boston http://t.co/z7DUYXNRom", "Wed Apr 17 20:58:22 ": "RT @TimTebow: It was an honor to spend time with Pat &amp; Cheri Summerall a few weeks ago. A great man &amp; true inspiration to me #RIP", "Sun Apr 21 04:32:13 ": "RT @KhaleesiMiley: \"@RantSports Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle outhttp://t.co/00Cwuy226A\" some of thes…", "Fri Apr 19 07:45:00 ": "@bbhrusty @NotBillWalton I agree. My head is exploding with the combination of nonsense violence and destruction going on #WestTX #Boston", "Wed Apr 17 20:56:13 ": "Clay Matthews: #Packer for Life http://t.co/rv8lHWkExX", "Fri Apr 19 08:07:05 ": "@coreywelch you sure you have the right house? definitely seems strange if there's no one there despite him being ID'd as bomber", "Fri Apr 19 08:30:54 ": "@YourAnonNews You mean \"suspect 2?\" They still haven't opened up their twitter accounts to state the name", "Fri Apr 19 19:21:23 ": "Boston Red Sox cancel tonight's game amidst massive manhunt for Marathon Bomber http://t.co/SKzXTMzNOk", "Wed Apr 17 18:39:39 ": "RT @Boston_Police: Despite reports to the contrary there has not been an arrest in the Marathon attack.", "Fri Apr 19 07:11:59 ": "@JustMama71 @RDAroony I checked a few other channels and it was only the news ones. Settle down was just observation, no big deal", "Thu Apr 18 04:28:44 ": "RT @PatriotOfAKind: Lets stay calm and get info out #Waco #WestTX  everyone is trying to help from all over the country.", "Fri Apr 19 08:11:58 ": "@KeithOlbermann @BostonGlobe Does 'apprehended' mean 'dead' more than 'in custody' did? I suppose so", "Fri Apr 19 07:36:28 ": "RT @NotBillWalton: We now live in a time where guys named Spoog_Burgerman16 and TittyBoy4Lyfe are better journalists than @CNN's John Ki ...", "Sun Apr 21 04:09:21 ": "Guaranteed you'll laugh at a few of these names... Love this list! http://t.co/00Cwuy226A", "Mon Apr 15 20:01:53 ": "RT @TheBigLead: NY Post is reporting 12 dead in Boston  http://t.co/9TJ2CQdTJF", "Fri Apr 19 17:55:27 ": "@TeamThirstTrap I'm sure he was a first alternate ha", "Sun Apr 14 23:50:14 ": "Guan speaks better English than Cabrera. An amazing 14 year old!", "Fri Apr 19 05:54:29 ": "@PNaegelyRS MSM = mainstream media", "Mon Apr 15 19:49:58 ": "RT @TheBigLead: geez RT @JOSreports: Police say are they still finding \"secondary devices,\" pleading with crowd to go home", "Sun Apr 21 19:25:47 ": "Darrelle Revis and his representatives have absoultely destroyed his reputation this last couple years", "Thu Apr 18 22:42:36 ": "Baylor Athletes and Athletic Staff helping in the aftermath of fertilizer plant explosion that rocked West, Texas http://t.co/Oh5TfNT8Dg", "Mon Apr 15 20:01:40 ": "Just devastating RT @BostonGlobe @billy_baker Witnesses saw bones sticking out, legs on ground, blood everywhere", "Mon Apr 15 00:43:21 ": "@JustinR86 If it were that big of an advantage everyone would be using one", "Mon Apr 15 20:28:40 ": "RT @BrettRosinRMN: #Rant4Boston", "Fri Apr 19 05:42:40 ": "RT @McCoy_Patrick_: @YourAnonNews @conor_finnegan  police scanner stating this as well. Confirmed second suspect still at large.", "Sun Apr 21 04:14:08 ": "Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle out of a few of these! http://t.co/00Cwuy226A", "Tue Apr 16 01:21:17 ": "Opportunity to win Beats Headphones, a Gucci bag, and more! Check it out http://t.co/cpmsSJKIb7", "Fri Apr 19 05:42:31 ": "RT @EReinhardt_: @YourAnonNews thats confirmed from a officer on the scanner.", "Fri Apr 19 09:22:52 ": "RT @cynesthesia8: @buckeyejeans @gatewaypundit Pete Williams MSNBC: sources say Suspect #2 not Sunil Tripathi.", "Thu Apr 18 03:20:00 ": "Praying for those in West, TX after the fertilizer plant explosion", "Thu Apr 18 03:25:51 ": "Nice piece by @DanParzych on the importance of Brittney Griner coming out as a superstar athlete who is homosexual http://t.co/lTC1JxFdCn", "Mon Apr 15 00:22:17 ": "Steve Williams gave Adam Scott that read on the final putt according to Scott. What a clutch read by a veteran caddie!", "Sun Apr 21 04:34:38 ": "RT @BJTAGreen: “@RantSports: Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle out of a few of these! http://t.co/xTV9kMa…", "Mon Apr 15 01:05:45 ": "@CRoss1075 @JeffSteffn \"Why does Radioshack ask for your phone number when you buy batteries?...\" http://t.co/Woay8GPInw", "Fri Apr 19 06:47:41 ": "RT @Adam_Jacobi: MSNBC has @AKitz on the line.", "Fri Apr 19 05:40:23 ": "RT @RyanSchulteis: We just heard another explosion here at the scene", "Fri Apr 19 07:09:49 ": "@RDAroony @JustMama71 Not completely blank but all went fuzzy. Only the news ones. First I thought it was my TV but checked other channels", "Fri Apr 19 09:08:41 ": "RT @MichaelSkolnik: NBC says both suspects are not American born, have been here for a year with military training overseas. would debun ...", "Fri Apr 19 08:24:44 ": "RT @MattBinder: Yeah and even the fictional events he mentioned are wrong. RT @YourAnonNews Posted by Anonymous on the 15th: http://t.co ...", "Fri Apr 19 07:10:18 ": "Listening to alternative scanner channel now http://t.co/UZV4imudfa #Watertown", "Sun Apr 21 04:32:09 ": "RT @CNEarly: “@RantSports: Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle out of a few of these! http://t.co/AewS4SiNp…", "Fri Apr 19 07:10:58 ": "@BrettMyhres Only an observation - I'm sure it was just a technical interference in the Boston area", "Mon Apr 15 19:52:59 ": "RT @twitsnoop POLICE asking people on Social Media to tweet get out of the Boston Marathon area immediately. DO NOT STICK AROUND", "Thu Apr 18 04:52:13 ": "Very sad RT @YourAnonNews Most of the fire fighters who responded to the original fire are now unaccounted for - Mayor #WestExplosion #West", "Wed Apr 17 01:24:10 ": "Ready for Football Season? Check out our picks to replace Faith Hill on SNF http://t.co/StWH7cVRMw", "Sun Apr 21 04:58:07 ": "@StuartScott Some may be a tad too TV-unfriendly, but SC needs to do a \"Most Inappropriate Names in Sports\" list! http://t.co/00Cwuy226A", "Wed Apr 17 01:29:59 ": "Thankfully, Oregon's Cheerleaders are NOT under sanction. http://t.co/LcyI4qGhmo", "Sun Apr 21 04:28:53 ": "@jennaanoel Haha yeah I've laughed each of the few times I've gone to read it the last couple months. @rjuska won the internet this article", "Sun Apr 21 04:51:23 ": "RT @bbrown07: Amazing! “@RantSports: Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle out of a few of these! http://t.co…", "Fri Apr 19 06:56:01 ": "Scanner goes off at same time that CNN, FOX, MSNBC channels all went blank on TV. Very strange", "Fri Apr 19 05:48:20 ": "RT @YourAnonNews: #Watertown: Arrest going on now. \"He's got shit in his pockets. Get down that street now!\" via @MichaelSkolnik ATF now ...", "Fri Apr 19 08:49:47 ": "#Watertown #CNN - the names of the suspects are on the tips of their tongues", "Fri Apr 19 06:13:54 ": "RT @haris_ahmad_27: Small fire in San Francisco Airport is to blame for evacuation.", "Thu Apr 18 05:16:05 ": "@YourAnonNews at least someone cares about this. All the talk of patriotism after Boston but yet more are concerned with NBA game. Thank you", "Mon Apr 15 20:15:11 ": "RT @alertnewengland: \"Possible confirmed explosion\" at JFK library. No injuries, crime scene being requested.", "Sun Apr 21 19:46:12 ": "RT @Its_thatman_Joe: “@RantSports: Most Inappropriate Names In Sports. Guaranteed you'll get a chuckle out of a few of these! http://t.co/g…", "Thu Apr 18 03:57:57 ": "Scary as hell. The explosion in West, TX on film http://t.co/tibh24mOdD  h/t to @sammcgaw and @NewsBreaker for posting", "Fri Apr 19 17:56:28 ": "Every Team's No. 1 Target in the 2013 NFL Draft http://t.co/DsHETexuVV", "Sun Apr 14 23:42:58 ": "RT @TomWatsonPGA: You showed great courage Adam ...and resiliency from last year's disappointment at Lytham. Congratulations", "Mon Apr 15 19:51:31 ": "Everyone in Boston please be safe - all our thoughts are with you", "Mon Apr 15 20:02:00 ": "RT @greghall24: ANOTHER bomb just went off right by where I'm standing. People running, screaming, crying. INSANE!"}