{"Mon Apr 22 13:03:45 ": "Sing Brahms’ Requiem at MIT to comfort the living: http://t.co/cdfL6xkHkR via @wburartery", "Mon Apr 22 13:36:35 ": "What we know about the Tsarnaev brothers: http://t.co/mkG7QDvNRW", "Mon Apr 22 17:53:49 ": "Dzhokhar Tsarnaev charged with conspiring to use a weapon of mass destruction: http://t.co/fvDMcXQMKc (Complaint: http://t.co/M2rYYEdkAc)", "Sat Apr 20 15:53:32 ": "Bruins and Penguins will auction off today's jerseys to support those affected by the marathon attack http://t.co/92aVzNBOe9", "Sun Apr 21 17:04:28 ": "RT @CurtNickisch: [PIC] #MBTA buses are all proclaiming a common message. #bostonstrong http://t.co/FSW8duzXp8", "Mon Apr 22 17:13:16 ": "RT @Boston_Police: MIT has created the Sean Collier Memorial Fund. To learn more - click on the enclosed link: http://t.co/HLMIlGkOZA http:…", "Sat Apr 20 19:30:54 ": "RT @MassStatePolice: Air Wing views from Watertown manhunt. 5 total pics released.No further info available tonight on pictures http://t.co…", "Sun Apr 21 12:30:07 ": "ICYMI: Boston newlyweds face amputation rehab -- together. http://t.co/6Nj2EBTzrC (via @commonhealth)", "Mon Apr 22 23:04:24 ": "Transcript: Today's Dzhokhar Tsarnaev hospital bedside court appearance: http://t.co/eUq2rCzvTP", "Sat Apr 20 02:08:56 ": "Obama, on unanswered questions: why they did it, if they had any associations", "Mon Apr 22 15:36:34 ": "Coffee is social stimulant, solitary pleasure, intellectual catalyst. It also connects us to far corners of the globe http://t.co/43W6C8Zxyo", "Sat Apr 20 12:20:41 ": "VIDEO: Were you out celebrating last night at the news of the bombing suspect's capture? These folks certainly were: http://t.co/LGNshmxx4g", "Mon Apr 22 22:14:14 ": "At Cambridge mosque, people remember outburst by suspected bomber Tamarlan Tsarnaev: http://t.co/XaiOOcjbcy", "Sat Apr 20 20:03:47 ": "PHOTOS: Newspaper front pages the day after the marathon bombing suspect was captured: http://t.co/J4cABNV72L", "Tue Apr 23 00:00:12 ": "Dancer Adrianne Haslet-Davis, who lost her foot in the 2nd blast: \"I’m a fighter.\" http://t.co/jJFALOrlKQ via @hereandnow", "Sat Apr 20 13:38:39 ": "RT @mbebinger: Support pours in for newlyweds injured in #bostonmarathon bombings http://t.co/nka8mEgkKS", "Sat Apr 20 15:33:00 ": "South Station is all clear and reopened, according to Boston Police.", "Mon Apr 22 20:57:01 ": "RT @nprmusic: Richie Havens has died. He was 72. Hear a 2008 interview with the folk icon @NPRWeekend.  http://t.co/an0Wadx6n4", "Sat Apr 20 15:36:34 ": "U.S. District Attorney Carmen Ortiz on why the bombing suspect wasn't read Miranda rights http://t.co/2fn1cPFKbW", "Sun Apr 21 14:06:20 ": "RT @Boston_Police: BPD Officer delivers milk to a family with young children in Watertown during the lockdown.. http://t.co/qEpjpf80U0", "Sun Apr 21 20:34:51 ": "RT @CurtNickisch: Five phases, but no timeline, to Boston's plan to re-open Boylston Street and Copley Square: http://t.co/2qBZSLeGCR", "Sat Apr 20 12:26:24 ": "Watch how every TV network broke the news that the bombing suspect was captured http://t.co/nDUWYoiUk5", "Sat Apr 20 02:39:43 ": "Obama, following suspect's capture: The nation is \"in debt to Boston and Massachusetts\": http://t.co/NesJLj90zB", "Mon Apr 22 15:48:34 ": "Professional women in countries like India and China are surpassing their American counterparts: http://t.co/7IzJBdK96B", "Sat Apr 20 18:44:44 ": "PHOTOS: Red Sox and Bruins back after bombings and manhunt: http://t.co/wXaVMFxKoa", "Mon Apr 22 14:12:34 ": "Spirituality and Sprite, aisle 1? What an artist sees in Wal-Mart http://t.co/zwn9F3D5Ot", "Mon Apr 22 14:01:35 ": "Miranda rights and Tsarnaev: Ex-U.S. Attorney General John Ashcroft  weighs in: http://t.co/4QIriAK3Ab", "Sat Apr 20 04:44:38 ": "In suburban Boston, thanks and jubilation after Marathon bombing suspect is caught: http://t.co/9bLQyNakDK", "Sat Apr 20 16:14:35 ": "Experts are giving high marks to the response effort in Boston this week http://t.co/Yk0G6oBSAk", "Mon Apr 22 22:54:18 ": "The FBI turns Boylston Street back to Boston: http://t.co/jS3EZ4ijdE", "Sat Apr 20 02:09:30 ": "RT @whitehouse: POTUS: \"One thing we do know is that whatever hateful agenda drove these men to such heinous acts will not - cannot - preva…", "Sat Apr 20 02:45:11 ": "Our newsroom has confirmed the now-captured suspect has been taken to Beth Israel Deaconess Medical Center", "Sun Apr 21 12:04:36 ": "With the marathon bombing suspect caught, Watertown residents reemerge and begin the healing process: http://t.co/6GR9CHumCc", "Mon Apr 22 21:52:02 ": "In Medford, mourners say their final goodbyes to Marathon victim Krystle Campbell: http://t.co/tt9SJZYaSy", "Mon Apr 22 18:46:50 ": "Dzhokhar Tsarnaev charged with using weapon of mass destruction [updated w/ details from complaint]: http://t.co/fvDMcXQMKc", "Mon Apr 22 15:12:34 ": "Nathan Silver’s two @IFFBoston films have a messy playbook all their own http://t.co/PwFXDKpvXx via @WBURartery", "Tue Apr 23 00:09:01 ": "RT @AP: BREAKING: Feds delay policy letting passengers carry knives, bats and other sports equipment on planes -RJJ", "Mon Apr 22 18:34:37 ": "RT @NateGoldman: After first marathon explosion, \"virtually every head turns to the east...in alarm\" but Bomber 2 \"appears calm\": http://t.…", "Sat Apr 20 02:59:46 ": "RT @RedSox: We can confirm that #RedSox game scheduled for tomorrow at 1:10pm is on. Pre-game ceremonies likely to begin @ 1pm #BostonStrong", "Mon Apr 22 18:22:53 ": "RT @benswasey: Per complaint, Tsarnaev had apparent gunshot wounds to \"head, neck, legs and hand\": http://t.co/3wTwV2ffuh", "Sat Apr 20 02:29:41 ": "Watertown resident, who lifted boat's bloody tarp, led to suspect's capture, BPD's Davis said: http://t.co/A4FnYRZSEk", "Mon Apr 22 19:48:33 ": "RT @OnPointRadio: Audio up for our show on the Tsarnaev brothers and the Boston investigation. http://t.co/hBUgKzymRd", "Sat Apr 20 18:54:15 ": "RT @UMassD: We have received several questions about why UMass Dartmouth remains closed today. We want to take this... http://t.co/Bo6zumkH…", "Mon Apr 22 18:53:32 ": "RT @CurtNickisch: [Pic] On the steps of the Massachusetts State House, silence, respect, sorrow: http://t.co/Gly2ddtJnF", "Sun Apr 21 14:46:21 ": "RT @AP: RAW VIDEO: Thermal imaging from the boat where the Boston bombing suspect was hiding: http://t.co/Lu3UoZI2P7 -BW", "Mon Apr 22 20:16:47 ": "At 5 p.m. today, FBI \"will turn Boylston Street back over to the City\" (will allow city to begin 5-pt plan: http://t.co/WMxa6YDuJF)", "Sun Apr 21 19:23:47 ": "Transit officer Richard Donohue is in stable but critical condition, was able to squeeze his wife's hand on command: http://t.co/orfIrUc0Sj", "Sat Apr 20 02:59:04 ": "RT @AP: Crowds march down Commonwealth Avenue in Boston, singing Red Sox anthem \"Sweet Caroline\": http://t.co/6rDEAdNDNX -SS", "Sun Apr 21 16:39:19 ": "Miranda rights and Tsarnaev: Former Attorney General John Ashcroft says U.S. move is the right one. http://t.co/4QIriAK3Ab", "Sun Apr 21 12:23:30 ": "RT @AP: AP VIDEO: Five days of terror in Boston - a timeline of events: http://t.co/mLFE8LLj0j -BW", "Mon Apr 22 20:55:39 ": "RT @commonhealth: \"Did The Bad Guys Have A Mom?\" And Other Bomb-Related Questions From Children http://t.co/YrdbO9Cj3Z", "Sun Apr 21 13:00:08 ": "Boston, bombs and lessons from Israel: http://t.co/ur5mAfMGXa", "Mon Apr 22 15:01:34 ": "Why Big Papi’s profane patriotism was exactly what we needed to hear: http://t.co/S8hOGCwW28 via @cogwbur", "Sun Apr 21 13:30:07 ": "How to talk to kids about bombs and bad guys and watching for trouble: http://t.co/Zbh4dn3qfb (via @commonhealth)", "Mon Apr 22 20:39:25 ": "Canada charges two in plot to attack train line with al-Qaida's help: http://t.co/drpf2EmvLt", "Mon Apr 22 13:10:49 ": "RT @FBIBoston: Update on Condition of Dzhokhar Tsarnaev: &amp;mdash; Boston http://t.co/l1zaQUtisu", "Sat Apr 20 12:53:42 ": "Yesterday in photos: From lockdown to capture http://t.co/tsnG5oh4PH", "Mon Apr 22 17:00:16 ": "RT @AP: BREAKING: White House says surviving suspect in Boston bombings will not be tried as an enemy combatant.", "Mon Apr 22 22:48:58 ": "Photos: Krystle Campbell funeral, moment of silence: http://t.co/3xeliQt2gH", "Sun Apr 21 18:01:09 ": ".@OneFundBoston, @mayortommenino and @MassGovernor call for a moment of silence at 2:50pm on Monday. Ringing of the bells will follow.", "Mon Apr 22 15:24:34 ": "Battling landslides and congested roadways, Chinese relief crews seek quake victims: http://t.co/5aLsaOcwOs", "Sun Apr 21 12:10:21 ": "Boston bombings point to growing threat of homegrown terrorism: http://t.co/shDbgd5wS4", "Sat Apr 20 15:06:19 ": "The Red Sox will wear special white jerseys today, and will auction them off to benefit One Fund Boston http://t.co/hknZ5nLNc1", "Mon Apr 22 17:47:14 ": "Just In: Bombing suspect Dzhokhar Tsarnaev charged with conspiring to use weapon of mass destruction.", "Sat Apr 20 04:45:36 ": "As it happened: One bombing suspect dead, second in custody after paralyzing manhunt: http://t.co/64a3kEeSEj", "Sun Apr 21 13:45:16 ": "Runners at the London Marathon today paid tribute to Boston: http://t.co/Iu1MDw59vl", "Sat Apr 20 16:01:47 ": "@Nanbp More about The One Fund Boston here: http://t.co/CJkbFGDOHE", "Sun Apr 21 20:34:17 ": "The city has a 5-phase plan to reopen the Copley area: http://t.co/7SOOfpsWuu", "Mon Apr 22 21:37:40 ": "DA: Bombing might provide leads in unsolved 2011 slaying in Waltham: http://t.co/qhEx33Cbwo", "Mon Apr 22 13:24:34 ": "Today: A statewide moment of silence at 2:50 p.m. http://t.co/twTRwsS9eh", "Mon Apr 22 14:36:34 ": "The soft and rough sides of Mike Sullivan, Republican candidate for U.S. Senate http://t.co/i2a4Jbm0q4", "Sat Apr 20 16:39:28 ": "CORRECTS ORTIZ'S TITLE: Mass. U.S. Attorney Carmen Ortiz on Miranda rights http://t.co/2fn1cPFKbW", "Sat Apr 20 19:39:21 ": "The marathon bombing suspect's friends at @UMassD are in shock, describe him as friendly, normal: http://t.co/Q1J7VH3Flm (by @LMJolicoeur)", "Mon Apr 22 15:39:42 ": "Photo: Funeral services under way in Medford for Marathon bombing victim Krystle Campbell: http://t.co/D6nhUic9lN", "Mon Apr 22 12:25:08 ": "Boston mourns, says thanks and gets back to business after last week's bombings and manhunt: http://t.co/yucZUaqXBM", "Sat Apr 20 11:21:32 ": "Want a recap of the last 36 hours in the Boston area? Here: Our live blog http://t.co/64a3kEeSEj or a one-stop story http://t.co/K7fNRm5alM", "Sun Apr 21 12:45:08 ": "TV coverage of the manhunt: Unprecedented, but just like it used to be. http://t.co/BHOC5IpeoM (via @WBURartery)", "Mon Apr 22 14:40:26 ": "RT @SomervillePD: #MIT police have set up a page for people to leave condolences for Officer Sean Collier: http://t.co/5toYWeft1O\n#Remember…", "Sat Apr 20 15:28:37 ": "Here's a photo from the South Station evacuation http://t.co/mjTkGPCmuj (via @AliZelisko)", "Mon Apr 22 12:24:31 ": "RT @cogwbur: Writing Our Way Through The Terror http://t.co/vBDsfjEDNx via @ethanfreak", "Sun Apr 21 17:05:00 ": "RT @CurtNickisch: Must-see photo from the London Marathon today: http://t.co/iYh3ZMm1KD via @Gilberto82 #vlm2013 #bostonstrong", "Mon Apr 22 13:48:34 ": "Today on @OnPointRadio: A deeper look into the Tsarnaev brother's worlds for clues and motives. Weigh in here: http://t.co/XPJ0WHqhO3", "Mon Apr 22 03:33:47 ": "RT @mbtaGM: ADVISORY: The #Copley #MBTA Station will remain closed tomorrow, Monday, April 22nd.", "Sat Apr 20 02:11:41 ": "Obama: \"All in all it's been a tough week, but we've seen the character of our country once more.\"", "Mon Apr 22 14:24:34 ": "Talking to kids about bombs and bad guys, and watching for trouble: http://t.co/Zbh4dn3qfb via @commonhealth", "Tue Apr 23 01:00:12 ": "The soft and rough sides of Mike Sullivan, Republican candidate for U.S. Senate: http://t.co/i2a4Jbm0q4", "Sun Apr 21 14:05:32 ": "Interrogators wait to query wounded bomb suspect: http://t.co/0jwP9rwKf2", "Mon Apr 22 23:30:13 ": "Want to help victims of the Boston Marathon bombings? Here’s how: http://t.co/fMTxrY1c3J", "Mon Apr 22 14:48:35 ": "Suspects' Chechen roots draw eyes to Russia, where reaction to the story is as complex as the region's history:\nhttp://t.co/PKuUc60WZr", "Mon Apr 22 20:40:02 ": "RT @hereandnow: Ballroom dancer who lost a foot in the marathon bombings: \"I'm a fighter.\" http://t.co/r2r1lwmnXY", "Sat Apr 20 02:31:34 ": "Gov. Patrick, on our air: \"So pleased\" with collaboration of law enforcement agencies to getting to a \"quick and favorable resolution\"", "Sat Apr 20 10:26:35 ": "At 7am, we'll have a special marathon bombings/manhunt show. @AudioBruce, @fredthys, @LMJolicoeur, @WBURSteve report. http://t.co/eDOoZBOOWy", "Mon Apr 22 18:50:11 ": "Reminder: There will be a moment of silence at 2:50 for the Marathon bombing victims", "Sat Apr 20 15:25:28 ": "South Station has been evacuated because of a suspicious package, according to Boston Police.", "Sat Apr 20 19:22:33 ": "RT @MassStatePolice: Photos from State Police Air Wing on Watertown manhunt.Please credit MSP for pics.Unk which police agency in picture h…", "Mon Apr 22 16:45:17 ": "Former Gov. Weld backs Gabriel Gomez in U.S. Senate Republican primary: http://t.co/xy5niRVLLq #masen", "Mon Apr 22 13:12:35 ": "Bombing suspect, still in critical condition, responds to questions in writing http://t.co/K9jPv3KtU8", "Tue Apr 23 00:30:13 ": "John Reily explains why, after a week of tragedy, @davidortiz's F-bomb was exactly what we needed to hear: http://t.co/d3P4oqIJjY", "Mon Apr 22 19:13:52 ": "At 2:50 p.m., marathon moment of silence held in Boston, elsewhere: http://t.co/l5ggOlHqyJ", "Mon Apr 22 21:00:12 ": "RT @siegeled: #BryanCranston of #BreakingBad coming to #AmericanRepertoryTheater.\n\nhttp://t.co/Pb9ZAtMRb2"}