{"Tue Aug 17 01:16:56 ": "Who still needs tickets for The Able Body w/ YOU HANG UP (feat. FRANKIE MUNIZ) and STATE & MADISON ?", "Mon Sep 20 04:35:25 ": "Do I think current music sucks because I'm getting older or because it truly sucks?  (This could be any one of us)", "Sat Jul 31 23:24:03 ": "You're not the boss of me nowwwwww.......", "Mon Apr 25 01:29:56 ": "C'mon @OfficialMedina , the chorus isn't turning out to be that bad!!", "Fri Jul 30 00:01:53 ": "August is going to be GIGANTIC for us!!!  I can't say why just yet, but we have some genuine, one-of-a-king things... http://fb.me/EvI2k9H0", "Wed Mar 09 05:39:29 ": "Anyone in the mood for some early baseball in Joliet on Thursday?  Chris will be performing at the Rialto Square Theater!!!  Come on down!!!", "Thu Oct 14 07:06:34 ": "Come to \"The Able Body @ FINAL ALL AGES SHOW @ The Lodge in Lisle\" Thursday, November 4 from 6:30 pm to 11:30 pm.... http://fb.me/L3XVn0V4", "Mon Jul 19 07:47:33 ": "Make sure you grab your tickets to see our pals HEAR YOU ME at The Metro this Saturday!!!", "Sat Jul 24 04:36:11 ": "Enjoy beating your head against the wall trying to figure out how to stump this thing...http://us.akinator.com/ http://fb.me/CnZ4bZJ3", "Mon Apr 25 18:37:29 ": "@JimNorton Will you ever fly Delta again Jimmy?  I got drink tickets for you and everything!!", "Sun Jun 13 07:58:27 ": "http://www.youtube.com/watch?v=NF65wk_a1D0 http://bit.ly/aTL1qt", "Thu Aug 19 20:15:51 ": "Only 2 more days until Subterranean with State & Madison and You Hang Up feat. Frankie Muniz!  Get your tickets... http://fb.me/y5eXCRQt", "Fri Jan 28 05:00:08 ": "Nearly 500,000 hits later, here is Chris Medina's American Idol audition  http://www.youtube.com/watch?v=elaXeN15isM&feature=aso", "Thu Jan 27 05:27:00 ": "RT @frankiemuniz: Played with Chris Medina and his band @theablebody in Chicago last August.  Amazing guys!  So happy for him.", "Mon Sep 06 03:55:57 ": "Glenn's getting his ass kicked in law school but he's kicking it right back.  Think of him at Rocky and law school... http://fb.me/wTK7oLq4", "Mon Sep 06 03:57:49 ": "Glenn's kicking law school's ass!  Think of him at Rocky and law school as Ivan Drago from Rocky IV.  Glenn will... http://fb.me/AtZ67tXp", "Mon Apr 25 03:15:40 ": "@OfficialMedina We sure did tell everyone about iTunes...DID YOU?!", "Mon Oct 04 04:14:55 ": "We have a Facebook page where you can instant message us now.  Come be our friend over at Thee AbleBody", "Fri Jun 25 17:30:51 ": "Good afternoon all!  We have a last minute show added\n for tonight at U.S. Beer Company (1801 N. Clybourn Chicago,... http://fb.me/AiTdwG77", "Sat Jan 29 22:31:40 ": "Who needs info for Chris' next viewing party to cheer him on?", "Fri Aug 27 00:37:08 ": "We need your ideas for shirt designs!!! Whatta ya got?!", "Sat Apr 23 21:40:20 ": "Nashville...Chris Medina is coming!!", "Sat Jul 31 00:44:19 ": "Life is unfaaaaaaiiiiiiirrrrrrrr...", "Mon Apr 25 05:11:28 ": "@WeAreColumbine Cast @IdolCarson in the film adaptation so we can see him in Chicago!!  We miss you man, come back very, very soon!", "Tue Aug 03 16:07:18 ": "So\n the sun's angry again and it's supposed to effect Earth.  So, just to \nbe safe, it was great knowing all of... http://fb.me/GajytKU8", "Tue May 17 06:01:38 ": "Been too busy to tweet?  It's true.  @OfficialMedina , we killed it tonight!!!  Can't wait for the rest of you to hear what we made tonight!", "Mon Jun 21 09:46:50 ": "Thank you to everyone who braved the awful traffic and made it on Friday.  It was great to see everyone's positive... http://fb.me/yfZ45q6x", "Fri Jul 09 23:09:01 ": "Come to \"The Able Body OUTDOORS on The SOUTH SIDE\" Saturday, July 17 at 11:30 am until &lt;br /&gt;Sunday, July 18 at... http://fb.me/CS2a7UuZ", "Thu Jul 08 06:10:57 ": "Finally!!  A show on the southside!!", "Sat Feb 12 18:09:50 ": "Lovehammers tonight!  See u there!", "Wed Jul 14 21:49:59 ": "Zachs birthday was yesterday...I didn't even call him per my statement that he would not receive a call.  Be... http://fb.me/t7z5Dk89", "Thu Sep 16 06:26:33 ": "Zach will be smashing an acoustic at practice next week for no reason other than no reason.  We'll try to present... http://fb.me/FVcL6Ct6", "Sat Feb 26 15:29:38 ": "So how high has Chris Medina climbed on the iTunes top 200 thus far?", "Sun Jun 27 04:55:22 ": "Some of The Able Body are not happy, but since Zach doesn't have Facebook, it doesn't matter.  11 IN A ROW!!! http://fb.me/vGEF7eDQ", "Fri Jul 16 04:08:51 ": "Come to \"The Able Body OUTDOORS in a BEER GARDEN (ALL AGES)\" Saturday, July 17 from 2:00 pm to 12:00 am. Take... http://fb.me/EXdT74zw", "Tue Jul 20 18:41:23 ": "Chris is trying out for American Idol in Milwaukee right this very moment (it may not actually be this very moment, but he is there)", "Sat Jan 22 01:05:06 ": "10 seconds never looked so good...", "Sun Oct 03 03:58:13 ": "Hung out with Dai and Jamison from E For Explosion tonight.  I consider it a successful evening.", "Mon Jul 26 04:39:40 ": "Only a handful left with Jason", "Mon Jan 31 17:25:07 ": "@frankiemuniz freezing in Arizona?  I got an extra room.  Come try Chicago", "Sat Apr 30 16:56:44 ": "Chris' single \"What Are Words\" is #1 on the singles charts in Norway.  WOW!!!", "Wed Aug 04 01:38:56 ": "Come to \"The Able Body w/ YOU HANG UP (feat. FRANKIE MUNIZ) and STATE & MADISON\" Sunday, August 22 from 6:30 pm to... http://fb.me/wKCWsQbz", "Fri Jul 16 04:10:09 ": "Come to \"The Able Body OUTDOORS in a BEER GARDEN (ALL AGES)\" Saturday, July 17 at 11:00 am until &lt;br /&gt;Sunday,... http://fb.me/EOeIH3Nq", "Mon Sep 13 01:59:08 ": "Well...Based on the VMAs...The Able Body definitely has no place on MTV...time for a new goal...", "Fri Jan 28 14:29:14 ": "Over 1 million views on YouTube!!  Let's go for 2 million!", "Sun Sep 12 21:57:40 ": "Bears....Beets........Battlestar Galactica", "Tue Jul 06 23:41:55 ": "Come out July 24th to catch out friends HEAR YOU ME at The Metro with The Fold!!!", "Mon Jun 28 04:56:23 ": "Hear our new E.P. yet?  Head over to www.myspace.com/theablebody to give all 3 songs a listen in addition to some... http://fb.me/DEvldyuD", "Sat Aug 28 06:06:51 ": "Have you suggested us to your friends?  Because you probably should RIGHT NOW!!!", "Fri Jun 25 17:22:43 ": "Good afternoon all!  We have a last minute show added for tonight at U.S. Beer Company (1801 N. Clybourn Chicago,... http://fb.me/zpJxGNhj", "Mon Jul 12 04:03:56 ": "Blames Tony Martino for walking around for \n30 minutes downtown trying to find my car in the pouring rain.  Thanks... http://fb.me/C2LGBxdZ", "Sun Sep 19 06:10:28 ": "Chriiiiiiiiis is eeeevery woman, It's all in hiiiiiiiiim.....Anything, you want done baby, he'll do it... http://fb.me/JPdtqAWo", "Sun Jan 30 17:54:03 ": "What's the talk about several feet of snow in Chicago?!?", "Wed Feb 02 04:39:06 ": "The Cops are on Snowmobiles!!!!  No, it's not normal here in Chicago worth noting!!!!", "Fri Jun 25 17:24:00 ": "Good afternoon all!  We have a last minute show \nadded for tonight at U.S. Beer Company (1801 N. Clybourn Chicago,... http://fb.me/AZM1i8XJ", "Sat Sep 25 04:39:26 ": "Doesn't Zach in a suit look a lot like Kirk Hammett in a suit?", "Wed Jan 26 08:08:52 ": "Here we go folks.  Make sure you tune into Fox tonight for that certain singing competition!!!", "Mon Aug 23 05:36:55 ": "Thank you to everyone that made it out tonight.  It was by far the most fun we've had as a band yet!!!", "Sun Aug 22 19:18:09 ": "Off to Sub T.  Hope to see you TONIGHT!  Check out &gt;&gt; The Able Body w/ YOU HANG UP (feat. FRANKIE MUNIZ) and STATE... http://fb.me/HXy1CTxp", "Tue Apr 26 04:47:17 ": "Norway is shaping up to be pretty fun!", "Mon Aug 30 13:19:23 ": "So...Chris hates the Beach Boys...", "Tue Apr 26 10:53:19 ": "Making promo videos for @OfficialMedina and @TheAbleBody is exhausting at 5 a.m.  I'll learn how to sleep properly some day, just not today", "Thu Jul 15 22:59:09 ": "Who's pumped for Saturday?!?  Huh?!  yaaaaaaaaaa", "Sun Jun 20 09:17:00 ": "Mark Rose, The Hush Sound, The Plain White T's...holy shit. http://fb.me/ti4YvlFm", "Tue Aug 03 18:21:51 ": "Was anyone else's car in a brand new lake this morning?", "Sat Oct 09 00:50:35 ": "~$80,000 people got stimulus checks...c'mon America.....c'mon.....", "Fri Aug 06 15:39:09 ": "will see you at Lollapalooza!  Let me know if you're going!  If not, then I will definitely see you with Frankie... http://fb.me/x3r9HTd5", "Thu Jul 22 23:42:20 ": "Last chance...Grab your tickets for our chums HEAR YOU ME when they play with THE FOLD @ METRO!! 7/24!!  See you there!", "Tue Jan 25 06:35:58 ": "We're busy on Wednesday night.  Some singing show is on.  You should probably watch...", "Mon Jul 05 22:51:15 ": "Looks like we get one last hurrah with Jason.  Then, he goes to San Diego Padres' training camp...", "Sat Jan 29 14:53:19 ": "Over 5 million hits!!", "Thu Jul 01 06:36:38 ": "Did you hear what Jason has decided to do?", "Wed Sep 01 05:11:00 ": "Ok this actually made my eyes well up...this is Dave...http://www.youtube.com/watch?v=TVGrcy8wQHk http://fb.me/yNSFb3J3", "Thu Feb 03 02:34:34 ": "Sign you've arrived:  YOU'RE TALKED ABOUT ON OPRAH!!!  Yet another congrats to Mr. Chris Medina!!!", "Sat Jun 26 06:04:26 ": "A massive thanks to everyone who came out tonight.  It was really a great time and we had a wonderful time seeing... http://fb.me/D7ajq0We", "Tue Apr 26 18:53:54 ": "McDonald's for breakfast means it will be a rough day...ugh", "Fri Sep 24 03:51:24 ": "Doesn't anyone remember Katy Perry used to be a huge Christian pop star before turning whore?  Specifically,... http://fb.me/HBK3y40T", "Mon Jan 24 01:04:39 ": "WE WILL BE PLAYED ON Q101'S LOCAL 101 TONIGHT AT 9 P.M.!!!!  TELL EVERYONE YOU KNOW!!! http://fb.me/CvzgEWtE", "Mon Sep 06 03:56:50 ": "Glenn's\n getting his ass kicked in law school but he's kicking it right back.  \nThink of him at Rocky and law... http://fb.me/H6pgnC5s", "Fri Jan 28 06:28:51 ": "Well over 600,000.  You think he'll hit a million by noon?  http://www.youtube.com/watch?v=elaXeN15isM&feature=aso", "Sat Oct 02 03:04:42 ": "Thanks to Mark A. Pauga for the invite to E Is For Explosion tomorrow in Carol Stream.  Check out their myspace... http://fb.me/JOdR8enT", "Tue Dec 14 06:11:04 ": "Oh ya, this still exists...We're in the process of hazing our new drummer Matt.  We'll be back next year.  In the... http://fb.me/DRhw0vyn", "Sat Oct 09 00:50:57 ": "~$80,000 dead people and prisoners got stimulus checks...c'mon America.....c'mon.....", "Tue Jul 06 00:05:41 ": "Our newly released \"Glasgow E.P.\" can now be downloaded for free at www.theablebody.com.  check the bottom right... http://fb.me/AYGm4toP", "Fri Jul 30 00:07:14 ": "August\n is going to be GIGANTIC for us!!!  I can't say why just yet, but we \nhave some genuine, one-of-a-kind... http://fb.me/EgsokaMg", "Thu Sep 09 04:34:20 ": "Well...that went EXTREMELY well...", "Sun Jul 18 01:26:56 ": "Reeeeeeeeeeeeed Robin...", "Thu Jul 01 06:35:36 ": "Have you spoken to Jason lately?  He's got interesting news.  Really, go talk to him at @Jason Czarnik", "Mon May 02 03:24:49 ": "HE GONE!!!", "Thu Jan 27 05:47:08 ": "RT @Regis_and_Kelly: Is anyone else crying over Chris medina on American idol?-k", "Wed Sep 29 21:56:28 ": "What a sad day it has become.  We lost a good... http://fb.me/DjoODuD6", "Sat Aug 28 00:26:03 ": "does not recommend you take your TV apart.  If it stops working, take it to someone who knows what all that stuff... http://fb.me/Ft0HKg7e", "Thu Jul 29 03:06:45 ": "2 more songs nearly done.  We're doing pretty alright without a drummer for the moment!", "Tue Aug 03 16:07:06 ": "So the sun's angry again and it's supposed to affect Earth.  So, just to be safe, it was great knowing all of you.... http://fb.me/DHukso3n", "Tue Sep 14 03:37:04 ": "So Zach drives a motorcycle now.  Feel free to speak to him in stereotypical motorcycle lingo now.  Such as, \"Nice... http://fb.me/Hm71HTKD", "Mon Jun 28 04:55:22 ": "Hear our new E.P. yet?  Head over to our myspace page to give all 3 songs a listen in addition to some old... http://fb.me/BYbIKJv9", "Mon Apr 25 03:27:58 ": "@ChrisMedinaArmy Pre-idol and post-idol.  We are still very much active with Chris included!", "Wed Feb 16 02:31:39 ": "Happy Birthday SheiLa Lanceta!!", "Tue Jul 06 23:44:22 ": "Come check out our pals HEAR YOU ME at The Metro July 24th when they play with The Fold!!!  Click &gt;&gt;&gt; for tickets... http://fb.me/Bdq7uiht", "Mon Jan 31 06:02:54 ": "Authentic Boston food?  Where?  Since when is bar food authentic?"}