{"Wed Apr 03 20:16:17 ": "Por que el primero de la manana es el peor cigarro del dia.Encuentro 5;00 pm et", "Fri Apr 05 20:16:06 ": "Lo que dijo Michelle Obama recativa el debate sobre \"la maldicion femenina\" en EE.UU, La dra Azaret en minutos. Encuentro 5:00 pm et", "Wed Feb 13 21:36:55 ": "Hoy en EncuentroL El \"momentazo\" de Marco Rubio con la botella de agua. 5;00 pm et", "Thu Mar 21 19:59:17 ": "@Raineojeda gracias oeja,le agredzco  su opinion", "Wed Feb 27 20:14:23 ": "mi comentario de hoy : \"El abuelo indignado\" en http://t.co/pSkC8i7rMY /cnnencuentro", "Thu Feb 14 21:32:57 ": "@arieljara77 @TeamCNNEE @CNNEE gracias ariel,la idea es entretener e informar sin menoscabo de nada ni de nadie.", "Mon Feb 11 21:47:35 ": "Repeticiones de la entrevista con el hijo de Pablo Escobar. miercoles 1;00pm mexico.\nsabado 16: \n9am ET          \n2pm ET          \n7pm ET", "Thu Feb 28 19:11:08 ": "@mibengala gracias bengala muchas gracias", "Tue Feb 19 21:05:38 ": "@Ylaska_Tejeda gracias de corazon, muchas gracias", "Thu Mar 07 20:05:24 ": "Proximos invitados de Encuentro:  \nViggo Mortensen y Martín Caparrós", "Thu Feb 14 21:32:14 ": "@Anarchicus @CNNEE una errata.?es que ud, no yerra nunca?", "Fri Mar 01 21:39:06 ": "@carrillo2487 gracias julio, uno nunca sabe a lo mejor nos conocemos algun dia.", "Thu Mar 21 19:58:28 ": "Mutilacion genital: 30 millones de ninas bajo amenaza. Hoy en Encuentro 5:00 pm et", "Tue Mar 19 19:46:31 ": "Hoy en Encuentro. El papa de la tele. Hablamos con el periodista que presento 26 programas de tv con el Papa Francisco. 5:00 pm et", "Wed Feb 27 19:48:53 ": "El hombre que conoce mejor que nadie las tripas del Vaticano. Hoy en Encuentro 5;00 pm et", "Thu Feb 21 19:41:48 ": "@Aries24b @cnne ?le parecio bien o mal? a mi me gusto hacerlo asi. huyo de las entrevistas demasiado formales", "Tue Feb 12 20:48:17 ": "Hoy en Encuentro Jorge Drexler y Carolina Herrera. 5;00 pm et", "Mon Feb 11 21:27:10 ": "gracias a todos por los comentarios tan elogiosos sobre el programa especial del hijo de Pablo Escobar. gracias", "Thu Feb 21 19:40:08 ": "@htomas022 gracias tomas, queda otro programa especial sobre desaparecidos en argentina, espero que le guste", "Thu Mar 21 19:59:47 ": "@LatorreLili es que eramos tan jovenes..?te acuerdas de aquella serie de la tele argentina?", "Thu Feb 14 21:35:28 ": "repeticion de la entrevista del hijo de Pablo Escobar. sabado 17:9 am y 7 pm ;domingo 18:9am y 4pm", "Wed Mar 27 20:50:48 ": "La mujer que dirigira la seguridad de Obama.Hoy en Encuentro 5;00 pm et", "Fri Mar 01 21:39:47 ": "@arieljara77 gracias ariel y cuidese", "Tue Feb 12 20:46:39 ": "@arieljara77 @TeamCNNEE @CNNEE Gracias Ariel, no pierdas la costumbre y haznos sabersobre todo lo que no te guste del programa. abrazo.", "Thu Feb 21 19:40:38 ": "@Mmagdala25 el presidente estaba en muy buena onda, siempre se agradece algo asi.", "Mon Mar 25 22:11:28 ": "@albertoeleuth Lo intento un poco mas viejo, pero lo intento, un abrazo desde atlanta", "Wed Mar 27 20:51:24 ": "\"Estaban enmascarados\". La historia de un nino iraqui que salvo su vida a duras penas. Encuentro 5;00 pm et", "Fri Apr 05 20:16:41 ": "Los estadounidenses y la marihuana\" ?si o no? enseguidaen Encuentro 5:00 pm et", "Fri Apr 05 20:17:20 ": "Medio planeta sonriendo por el primer ataque contra Corea del Norte. Encuentro 5:00 pm et", "Mon Mar 25 22:09:13 ": "Hoy lunes 25 de marzo @CALACNN entrevista al periodista @KingsThings en @CNNEE y @CNNLATINO. 9pm(ET)(PT)", "Tue Feb 19 21:06:27 ": "gracias de corazon, muchas gracias por los elogios ala entrevista con Escobar JR.", "Tue Feb 19 21:05:16 ": "@juventino777cnn gracias de corazon, muchas gracias", "Wed Apr 03 20:13:16 ": "HOY EN ENCUENTRO\"\npor que el primer \"hombre\" que se embarazo tiene problemas para divorciarse de su mujer. 5:00 PM ET", "Thu Feb 21 19:42:22 ": "@karenarteagan gracias karen un abrazote", "Thu Feb 28 19:11:38 ": "@arieljara77 gracias ariel, un abrazo desde atl.", "Mon Mar 18 19:34:43 ": "Gracias a los companeros que me sustituyeron y gracias a todos los que se preocuparon por mi ausencia . Ya estoy de vuelta.", "Fri Apr 05 20:14:04 ": "Un cura chileno abuso de el. LLevo consigo esa cruz durante anos, hasta un dia. Su historia la cuenta hoy en Encuentro. 5:00 pm et", "Mon Mar 18 19:50:30 ": "@ljose52 ue un lapsus, lo siento realmente lo siento. no debe pasar", "Wed Feb 27 19:52:58 ": "@arieljara77 gracias ariel un abrazo para ud.", "Mon Feb 18 20:41:48 ": "Hugo Chavez ?un enfermo terminal? Hoy en Encuentro 5;00pm et", "Thu Feb 21 19:33:34 ": "ENCUENTRO ,5;00 PM ET.Cuando nadie escuchaba, el papel que jugo el posible sucesor del Papa en los abusos sexuales en Milwaukee.", "Tue Feb 19 21:03:06 ": "@vanes2979 cubano", "Mon Mar 25 22:09:37 ": "Larry @kingsthings, el rey de la conversación: \"Nunca aprendí nada mientras era yo quien hablaba\" http://t.co/Nr1DXg5FJH Por @CalaCNN", "Mon Feb 25 21:08:46 ": "HOY EN ENECUENTRO (5:00 PM ET): Bernardo Barranco, Director Del Centro De Estudios Sobre Religión De México", "Thu Feb 28 19:10:26 ": "@eliesagastume otro abrazo para ud, desde  atl.", "Tue Feb 12 20:31:19 ": "Entrevista del hijo de Pablo Escobar se repite sabado 16 a las 9 am y 7 pm et; eldomingo 17 a las 9 am y a las 4 pm et", "Thu Feb 21 19:43:11 ": "@vanes2979 cuba", "Fri Apr 05 20:14:44 ": "de Obama a sarkozy, pasando por Bush. Hoy en Encuentro las meteduras de pata de los politicos. 5:00 pm et", "Thu Feb 14 21:30:08 ": "@JUANBERFUT Amlexanox,", "Mon Feb 11 21:26:15 ": "@idng54 ?te parece eso? no era el proposito, Escobar jr es un hombre que merece respeto, todo el respeto.", "Thu Feb 14 21:33:43 ": "@JUANBERFUT Amlexanox", "Tue Feb 19 21:04:56 ": "@LeilaMovil gracias leila es que es terrible lo que esta pasando", "Mon Feb 11 21:27:53 ": "Hoy en Encuentro: ?que deja Benedicto XVI tras su renuncia? ?que posibilidades hay de un papa latinoamericano? 5;00 pmk e", "Tue Feb 19 21:09:11 ": "Mi comentario de hoy ; \"\nBye  Mahony!\" en http://t.co/gFJsvYvS", "Thu Feb 28 19:12:13 ": "@ValMa44 algun dia lo contare..que morbo!!!!", "Mon Feb 25 20:56:42 ": "Benedicto y Raul Castro se van. Mi comentario : \"Dos hombrtes,dos mundos\" en http://t.co/uHRGf2tD87", "Tue Feb 19 21:03:39 ": "@Euphos12 gracias ivan le paso el dato al reportero", "Tue Feb 19 21:04:28 ": "@CHAVEZU y cuando hago lo mismo con los gobernantes de derecha ?no lo percibe usted? entonces es un caso de percepcion sesgada.", "Wed Apr 03 20:14:12 ": "Messi fuera de juego; ?por que y hasta cuanbdo? Encuentro 5;00 pm et", "Mon Feb 11 21:48:15 ": "repeticiones de la entrevista del hijo de Pablo Escobar: domingo 17: \n9am ET          \n2am ET          \n4pm ET", "Mon Feb 25 21:10:22 ": "@HecTaveras de momento es imposible, agradezco su atencion", "Mon Mar 18 19:32:52 ": "En minutos, habla la mujer que mejor conoce al Papa Francisco: su hermana. Encuentro 5:00 pm et", "Thu Feb 21 19:33:04 ": "Hoy en Encuentro: una nina con tres padres: dos lesbianas y un homosexual. 5:00 PM ET", "Tue Feb 19 20:59:38 ": "No es un cuento chino. ?como funciona el espionaje chino contra Estados Unidos? Hoy en Encuentro 5;00 pm et", "Tue Apr 09 19:43:21 ": "CNN en La Habana. El caso de los dos chicos secuestrados en La Florida. Lo cdontamos esta tarde en Encuentro. 5:00 pm et", "Thu Mar 21 19:57:11 ": "Lo que (dicen que) hizo o dejo de hacer el Papa Francisco durante la dictadura militar argentina. Hoy en Encuentro 5:00 pm et", "Thu Feb 28 19:09:32 ": "Benedicto XVI ¿se va del todo? \nEncuentro 5:00 pm et", "Mon Mar 04 20:25:05 ": "Mi comentario de hoy: \nEl bufón Rodman ya esta en http://t.co/AZhnuCKQL1", "Thu Feb 21 19:39:23 ": "@crissmonterrey que pena criss que no le haya gustado la entrevista, tal vez la proxima me salga un poco mejor.", "Thu Feb 21 19:44:15 ": "Entrevista de Evo Morales ya esta colgada en http://t.co/AZhnuCKQL1", "Mon Feb 11 21:28:19 ": "Mi comentario de hoy : \"Se va Benedicto\" en http://t.co/kE9eNDVe.cnnencuentro", "Tue Mar 19 22:22:17 ": "@tanyalizarraga gracias tanya...me alegro que te guste encuentro, gracias", "Tue Mar 19 22:21:44 ": "@victorarguello hace unos meses pusimos una nota sobre el tema en el programa, garcias victor un abrazo", "Tue Apr 09 19:43:47 ": "@moraleshg1 hola gretel un saludote desde atlanta", "Wed Apr 03 20:15:02 ": "Drogas, cerveza y pistolas en las fiestas clandestinas de una carcel de New Orleans. Encuentro 5;00 pm et", "Mon Mar 18 19:50:11 ": "@Chrismewol @jclopezcnn @arduinoCNN Fue un lapsus, lo siento realmente lo siento. no debe pasar", "Wed Apr 03 20:36:13 ": "@geografico1 pedro, espera un poquito para que veas la historia completa. no hay truco alguno.", "Fri Feb 15 21:11:48 ": "?En que creen los que no creen en nada? Hoy en Encuentro, La fe de los ateos. 5;00 pm et", "Wed Mar 06 21:51:20 ": "Mi comentario El trigo y la paja ya esta en http://t.co/2hgmeLJ0Ag", "Tue Mar 19 19:54:36 ": "@vannucchiM estilo o falta de estilo ? es mas bien la idea de jamas aburrir al televidente. un abrazote desde atlanta", "Wed Feb 27 19:50:20 ": "Cae una de las mujeres mas poderosas de Mexico. El imperio de Gordillo. Encuentro 5;00 pm et", "Wed Mar 06 21:50:11 ": "@711walter gracias vicente, me han dicho que mega sigue emitiendo raices y recuerdos. que bueno!", "Thu Feb 21 19:41:06 ": "@Ga_Salama gracias gabriela, creo que el presidente estaba de buen humor", "Mon Mar 25 22:09:27 ": "No se pierdan la entrevista exclusiva de @CALACNN con el periodista @KingsThings en @CNNEE y @CNNLATINO. Hoy 25 de marzo a las 9pm(ET)(PT)", "Tue Mar 19 19:58:23 ": "Mi comentariode hoy: \"Condones\" en facebook./cnnencuentro", "Mon Feb 25 21:09:52 ": "@carlacontasti Gracias Carla, un saludo cordial desde Atlanta.", "Mon Feb 25 21:08:25 ": "Qué hará el nuevo papa con la investigación del robo y filtración de documentos?  Y con las denuncias de curas pederastas ¿qué pasará?", "Thu Feb 14 21:33:19 ": "@dianamarcm yo quiero dos horas!!!!", "Mon Feb 11 21:30:30 ": "Hoy en Encuentro: La tragedia del soldado que mato a Osama Bin Laden. 5;00 pm et", "Fri Feb 15 21:12:47 ": "LA ENTREVISTA DEL HIJO DE PABLO ESCOBAR SE REPITE EL SABADO 16 A LAS 9 am  Y 7 pm  ..EL DOMINGO 17 A LAS 9 am Y 4 pm #", "Wed Feb 27 19:48:03 ": "?Un Papa negro seria bienvenido? Encuentro 5;00 pm et", "Tue Apr 09 19:40:21 ": "Conmocion en EE UU ante el anuncio de la liberacion de la enfermera de la muerte....mato a mas de 40 ninos . Encuentro 5;00 pm et", "Thu Feb 28 19:08:45 ": "Mi comentario de hoy: \"un hombre solo\" en http://t.co/AZhnuCKQL1", "Mon Mar 18 19:37:32 ": "Erotismo en Tierra Santa. La revista Playboy aterriza en Israel . Encuentro 5:00 pmm et", "Wed Apr 03 20:36:53 ": "@luispa000 cada tarde a las cinco, luego se reemite en varias horarios regionales, al dia siguiente", "Thu Feb 14 21:28:45 ": "Abrazos y balazos. Hoy en Encuentro.5;00 pm et", "Tue Apr 09 19:39:59 ": "Hollywood cede ante Beijin... Brad Pitt , es la nueva victima de la censura en china...#", "Wed Feb 13 21:38:13 ": "LA ENTREVISTA DEL HIJO DE PABLO ESCOBAR SE REPITE EL SABADO 16 A LAS 9 am y 7 pm DOMINGO 17, 9 am y 4 pm", "Mon Feb 18 20:42:24 ": "Mi comentario: Los \" bankster\". en http://t.co/FE5COodO", "Thu Feb 21 19:33:53 ": "?Como sera la despedida del Papa? 5;00 pm et"}