{"Wed Feb 13 06:56:47 ": "Congrats to @collinhartmma good strategy . Felt great leading up to fight, after weight cut felt off. During the match was very fatigued.", "Wed Feb 13 01:10:59 ": "Big fight tonight #TUF. Will see what cards fate has to deal. Lol", "Sat Feb 09 17:36:21 ": "My Angel by 1KING via #soundcloud https://t.co/kdDbeBFF (King Kevin Casey) Features AMANDA HUDSON!!!  Tribute to mothers.  Share the music", "Tue Feb 26 20:31:29 ": "\"Spider\" and \"King\" after a training session ran by the Champion. http://t.co/R0683jM9O2", "Fri Aug 26 02:11:14 ": "@PrettyMsRange thanks for the for the support sweetie.", "Mon Feb 11 15:47:29 ": "8am training session!!! Going to work while the competition is in bed.", "Sat Aug 20 21:03:29 ": "Shout out to Big BOSS @HARVEYWALDEN", "Thu Feb 28 23:44:11 ": "RT @MMAinterviews: WATCH US RECAP EP. 6 of @TUFonFX LIVE with @kevinkocasey at THIS link: http://t.co/KzK2SZFxfI @JoshSamman vs @ThorThe ...", "Sat Feb 09 19:18:34 ": "Fighting is my passion, music is my love.  Wisdom is my strength, which helps me rise above (KING KEVIN CASEY)", "Fri Feb 08 21:20:00 ": "RT @MMAinterviews: Hear @kevinkocasey break down this week's episode of @TUFonFX with @SpencerLazara : http://t.co/qo2TdlMM", "Sat Mar 16 00:44:41 ": "RT @KazganMMA: With @kevinkocasey \nOsss.. http://t.co/bPu4MANTLP", "Wed Jan 30 04:58:50 ": "Getting ready to watch Tuf.  Both of the fighters tonight @Lukebarnatt @JamalSmithMMA  are tough. One of seasons best fights coming up.", "Mon Oct 24 13:46:04 ": "HAD SOME TIME TO RELAX OVER THE WEEKEND, NOW ITS BACK TO TRAINING. THE LIFE OF A WARRIOR. (KING KEVIN CASEY)", "Wed Sep 07 00:20:34 ": "To all my new found friends and fans. \"NO SURRENDER NO RETREAT\"  (Its a lifestyle}  KING KEVIN CASEY", "Thu Sep 08 23:16:02 ": "Dont forget to To Watch The Ultimate Merger, Sure To be FIRE. KING KEVIN CASEY IS BOUT THE PEOPLE.", "Thu Feb 14 17:53:00 ": "@kelvingastelum I'm on a mission of redemption.", "Thu Feb 07 05:53:50 ": "I just tweeted some of my unreleased album.  All lyrics written by and performed by me King Kevin Casey, all I ask is you share if you like.", "Wed Oct 26 21:40:12 ": "ITS OFFICIAL KING KEVIN CASEY FIGHTING NOV 19 2011. RESPECT IN THE CAGE. (NO SURRENDER NO RETREAT)", "Wed Mar 20 21:49:51 ": "Fans don't see what goes on behind the scene, I was admitted to the hospital and was diagnosed with acute renal failure. Care to look it up.", "Fri Aug 19 01:29:13 ": "@realLizTaylor thank you sweetie for the support. And there's much more to come.", "Fri Aug 05 05:50:26 ": "@iamTOCCARA was lookin as sexy as ever!", "Fri Aug 19 00:19:27 ": "Thank you sweetie. Tonight's episode is a good one. Let me know what you think after.", "Thu Feb 07 20:09:12 ": "Big Congrats !!! To @heidimontag @spencerpratt for the new season of Celebrity Big brother. Looking forward to the 2013 comeback!!!", "Fri Aug 19 02:09:32 ": "I'm still in. Stay tuned. Kings in the building.", "Sun Nov 28 22:55:09 ": "Vangaurd nightclub Hollywood Ca", "Sun Nov 28 22:55:37 ": "Please come out and support", "Mon Aug 22 00:19:34 ": "@kevinkocasey: o@Harveywalden", "Fri May 21 14:01:30 ": "Challengers: Lindland vs Casey Weigh-ins\n\nhttp://strikeforce.com/news/2010/05/challengers-lindland-vs-casey-weigh-ins-videos/", "Fri Aug 26 02:14:02 ": "Who thought I was going home lol. I'm just keeping in real. And TVOne is the number one network, stay tuned for more Ultimate Merger.", "Mon Aug 22 00:20:49 ": "@kevinkocasey: OOH RAH @HARVEYWALDEN", "Fri Feb 08 06:43:56 ": "Forever by 1KING via #soundcloud https://t.co/OAyfw7fL", "Wed Aug 10 00:22:13 ": "@heidimontag Thanks for the love and support, we're just gettin warmed up!", "Sun Nov 28 22:53:37 ": "The countdown has begun for King Kevin Caseys performance at vangaurd Dec 11, For tickets call (310)808-8181 ask for MR Casey", "Sat May 22 10:16:13 ": "No Surrender No Retreat", "Wed Feb 06 21:06:05 ": "Congrats to @vinnymma on his up coming fight. I predict that it won't be a wonderful night. Vinny via second round submission .", "Thu Feb 07 00:41:45 ": "@kelvingastelum AKA \"El Toro what up.   Seems I've been getting a lot of request. I'll start putting it together .", "Fri Aug 19 04:48:17 ": "Much love to all the King and @cocktail player fans for all the support.", "Sat Aug 20 20:58:22 ": "Sitting here feeling blessed and loved, thinking of a way to give all the love back for those who show support. One Love.", "Mon May 17 16:28:06 ": "@ AOL Studios, Watch me live on internet television @ mmafighting.com.", "Thu Dec 16 16:04:56 ": "Watch Kevin Casey performance on you tube.", "Thu May 13 17:06:27 ": "Guys when you get a chance checkout below link on Kevin Casey VS Matt Lindland.\n\nhttp://www.youtube.com/watch?v=gXMWZYFkXBw", "Thu Feb 07 05:46:40 ": "Respect by 1KING via #soundcloud https://t.co/UQwpnVLz", "Wed Feb 06 04:16:44 ": "@bubbathemenace says I'm scared knowing he's the biggest p**** in the house. Lol  I can't wait to make you eat your words chump lol.", "Mon Jun 20 13:54:25 ": "Getting ready to run 3.5 miles on the beach, anybody down!", "Fri Aug 19 01:13:06 ": "What do you think is on my mind right now. Hahahaha", "Thu Feb 07 05:45:56 ": "Eternity by 1KING via #soundcloud https://t.co/551CkG9A", "Sun Jan 27 00:31:58 ": "I see my teammates and coach @JimmyCrashBJJ @KelvinGastelum @coachjaimiehuey have been requesting the presence of KING LoL. Im back !!!", "Sat Feb 09 20:43:00 ": "RT @MMAinterviews: @kevinkocasey talks about fear of @AdamCellaMMA's safety after the vicious #KO but that he bounced back quickly\nhttp: ...", "Thu Feb 07 06:40:50 ": "@jubbaman What up Boss !", "Tue Nov 01 22:51:11 ": "THREE MORE DAYS UNTIL I COMPETE IN THE JU JITSU WORLD CHAMPIONSHIPS!!!  BEAST MODE HAS BEEN ACTIVATED. (KING KEVIN CASEY)", "Sat Aug 27 06:08:06 ": "Congradulate those who reject fear and persue a dream.", "Fri Sep 02 01:45:04 ": "Thank you everyone for all the love.", "Wed Feb 06 04:27:18 ": "What up big Z @zakcummings ,  ladies and gentlemen Zack has no official nickname. Who agrees with Zack diamond Cummings", "Mon Nov 22 04:35:27 ": "King will be performing at vangaurd nightclub Dec 11, in the best of the west hip-hop showcase. Winner takes all.", "Fri Feb 22 06:23:44 ": "RT @MMAinterviews: We are prepping to go LIVE with @kevinkocasey to recap ep. 5 of @TUFonFX! LISTEN IN HERE: http://t.co/EoXRUsuTob", "Fri Jun 17 04:09:58 ": "@HeidiMontag Thanx 4 the invite! @Wetrepublics not gonna know what hitum.  My bday weekend so everyone has to leave tipsy. LOL", "Wed Feb 20 04:03:37 ": "Was that Big Bad @bubbathemenace brought to tears by @kelvingastelum tonight. \"Tears\" not the menace. Congrats Killa Kelvin.", "Sun Feb 24 03:54:03 ": "Live at UFC http://t.co/pjMRtOuuJs", "Thu Feb 07 15:57:20 ": "@thorthehammer What's up my brotha I hope your all good, and I know your training hard. See you in April.", "Sun Sep 04 22:40:51 ": "Big  Shout out Radhames Jr The 2011 world submission grappling Champion. Ladies show him some love (KING KEVIN CASEY)", "Fri Aug 26 02:12:04 ": "@Nappturalistic thanks for all the support sweetie.", "Mon Jan 28 15:37:52 ": "On my way to the gym, first session starts at 8am sharp.", "Mon Aug 22 17:12:32 ": "Today is the first day of my official training camp for my next fight .  Kicks off with 3.5 miles on soft sand. Stay tuned. One Luv", "Mon Nov 22 04:28:54 ": "King Kevin Casey has officially returned to the world of twitter", "Sat Jan 26 23:35:52 ": "Great to see the coaches promoting TUF,  great to see the ratings are doing so well !!!", "Sun Jan 27 00:14:15 ": "Goodluck  tonight to my Blackhouse teammate/training partner (Glover Teixeira)  REPRESENT!", "Thu Feb 07 18:44:11 ": "RT @MMAinterviews: @kevinkocasey breaks down @UriahHallMMA's brutal KO of @adamcellamma on ep. 3 @TUFonFX &amp; matchup of Collin Hart:  ...", "Fri Aug 19 01:45:43 ": "And that's history. Lol;)", "Fri Aug 19 01:09:39 ": "This will be the first time I ever went drifting.", "Sun Dec 05 19:12:44 ": "if you became rich overnight would you stay in your present career? if not your on the wrong path.", "Tue Feb 12 00:17:16 ": "What up to the darkside homies !!! @coachjamiehuey @kelvingastelum @uriahhallmma @zakcummings @thorthehammer @jimmycrashbjj @lukebarnatt lol", "Mon Jun 20 13:47:30 ": "@jennajamensone  What up, thanx 4 the love.", "Fri Dec 10 03:28:47 ": "Just finished my new single (GO HARD!)", "Thu Feb 14 17:47:58 ": "On my way to the track to get some road work done. Sprints!!!", "Thu Feb 07 17:53:03 ": "MMA Plus - Luke Barnatt TUF 17 BLOG: Banter with \"Bigslow\" - week 3 http://t.co/2pu60yNf via @sharethis  @lukebarnatt with a great recap.", "Sat Feb 09 07:08:36 ": "Stand up by 1KING via #soundcloud https://t.co/TgtutN5C  (King Kevin Casey )Unreleased track .  All lyrics written and performed by me.", "Thu Feb 07 05:47:01 ": "Bounce by 1KING via #soundcloud https://t.co/7jzV2hvO", "Sun Aug 14 00:46:34 ": "@goforitgant Thanks for the love Boss lookin forward to working with you in the near future.", "Sun Oct 23 03:08:47 ": "Thank U To Everyone Who Came To Support My Return To The Ring!  The Path Of Your Truth Leads To The River Of Your Destiny.(KING KEVIN CASEY)", "Thu Feb 07 06:04:47 ": "Amanda Hudson also featured on select tracks, I will put more songs up as long as they are shared.", "Mon Sep 19 01:51:59 ": "The greatest gift that God ever gave man was a women.  But its your missoin to find your rib. (KING KEVIN CASEY).", "Fri Aug 19 01:50:36 ": "@nappturalistic don't be jealous sweetie. Thank you for all the support.", "Wed Sep 07 00:16:49 ": "Big Shout Out To My Good Friends @spencerpratt And @heidimontag, Getting Ready To Do It Big In Las Vegas @hardrock!", "Tue Sep 20 14:47:22 ": "Getting ready to run 3.5 miles in the soft sand.  Then ill be doing a kickboxing session.", "Fri Aug 26 03:54:42 ": "@kevinkocasey: thank you for the support sweetie @FlaMiNg_KiTTy", "Sun Feb 24 00:13:59 ": "On the way to Honda center to watch UFC live.", "Mon Aug 15 12:58:14 ": "Thanks sweetie:).", "Fri Aug 19 03:39:44 ": "@kevinkocasey: @Nappturalistic love you sweetie thank you.", "Fri Feb 08 06:45:24 ": "We Do Mix 1 by 1KING via #soundcloud https://t.co/3Z02dhg4  (KING KEVIN CASEY) Unreleased track please share. Thank you", "Tue Aug 02 15:51:59 ": "Getting ready to run 3 miles on the soft sand anybody want in?LOL", "Sun Aug 07 20:49:20 ": "Thanks to everybody who took the time to show me some love out in the streets. \"KING IS BOUT THE PEOPLE\"", "Tue Jan 03 01:49:45 ": "HAPPY NEWYEAR TO ALL!     READY FOR A NEW CHAPTER.", "Mon Jan 28 19:54:46 ": "@clinthester  What up in the A homie ! You know I'm on the coast gettin ready 4 anything and everything.", "Fri Feb 08 07:09:41 ": "You guys didn't know, that KING got flow . LOL", "Fri May 21 23:09:02 ": "Check out my debut appearance on InsideMMA on HDNet tonight@6:30 and then watch me fight@8pm on Showtime.", "Sat Jul 30 00:25:46 ": "Make sure not to miss the premiere of Donald Trumps Ultimate Murger 2 Starring Toccara Featuring King Kevin Casey On TV ONE. AUG 4th", "Wed Mar 20 21:58:16 ": "Cameras don't show my doctor visit nor the issues the other fighters had with weight cuts. My life comes b4 the fans blood thirst lol.", "Tue Sep 14 16:08:43 ": "Check out King Kevin on his first radio interview today@4pm. You can watch it online or on your blackberry @ mocradio.com with 10,000 ot ...", "Fri Jul 29 02:13:24 ": "@ryrongracie @jakesheildsajj @xandejiujitsu \"TOAST TO THIS GENERATIONS GRACIE JIU JITSU ELITE\" \"NO SURRENDER NO RETREAT\""}