{"Thu Feb 14 15:15:58 ": "@tennistweetscom you being not so nice to WTA on Valentines day?♥", "Tue Mar 05 03:11:34 ": "At #latennischallenge with my 3 kids. Pauley Pavilion looks great thanks to @justingimelstob @MardyFish http://t.co/6FW2XzftGl", "Sat Mar 16 00:03:27 ": "@spanner77 happy birthday!!!! And many more for the jolly good fellow", "Sun Mar 17 23:38:59 ": "Got back to westside LA in time to see Champ point!!", "Fri Apr 05 14:42:05 ": "RT @Ravens: Get ready for @Orioles opening day with a #Ravens-Orioles photo gallery. RT if you're pumped! | http://t.co/hgtTgfUCSC", "Sat Mar 02 03:49:32 ": "funny seeing Serena get called out for phone camera abuse during PGA event in her Palm Beach Hood. Will Rory be in Indian Wells?", "Sun Mar 24 04:48:58 ": "RT @Martina: Friend of mine, Mel di Giacomo , took this photo a while back, thought you guys would enjoy:) http://t.co/1g1JbtyjBu", "Fri Apr 05 18:17:37 ": "Cliffy and pammy freezing in #familycirclecup watching serena v burdette on #espntennis better weather coming http://t.co/CgY1I974Cz", "Thu Mar 14 15:23:10 ": "@Chrisjameson9 I remember taking the 7 train out to Flushing Meadows for my finals vs @ChrissieEvert in 1978. I was an amateur in all ways", "Thu Mar 14 05:08:39 ": "@tennistweetscom as hewitt and Bags will tell you this night session nothing to talk about yet. #ausopen #bnppo13", "Fri Apr 05 16:05:51 ": "http://t.co/8zCSApUtrg Bethanymatteksands up 3-2 on Madisonkeys in 1st set TB on chilly #familycirclecup ... http://t.co/MFjWB4sLYh", "Sat Apr 13 06:05:38 ": "@ChrissieEvert stick to tennis predictions. he looked good till 16. how about u @Martina and i ask member Ms Rice for an Augusta round, fore", "Sun Feb 10 06:06:05 ": "@thetracyaustin coming from LAX (not airport) tradition in Baltimore way 2 go spreading the gospel of LAX out west but play tennis too!!", "Tue Jan 29 02:27:19 ": "@christophclarey does Jason like tennis?", "Thu Feb 07 14:41:04 ": "Arthur Ashe asked me to warm him up before he played his final match in MSG in 1979 when i was 17. He always treated everyone w respect. RIP", "Sun Mar 03 05:01:20 ": "watched my 1st overtime as a parent today as our oldest battled well in 23-21 Wildcat loss to Hoyas. btw I think Rafa will go to IW for golf", "Sun Apr 07 19:38:22 ": "Yep I did get some details of Serena vs Justine's hand hold up confused. Today's final was good one. Like that JJ is back. SW deserves rest", "Thu Feb 28 04:24:29 ": "RT @joeldrucker: My late wife Joan's bday 2.28. From \"Comes a Time\" -- You and I/we were captured/we took our souls and we flew away.", "Sun Mar 17 18:54:27 ": "Soccer running tad long so #espntennis starting a little late Maria Vs Caroline then Rafa vs Del Po", "Mon Feb 04 05:58:05 ": "Super Bowl broadcast marred with excess commercialism, scripted approach http://t.co/FvPsLGJi", "Sun Mar 17 01:17:22 ": "@darren_cahill of course she does!!! Now go get a cold one then another...... #espntennis", "Mon Apr 08 01:56:00 ": "@BenRothenberg  @familycirclecup the 41st addition was terrific. Charleston is a great city. Southern hospitality and @serenawilliams Rules", "Fri Apr 19 05:48:07 ": "RT @Orioles: Jubilation. #Birdland http://t.co/okcTMu5gMU", "Mon Feb 04 05:18:00 ": "@Jimmy_Smith25 yippee thanks Jimmy love back to you 4 down under. AFL starting soon?", "Sun Mar 17 14:42:13 ": "@bgtennisnation @ChrissieEvert thx who wins today M &amp; W?  @darren_cahill @cbfowler @fellerbob yesterday's JMD vs ND  atmosphere of a major.", "Fri Mar 22 20:59:12 ": "http://t.co/QOKKRozQws Finding size 12 shoes never easy so these choices like winning shoe lottery no ... http://t.co/K4BED76Geu", "Mon Mar 04 14:37:12 ": "big day for my big #espntennis brother", "Tue Mar 05 03:35:35 ": "Full house at Pauley for #latennischallenge. Haas vs Blake http://t.co/DIVjkjIZmB", "Tue Mar 12 00:27:55 ": "Great day at sherwood country club raising money for my kids school. See you friday on #espntennis http://t.co/PQC0TvDheN", "Sat Feb 09 19:10:52 ": "Ok so it's not 3 feet of snow but westside LA temps in the 30's is unusual. Dig out slowly NE or backaches http://t.co/AliE4dIj", "Wed Apr 03 04:03:49 ": "i can relate to @sloanetweets as after US Open final in 78 i had trouble winning matches for a year. life changes when u beat gr8 in a major", "Mon Apr 08 15:19:43 ": "@RickSchuchman thanks. I like that but curious \"Quirky\" how so?", "Mon Apr 22 14:28:41 ": "@ChrissieEvert @Martina @thetracyaustin I played crazy mixed doubles with Don Budge and Renee Richards in 1977 at my 1st exo in Baltimore", "Tue Apr 02 20:10:34 ": "That's me!!! Did someone turn on the heat?  Off to #familycirclecup for #espntennis. Love Charleston SC http://t.co/cHCvzXbDYc", "Fri Feb 22 00:42:24 ": "@magicjohnson speaking at Dr Buss memorial service just spoke about how Dr Buss took him to WTT Strings match and he fell in love w tennis", "Sat Apr 06 16:41:56 ": "@ESPNTennis serena in 2 close sets. Great 2 see this amazing unique rivalry. How many more times will they play? ever in a major final again", "Fri Apr 05 16:40:52 ": "Flooded court 9 at #familycirclecup mattek sands v keys been off ct but @Venuseswilliams plays on &amp; lost lead http://t.co/isEAsl3iC9", "Sat Feb 23 07:01:16 ": "After watching 20 20 #teamroberts I feel grateful that ABC Sports in early 90s made it possible for me to work with Robin and Arthur Ashe", "Tue Feb 12 04:21:22 ": "RT @StuartAppleby: Just ate at Feed Body &amp; Sole in LA\nopened up a week ago, a great feel with stunning marble bar counter top.\nhealt ...", "Fri Apr 05 16:08:09 ": "And just after last tweet 4-2 Matteksands it started to rain wait is that snow? Players waiting courtside under towels and umbrellas", "Tue Mar 05 14:38:58 ": "@Martina thanks but been on for 20 months!! But just started e follow u. Love your non tennis tweets. Thinking of playing Wimb Legends hmmm", "Sun Apr 07 16:12:29 ": "@darren_cahill repeat ourselves, that's what we do when we get older. @ESPNTennis today live at 1p #familycirclecup. JJ how many games vs SW", "Sun Feb 17 20:38:18 ": "Surfer lovers here is north shore hawaii the pipeline. Love 15 looks easier!! http://t.co/n1hKLf6j", "Tue Feb 05 14:23:43 ": "RT @NeilHarmanTimes: Andy Murray steps up and says players should be happy to donate part of prize money ... http://t.co/Vkp60tcy", "Fri Apr 05 16:25:30 ": "@Venuseswilliams vs lepchenko has never stopped play in rain while Keys and BMS stopped at 7-6 Keys and are inside club house", "Sat Jan 26 11:48:18 ": "We will not see a major final quite like this ever again... Well done Victoria!! Li Na you are brave too! Thanks #espntennis", "Sun Mar 10 03:44:53 ": "@michaelshure owen played solid game today. Too good for George. BTW boys 8 and under basketball is great to watch. They never pause", "Mon Mar 04 00:30:34 ": "RT @cbfowler: Just had a very interesting sit down w/ @RafaelNadal for #sportscenter tonight. Spoke of his doubts/fears/plans after 7 mo ...", "Fri Apr 05 21:23:41 ": "U never know who you might run into shopping on Kings St Charleston SC during #familycirclecup #espntennis http://t.co/4yQC9TnX4O", "Fri Feb 15 00:49:27 ": "@MarkChow1977 ♥ thanks", "Sun Apr 07 18:15:39 ": "Tennis more fun with sparks on the court!!!!!!! Love that exchange between JJ and SW.... #ESPNTennis", "Sat Mar 16 03:13:40 ": "Kerber v woza just going 3. Piotr W coaching on court  in Polish so all you translators get ready to help on #espn10s at 8:30", "Mon Apr 08 15:43:56 ": "@anthonyduane I tweeted late yesterday I got details wrong who put up hand but 10S world including me always knew SW was correct then &amp; @FCC", "Wed Mar 27 05:07:35 ": "Oops always been a horrible speller Vonn not Vaughn.....", "Thu Feb 28 04:25:41 ": "RT @ITATennis: Congrats to the Kenyon Lords, winners of the 2013 ITA DIII National Men's Team Indoor Championship #D3Indoors http://t.co ...", "Sun Mar 31 20:28:20 ": "RT @miketirico: 25yrs ago at my first job, ch5 in Syr, the 2 college hoop coaches I covered were Boeheim and ... http://t.co/DixWiczYiq", "Sat Feb 23 04:41:17 ": "RT @ChrissieEvert: What an inspirational @ABC special on Robin Roberts. So much pain and heartbreak thrown her way and she handled it wi ...", "Fri Apr 05 22:01:59 ": "@tennistweetscom seles?", "Fri Apr 05 13:09:38 ": "@ESPNTennis yesterday was a good warm up wuth Lord Drysdale newest inductee into the #tennishalloffame serenavenusallday", "Mon Mar 11 20:30:47 ": "What course am I playing? http://t.co/GUBroIMKGj", "Sat Apr 06 13:57:31 ": "40,000 Cooper River bridge runners closes down main rd to tennis so detour for sisters on #espntennis sun out http://t.co/PDMFRlPfmx", "Sun Mar 17 19:35:19 ": "Caroline's Dad is coaching so if we replay hit me up with any translation #espntennis", "Sat Mar 16 00:05:27 ": "@1pcornwell http://t.co/uGPIbkHX1I. Cheers back!! Hope your backhand is as good as your writing hand", "Sun Apr 07 18:16:19 ": "RT @NeilHarmanTimes: GSM GB 64 64 61. Seen it all nowhttp://www.thetimes.co.uk/tto/sport/tennis/article3725963.ece", "Mon Apr 22 14:53:32 ": "@thetracyaustin @ChrissieEvert @martina then I heard this story that George Kate and Sam's mom swore at Tracy Austin after losing a QF match", "Sun Mar 17 20:05:36 ": "@markalannixon can u help us again as PW back out coaching @ESPNTennis", "Fri Mar 01 15:11:14 ": "RT @justingimelstob: Congrats @DjokerNole preparing nicely 4 @LA10sChallenge advancing Dubai final!Few ... http://t.co/h5OVaS6fVB", "Thu Apr 04 14:21:32 ": "President Bush and @ChrissieEvert  yesterday at lunch. He loves tennis and has always SERVED well!!!! http://t.co/3XKV0haDXW", "Sat Feb 02 06:02:35 ": "My 1st tattoo!! Go @Ravens http://t.co/uyRxrYgw", "Fri Mar 22 14:02:03 ": "@TorreySmithWR I went to watch @martina last year on #DWTS and so did @ChrissieEvert  it was a blast. Can a @Ravens fan put me over 7,000?", "Sun Mar 03 14:44:11 ": "@ChrissieEvert i sooooooo love the fiesty you! Happy Sunday pal. What annoying show you watching next? Being on west coast i like head up.", "Mon Mar 18 04:31:20 ": "RT @EliseBurgin1: For years Sharapova considered spectacular tennis player but not spectacular athlete. Is she winning people over on at ...", "Tue Apr 09 23:05:04 ": "@MardyFish guess who won the 1996 celebrity olympic #wheeloffortune in atlanta before summer games?", "Sun Mar 10 05:30:06 ": "@traceyfrombondi welcome Tracey to twitter. She was my 1st practice partner when I moved to LA. Off 2 Indian Wells next week 4 #espntennis", "Thu Apr 04 02:05:54 ": "Awoke in LA flew to houston 2 have lunch w amazing couple 41 &amp; Mrs B &amp; @ChrissieEvert then to Charleston SC for #familycirclecup #espntennis", "Thu Apr 11 05:21:44 ": "4th Annual Cocktails for a Cause | April 17, 2013 | Shade Hotel http://t.co/bbtZpS8RW8 via @eventbrite w @flipsntwists @landondonovan &amp;more", "Sun Mar 03 14:47:27 ": "@BenRothenberg reminds me when i was just on tour i was told Hamburg was the vice capital of Europe to which i asked \"so what's the capital?", "Sun Jan 27 02:54:42 ": "@darren_cahill  kilt + celeb dbls = big shot @AustralianOpen. Meanwhile @PatrickMcEnroe @cbfowler @darren_cahill have fab final #espntennis", "Sun Apr 21 12:38:40 ": "RT @Orioles: RECAP: @ChrisDavis_19, Machado go deep, #Orioles complete doubleheader sweep with 6-1 victory. http://t.co/qMELCVvQo2", "Sat Feb 02 05:47:43 ": "Mr and Mrs Harbaugh should talk to Richard Williams and Oracene Price", "Sun Mar 17 20:40:21 ": "Easy to be patient for ceremony after a win http://t.co/nq6yfZsO9o", "Fri Mar 15 22:55:39 ": "1# signing after a routine win. http://t.co/uGPIbkHX1I", "Mon Apr 08 03:24:32 ": "RT @Venuseswilliams: I will be at @serioustennis in Atlanta Monday at 6pm showcasing @EleVenbyVenus for all the fans.", "Sat Mar 16 02:40:08 ": "My daughter is getting Mary Joe's headset warmed up. Get ready for Maria squared on #espntennis http://t.co/ZAIsF5esCH", "Sun Apr 07 19:45:26 ": "@thetracyaustin and now look at us XXXOOOO", "Sun Mar 17 00:27:59 ": "While the boys were playing in brutal heat, we went up to 10,000 ft &amp; played in snow. Sorry @darren_cahill http://t.co/ZvWp5LzXqS", "Wed Mar 27 05:05:41 ": "In Vail w kids. We met Lindsay Vaughn 2night. My son 7, when about to meet her says \"where is the famous skiing girl?\" she was gracious &amp;fun", "Sat Mar 09 03:00:10 ": "RT @EliseBurgin1: When Sharapova set up and dictating, not fun to be on other side of net..Schiavone getting beat up in the desert!!", "Tue Mar 05 06:36:54 ": "on world tennis day before i hit the hey, let me just say that tennis is the GREATEST sport of all for men, women, girls, boys GO TENNIS!!", "Mon Feb 04 05:20:24 ": "@humpybong57 not one left.. it was a blast sharing it with kids!! @Ravens", "Sun Feb 03 02:30:24 ": "@PatrickMcEnroe  Ravens 24-17", "Mon Apr 01 05:33:29 ": "All athletes should watch this and be careful, be smart, be philanthropic! http://t.co/8ZaaHblqkz", "Mon Mar 04 02:35:39 ": "RT @justingimelstob: Hanging with 2 sporting legends, @kobebryant @DjokerNole at the Laker game promoting @LA10sChallenge :) http://t.co ...", "Mon Apr 15 13:56:54 ": "bc of kids 3 bday parties and daughters bball gm could not watch golf live, finished at 1:30am. another amazing sporting finish. Aussies!!", "Thu Mar 14 01:46:45 ": "@BenRothenberg @Taylor_Townsen sounds like something I might say.. Again and again and ..", "Mon Feb 04 05:10:40 ": "@raylewis Best last game in Hall of Fame career since Sampras 02 US Open. Amazing night to share w my kids. thank you #Ravens", "Mon Apr 22 05:09:29 ": "@thetracyaustin @ChrissieEvert @Martina My mom played little Mo in Jrs in SoCal  70 yrs ago &amp; lost 6-0 6-0 more sportingly than i would have", "Tue Feb 26 05:42:27 ": "RT @BenRothenberg: RT @Clijsterskim: Hi everyone, we have some exiting news to tell you... Jada is going to be a big sister :-) ! Xxx Ki ...", "Mon Mar 11 02:51:05 ": "RT @thetracyaustin: Receiving a replica #FedCup trophy 4 the years I was on the winning team 4 the US along w @BillieJKing &amp; Rosie C ...", "Thu Feb 28 03:02:36 ": "My kid's dad just said the @oscars did want a Bond to present and tried to get him via a former agent but only rumors got to him so no go"}