{"Sat Mar 30 05:03:32 ": "AFL coaches are getting younger. But Sheedy and Malthouse say don't ever discount experience. #afl http://t.co/5zcqWljQHc via @theage", "Tue Mar 19 10:06:20 ": "Congrats to @chloejane32 on winning Cricket Victoria media award for this great story. http://t.co/VvSLoNXQxT via @theage", "Thu Apr 18 07:41:32 ": "Say what you like about kiwis, but at least they stand for principles. Wish we could too. http://t.co/sWKwUPN05L via @theage", "Tue Apr 09 04:27:45 ": "@deadeyebandit  not sure, but sounds it. Worth checking if interested.", "Sun Mar 17 01:06:04 ": "The AFL's no-contact on legs rule is a good one, but it might be tricky to enforce in the wet, says coach http://t.co/tC4La48yu5 via @theage", "Sat Mar 30 09:51:20 ": "Hi @RTLarks, that is one cool pic. Pity the fool!", "Sat Mar 16 07:58:25 ": "Looks like a job too big for the vics in the #shield unfortunately. Bloody nsw eyes off another title.", "Tue Apr 02 09:38:10 ": "It's a change for me from here on, as I'm now a court reporter for @theage. Yet to see any footballers in court, but only one day in!", "Tue Mar 19 13:34:12 ": "Jobe Watson admits the supplements probe the past six weeks has been turbulent for Essendon's players. http://t.co/S7Z0dkb2QG via @theage", "Tue Apr 09 04:33:53 ": "@deadeyebandit will do. Follow @theage_photo", "Fri Mar 15 04:12:34 ": "Carlton forecasts new role for Chris Judd in tonight's pre-season final against Brisbane. http://t.co/Uw0Ik9diaf via @theage", "Sat Mar 30 05:34:34 ": "Doggies on top of the ladder. Stick that bit of paper on the fridge now. #afl", "Thu Mar 07 13:59:54 ": "Call to ban alcohol ads in TV sports -  http://t.co/hlATgWFiIS via @theage", "Sat Mar 16 01:29:41 ": "Aargh! Vics fall short of first-innings pts v Tas despite D Hussey ton. Need outright now as six states chase berth in final. #cricket", "Thu Mar 14 05:08:24 ": "@ShortFirstSlip Fair point. Maybe they should show Rocky or Miracle on Ice.", "Tue Mar 19 13:35:58 ": "What reception awaits Essendon @ AAMI? Crows coach wants fans to be respectful, skipper says no sledging. http://t.co/A0BwRhXaxy via @theage", "Wed Mar 20 08:38:04 ": "Crows confident they can kick winning scores without Tippett. We'll find out Fri night. http://t.co/5J5qB2KjrH via @theage", "Wed Apr 24 05:07:08 ": "@Ben_Broad I'm feeling optimistic too. Good squad I reckon. Poms a lot more settled with their best team though.", "Sun Mar 17 08:47:10 ": "All over for vics in the #shield, losing to tas by 111. May it be tassie's from here on. Punter deserves it.", "Tue Mar 26 10:31:40 ": "Midnight Oil fans: the house on the album cover of Diesel &amp; Dust needs saving. Donate to help. http://t.co/78xZJgIJDv via @newscomauHQ", "Sat Mar 30 09:56:10 ": "@victory_dan reckon we might see different thinking next year though.", "Fri Mar 08 07:54:44 ": "McGuire fires up over Swan's Footy Show interview.  http://t.co/2CT93mH6I4 via @theage", "Fri Mar 15 13:35:14 ": "Bris coach Voss hails his side's finishing power and improvement in midfield. But stresses celebrations are done and dusted. #NABCup", "Mon Mar 18 23:42:16 ": "Anyone else feel uncomfortable about how the Shane Watson soapie might now go from crack-it to captain? http://t.co/fLaJMhnAkn via @theage", "Thu Mar 14 05:46:16 ": "@MattBrownABC Yeah, but if he was channelling David Beckham, Becks has changed styles 20 times since then.", "Tue Mar 26 22:21:14 ": "Bells beach classic starts today. Here's a preview: http://t.co/JJXdeJ0RSS via @brisbanetimes", "Fri Mar 15 13:37:11 ": "But Mick Malthouse says Carlton was smashed in clearances and surrendered after half-time. Says there's a lot of work to do. #NABCup", "Mon Apr 08 07:32:02 ": "@danbrettig thanks man, no shortage of characters here!", "Sat Mar 30 01:20:02 ": "One year since his death, Bells Beach remembers surf icon Michael Peterson. #RipCurlPro http://t.co/GQkLavmdQ3 via @theage", "Tue Mar 19 13:40:05 ": "Retired Hussey is welcome back. Would prompt more ridicule, but gotta admit he'd be handy right now. http://t.co/u4Dn3l0hL0 via @theage", "Thu Apr 25 04:03:59 ": "@brydoncoverdale must have been. No one knew the words.", "Sat Mar 30 05:04:52 ": "@emmasq Only if you bring back a real pizza from Napoli.", "Fri Mar 22 00:06:22 ": "Nathan Buckley flags hard work for Coll this year, but Pies will start season without Dale Thomas. http://t.co/PIiw27hzqW via @theage", "Wed Mar 20 08:40:27 ": "North pioneered Fri night footy. Now they know they must do well on the rare times they're on big stage. http://t.co/RvcfABcc6M via @theage", "Sun Mar 17 01:10:13 ": "Footy magazine in @theage today. I've tipped Hawks for flag but would be happy to be proven wrong.", "Thu Apr 25 03:03:11 ": "No wonder it doesn't get much of a run", "Sun Mar 17 03:22:04 ": "Vics need 337 from 73 overs to bt Tas and host the #shield final. Great finish to the season with all sides bar SA still a chance for final.", "Tue Apr 09 04:25:10 ": "@deadeyebandit “@theage_photo: Catch Age photog Penny Stephens talking about her work - Thurs night (11/4) at John Gorilla, Brunswick West.", "Tue Mar 26 10:41:55 ": "@rohan_connolly @newscomauHQ Yep, it belongs to them so let's give it baaaaaack. #fairsfair", "Sat Mar 30 09:34:10 ": "AFL to look at earlier season start with 25 games per team to help Suns, Giants. #afl http://t.co/HOzxiQK9QE via @theage", "Sat Mar 30 10:56:59 ": "Easter 2013. Ablett has risen. #afl", "Sat Mar 30 09:54:03 ": "AFL boss confirms his league asked ASADA about drug penalty discounts. #afl http://t.co/mYAhd5J4dN via @theage", "Tue Mar 19 08:07:48 ": "Thomas no distraction: Maxwell -  http://t.co/FnHVeOFicx via @theage", "Thu Mar 07 05:33:47 ": "Can't believe I'm saying this but well done to Kyle and Jackie O in this interview. http://t.co/T7jdIrIBUN via @theage", "Thu Apr 25 03:02:50 ": "At local #Anzac service just heard 2nd verse of national anthem: 'for those who've come across the seas we've boundless plains to share'", "Sat Mar 30 04:16:18 ": "@rdhinds Saw that game a few years ago. Apollo Bay Hawks had a No.11 who kicked five in comeback win. Sure to this day it was Gary Buckenara", "Tue Mar 19 13:42:21 ": "And surely not for the last time this season, the Magpies back their star pair over off-field issues. http://t.co/Cty5idYP41 via @theage", "Thu Mar 21 02:26:17 ": "James Hird hopes the way Ess players have handled pressure of late holds them in good stead this season. http://t.co/3a2OjK4iG0 via @theage", "Wed Apr 17 09:55:59 ": "RT @TheSharkTweet: Farewell Nelly you gorgeous beast. You broke hearts on the track and won them off it, happy retirement big girl! @bla ...", "Fri Mar 22 03:00:00 ": "RT @brydoncoverdale: Cricket Australia have confirmed Shane Watson will captain Australia in Delhi with MIchael Clarke ruled out due to  ...", "Thu Mar 07 07:33:34 ": "@GeorgeDobell1 @prakashbarot Not at all. Jokes aside, even the face of Aust cricket is changing. http://t.co/O7cplTHGn0 via @espncricinfo", "Thu Mar 21 23:58:58 ": "Bombers are tighter after their tough summer; now for their big test. Adelaide at AAMI Stadium. #footy http://t.co/ZU9gftaYkO via @theage", "Thu Mar 14 04:09:35 ": "Of all the replays for Fox to show in a rain break, they show the Aussies losing to Zim. Talk about kicking a side when it's down. #cricket", "Fri Mar 08 07:58:51 ": "Nice to see Jono Brown eager to start his 14th AFL season. One of the game's best players and characters. http://t.co/JtqwW1RLLb via @theage", "Thu Mar 21 05:54:43 ": "The spill that ended as a fizzle. #spill", "Wed Apr 24 02:26:47 ": "That said, cue the dad's army references from eng in response. #Ashes #Cricket", "Thu Apr 18 10:13:34 ": "@Warrigal150 gonna baulk at that one!", "Sat Mar 16 08:00:53 ": "Starc's test batting avge just a smidge behind phil Hughes'. Surely Aussies need not preoccupy themselves with an all rounder now. #cricket", "Wed Mar 13 00:25:33 ": "Proposals to beef up ASADA's powers to be debated in Parly today. Greens, Libs set to vote together. http://t.co/iaS1a3a52J", "Wed Apr 24 10:48:49 ": "@CommBank hi, not sure how you've infiltrated my feed but could you please go. I see enough bank ads.", "Thu Apr 18 08:01:42 ": "@rohan_connolly @theage cheers", "Tue Mar 19 10:01:32 ": "Blind auditions on ch9's #thevoice. But what about those who are mute?", "Sat Mar 30 09:41:50 ": "Maybe AFL should revamp drawn-out R1 with too many dud games instead of blaming cricket for dull opening. Haw-Geel is 11 days into R1. #afl", "Thu Mar 28 12:23:01 ": "Good to see Daisy Thomas back for the Pies' VFL side. Even better was watching Blues and Tiges slug it out. Nice to have #footyback", "Wed Apr 03 03:14:55 ": "RT @malcolmconn: #CRICKET Jackson Bird man of the match in his last Test - no contract. Xavier Doherty couldn't wickets on Indian spinni ...", "Mon Apr 01 21:25:39 ": "RT @FulhamFC: Full-time: Fulham 3-2 QPR. #FFC hang on to secure a tense win after Remy and Taarabt reply to Berbatov's double and Hill's ...", "Thu Mar 28 12:24:22 ": "Andrew Symonds would be handy in the Test team right now. Instead he's in the upcoming Celebrity Splash. Cricket continues to take a dive.", "Mon Apr 08 06:07:09 ": "@danbrettig you betcha! in court now, in a suit and waiting for charge sheet. Just 2 wks ago I was writing on dale Thomas' ankle. Big change", "Thu Apr 18 10:10:10 ": "@JacksonTruths I'd just like to inspired by our politicians, the same way I was today by politicians in the US and NZ.", "Tue Mar 19 13:32:27 ": "Nick Riewoldt fears an EPL-style gulf if the gap widens between the AFL's haves and have-nots. http://t.co/9iEIBtuTAw via @theage", "Thu Apr 18 22:37:18 ": "@JacksonTruths the ones who tried. Hmmm, seeya.", "Sat Mar 30 10:02:45 ": "@rmcahill @rohan_connolly no argument from me having the pies in the main slot. Would make good Friday great!", "Wed Mar 13 00:23:16 ": "Footy fires another shot at cricket's nerve to hold a Sheffield Shield final. http://t.co/uNdMxy5o0N", "Thu Apr 18 10:13:58 ": "@jopsenica cheers", "Tue Apr 09 03:35:48 ": "@ahleach @ralphyheraldsun @klioness \"When the facts change, I change my mind. What do you do, sir?\" - John Maynard Keynes.", "Sat Mar 16 00:55:22 ": "John Silvester's great read on a national approach to fighting organised crime. Has a killer kicker at the end too. http://t.co/9UfNLvfgB3", "Thu Mar 07 14:11:40 ": "@buckster355 too friggin hot to sleep. Hope things are comfy in the chandigarh digs. You've spent a bit of time there haven't you?", "Sat Mar 30 09:59:53 ": "Heard on radio talk about looming pressure on a coach (Voss). At this point the season was four games old. Surely this is a record. #afl", "Tue Apr 09 03:54:13 ": "@RalphyHeraldSun @ahleach @klioness     Distant great uncle I believe!", "Fri Mar 22 00:03:48 ": "Darren Lehmann is currently the best cricket coach in Australia. He gives @GregBaum some of his insights.http://t.co/Vg3f8jgcmH via @theage", "Wed Apr 24 05:10:35 ": "@rohan_connolly I agree with @holdsteadygirl man. I'd already forgotten about this women.", "Sat Mar 30 06:28:29 ": "AFL boss on countdown: Nah nah nah nah nah nah naaaaah. http://t.co/mi0zI0K2KJ via @theage", "Sat Mar 30 03:13:55 ": "Besides Doggies' great start, best thing about WB-Lions game? Traditional jumpers, colourful, dynamic and no white in sight. #afl", "Mon Apr 01 22:50:53 ": "Delhi's metro success a lesson for Australia -  http://t.co/bqQOGF0meV via @smh", "Sat Mar 30 05:45:49 ": "@NABFW Yeah fair point. But at least it beats the wishy washy white they wear in other away games. That Fitz jumper was beautiful wasn't it?", "Wed Mar 20 08:35:47 ": "Geelong skipper says new ruck rule may help ex steeplechaser make his AFL debut. http://t.co/AqX0a7njWf via @theage", "Fri Mar 15 13:33:09 ": "Bris Lions cap faultless pre-season with NAB Cup triumph. Brown's boys very impressive against Carlton. http://t.co/pbnrdLunWF via @theage", "Sat Mar 16 07:57:18 ": "Deledio, maric star as Richmond beats bulldogs at cold, wet princes park. Good news for doggies too as cooney, Morris among best. #afl", "Sat Mar 16 08:36:23 ": "@buckster355 he bowls more than Watson. Isn't that enough?", "Thu Mar 21 23:59:41 ": "David Zaharakis to be played in reduced role for Essendon against Adelaide. http://t.co/nDurmNJUEP via @theage", "Wed Apr 24 02:23:07 ": "And rapt to see patinson, siddle, harris and bird (no johnson) vie for 3 spots as quicks. Unless spinner left out at oval like '09. #cricket", "Thu Mar 07 14:19:29 ": "@buckster355 fingers crossed for five days for you. Trust you've got plenty of dayleads left in you. Morning radio before bed, please.", "Fri Mar 08 22:33:57 ": "This is the best AFL story I've read in ages, on Travis Boak and Port Adelaide. http://t.co/dG4l58bklW via @theage", "Thu Mar 21 03:06:06 ": "And here I was thinking it a bit messy the leadership would change hands to Shane Watson. #spill", "Tue Apr 16 22:26:47 ": "Judge finds it tough to jail Aboriginal offender. http://t.co/KE4R71c1TO via @theage", "Sat Mar 30 10:04:46 ": "@White_Adam agreed, but start the season with a bang. Maybe even a GF rematch like in the old days.", "Wed Apr 24 02:18:28 ": "Just saw #ashes squad. Happy with haddin and rogers. Rebuilding can wait, let's just go with best players. #cricket", "Thu Mar 14 05:04:37 ": "Actually, watching Zim's jubilation at the end was nice. Not so nice was Nathan Bracken's hairstyle back then. #cricket", "Sat Mar 09 08:15:28 ": "Episode II in the Dane Swan saga: The manager strikes back. http://t.co/hm1eLufRcj via @theage", "Wed Apr 24 05:20:08 ": "@rohan_connolly @holdsteadygirl the force of the click bait is strong in this one."}