{"Sat Apr 20 19:22:09 ": "@CoreyDevonDavis @AllthruChrst Haha you right!", "Mon Apr 15 21:31:06 ": "RT @TimTebow: Wow... Praying for everyone effected by the explosions in Boston today.", "Wed Apr 03 19:25:51 ": "@BadgerFootball What happened to the scoreboard?", "Thu Apr 04 20:37:18 ": "Do work bruh! RT @Cromartie_M: Wheels up..Off to Tampa.! #BusinessTrip #NFL http://t.co/wQh3HeFk5G", "Sun Apr 07 03:00:48 ": "🎶I hit it, I hit it, I hit it, I hit it, I hit it, I hit it first I hit it, I hit it, I hit it, I hit it, I hit it, I hit it first🎶", "Tue Apr 16 23:22:44 ": "RT @BCSmith58: Im truly blessed to be able to play the game I love. Cant put it into words how good it felt to be back out on the field  ...", "Wed Apr 17 13:38:01 ": "Haha people these days bruh! RT @DrPnutt: @WatKANuDo4Brown lmfao fool u got stalkers now? Damn bread truck! Haha", "Sat Apr 13 19:24:39 ": "We all have the same 24hrs last time I check. What are you doing with yours?", "Sat Apr 06 04:18:23 ": "RT @sj39: Beware of those whose loyalty is controlled by opportunity. Put your trust &amp; faith in GOD cause man will let you down each ...", "Fri Apr 19 01:02:39 ": "Feels good to see all the excitement around the upcoming schedule. Great things to come this fall! #GodProvides #BillsMafia", "Tue Apr 09 02:34:59 ": "@speedro8 HBD bruh!", "Tue Apr 09 04:14:38 ": "This Rain coming at the perfect time. Time to shut it down.", "Wed Apr 17 22:49:56 ": "RT @DSearcy21: Good work today, lets keep laying the foundation for success #GrindMode #OnDemGs", "Fri Apr 19 16:46:24 ": "RT @TAEO_NINE: I choose to be happy &amp; smile even when things aren't going good because I know it all happens for a REASON", "Fri Mar 29 19:11:54 ": "@JessicaLillian I been told you that you were dramatic! Lol", "Tue Apr 02 21:33:39 ": "I can't wait till it warm up here in Buffalo though. Lol", "Sat Apr 06 15:20:11 ": "Bout to hop on this 2K! Konkrete2Brown", "Fri Apr 05 03:31:30 ": "RT @carolynrose_xx: so tired but can't sleep -_-", "Tue Apr 16 18:05:40 ": "RT @BB5LIVE: Gm USA!! faith grows best in the winter of trial. 🙏🙏", "Fri Apr 19 01:09:32 ": "RT @foleydickie12: @WatKANuDo4Brown let's go buffalo #BillsMafia is here and salivating for a winning season", "Fri Apr 05 02:53:11 ": "@MarcB6 If you wasn't Duke you were garbage! Haha", "Fri Apr 12 14:25:50 ": "@bZuck36 Haha chill Zuck I'm still here man! You know I got you.", "Tue Apr 02 21:28:30 ": "I agree! RT @WarrenSapp: Don't ever question a Florida boy's desire or work ethic!", "Fri Apr 19 01:06:44 ": "RT @Its__Ritz: @WatKANuDo4Brown homie! I cant freakin wait! Im so damn excited for the season. #BigThings coming for the #BillsMafia #Bills", "Tue Apr 09 13:37:16 ": "S/O to the big homie @OmgCAUTION! Preciate the love! Go follow ASAP! http://t.co/dPiOYDxTVS", "Wed Apr 17 13:38:21 ": "@bZuck36 far from it. Lol", "Mon Apr 22 15:19:52 ": "RT @LovLikeJesus: Prayer should be the Key in the Morning, And The Lock at night!!", "Thu Apr 18 16:32:39 ": "RT @BO_NUPEs1946: Y'all hear Obama speak in Boston and say \"...excel in every field of human endeavor...\" I think he's done his research ...", "Mon Apr 22 01:36:00 ": "RT @DougBaldwinJr: If your child has the opportunity to go away for college, encourage it. Greatest thing that happened to me was being out…", "Wed Apr 03 12:38:50 ": "RT @StevieJohnson13: it's money out there.. a for sure way of not getting it is by staying in bed. lets Hustle! #HBHF", "Sat Apr 06 16:41:24 ": "#RP Me and @who_is_jojo on the sticks chillen at the house. #GodProvides http://t.co/IZjuvUUGl4", "Thu Apr 18 15:53:44 ": "No pressure. Lol RT @M_Ball28: Gonna throw this 96mph fast ball! 😆😆", "Thu Apr 04 00:04:42 ": "RT @bplano: @BadgerFootball @M_Ball28 @WatKANuDo4Brown - Also possible the students brought it down from so much jumping around/cheering ...", "Sat Apr 20 14:28:54 ": "RT @LovLikeJesus: Praise God even when you dont understand what He's doing.", "Wed Apr 03 12:09:28 ": "RT @Beautiful_Verse: Everything can be done for a believer. - Mark 9:23", "Thu Apr 18 16:53:18 ": "RT @DavidGilreath18: I like Drake new music but its hard to get on twitter after a new song drop because everybody start quoting his lyr ...", "Sat Apr 13 15:32:19 ": "It was good to see my #Pitt fam yesterday. #H2P", "Fri Apr 05 19:28:30 ": "#OnWisconsin RT @TalentAgent2: #FF if you are a true BADGERS FOOTBALL FAN @watkanudo4brown @aaronhenry7 #FSESPORTS", "Fri Mar 29 18:50:41 ": "RT @TimTebow: So humbling to think that on this day over 2000 years ago the Son of God chose to give up his life so that we could have e ...", "Mon Apr 15 13:10:45 ": "RT @CoreyMcintyre38: Morning everyone and thank god for another day.", "Sun Apr 07 03:01:18 ": "😂😂😂 Ray J was a fool for that one!", "Fri Mar 29 23:37:15 ": "RT @tchoice23: I want to say thanks to the Bills organization and to all my fans I'm heading back to buffalo. http://t.co/hNxktWXqV9", "Thu Apr 04 20:51:15 ": "Me and Joe Sawyer just took the longest ride through Orchard Park. Lol", "Fri Apr 19 01:13:13 ": "@tchoice23 You done got delayed bruh?", "Fri Apr 19 01:26:43 ": "RT @dtrautman1: @WatKANuDo4Brown that opener will be crazy", "Tue Apr 02 13:11:08 ": "Thanking God for another day. Blessed to see another one! #BlessedBeyondMeasure #GodProvides", "Fri Mar 29 23:37:36 ": "RT @DanGer_FieLd20: Obedience always brings blessing.. !", "Tue Apr 02 21:43:48 ": "RT @JimmyScap: @WatKANuDo4Brown This is cold even for us that live here. Should be spring by now!", "Fri Mar 29 22:50:43 ": "RT @GoPittFootball: Tom Savage to Kevin Weatherspoon for a 15-yard TD. \"Spoon\" having an impression-making spring! @ClairtonBears #Pitt", "Tue Apr 09 02:39:56 ": "@IKeepsIt103 chillen bruh watching this game.", "Wed Apr 10 21:40:35 ": "@JJWatt Haha they gone let you in free anyway!", "Fri Apr 05 03:28:47 ": "RT @TreyDayAllDay_: @WatKANuDo4Brown Thanks for the gloves big bro... Keep ballin out up there in Buffalo", "Wed Apr 10 12:03:35 ": "RT @AaronHenry7: Thank you Jesus for another one!!!!!", "Sat Mar 30 16:08:25 ": "RT @BB5LIVE: Gm!! The best kind of friend is a praying friend. Under any circumstances I pray for all my homies..", "Fri Apr 05 01:41:24 ": "RT @MarcB6: @Tjporter2 @WatKANuDo4Brown @PendergrassRB Ayee y'all can't tell me u don't remember Beasely spazzin like the Rutgers coach  ...", "Tue Apr 09 00:46:04 ": "RT @AboutAquarius: #Aquarius work hard, play harder and stay humble.", "Sat Apr 13 19:22:45 ": "Me and @Kev_Spoon88 kicking it like Fifa right about now.", "Tue Apr 09 04:13:10 ": "Second time around I know better.", "Tue Apr 02 21:44:00 ": "Yes i do! lol RT @ProudParents18: @watkanudo4brown  same here bro, you already know all about WI", "Thu Apr 04 20:43:00 ": "RT @CJSPILLER: Hope everyone is having a great day on this Thursday we had another productive day at the stadium.#layingthefoundation", "Thu Apr 18 01:50:20 ": "It's amazing what confidence can do for you.", "Sun Apr 07 23:34:59 ": "Happy Birthday Mom! #Love #GodProvides 🎂 http://t.co/M191QNKscZ", "Mon Apr 15 21:24:05 ": "RT @DanGer_FieLd20: I wonder how it feels to know you already made it before you actually made it... Na nvm that just wouldn't be me #sl ...", "Fri Apr 19 03:33:24 ": "RT @Beautiful_Verse: Save me from people of the world  - Psalm 17:14 .", "Sun Apr 07 23:55:06 ": "RT @TAEO_NINE: I'll never hit a woman, she can do or say whatever if its that BAD I rather #ReplaceHer", "Fri Apr 05 01:43:52 ": "@MarcB6 Hahahaha yea bruh he use to throw the ball everywhere but at us.", "Fri Apr 19 03:24:50 ": "Swag Champ of the world! RT @scorindorin: I second that! RT @RonBrooks33: @StevieJohnson13 one of the coolest hard workin ppl I know #SALUTE", "Sat Apr 20 14:25:50 ": "RT @TeamAthleteLife: RETWEET if you play for God!", "Sat Apr 20 01:58:31 ": "Me and @who_is_jojo trying to find a good wing spot. #Decisions", "Fri Apr 05 03:15:29 ": "Some of the words of wisdom that @AaronHenry7 has told me I still think about to this day. #Truth", "Fri Apr 05 03:17:41 ": "I use to always come to @AaronHenry7 about something and he would say \"Like my Grandma or my Daddy would say.\" Lol", "Sat Apr 20 19:27:39 ": "@CoreyDevonDavis Lol you see that lil bruh! I guess I gotta say this the official Zach Brown in my bio.", "Wed Apr 17 23:40:24 ": "Thanking God for his blessings! #HighlyFavored", "Sun Apr 07 16:27:08 ": "Thankful for another day! #GodProvides #BlessedBeyondMeasure", "Sat Apr 13 15:26:10 ": "RT @Fred22Jackson: Happy birthday to the Big Homie @teambryanscott", "Fri Apr 05 03:19:01 ": "\"All crying does is make it harder for you to see.\" You remember this one bruh? @AaronHenry7 haha", "Fri Apr 05 03:30:57 ": "@TreyDayAllDay_ No problem lil bro! Do your thing this spring and eat! #GodProvides", "Fri Apr 19 04:08:44 ": "RT @trillaboy561: Rt if Rep Florida", "Fri Apr 12 01:50:20 ": "Finally made it to Pittsburgh.", "Sat Mar 30 01:38:47 ": "Thats was up bruh! RT @CatchinMyDreams: Surprised my Mom n Dad Wit New Cars Today! #Blessings #ChangingLIVES #JTG", "Tue Apr 02 21:30:35 ": "Felt good to get back in the building and grind with the team today.", "Sun Apr 07 19:03:21 ": "RT @WhoisTPoole: Video gave me chills. Let's me know how blessed I am to play this game. Someone out there is dying to play.", "Sun Apr 21 14:57:13 ": "RT @Im_MikeB: We all make mistakes. Nobody's perfect. Just gotta continue to move in the right direction despite the setbacks.", "Sun Apr 07 03:00:22 ": "🎶She might move on 2 rappers &amp; ballplayers But we all know I hit it 1st\nI hop in the club &amp; boppers show love &amp; I don't even put in work🎶", "Tue Apr 09 03:19:05 ": "@IKeepsIt103 yea", "Wed Apr 10 21:22:30 ": "Starting to look like Pittsburgh is going be the destination this weekend.", "Sun Apr 21 02:33:07 ": "#NBAPlayoffs", "Sat Apr 13 20:50:38 ": "When i get back we gotta go! RT @CatchinMyDreams: Bout to see where my bowling game at! 🎳", "Tue Apr 02 13:05:53 ": "RT @AaronHenry7: Rise and shine world!! Thank you Jesus for another wonderful day", "Sat Apr 20 19:37:01 ": "@CoreyDevonDavis Yup! It's all good tho.", "Thu Apr 11 12:06:33 ": "RT @23botter: Read a great quote.... Blood makes you related but loyalty makes you a family.  How true #OlineU", "Sat Apr 20 01:11:41 ": "On this 2K Konkrete2Brown", "Fri Mar 29 19:48:13 ": "@JessicaLillian I'm not even close! Lol", "Sat Apr 20 19:19:43 ": "@CoreyDevonDavis @AllthruChrst What y'all know about The Whispers? Lol", "Fri Apr 12 13:51:41 ": "#RP Me and brit_spoon last night straight  flexin for Instagram real quick. #Goofy 😂 http://t.co/9dHLeY3FVD", "Wed Apr 17 13:36:00 ": "We got people out here making fake twitter accounts. @Zach_Brown35 😂", "Sat Apr 13 15:23:58 ": "RT @cjlquips: Great seein @WatKANuDo4Brown and @Mike_Shan87 at the spring game #pittmen #H2P", "Fri Mar 29 18:58:34 ": "RT @ChrisMaragos: Good Friday is \"good\" because it's the best news we could ever have. Christ's perfect sacrifice on the cross for imper ...", "Fri Apr 05 20:25:59 ": "@TalentAgent2 Buffalo.", "Fri Apr 19 15:37:32 ": "Hard to say you don't have a purpose if your heart still beating. #BlessedBeyondMeasure #GodProvides"}