{"Mon Apr 22 06:05:07 ": "@DParwana Hope you've voted for him then. http://t.co/uFrdVHevVi #Bollywood100", "Mon Apr 22 06:04:04 ": "@dino_29 Hey there, thank you for your valuable suggestion. We'll try our best and keep you updated.", "Mon Apr 22 03:30:41 ": "\"When asked if my cup is half-full or half empty, my only response is that I am thankful I have a cup.\" #Suprabhat #Quote", "Sat Apr 20 09:45:58 ": "Vote and make your friends vote too! The greatest elections in the HISTORY of Bollywood. Vote now at http://t.co/ro93HsvRNi #bollywood100", "Fri Apr 19 13:14:43 ": "RT @vedant123: http://t.co/XKp3SyiY2Y Just checkd the photoshoot pics of @iamsrk @SrBachchan nd Dillip Saheb! Perfect icons to salute #1 ...", "Fri Apr 19 15:34:45 ": "Tera haath haath mein ho agar, toh safar hi asle hayaat hai / Mere har kadam mein hain manzilen, tera pyar gar mere saath hai. #KabhiKabhie", "Sat Apr 20 08:28:06 ": "RT @AtikaChohan: Yeh Dekha? Praise for the show! @HISTORYTV18 http://t.co/fWdzlBiqT9", "Sun Apr 21 06:56:35 ": "@pooja1712 We have them on repeat all week. You can catch part 1 of Behind The Scenes on monday at 11 and part 2 at 5:30 #bollywood100", "Mon Apr 22 10:25:24 ": "@rayofash73 Hey there, next week's episode is dedicated to the DIVAS of Bollywood including Sridevi &amp; Rekha. Don't miss it, Friday at 9 PM!", "Fri Apr 19 15:38:26 ": "Vidhu Vinod Chopra originally wanted Naseeruddin Shah, Suresh Oberoi and Ajit Vachani in the film #Parinda. #Bollywood100", "Sat Apr 20 06:49:44 ": "If you missed the Behind The Scenes, you can catch Part 1 it today at 4:30 PM and Part 2 at 10 PM. #bollywood100", "Fri Apr 19 16:11:22 ": ".@sanasaeed17  who played young Anjali in #KKHH, also later played the role of Tanya in @kjohar25’s Student of the Year! #Bollywood100", "Mon Apr 22 07:01:51 ": "@DParwana Glad to hear that! Let's wait and see who wins! Have you voted in all other categories? :)", "Sat Apr 20 07:08:16 ": "Closest battle of #bollywood100 is for the Greatest Male Singer where Mohd Rafi leads Sonu Nigam by just 106 votes. http://t.co/T6CVFG2VCR", "Fri Apr 19 15:54:13 ": "Newcomers @aamir_khan and @iam_juhi actually helped distribute flyers and stickers of the film during the promotion! #QSQT #Bollywood100", "Mon Apr 22 05:56:36 ": "@shrootishenoy @manishalakhe @100 Thank you for your valuable suggestion. We will get back to you soon on this. :) #Bollywood100", "Mon Apr 22 04:30:41 ": "\"The problem is not the problem; the problem is your attitude about the problem\" - Captain Jack Sparrow #Quote", "Mon Apr 22 05:57:51 ": "@anilalur Hey, we're sorry you feel that way. Would you care to tell us what's wrong so that we can try to improve on that?", "Fri Apr 19 15:36:12 ": "In the wedding scene, @SrBachchan's own parents are seen sitting on the mandap! #KabhiKabhie #HISTORYFacts #Bollywood100", "Sat Apr 20 12:13:35 ": "RT @RanjibMazumder: Do watch.Also CNN IBN 8 pm RT @HISTORYTV18 If you missed Bollywood@100,you can catch Part 1 it today at 4:30 PM &amp; P…", "Fri Apr 19 15:38:01 ": "#HISTORYFact: Parinda's original cast didn't have Jackie Shroff and Anil Kapoor. #Bollywood100", "Fri Apr 19 15:50:06 ": "“Dosti mein, no sorry, no thank you…” #IconicDialogues #Bollywood100", "Mon Apr 22 05:58:56 ": "@SinghShiven31 Hey, the nominees of #Bollywood100 were shortlisted by a panel of eminent jury members and experts.", "Sun Apr 21 06:39:34 ": "The first song to be recorded was \"De de Khuda ke naam pe\" sung by W. M. Khan. Vote for your favourite singers here http://t.co/ro93HsvRNi", "Fri Apr 19 13:51:05 ": "Sunidhi Chauhan. Votes: 498, currently in 4th place. #SunidhiChauhan #Bollywood #India #Indian #Hindi… http://t.co/JEROOX3GWf", "Sat Apr 20 07:36:36 ": "Have you voted for your greatest entertainers of #bollywood100? Vote now and make a difference. Visit http://t.co/ro93HsvRNi to vote.", "Fri Apr 19 15:36:43 ": "Instead, Neetu Kapoor was cast for this role. She and Rishi Kapoor fell in love while shooting this film. #KabhiKabhie #Bollywood100", "Mon Apr 22 09:04:54 ": "To vote for Waheeda Rehman as Greatest Actress give a Missed Call on 08082807830 or click: http://t.co/uFrdVHevVi http://t.co/1WHxgEQiPE", "Sun Apr 21 18:55:27 ": "RT @max4974: Karan Johars show on Bollywood@100 was awesome.", "Fri Apr 19 15:48:04 ": "Anil Kapoor invested all the money he had made as an actor into making Mr. India #Bollywood100", "Mon Apr 22 10:26:46 ": "@SwarajMama_sBoy Hey there, you can vote for SRK by giving a missed call on 08082807829 :) #Bollywood100", "Mon Apr 22 12:29:44 ": "It's the Joker - Jack Nicholson's birthday today. Can you tell us who's the Joker/Showman of Bollywood? Dial 08082807825 to VOTE for him.", "Sat Apr 20 06:56:19 ": "@Tanumoy_Bose The channel itself has no stance. It leaves the interpretation open for the viewers :)", "Mon Apr 22 06:00:23 ": "@Tanumoy_Bose We believe everything to be true. :)", "Fri Apr 19 16:17:44 ": "To get the village crowd to cheer for the required scenes in Lagaan, @aamir_khan actually sang Aati Kya Khandala to them! #Bollywod100", "Fri Apr 19 16:04:52 ": "Did you know, Kajol fell off the cycle while filming Yeh Ladka Hai Deewana, and actually developed amnesia for a short while! #Bollywood100", "Fri Apr 19 15:48:44 ": "Mogambo khush hua! #iconicDialogues #Bollywood100", "Mon Apr 22 07:39:35 ": "@Gupchuptweets Hey there, you can vote here: http://t.co/uFrdVHevVi #Bollywood100", "Fri Apr 19 16:15:00 ": "Must be #TrueLove RT @AaStHa_M: @historytv18 Yes I Know! U know that she only remembered Ajay's name? #Bollywood100", "Fri Apr 19 15:38:58 ": "It was Anil Kapoor who convinced Vidhu Vinod Chopra and Jackie Shroff for #Parinda. #Bollywood100", "Fri Apr 19 15:39:41 ": "Jackie Shroff had his doubts about doing justice to the role in #Parinda, saying, \"Mujhe acting nahin aati\" #Bolywood100", "Mon Apr 22 05:30:41 ": "\"When the past calls, let it go to voicemail, believe me, it has nothing new to say.\" #Quote #Inspiring", "Fri Apr 19 15:48:54 ": "Enter the 90s and #Bollywood100’s era of love!", "Sun Apr 21 04:30:07 ": "\"People throw stones at you and you turned them into milestones”\n― Sachin Tendulkar #Quotes", "Sat Apr 20 06:46:32 ": "@manishalakhe That's a wonderful suggestion. We will share the feedback with the team. Let's see. #bollywood100", "Sat Apr 20 04:30:00 ": "“My Life is My Message”\n― Mahatma Gandhi #Quotes #SoTrue", "Sat Apr 20 06:48:06 ": "@NAMRATARAI66 You can watch it today at 4:30 PM and 10 PM. #bollywood100", "Sun Apr 21 18:59:20 ": "RT @avigamya: @HISTORYTV18 you guys are really doing an awesome job in spreading awareness about important issues :):)", "Sat Apr 20 12:19:08 ": "All it takes is a click or a missed call. So what are you waiting for? Vote for the Greatest of #bollywood100. Visit http://t.co/uFrdVHevVi", "Sun Apr 21 07:21:32 ": "RT @p1j: India's 1st 'Tarzan Type' Cinema.Featuring one ofmy GrandFathers in Lead:) #Vintage #Tarzan #100YrsofBollywood #Zambo http://t.co/…", "Fri Apr 19 13:17:55 ": "1,00,000 votes and counting! The biggest voting in the HISTORY of Bollywood is going on. Vote now! http://t.co/lxioc3E1CV #bollywood100", "Fri Apr 19 15:47:43 ": "Superstars like @SrBachchan had turned down Mr. India, thinking it to be an unviable film #Bollywood100", "Fri Apr 19 15:35:46 ": "The romantic version of the poem #KabhiKabhie that the film made popular was actually written later, based on the sad version! #Bollywood100", "Sat Apr 20 05:30:00 ": "“If you're not failing every now and again, it's a sign you're not doing anything very innovative.”\n― Woody Allen #Quotes", "Mon Apr 22 06:44:33 ": "'Aahen Na Bhareen Shikave Na Kiye' sung by Noor Jahan was the 1st Qawwali recorded in female voices. VOTE for her http://t.co/uFrdVHevVi", "Mon Apr 22 09:20:52 ": "@shuklamit @1mgupta @kankanac @brisha_15 @stamlobeta @ankurchuriwal @iamneer Hey, to vote for @SrBachchan give a missed call on 08082807820", "Fri Apr 19 15:35:31 ": "Sahir Ludhianvi had actually written two versions of the poem #KabhiKabhie. One was a romantic poem, the other was a miserable ode to loss.", "Fri Apr 19 16:21:18 ": "To get his character right in Khosla Ka Ghosla, @bomanirani spent 3 weeks listening to a tape recording of a property broker in Delhi!", "Mon Apr 22 07:01:18 ": "@anilalur Hey there, this yr we're celebrating #100YrsOfBollywood and which other topic describes #India best other than Bollywood! :)", "Fri Apr 19 15:34:55 ": "#HISTORYFact: Yash Chopra changed the opening scene of #KabhiKabhie because it was deemed too experimental! #Bollywood100", "Sun Apr 21 10:27:45 ": "RT @prabhupradeep: Watching Behind The Scenes #Bollywood@100 on @historyTV18! @kjohar25 giving great insights on Film Industry! Luking fwd …", "Sun Apr 21 13:51:55 ": "RD Burman unknowingly became a composer at 9 when SD Burman used his tune to create a song. Vote for Pancham Da at http://t.co/ro93HsvRNi", "Mon Apr 22 06:07:03 ": "@nsmahesh18 Hello there :)", "Sun Apr 21 18:52:03 ": "RT @p1j: 1st Heroine of Talkie-Era Zubeida recalling AlamAra song http://t.co/KUv1ROasgl RT @HISTORYTV18 1st song was \"DeDe Khuda ke naam\" …", "Mon Apr 22 06:01:58 ": "@Raghu_Filmy Glad you're loving the shows! Do follow us for more updates. :)", "Sun Apr 21 10:30:43 ": "Who played Devdas better, Dilip Kumar or Shahrukh Khan? Have you voted for the Greatest Actor at http://t.co/ro93HsvRNi yet? #bollywood100", "Mon Apr 22 12:43:43 ": "@ShahSamey You're absolutely right. :)", "Mon Apr 22 10:06:12 ": "Vote for A R Rahman as the Greatest Composer by giving Missed Call on 08082807860 or click: http://t.co/uFrdVHevVi http://t.co/6ySzPW7Mub", "Sun Apr 21 03:30:06 ": "“ To the world you may be just a person, but to a person you may be the world ”\n― Yonelfri Marte #quotes #suprabhat", "Sun Apr 21 18:53:14 ": "@avigamya Glad you like the show. :)", "Mon Apr 22 06:23:52 ": "Behind the success of every winner will lie YOUR vote. VOTE for the Greatest in Bollywood &amp; make them win! Vote here: http://t.co/uFrdVHevVi", "Fri Apr 19 16:35:29 ": "@biswaraj007 Glad you liked it! We'll be back with more same time next week! In the meantime, keep following us here and on FB for more!", "Sun Apr 21 05:30:06 ": "When you sell a man a book you dont sell him just 12 oz of paper and ink and glue, you sell him a whole new life.\n-Christopher Marley #Quote", "Fri Apr 19 15:31:57 ": "Who else is tuning into #Bollywood100 with us right now? Join us and @kjohar25 on a behind-the-scenes tour of 80s and 90s Bollywood!", "Fri Apr 19 16:03:23 ": "It was the railway station scene at the end of #DDLJ that convinced @iamsrk to do the film! #Bollywood100", "Sun Apr 21 07:19:58 ": "Meena Kumari and Madhubala started acting at the age of 7 and 9 respectively! Did you vote for the Greatest Actress? http://t.co/ro93HsvRNi", "Sat Apr 20 03:30:00 ": "“The unhappiest people in this world, are those who care the most about what other people think.”\n― C. JoyBell C #Quotes #Suprabhat", "Mon Apr 22 07:02:52 ": "@AnitarajRaj @SaranshSehgal2 @NAMRATARAI66 Hey there, the nominees of #Bollywood100 were shortlisted by a panel of eminent jury members.", "Fri Apr 19 15:39:56 ": "Vidhu Vinod Chopra gave Jackie a sealed envelope with a mantra he was to repeat 100 times. The mantra was ‘I know acting.’ #Bollywood100", "Fri Apr 19 15:46:48 ": "Salim Khan’s initial idea was to make quick money with Mr. India, since fewer days of shooting with the actor would be needed. #Bollywood100", "Fri Apr 19 16:51:03 ": "@biswaraj007 We're at http://t.co/RjNdgo3ef8 See you there!", "Fri Apr 19 16:21:41 ": "Keep watching to see an excerpt from Omi Vaidya's audition tape for the film #3Idiots #Bollywood100", "Sat Apr 20 12:47:13 ": "Watch the second part of the unmissable Behind The Scenes episode with @kjohar25 tonight at 10 PM. #bollywood100 #100yrsofBollywood", "Mon Apr 22 08:21:25 ": "Vote for Manna Dey as the Greatest singer by giving a Missed Call on 08082807873 or click: http://t.co/uFrdVHevVi http://t.co/BaStS8CCag", "Fri Apr 19 15:37:14 ": "“That walk which became so popular in Ram Lakhan, that is Subhash Ghai. I imitated him.” – Anil Kapoor #Bollywood100", "Sun Apr 21 18:53:49 ": "@Quetzal_bird Vote for him here! http://t.co/uFrdVHevVi #Bollywood100", "Fri Apr 19 15:40:30 ": "Anil Kapoor and Nana Patekar gave Jackie acting lessons on the sets of #Parinda. Jackie won the Best Actor Award for the film! #Bollywod100", "Mon Apr 22 06:04:40 ": "@MursalYaqubi Hope you've voted for him then! http://t.co/uFrdVHevVi #Bollywood100", "Fri Apr 19 16:01:15 ": ".@MadhuriDixit1 is currently leading the votes in the Greatest Actress category in #Bollywood100. Have you voted yet? http://t.co/uFrdVHevVi", "Sun Apr 21 18:52:33 ": "@sharadhik Vote for him here :) http://t.co/uFrdVHevVi #Bollywood100", "Fri Apr 19 15:52:14 ": "If Juhi Chawla hadn’t done Qayamat Se Qayamat Tak, she would have played Draupadi on the TV show Mahabharat! #Bollywood100", "Sat Apr 20 12:13:14 ": "@NAMRATARAI66 It will be shown at 10 PM #bollywood100", "Sat Apr 20 07:25:06 ": "@alpi1980 You can see that factor in other categories too. Click here for the leaderboard http://t.co/bCEr7v5Wew #bollywood100", "Fri Apr 19 13:38:52 ": "How many of you have voted for #Bollywood100? Who did you vote for and why? If not, please vote at http://t.co/E3oEKqp67G", "Fri Apr 19 15:36:55 ": "#HISTORYFact: Parveen Babi was Yash Chopra's first choice for the role opposite Rishi Kapoor. #KabhiKabhie #Bollywood100", "Mon Apr 22 14:05:09 ": "Ghazal king Jagjit Singh is on the 5th position with 593 votes. Surely he deserves more votes, what say? Vote here: http://t.co/uFrdVHevVi", "Sun Apr 21 06:32:14 ": "RT @shuklamit: @HISTORYTV18 : Video of @SrBachchan and Nusrat Ji together. Amit Ji enjoying the soulful voice of Nusrat Ji https://t.co/6Tc…", "Fri Apr 19 16:31:18 ": "Thanks for watching #Bollywood100 with us! Remember, the greatest icons in Bollywood need your vote at http://t.co/uFrdVHevVi Vote now!", "Fri Apr 19 16:12:02 ": ".@BeingSalmanKhan offered to do the role in #KKHH only because he greatly admired @kjohar25’s father! #Bollywood100", "Sat Apr 20 06:53:49 ": "@biswaraj007 https://t.co/r18rktOTw2"}