{"Fri Apr 19 06:46:59 ": "RT @alertnewengland: Authorities tracked the carjacking suspects to Watertown thanks to anti-theft system in the Mercedes they stole.", "Tue Apr 23 20:50:03 ": "This lady says it's her 50th birthday and it's her first time on an airplane", "Sun Apr 21 08:25:49 ": "@ochocinco ok I'm coming", "Mon Apr 22 07:18:22 ": "Wish I hadn't clicked the link to see that picture of the dead boston bomber", "Mon Apr 22 14:01:29 ": "RT @SanQuinn: Core DJ retreat Las Vegas here I come", "Fri Apr 19 17:09:48 ": "These guys probably felt like nothing their whole lives &amp; now for a moment they're headline news like the most important people in the world", "Wed Apr 24 17:42:39 ": "@philthyrichFOD me", "Wed Apr 24 22:56:07 ": "@ItsMeMeBitches lol let me get to work", "Mon Apr 22 14:09:59 ": "@PastorTroyDSGB tomorrow hit up @iamtonyneal", "Sun Apr 21 04:38:40 ": "He's my assistant RT @IAMRICI: Yo what do Kid Cudi do anyways??", "Fri Apr 19 22:07:30 ": "still processing the fact that a sneaker company mailed out marijuana m&amp;ms to entice media to write about their product lol", "Fri Apr 19 06:26:18 ": "i'm jealous of the guy who live-tweeted the bin laden raid. that's way cooler than getting lil wayne's first post-prison tweet", "Sun Apr 21 16:40:15 ": "@ochocinco that looks like @OccupyMyBeard giving yall a mean side eye in the background lol", "Sun Apr 21 22:34:11 ": "Just posted a photo @ Dogwood Festival http://t.co/NUUHrPDfja", "Fri Apr 19 06:45:23 ": "RT @PerezHilton: New FBI photo of Boston bombing suspect 2 http://t.co/se2yVc4S1Z", "Sat Apr 20 01:13:54 ": "RT @PetesWire: Better shot of boat where suspected #bostonmarathon bomber was hiding out. #wbz http://t.co/iwizBhTGm7", "Fri Apr 19 17:17:52 ": "RT @PumaTPG: @JuliaBeverly Its certainly a way into the history books, but what can media do? they have to report it one way or another", "Fri Apr 19 21:53:16 ": "It's m&amp;ms I'm kind of afraid to eat them tho RT @GinaMontana_: @JuliaBeverly that's weed in the green bottle?", "Fri Apr 19 17:16:56 ": "RT @AndreOfAtlanta: An Ex-FBI Dir. also criticized media handling. They sensationalize info which should be suppressed", "Mon Apr 22 06:57:50 ": "RT @LouisOliver25: LIV right now w Flo Rida, Rhianna. @DJPROSTYLE killin this sh_t.... http://t.co/iRN7pC4FuF", "Fri Apr 19 22:19:53 ": "@NuccioKing so why would lil wayne be mailing me marijuana m&amp;ms lol", "Mon Apr 22 21:46:44 ": "@MattCoward1 comedy is not your forté", "Fri Apr 19 19:21:20 ": "So the bombing suspect tweeted \"aint no love in the heart of the city...stay safe\" right before the attack. Coldblooded", "Sun Apr 21 22:37:06 ": "making my nephew dizzy http://t.co/9G9cAcyycb", "Mon Apr 22 01:54:06 ": "@Pill4180 whassup", "Fri Apr 19 19:16:08 ": "All the rappers wanna be pimps &amp; all the pimps wanna be rappers.", "Fri Apr 19 16:14:41 ": "RT @MissJia: YOU chose to get on TV and have your alleged reality on display. So we blog about the real life YOU talk about and you mad?", "Sat Apr 20 19:47:15 ": "Or \"penetration\" RT @iammick: I still giggle like a 3rd grader everytime a basketball announcer says a \"little floater.\"", "Fri Apr 19 19:20:16 ": "RT @MichaelSkolnik: insane photo of the military rolling through #Watertown... http://t.co/p7mbt8mAqV (via @jw2840)", "Sun Apr 21 21:32:27 ": "things u see at piedmont park: crossdressing man dancing with shake weight http://t.co/3TgtPF2Q07", "Fri Apr 19 22:12:28 ": "@1Daskkki u must not be reading my timeline", "Fri Apr 19 06:05:50 ": "RT @MzGossipGirl: I appreciate the ppl in Mass. live tweeting but if you are hearing explosions around you it's time to get off twitter", "Sat Apr 20 06:57:14 ": "RT @Staticjon: Opening act fail: throwing piles of CDs at the crowd when nobody's paying attention", "Mon Apr 22 06:55:29 ": "@DJPROSTYLE happy bday!", "Wed Apr 24 03:30:26 ": "yeah, that's not at all creepy @ Palms Casino &amp; Resort http://t.co/8ghjRFzcGe", "Sun Apr 21 04:49:25 ": "RT @maura: bombing suspect quoted 'rent' on his twitter account. why no 'what we know about the suspects' taste in musical theater' piece?", "Fri Apr 19 06:35:06 ": "RT @BostonGlobe: Official: Marathon bombing suspect in custody, another remains on the loose http://t.co/5MGC0toyv5", "Fri Apr 19 21:48:52 ": "so i got a 4/20 gift pack in the mail from lil wayne &amp; his new sneaker line Spectre... i don't smoke..… http://t.co/BkV33J9HNK", "Sat Apr 20 00:06:25 ": "@The_A_Prentice lol", "Fri Apr 19 15:23:39 ": "RT @tomuky: #watertown Imagine looking out your window and seeing this http://t.co/soFoAGSkjp", "Sat Apr 20 13:01:01 ": "@WuChangTX nice", "Fri Apr 19 17:18:28 ": "RT @msloredo: @JuliaBeverly It bothers me that we give so much attention to losers. It's why people keep causing these tragedies.", "Sat Apr 20 12:35:25 ": "RT @DaRealsebastian: Not everybody has a hustler mentality, some people been working a 9-5 so long they only do what somebody tells them do", "Thu Apr 25 03:41:17 ": "in the studio w yogottikom @ Studio At The Palms http://t.co/pRTnABrXIx", "Sat Apr 20 17:59:27 ": "RT @cavemanpromo: Road life is not healthy!", "Fri Apr 19 22:11:32 ": "what's it called when one person exhales weed smoke thru their mouth &amp; another person inhales it?", "Fri Apr 19 23:19:12 ": "RT @JohnGotty: #TBT -- Julia Beverly &amp; The Greatest Webbie Interview Of All Time http://t.co/G8GlqyNcBx", "Sat Apr 20 02:23:19 ": "donation page for the guy who lost both legs in the marathon bombing http://t.co/oW8n4YXqfO", "Sat Apr 20 22:00:40 ": "RT: @JLBarrow: 22 Hilarious Twitter Responses To TMZ's Boston Coverage http://t.co/FBX0y448qu via @heavenrants", "Mon Apr 22 21:23:51 ": "Shocked Dzhokar Tsarnaev Always Thought Classmates Were Really Great Judges Of Character http://t.co/eQG9iFCTwE via @TheOnion", "Sat Apr 20 02:41:26 ": "@massappeal they said that on CBS *shrugs*", "Sun Apr 21 21:04:32 ": "This little girl flying her kite at the park is concerned that it may run into an airplane", "Mon Apr 22 04:43:25 ": "@THEREALDJSHAWTY regarding what", "Fri Apr 19 06:43:17 ": "So these dumbasses thought they could just drop off bombs at an event w photographers everywhere &amp; not get caught?", "Fri Apr 19 06:48:45 ": "RT @DOPEPICS: America raises just as many terrorists as any other country...", "Sat Apr 20 01:01:42 ": "RT @mayortommenino: \"We got him\" #oneboston http://t.co/tRNUDb7vIx", "Fri Apr 19 22:17:44 ": "Ok, I once saw snoop &amp; don magic juan blowing a shotgun &amp; it was a traumatizing experience RT @djwallysparks: blowing a shotgun", "Fri Apr 19 16:23:41 ": "RT @GhostwritaMusic: You walk into Walmart for some toothpaste and body wash and come back out with a mountain bike and universal remote", "Mon Apr 22 14:01:03 ": "Twitteer allows the whole world to participate in one big inside joke", "Fri Apr 19 23:28:48 ": "@EDUBB713 I don't smoke", "Fri Apr 19 17:08:22 ": "I feel like the way media profiles mass killers encourages copycats. In their twisted minds it's a way to become powerful &amp; famous", "Mon Apr 22 16:16:13 ": "@rapcoalition @balleralert RT @SunshineDBaby: @JuliaBeverly http://t.co/v7z5TKRdBQ MUST read article", "Fri Apr 19 06:05:26 ": "RT @ErikGParker: Listening to Boston MA scanner live, here. http://t.co/B0PbetzvFi", "Fri Apr 19 16:11:28 ": "Hahaha yes. Come check out the art festival RT @RSoon: The Dogwood Festival may be the most aggressively Caucasian event in Atlanta.", "Fri Apr 19 20:15:45 ": "@VinceValholla it'd never work cuz people wanna know who they are &amp; why they did it. Natural curiosity.", "Sun Apr 21 16:43:42 ": "Lolol RT @DaBishopDonJuan: I WAS GETTING SO STONE ON 420  I STARTED SMOKING WITH A MIDGET http://t.co/tMOE3QvBlG", "Fri Apr 19 06:00:25 ": "RT @nnamdi_okafor: The hurt our country is feeling now, is a consequence of our lack of love...", "Sat Apr 20 06:38:53 ": "@KillerMikeGTO happy bday!", "Fri Apr 19 21:57:27 ": "I was at an all ages concert once &amp; crime mob was passing out weed flavored lollipops to all the kids I was like um.....", "Sat Apr 20 18:10:03 ": "Same thing they were talkin about on 'Racks on Racks' RT @RealLifeKaz: RT @_CocoLopez: Wtf is French Montana saying in stay schemin?", "Sat Apr 20 02:24:03 ": "RT @GAFollowers: Picture of Boston Marathon suspect in custody. http://t.co/Ilpd18M0cZ", "Sun Apr 21 08:24:29 ": "@djbrandigarcia happy bday!", "Wed Apr 24 22:56:16 ": "@CandaceJade84 yup", "Sun Apr 21 16:41:35 ": "@ochocinco no but I will be soon, I'll come prepared w vibrams", "Sat Apr 20 14:05:50 ": "RT @BillionaireBon: Never let fear decide your fate", "Mon Apr 22 21:27:17 ": "Let me know what time love &amp; hip hop atl premieres so I can be sure to log off twitter during that time", "Sat Apr 20 02:52:31 ": "Fri Apr 26 Bow Wow hosts Onyx in Milwaukee @ymcmb_bw @iamtonyneal.. Booking inquiries @agencytwelve http://t.co/eC2XZ5OUEG", "Mon Apr 22 16:15:41 ": "This is typical. RT @SunshineDBaby: @JuliaBeverly http://t.co/v7z5TKRdBQ MUST read article", "Sat Apr 20 13:40:29 ": "It looks like 4/20 started early cuz I got a lot of random 5am texts from weed smoking friends that don't make much sense", "Thu Apr 25 02:59:42 ": "ran into @traeabn &amp; @dorroughmusic at the core djs retreat @ Palms Casino &amp; Resort http://t.co/wJi6AqT4ry", "Fri Apr 19 06:05:15 ": "RT @Ralphige: going to sleep listening to boston police scanner... may my dreams morph into whatever it becomes, it will be interesting", "Sat Apr 20 19:38:31 ": "Wow RT @BostonGlobe: MT @MassStatePolice: Photos taken from State Police Air Wing on Watertown manhunt. http://t.co/YV9ESuSnXw", "Mon Apr 22 23:51:21 ": "@MayorNYC it's pretty clear from your avi that you're not into women, so your opinion is irrelevant", "Sat Apr 20 13:15:33 ": "RT @passport_cutty: people who smoke weed are just aggravating. Can't eat, sleep, talk, drive, watch TV, throw out the garbage w/o a blunt", "Fri Apr 19 23:27:40 ": "I think I should interview more rappers at wal-mart. Turn it into a series", "Fri Apr 19 21:56:29 ": "@mrlfrager what's good", "Sun Apr 21 23:00:00 ": "saw a lot of dope artwork today @ Dogwood Festival http://t.co/QLY2rKQXpG", "Sun Apr 21 08:24:36 ": "@EBEAUTY404 lol", "Fri Apr 19 22:04:51 ": "so today I got to hear barry weiss do his best impersonation of pimp c, probably the greatest thing that's happened all week", "Fri Apr 19 16:00:43 ": "RT @AdrianChen: larger version of old profile pic from @j_tsar twitter account: definitely suspect #2 http://t.co/INi1aP1JyF via @wildcowboy", "Sat Apr 20 13:43:20 ": "@Ludacris coldblooded lol", "Sat Apr 20 13:48:26 ": "@MadFreshDaily lol I had people offering to buy mine", "Fri Apr 19 17:12:29 ": "Uncle Luke's new Make It Rain Tour will feature free condom giveaways. This is a real press release I just received", "Sat Apr 20 02:36:39 ": "The bombing suspect in custody took the oath to become an american citizen on 9/11 last year", "Fri Apr 19 06:44:17 ": "If it was some white guys that did it we're not calling it \"terrorist attacks\" anymore huh", "Fri Apr 19 22:31:11 ": "@djwallysparks I thought they were about to kiss I was like wtf", "Fri Apr 19 06:46:13 ": "RT @peterstringer: Boston Police Scanner: \"White male, grey hoodie, black curly hair, possibly with assault rifle and explosives.\"", "Fri Apr 19 06:01:21 ": "RT @nnamdi_okafor: remember what you were doing when u didn't have any dreams. that was boring. these bumps in the road make for a good trip", "Fri Apr 19 18:23:50 ": "The governor of massachusetts is kinda fine. Learn something new every day", "Fri Apr 19 06:51:12 ": "@Embassy730 no"}