{"Fri Mar 29 00:00:33 ": "The first show of our tour at Villa in Perth sold out last night!! We still haven't slept, currently jet lagged as... http://t.co/GwrNCXX2kr", "Sun Mar 10 23:25:51 ": "SXSWSXSWSXSWSXSWSXSWSXSWSXSWSXSWSXSWSXSW", "Mon Mar 18 21:50:24 ": "While the world is going insane over the 'Green' version, give some love to the original 'Red Light, Green light'... http://t.co/L20LtfXMxm", "Thu Mar 21 18:40:43 ": "Thanks to the legends that caught us last night in New York! Tonight we're playing at Shea Stadium in Brooklyn -... http://t.co/MNwx4q3hvw", "Mon Mar 11 20:06:51 ": "We've been added to the Sailor Jerry SXSW showcase with Natural Child!!! Now that's 11 shows in 7 days!!! http://t.co/o8D6ejjJyF", "Mon Apr 08 14:58:02 ": "DUNIES 4 PERTH http://t.co/vcFzRFZWax", "Tue Mar 19 00:35:57 ": "Where the weed at in Texas?!", "Wed Apr 10 13:33:42 ": "Fuck some cunts are weird http://t.co/5RsAbGHbxC", "Fri Apr 05 03:28:41 ": "Win the chance to smoke all your best weed with your old mates Dunies tonight!! EVERYONES A WINNER", "Sat Apr 06 21:15:08 ": "Dexi's. https://t.co/ud1g75avGD", "Mon Mar 11 10:44:58 ": "El Paso was awesome tonight! Stoked that there were some Mexican Dunies frothers at the show!!", "Fri Mar 29 06:28:17 ": "Just woke up smelling like the vomit I vomited all over myself and the rental drums during Red Light Green Light... http://t.co/ZyuEOrAU17", "Wed Mar 13 09:04:43 ": "Our YouTube channel got pimped! Check out the sexy goodness!\n\nhttp://t.co/NZtSusExHQ", "Mon Mar 11 01:29:22 ": "Tough bands are funny http://t.co/6w5BUmmwaZ", "Wed Mar 13 16:08:25 ": "2 Austin shows down, we're playing the Sailor Jerry party today at 1pm!! http://t.co/NUS629nInN", "Thu Apr 04 00:33:55 ": "We are taking over Grace Darling Hotel for two nights this week! We have just released 10 tickets to our Sold Out... http://t.co/kjeZXIJUBt", "Wed Mar 20 01:00:09 ": "NEW YORK! WE'RE PLAYING AT CAKE SHOP NYC TONIGHT!!!", "Tue Apr 23 23:05:10 ": "IT WAS HARDER THAN NOT TELLING OUR MUM'S WE LOVE BONGS, BUDS &amp; BITCHES BUT YOUR BEST MATES DUNIES ARE PLAYING... http://t.co/R3zThnha0P", "Thu Apr 11 03:51:41 ": "FIRST SYDNEY SHOW IS SOLD OUT! SO STOKED WE THOUGHT WEED REHEARSE FOR ONCE. SOUNDING REALLY SHIT!!! YEW http://t.co/6kc6IkI7pN", "Wed Apr 17 06:56:21 ": "Getting some Coachella up in my face http://t.co/7XKDoV2c15", "Tue Mar 12 03:53:01 ": "We're playing two shows at SXSW tomorrow. COME", "Thu Mar 14 19:40:33 ": "Someone just told us to \"fuck a dingo\" at sxsw #classic", "Fri Mar 15 07:59:33 ": "Mustard! http://t.co/GvOONKsErC", "Mon Apr 08 06:45:31 ": "Just got let into the Virgin Australian lounge after crediting about two years worth of flights at the airport.... http://t.co/5t6L556Six", "Fri Mar 15 19:46:45 ": "SXSW = HECKERS", "Tue Mar 26 00:13:49 ": "Melbourne you are to good to us, we want to touch you. NOT MANY TICKETS LEFT TO THE SECOND SHOW! *Disclaimer* DR... http://t.co/nws0C9wxKM", "Wed Apr 03 03:15:36 ": "I'm not gonna doooooooo, what everyone thinks I'm gonna dooooooooo and just FLIP OUT mannnnnnnnnnnn http://t.co/w5q0IfLsWE", "Mon Apr 01 03:22:21 ": "We've been offered the opening support for Justin Beiber at the Sydney Myspace launch April 20th. We're going to do it #youngsnatch", "Fri Mar 22 21:50:19 ": "Apparently since your old mates Dunies have been away our tune \"Red Light Green Light\" has been played every... http://t.co/B0Wz9D2tvq", "Sat Mar 23 20:17:09 ": "+61438128126\n\nHey wanna chat with a spunk??? Call our mate Dunners he's keen for a good time ;) http://t.co/UV8WlPkb3Z", "Fri Mar 22 00:33:25 ": "WE WANNA PLAY SOME SHOWS IN NEW ZEALAND! Is that even allowed? #redhobbitchilipeppers http://t.co/w7UOZ3xOdu", "Mon Apr 01 09:27:46 ": "ADELAIDE WAS FUCKING RAD LAST NIGHT!!!! SOOO GOOD TO BE TOURING AUSTRALIA RIGHT NOW!!!!!! http://t.co/u4kZEijwyV", "Sun Apr 21 09:19:51 ": "Fucking STOKED our Smile EP is finally out!\n\nIf you want the sucker for free send us a 5 second video of the best... http://t.co/t1rEcUyXxl", "Sat Apr 20 06:17:17 ": "Happy 420 love Dunies!", "Thu Apr 11 09:26:32 ": "STOKED TO PLAY WITH OUR MATES SURES AGAIN TONIGHT WITH PRO VITA GET DOWN EARLY AND BRING INFLATABLES!!!", "Thu Apr 18 06:27:13 ": "CHECK OUT OUR NEW EP COVER!!! iTUNES REJECTED IT SO WE'RE SORTING SOMETHING OUT HOPEFULLY BY TOMORROW!!!! NEW... http://t.co/QJcmVI0pjQ", "Wed Mar 27 01:21:14 ": "JUST GOT BACK TO AUSTRALIA!!!! TOUR STARTS NOW", "Sat Apr 20 06:57:25 ": "Your old mates Dunies new EP 'Smile' is finally up on iTunes!! PG artwork but Fuck It!... http://t.co/awErPZxAax", "Thu Mar 14 23:53:08 ": "PLAYING A SECRET HOUSE PARTY WITH FIDLAR &amp; THE ORWELLS!!!! PARTY FROTH CUNTZ YYEEWWWW", "Tue Apr 09 02:26:35 ": "A few days off max chilling at Brett's mums house!!! http://t.co/xbSJglpdUe", "Thu Mar 28 12:38:31 ": "We're in PERTH!!! First night of the tour is tonight PEACE LOVE AND CONES http://t.co/06irC8VDt7", "Sat Mar 16 00:04:00 ": "Someone have Danny a knife on stage last night. Creepy shit", "Wed Apr 17 17:22:01 ": "Our mates Bleeding Knees Club have a fresh ass new track check it! We had the sickest time touring with these... http://t.co/ATycQjzLNm", "Mon Apr 01 05:41:17 ": "APRIL FOOLS! Dunies aren't playing with Justin Bieber..... but we are however TOURING IN SOUTH AFRICA, SOUTH EAST... http://t.co/zQ0ccoCy3V", "Thu Apr 11 00:54:15 ": "I posted a new photo to Facebook http://t.co/eyNHNVjKME", "Sun Mar 10 07:24:17 ": "CRAIG ATKINS our sick mate from Sydney has been doing all of our artwork recently! Hit him up yo", "Fri Mar 22 00:56:29 ": "We're playing at Shea Stadium in Brooklyn tonight 16 shows down 4 or so to go then we come home for our Australian tour!", "Sun Mar 10 19:33:06 ": "Thanks to everyone who watched us in Encinitas and Arizona! About to drive to El Paso Texas to play a show... http://t.co/oLJe8NFE9Q", "Sat Mar 09 08:08:22 ": "Arizona is awesome. @TheGanaschz bcmichaels deathknowsyourname @ Tempe http://t.co/GdbnK2o6P1", "Tue Mar 12 23:16:08 ": "HOME TOWN CROWD!! Come lose your shit.... http://t.co/IHbVPM2HKb", "Sun Apr 07 02:03:06 ": "I missed my flight, 6am can s my d anyway", "Mon Mar 11 23:00:08 ": "SXSW KICKS OFF TODAY FOR THE DUNIES!", "Fri Apr 05 06:35:47 ": "Chanel V asked to do an interview next week. Looks like Danny's audition tape's done good", "Wed Apr 17 14:40:43 ": "Pretty keen to start selling our music in return for bit coins", "Wed Mar 27 08:35:57 ": "@Frenchkissing @EmmaLouiseHere !!!!!!", "Tue Apr 09 23:37:53 ": "STOKED TO PLAY OUR FIRST UNDER 18 GIG IN FUCKING AGES! CYA SOON KIDDIES #nothingsuss http://t.co/BcPq8X4Jyu", "Sun Mar 24 22:25:44 ": "IT'S THE 20TH AND LAST SHOW OF OUR USA TOUR TONIGHT IN NEW YORK AT THE AUSSIE BBQ!!!!", "Fri Apr 05 02:06:26 ": "MELBOURNE TODAY AND TOMORROW!", "Thu Apr 11 05:24:20 ": "A PICTURE FROM BRETT'S BIRTHDAY SURPRISE AT SXSW AUSSIE BBQ. NAWWW http://t.co/pHeWoUWWj6", "Tue Apr 02 04:34:07 ": "WE DROPPED INTO THE High Times Magazine OFFICE IN NEW YORK, SMOKED \"DABS\" AND STONER RANTED IN THEIR PODCAST ABOUT... http://t.co/0sXd8W6gmM", "Wed Mar 13 22:29:39 ": "MELBOURNE! We gone done and added a SECOND SHOW at The Grace Darling with APES &amp; ScotDrakula! Tickets on sale now... http://t.co/c4zy8gw5q2", "Tue Mar 19 17:59:05 ": "Get a job...", "Wed Mar 27 08:35:10 ": "RT @Frenchkissing: G: SXSW pixxxx #1: Dune Rats in east Austin somewhere http://t.co/tQvomVWA2I", "Tue Apr 23 06:44:21 ": "THE SECRET IS OUT - YOUR OLD MATES DUNIES ARE ACTUALLY DAFT PUNK - OUR FIRST UNMASKED SHOW IS TOMORROW! http://t.co/ziz5bAZ6Li", "Sun Mar 24 00:00:09 ": "HAPPY BIRTHDAY TO OUR BASS MAN BRETT YOU FUCKING SICK CUNT!!! http://t.co/1kpn3Pewh7", "Fri Mar 29 00:32:00 ": "RT @holtperkins: I had a dream that i met up with harry (of one direction fame) and we went to a dune rats concert. #what i should defin ...", "Mon Apr 22 00:13:49 ": "RT @triplejplays: .@DUNERATSS - Red Light, Green Light [10:09]", "Thu Apr 18 09:00:08 ": "DUNIES FIRST CHINESE TOUR POSTER!! We have no idea what the fuck it says but a \"Dragon Boat Party\" sounds pretty dope http://t.co/dFGtS69dBm", "Tue Apr 16 00:23:17 ": "We just got a bunch of (non-crack) needles for South Africa....my arm feels like some fat cunt's been punching it... http://t.co/WCKJCyxQo5", "Wed Mar 20 22:55:58 ": "Guess who just interviewed Dune Rats? Here's a MASSIVE hint... http://t.co/9Qe79Rl5Me", "Sat Mar 23 23:51:23 ": "2ND LAST SHOW OF OUR USA TOUR TONIGHT IN PHILADELPHIA. Our 20th and last show of the tour is the Aussie BBQ in... http://t.co/MAlwFSMUnq", "Mon Apr 08 02:52:59 ": "Mutt packing district...", "Sun Mar 10 02:44:15 ": "Our old mate Seanny Bates started up a sick online store Boneyard Supply - Check it! http://t.co/CBAPThZdAZ", "Mon Apr 08 06:42:56 ": "Just got let into the Virgin Australia after crediting 2 years worth of flights. Free beers are cool, pity about... http://t.co/iFCW5nPKNi", "Mon Apr 22 07:21:22 ": "FIRST EPISODE OF THE \"DUNE RATS: AMERICAN DEATH TRIP OF DREAMS\" SERIES HAS JUST BEEN PUT UP YYEEEWWW CHEERS  TO... http://t.co/8JrZ3r7WG0", "Wed Mar 20 22:55:48 ": "Guess who just interviewed Dune Rats? Here's a MASSIVE hint... http://t.co/KUGIeue8vF", "Tue Apr 02 02:21:21 ": "THANKS TO ALL 9,000 OF OUR MATES....WISH WE COULD HAVE A MASSIVE DUTCHIE WITH YOU ALL!! http://t.co/hOS2DuSHW8", "Sat Apr 06 07:04:15 ": "DRUNK MUMS RULE!!!", "Wed Mar 20 17:35:57 ": "NEW YORK!!! Come to Cake Shop TONIGHT", "Fri Mar 22 02:00:07 ": "Your old mates DUNE RATS are playing at Ashbury Park in New Jersey tonight at The Berkley-Certeret Hotel tonight. It's All ages and Free yew", "Tue Apr 09 06:59:17 ": "CHECK THE VIDEO FROM OUR ROOFTOP SESSIONS IN LA YEW!! #rollogrady\n\nhttp://t.co/b38JUpyXYF http://t.co/gMmv5sjupI", "Sun Mar 10 03:38:13 ": "You awesome peeps see the Brooklyn Vegan article? http://t.co/avlQo3iYOR", "Wed Mar 20 04:22:04 ": "See BC's face? Look in his eyes... he wants you to come to the second Sydney and Melbourne shows when Dune Rats... http://t.co/Lsc3nltASh", "Sun Mar 10 01:26:29 ": "Here's the poster for all our SXSW shows! We just found out that we're playing at the High Times Awards!!!!! http://t.co/L0qVt7XtPi", "Wed Mar 20 23:00:08 ": "BROOKLYN! We're playing at shea stadium tonight!", "Mon Mar 18 21:49:45 ": "While the world is going insane over the 'Green' version, give some love to the original 'Red Light, Green light'... http://t.co/Kk79w5ZPNZ", "Sat Apr 06 02:43:54 ": "Last nights show in Melbourne was fucking mayhem!!! We're playing our second sold out Melbourne show tonight with... http://t.co/uGd3X1FT9V", "Mon Mar 11 04:41:22 ": "Just got to El Paso Texas and there isn't even 1 taco kit in sight. FUCKING ROUGHT #standandstuff", "Wed Mar 20 01:07:43 ": "Just got to New York!!!! Our new home away from home!!!", "Thu Mar 14 06:34:06 ": "Dudes and Dudettes!\n\nYou know you can get the Dune Rats x Afends \"Red Light, Green Light\" cutoff online now?... http://t.co/dxp9SHl9Lt", "Wed Apr 03 13:47:09 ": "Got a good feeling about tomorrow... http://t.co/MXUUKuMsWg", "Sun Mar 31 06:41:22 ": "SECOND SHOW OF OUR AUSSIE TOUR TONIGHT IN ADELAIDE AT THE FOURWORDS PARTY AT RHINO ROOM! \n1ST 5 PEOPLE WITH A... http://t.co/vFtxsPRMsa", "Sun Mar 17 22:59:11 ": "WALMART RIDEN http://t.co/UOGzBB4q1Q", "Sun Apr 07 12:56:55 ": "Max chilling #braveheart http://t.co/5P6HwxNV4Q", "Thu Apr 18 05:08:00 ": "We ate a bunch of acid in Central Park in New York with our Australian mate lord Fascinator... These are their... http://t.co/gTfaB8BG8V", "Wed Apr 17 09:49:34 ": "I posted 12 photos on Facebook in the album \"LIVE\" http://t.co/9wVKadAU4T", "Wed Apr 10 08:33:25 ": "YOUR OLD MATES DUNIES ARE STOKED TO PLAY OUR FIRST (18+) HOME TOWN SHOW SINCE THE STATES AT TRACK AND FIELD IN... http://t.co/iLYR5x7I9c", "Sun Mar 17 20:23:58 ": "SXSW was a blast mangs!!!!! Thanks to everyone who helped and came to shows......we are now buttfucked. NY soon!!!!!!", "Wed Apr 03 10:45:02 ": "ADELAIDE WAS MAHEM! NEXT STOP MELBOURNE YEW #airportbeers http://t.co/XyhMqhNNje", "Thu Mar 14 01:32:48 ": "SYDNEY we haven't forgotten you either, we are playing a SECOND show at Brighton Up Bar with the bad boy stylings... http://t.co/4WMe2OdAlt"}