{"Wed Mar 06 05:10:18 ": "“@kimberlee_davis: DId not realise @mc_pez was so attractive.” - haha cheers babe. Kimmidge reppin viewbank", "Sat Mar 16 06:08:34 ": "“@SurBoosington: @mc_pez major fucking props on the vid &amp; song. You're getting love all the way from Madison, Wi” - Thats epic! Thanku sir!", "Mon Oct 24 09:44:38 ": "“@PrimeIsHere: @PagenElypsis your vocal warmup game is strong.” - haha i recall something about fingering your enemies asshole yeah?", "Tue Nov 01 02:02:58 ": "So im currently in the champagne bar in a hand me down suit $12 fake leather kmart shoes haha. What up rich cunts! (and cheers davo)", "Tue Dec 20 02:36:17 ": "“@mr_B_man: @mc_pez I'm taking a whole box of endone. Can you wake me when your new album drops?” haha!", "Fri Jan 25 01:54:29 ": "If you're a legend, click this link and come join me :) http://t.co/7Q5DcglN", "Sat Nov 03 04:23:58 ": "Hey dackies (@3ree6ixty ) i just went to get some frenchies from the bar at derby...", "Thu Jan 26 08:04:35 ": "“@STYALZFUEGO: Getting a bit nervous now” - you're all good babe", "Wed Feb 22 00:53:20 ": "“@Skryptcha: @mc_pez ill vid bruz, bars hit close to home with me too ha, I feel ya!” - thanks bra :)", "Thu Dec 01 07:04:25 ": "Yeah gotta say much love to everyone in mentone last night :) that shit was hysterical!! Felt like 3 years ago when my album first came out", "Sun Mar 31 09:32:27 ": "“@HannahKorin: I had a dream that I had brunch with @mc_pez but it turned out to be an imposter..Was so realistic I woke up crying - haha!", "Fri Mar 30 05:14:41 ": "To my Sydney twitter folk, i'm playing an ALL AGES show @ The Hi Fi bar tonight! Come down & get involved!", "Wed Feb 27 21:25:14 ": "“@chloe_dudley: @mc_pez in sweatpants 👌😱❤” - Haha cheers babe", "Fri Jan 04 00:52:33 ": "haha cheers @neuetopher :) it gets a lot better than that bro so feel free to hang up those boots", "Fri Jan 04 00:47:27 ": "“@Diafrix: Fresh tune! @mc_pez http://t.co/gVpV5B4v” - cheers bra :) kinda bugs me out that they're playing it hey!", "Wed Mar 06 22:49:18 ": "“@FORTAFY: Seen the new clip at the gym @mc_pez dope work!!!! Everyone make sure u chk it out!” - Cheers brother!", "Tue Dec 04 01:58:06 ": "@theaussiebbq @triplejlinda (the same time) rookie tweet error there haha", "Thu Jan 26 06:40:33 ": "“@Mphazes: Cigarettes @illyal produced by me NUMBER 35!!!” - congrats boys! Cracker of a song", "Thu Dec 06 03:28:13 ": "@EbonyPaigeM all good babe :) i cant wait to put out some more music now just to see how many more we can get haha", "Mon Mar 11 05:03:21 ": "“@NealeBaylie: @mc_pez threw my phone case to u at GOODLIFE &amp; u put it in your pocket, u were the best performer there!” - haha that was u!", "Mon Oct 31 11:12:13 ": "@siettamusic don't be afraid to send me one of those soulful bangers now too bro! Haha", "Mon Mar 04 09:59:46 ": "@hadbiebergasm thank you :)", "Tue Dec 18 03:36:24 ": "RT @triplej: It's ya boi @mc_pez with his new single 'The Game' for @triplej_VandL! http://t.co/BFC8zhjI", "Fri Feb 08 07:20:56 ": "“@mpowney: Purchased my first Aussie hip hop track this morning - The Game by @mc_pez - after hearing it on JJJ” - Love your work brother!", "Sat Mar 16 06:03:46 ": "“@donald_mcmillan: @mc_pez big fan man hope u come to scotland one day” - thanks brother :) me too!", "Fri Jan 04 00:50:18 ": "RT @neuetopher: @mc_pez if the rest of your new album is half as good as your single, I'm going to need to quit my job and start listeni ...", "Sat Jun 16 07:58:06 ": "Probably the darkest track off it but i fucking love it. Shout outs to Arie-Elle on the eery outro http://t.co/BWqyYnlx", "Wed Feb 29 10:01:31 ": "@siettamusic hey bruv it wont let me haha, keeps failing. I'll try when i get home!", "Thu Jan 26 06:53:59 ": "And of course congrats to trigger (@funkoars) as well for sing it. RIDICULOUS beat", "Thu Jan 26 08:43:26 ": "“@triplej: #8 360 (@3ree6ixty) - 'Boys Like You (Ft. Gossling)' #Hottest100” - fuckin boooooooom", "Wed Apr 10 11:26:46 ": "RT @tonedeaf_music: INTERVIEW: We chat with @mc_Pez about his health scare, songwriting, and his forthcoming album and tour. \nhttp://t.c ...", "Wed Oct 12 00:43:55 ": "Jesus christ @Drapht @funkoars that's some epic shit right there boys!", "Mon Mar 11 08:05:45 ": "“@squidlez: @mc_pez when i was on my mates shoulders u pointed at me &amp; it made my fucking life complete, u r amazing cunt &lt;3” - haha legend!", "Thu Dec 06 03:17:52 ": "For anyone who hasn't heard it u can either go to http://t.co/DrLlfYQx for youtube or http://t.co/TW43uQy9 for some soundcloud action. peace", "Mon Nov 07 12:20:24 ": "@KidMacMusic @bigphrase @3ree6ixty @fighting_fear if i actually checked twitter, yes i would've loved to bra. My bad", "Mon Oct 31 11:21:32 ": "@Mphazes word up son, awesome. Im hitting the studio on wednesday for our track so we'll fire up when ur back", "Tue Mar 12 11:00:36 ": "“@RebeccaSmedley1: Im convinced @mc_pez pointed to me &amp; said he loved me, not the girl next to me #goodlife - haha it was definitely u babe!", "Tue Mar 12 01:25:18 ": "“@miss_barbie_n: Love love love @mc_pez's song the more I hear it! Also how hot he is #NewCrush #TheGame” - haha thanks babe :) #sweetheart", "Wed Feb 06 04:02:05 ": "@emmahswitch @92deg_espresso haha u 2 r awesome :) c u there babes!", "Sat Oct 15 06:10:57 ": "@MatikDJ haha genius", "Wed Feb 27 21:22:33 ": "@BushRohan &amp; cheers brother :)", "Thu Jan 26 07:01:57 ": "“@JohnnyUtahAus: Fuck.. @mc_pez has really come out of the twitter woodwork on Hottest 100 day! haha.” - haha yeah im following the updates!", "Thu Jan 26 05:38:58 ": "@HermitudeMusic are pretty fuckin dope hey.. Cracker of a song", "Sat Mar 23 04:05:42 ": "Im pretty sure the 4 women sitting next to me in this cafe could pass for seagulls if i recorded them", "Sat Jan 05 00:59:18 ": "“@StaceyLeeFrench: Great arvo tunes @mc_pez thank you 😎 http://t.co/xMmTSDNt” - you're welcome stace, much love babe", "Tue Oct 25 02:46:42 ": "“@PrimeIsHere: My mind's telling me noooo, but MY BODYYY'S telling me yes.” - R Kelly?", "Thu Nov 22 05:05:35 ": "Nobu dogs tonight babes? Fucking boom @3ree6ixty @crystallouu", "Sun Feb 10 02:59:32 ": "Anyone who's at st kilda fest, i'll be on the main stage at 3:45!! Come check it out!!", "Sun Apr 14 00:52:19 ": "“@AusTomasMc: I can't stop listening to @mc_pez - The Game. Awesome track buddy!” - cheers tommy!", "Wed Dec 05 10:16:51 ": "“@homeandhosed: #nowplaying @MC_Pez - The Game (9:15pm) - love your work dom :) i need to step my twitter game up so im up on things haha", "Thu Dec 01 07:01:56 ": "“@infiniteaus: @mc_pez just smashed the mentone hotel, a few girls fell inlove” - haha", "Tue Mar 05 10:51:38 ": "@beniahcolby nup all new bra", "Mon Oct 31 11:07:01 ": "@siettamusic haha word bro, good to meet u too. It was a very entertaining backstage performance from u and katie i tell u what!", "Wed Mar 06 01:38:55 ": "“@glenny__: The Game by @mc_pez is the tune like its unreal” cheers glen dog!", "Sun Aug 19 07:33:08 ": "@harry_o lovely speech at the conference today bro. Did u see the rest of the weekend?", "Wed Feb 27 21:34:19 ": "“@Sammy_Spooner: When are preorders for @mc_pez 's new album? #FavouriteRapper #BringItOnnnnnn\" - Not yet spoon dog but its coming :)", "Fri Jan 25 04:04:29 ": "@chancewatersau @laurajanealexis I think its U/18 but i like Chances style haha. Sorry i didnt have enough letters left 2 fit u in my tweet!", "Wed Feb 27 20:55:58 ": "@martysmiley cheers brother :) yeah its been a gradual thing but im gettin there haha", "Fri Jan 25 01:53:46 ": "Yo all my Underage fans in Brissy!! I'm playing at Live It Up Festival on April 13th along side Amity Affliction, The Getaway Plan &amp; more..", "Wed Jun 20 11:17:07 ": "@PurposePE that alive track is dope bra", "Fri Mar 09 08:10:04 ": "This is cute - “@solm8: Damn, it didn't even register that @3ree6ixty @mc_pez @PrimeIsHere all used this beat :) http://t.co/X72Nj1fk”", "Thu Jan 26 06:47:28 ": "“@triplej: #29 @Drapht - 'Sing It (The Life Of Riley)' #Hottest100” - congrats to d-rapht! Favourite jam off the album right there", "Mon Mar 11 05:09:08 ": "“@lilyannabellexo: @mc_pez has the same disease as me, shit man. Have u gotten your thyroid out?” - nah treated it naturally, got better :)", "Sat Jun 16 07:56:29 ": "If you're having some pre drinks before u head out tonight, why not listen to a new track that i did with my brother Tys for his mixtape..", "Thu Dec 06 03:13:33 ": "phenomenal hash tags babe “@EbonyPaigeM: loving @mc_pez new track #getonit #easylistening #congratspez #muchlove #yourback #neverreallygone”", "Wed Feb 27 21:22:08 ": "“@BushRohan: What a killer video for The Game by Pez . Can write music &amp; apparently play ball too!\" - It was like going back in time yo haha", "Wed Mar 20 00:20:46 ": "@l_w_giles really? Awesome. Which song was it?", "Wed Mar 06 22:51:38 ": "@didipetkovski haha thanks babe :) you're a sweetheart! I'll keep that offer in mind for when im ready to settle down ;)", "Wed Mar 07 04:18:15 ": "@siettamusic i think im on some full amateur shit yo coz i cant figure out how to send a dm msg anymore haha. hit me on mc_pez84@hotmail.com", "Mon Oct 31 11:10:19 ": "@illyal @siettamusic cheers bra, u smashed it! Holla at u when i hear back from old phaze dogs", "Mon Mar 11 05:09:52 ": "@lilyannabellexo have they put u on the drugs babe? Have u had it for long?", "Tue Dec 04 01:56:56 ": "@theaussiebbq @triplejlinda oh really? That's extremely exciting and nerve racking at", "Tue Oct 25 02:45:50 ": "You wouldn't wanna order a 'soft' drink around him i tell u what", "Tue Nov 01 02:00:55 ": "Got some free members tickets to the cup. Then realised i lost my porno suit & tie etc...", "Thu Jan 26 06:41:21 ": "“@triplej: #33 Jay-Z & @KanyeWest - 'Otis (Ft. Otis Redding)' #Hottest100” - also a gem of a song... Wow shit's getting serious now", "Fri Apr 12 00:09:41 ": "COOLONGATTA HOTEL TONIGHT Y'ALL!!!! First show of the tour let's do this!!", "Tue Dec 04 22:19:54 ": "@WpnX yeah brother all good! Cant wait to show you the results, its gonna be a fucking weapon!", "Thu Jan 26 07:12:36 ": "“@horrorshowcrew: Edinburgh Gardens  http://t.co/Y2qlBWtj” - im heading there now dude, where u at?", "Tue Oct 25 02:42:24 ": "Its a certain type of dead shit that wears a jim beam hat..", "Sat Jan 05 01:00:35 ": "@fozzeyandvanc one more day yo, im milking this beach shit haha", "Mon Mar 11 05:04:28 ": "@1percenterMC much appreciated brother :) much love!", "Tue Dec 11 23:35:48 ": "@GnTMag sounds good to me :)", "Sat Mar 16 06:11:02 ": "“@MrAusnadian: Hey @mc_pez, I owe u a couple of bucks coz iTunes Canada won't let me buy your single. What's your PayPal? - haha thats love!", "Sun Feb 05 08:44:47 ": "“@StrictlyOZ: #nowplaying @hilltophoods ratteling the keys to kingdom, up next @mc_pez these days\" - bit of that flow shit boys, i like it", "Tue Feb 12 03:15:38 ": "“@tiffdaawg: Got no clue how to use twitter, only came on here to tweet @mc_pez and @3ree6ixty” - haha love ur work babe!", "Wed Feb 06 11:38:49 ": "@emmahswitch @92deg_espresso haha my lingo has gotten so out of hand that i call dudes babe more than girls these days. Its all love babe", "Sun Mar 10 04:10:48 ": "RT @gigglingben: tonite from 6 on #RadarAusTop20 @mc_pez chats w/ @Ella_Hooper &amp; I about #TheGame listen to it on @FOXMelbourne &amp ...", "Sat Jan 05 00:00:52 ": "Man the beach life is the way to go hey, i could do this forever", "Thu Dec 06 03:16:47 ": "Yo homies thanks for all the love on the new track :) its been pretty overwhelming &amp; unexpected, much love!", "Thu Jan 26 05:53:17 ": "Sitting in the sun drinking french champagne, waiting for 6 dog to go top 10 #itsafuckinggoodwaytogetdrunk", "Sun Apr 14 00:54:58 ": "@HannahKorin haha", "Sun Apr 14 00:57:46 ": "“@StaceyLeeFrench: p-easiest the BEST night out in Mbar to date... #honestly #fuckinbeautiful 😊❤🎶 http://t.co/HJvkoLviih” -  Stace :)", "Wed Feb 27 21:30:38 ": "“@MJ_Leggy: Addicted to Pez's  song - The game #getonit @mc_pez” - I like your style leggy", "Wed Feb 27 21:28:12 ": "“@SlumpedIAC: @mc_pez - 'The Game' http://t.co/6b8uG7jhkV #pez #triplej” - Appreciate the kind words mike :) much love man!!", "Fri Apr 05 06:20:07 ": "RT @globalplaybook: Check out our chat with @mc_pez and get to know what he is up to in 2013 http://t.co/eZ11e17QaI", "Fri Mar 30 05:15:12 ": "And you can go to http://t.co/lqPiv78Q for tix or get them on the door :) boom bang boom", "Wed Feb 22 00:52:32 ": "Yo peeps i just filmed a 100 bar verse. Check it out http://t.co/aVvmZ8Km”", "Thu Dec 06 03:28:59 ": "@urthboy thank u sir :)", "Thu Jan 26 07:03:13 ": "As a general rule, dont expect to see around here again for a while tho haha @JohnnyUtahAus", "Wed Feb 27 21:23:46 ": "“@MissAshQ: New clip &amp; track is awesome @mc_pez! Looking forward to the rest of the album http://t.co/a7cGSv4PrC” - Thanks love :)"}