{"Fri May 08 05:47:05 ": "@SILK_HONEY gettin money and lookin fly owwww", "Tue May 12 20:24:21 ": "Everyones talking about Rick Ross fake louies but people should be talking about how crazy is my album is", "Thu May 14 02:41:00 ": "@AdamHeron PAUSE", "Mon May 04 06:11:25 ": "CONCERT TOMORROW HIGHLAND BALLROOM WHO NEEDS TICKETS TO THE SOLD OUT EVENT? TELL ME OR SHOW ME THE CRAZIEST THING ILL LET YA KNOW THE WINNER", "Sun May 03 21:11:54 ": "@candycane00 thanks for the love", "Thu May 28 06:58:29 ": "Everyone it aint a surprise if i tell ya come on (pause)", "Wed May 27 05:16:53 ": "I might go 2 videos like always and u see the movement i started with the 2 video game...who and what else ya think i should do?", "Thu May 14 22:18:17 ": "Who's the best rapper out right now? I just saw the list for it and its looking real sad", "Mon May 04 16:52:59 ": "RT @FreeBleuDaVinci: sorry jadakiss, sorry rick ross, sorry anyone else who dropped this year so far....Cam'Ron has the hottest album of ...", "Tue May 12 20:23:09 ": "The buzz is heavy right now as my album dropped today go get the Crime Pays #1 on itunes", "Sat May 09 07:38:32 ": "WHERES ALL THE CRAZY FEMALES AT? OWWWWWWWW", "Thu May 14 02:42:09 ": "About to smoke some air shit is just so funkin...", "Mon May 11 02:03:23 ": "Happy mothers day to all the moms and baby moms!!!", "Sun May 03 21:04:56 ": "@candycane00 thanks for the love makesure you go buy that album next week Crime Pays one of the realest albums of the year worth the $15", "Wed May 20 06:12:45 ": "SUEZzzz", "Tue May 05 22:23:28 ": "Me talking about the diplomats http://tinyurl.com/cq7exk", "Thu May 28 07:24:12 ": "FOLLOW @POSTABOI HE JUST SHOWED ME A FLIX OFF ALL MY ALBUMS...TRUE FAN HIT ME UP", "Thu May 28 07:28:55 ": "CRIME PAYS IF YOU HAVENT COPPED IT GO GET IT...FLY HIGH OR GET FLOWN OVER", "Mon May 04 17:28:40 ": "Highline ball room tonite Crime Pays in stores May 12 go cop that and help get my followers up", "Thu May 14 22:19:19 ": "Oo yeah what's good twiggas what its looking like out there?", "Sun May 03 21:12:24 ": "@JonathanJelks good looks on the support make sure ya get that album", "Thu May 28 07:13:52 ": "IM SHOUTIN PEOPLE OUT WHO SEND ME PICTURES OF MY NEW ALBUM NO BOOTLEGS LOL I RESPECT IT THOUGH", "Fri May 08 05:57:32 ": "Shoutout to @POSTABOI him and his man got money on the album", "Fri May 08 05:44:35 ": "@whoisjaewood I stay out in Ohio im goin to be touchin down soon", "Mon May 04 19:12:23 ": "Show in a few hours what's ya favorite tracks from all time I might preform a few?", "Sat May 09 02:01:30 ": "New video out cookies and apple juice tell me how ya feel about that also I'm going to be promoting hard this week nohome go get the album", "Sun May 03 21:05:47 ": "I see i need more followers some1 help me out", "Sun May 03 20:59:38 ": "@JennyHaze WHAT ARE YOU TALKIN ABOUT?", "Tue May 26 04:54:32 ": "Everyone says nothing when I asked what I missed no good!!!", "Thu May 28 06:48:34 ": "Im heavy out this twitter right now talk to me...surprise for ya coming in a few weeks crazy", "Fri May 08 05:58:22 ": "My bad if i cant reply to everyone replies are going retarted right now i need a assistant who wants to work?", "Wed May 13 04:44:49 ": "With the big dog funk flex did he show a little while ago hope ya tuned in...by the way the album is sicker then a swine", "Thu May 14 02:40:33 ": "@kidyungn NO GOOD...GET ON THE GRIND LOL", "Sun May 03 21:27:31 ": "Ya making it happen...im diggin this twitter thing i think i might have the hand of this i might be ready for the take over", "Thu May 14 02:31:11 ": "About to read some of these replies...whats everyone else up to?", "Sun May 03 20:57:13 ": "Whats good twitters? Whats every1 doin right now?", "Wed May 06 05:11:58 ": "In the stu blowing on the finest air pause", "Sun May 03 03:01:14 ": "Game 7 was upsetin fuck it Cavs Lakers", "Mon May 11 16:11:57 ": "Crime Pays in Stores tomorrow on Itunes tonight support it i will be reading and sending replies in a few", "Fri May 15 06:40:30 ": "Chillin in the stu right now what ya doing? hope ya caught me on 106 n park today", "Tue May 05 19:44:18 ": "Videos are up from last night preformance peep mania page @missinfo", "Sun May 03 00:51:02 ": "Shout out to funkflex tune in to hot97", "Mon May 18 19:33:53 ": "What's good my twiggas? I been gone for a minute I'm back at it what ya all up to?", "Mon May 11 16:07:49 ": "We movinnnnnnnnnn!!!! whats the word out here album dropping tomorrow make sure ya get 4 copies Crime Pays huge album", "Sat May 16 02:21:12 ": "We in NY tonight heacy we getting money", "Mon May 11 16:11:10 ": "Shoutout to all my real fans that been through it all with me...This year is when we movinnnnnnn heavy", "Wed May 20 06:13:17 ": "SHout out to everyone in Suez right now we gettin money....", "Tue May 05 19:43:09 ": "Hot summer I'm what the games been really missing go cop the album buy 3 May 12 Crime Pays Hottest album of the year back on my official shh", "Tue May 12 20:21:25 ": "RT @GowMosby: @CAM_CRIMEPAYS i picked up the cd  and this album is crazy. Neverever is my  fuckin banger , but overall its fuckin crazy. ...", "Tue May 26 04:50:28 ": "Tell me what I been missing?", "Wed May 13 04:45:10 ": "Hit me up let me know how ya feel about the album?", "Tue May 12 18:00:00 ": "Everybody I hope ya cop the album its In stores now Crime Pays", "Fri May 08 05:40:29 ": "Album dropping in a few more days Crime Pays im smashem out there...", "Sun May 17 03:42:44 ": "Shoutout to funkflex last night was crazy where we at tonight?", "Tue May 12 20:22:00 ": "RT @illaki: @cam_crimepays  got the album shit is fire. salute killa  niggas better have they chalupa right its about to....shessssh", "Sun May 03 20:58:44 ": "IF EVERYONE WANTS TO KNOW WHY IM FOLLOWING YA IS BECAUSE IM TRYING TO GET USE TO THIS TWITTER SHYT I DIDNT KNOW IM NOT SUPPOSE TO FOLLOW NO1", "Wed May 27 05:03:51 ": "4 followers to 2 k show love and i need to get more followers not receiving the love i should be getting", "Fri May 08 05:46:00 ": "Whats good with some followers someone help me out im trying to get to 1000 by the end of the night lets get it", "Tue May 19 02:39:53 ": "Anyone that hasn't went out and bought my album make sure ya go and cop that its the best album of the year so far as ya have stated", "Mon May 04 17:27:53 ": "Gettin right for the show today NY has so much love for me I'm back like I never lefted", "Tue May 05 22:11:35 ": "we about to do a listening go over my promo game plan im going extra on ya", "Tue May 05 22:10:43 ": "video from last night http://tinyurl.com/dao56l", "Tue May 26 04:50:12 ": "What's good twiggas? Haven't been on as much been busy watching the games out in orlando...shoutout to lebron keep doing ya thing", "Fri May 08 05:45:17 ": "@Breedon i still got love for sheist that my man everyone just doing there own thing", "Thu May 28 07:18:03 ": "RT reachnyc: @CAM_CRIMEPAYS http://tinyurl.com/pcl8pp and I got the hard copy. Pause. I need this interview tho holla! Contact@reachnyc.com", "Tue May 26 04:53:37 ": "@SeXiAzIaN209 what craziness I missed?", "Thu May 28 07:35:44 ": "RT AMMOKILLShttp://twitpic.com/63r2r - @CAM_CRIMEPAYS @POSTABOI - !'M SURE Y0U KN0W Y0UR ALBUM ARTW0RK, HE'S N0T THE 0NLY 0NE.", "Wed May 13 15:12:32 ": "Up early getting my promo on for the #1 hiphop album on itunes Crime Pays and #3 overall let's make it happen", "Wed May 27 04:59:56 ": "Back at it whats poppin out there?", "Sat May 16 02:19:41 ": "On hot97 right now tune in let me know what's good?? Tonight at promaome come party", "Sun May 03 04:30:53 ": "Where its at tonight if your in NY? Holla at me might make a cameo", "Tue May 05 20:20:06 ": "@JennyHaze good looks on the love I need this type of love so I can bring hip hop back to where it needs to do", "Sun May 03 21:52:33 ": "Hang", "Thu May 28 07:19:07 ": "I CANT RT EVERYBODY BARE WITH THE KID YA DIG", "Mon May 04 19:27:10 ": "RT @soapboxohio: @CAM_CRIMEPAYS whatever from sde album...u should do a acapella version of killa cam", "Sun May 10 00:53:40 ": "Whats good twiggas? whats everybody up to? album jus a few more days away its time to put the game in a chokehold lol", "Sun May 03 20:57:52 ": "Everyone come check me out tomorrow at the Highline ballroom in NY...got some special apperances for ya...", "Tue May 05 05:07:15 ": "Highline Ballroom was crazy line around the block Shoutout to everyone that came out and showed me love shoutout to Ohio also I saw ya", "Thu May 28 07:18:16 ": "SHOUTOUT TO @reachnyc", "Thu May 07 05:21:42 ": "We gettin money over here whats your occupation? Go get that album in stores and itunes May 12 hit me up with your thoughts", "Thu May 28 07:53:17 ": "RT rundat : http://twitpic.com/63rl6 @CAM_CRIMEPAYS", "Thu May 28 07:36:05 ": "FOLLOW @AMMOKILLS ANOTHER HUGE FAN...", "Mon May 04 19:26:52 ": "RT @iHeartFlyKicks: @CAM_CRIMEPAYS what mean the world to me, wet wipes, get ya guns, oh boy, all ur songs are classics!", "Mon May 04 06:10:34 ": "SHOUTOUT TO ALL MY REAL FANS SHOWING ME LOVE I BEEN CATCHIN UP TO THESE TWEETS ILL GET BACK TO YA WHAT POPPIN THOUGH", "Thu May 07 05:20:55 ": "New video on up check it out on @missinfo blog http://poprl.com/119L", "Sat May 30 07:40:25 ": "Whats good Fleaaaaaa???", "Thu May 07 01:52:19 ": "SWOOOOPPPP GANG Wheres everybody at just got some free time been runnin around all day", "Tue May 26 04:53:54 ": "@Shan99 what's everything?", "Mon May 04 16:19:40 ": "TONIGHT HIGHLINE BALLROOM NY DO YOU MISS ME?", "Fri May 08 05:40:54 ": "Whos up though talk to me lets do it????????", "Wed May 27 05:00:36 ": "wheres all the females at holla at me shootin a video this week might a need a few of ya hit me up", "Thu May 28 06:59:31 ": "Beats songs raps models whatever it is that ya do ill send ya a link where to hit me up at...my dude will take care of all that for ya", "Wed May 06 05:07:03 ": "Shoutout to everyone showin me love @swaggboyp @postaboi @illaki", "Sun May 03 06:55:57 ": "Whats the best spots to eat at when u high?", "Sun May 03 22:04:53 ": "@joeexclusive Send me the info ill have my assistant look in to it", "Mon May 04 18:00:41 ": "Album is crazyyyyyyyyyyyyy go get that May 12 Crime Pays", "Sun May 03 21:14:14 ": "i need to get to 300 by the next hour whos going to help? If i get 1000 followers by tonight im going to be giving away a few albums", "Wed May 13 04:57:16 ": "@msmia83 lol go buy at on itunes", "Sat May 09 07:30:42 ": "WHOS UP?", "Thu May 28 07:12:29 ": "RT AMMOKILLS : http://twitpic.com/63qeb - @CAM_CRIMEPAYS TELL ME WHAT Y0U SEE HERE??...SHOUTOUT TO EVERYONE THAT BOUGHT THE ALBUM"}