{"Sun Apr 14 19:43:52 ": "When I was in 6th grade my teacher told me to have a more realistic goal in life other than music #thanksforthemotivation #followyourdreams", "Sun Apr 14 21:40:19 ": "RT @HeartsHandsUT: So who in the #HHArmy  is ready for our #2013takeover ? Lets do this.", "Sat Apr 20 07:29:27 ": "@phartlee I'm freaking so pissed!!! Were they so good?", "Mon Apr 22 21:03:23 ": "Wanna get a girl to like you? Act like you don't like her.  #femalelogicftw #girlsbecray", "Sun Apr 21 21:08:07 ": "Hello, my name is happy valley. #utah #mountains #natureatitsfinest #birdseyesview http://t.co/x9LASgMVEn", "Tue Apr 23 00:21:52 ": "@Kylypso you know it's true. If my kids don't have the same perfect hair as yours, I'll kickem outta da house.", "Sun Apr 21 00:55:19 ": "There is nothing more terrifying than the rec center locker room. #theweirdestkindsofpenises #putthatthingaway", "Sat Apr 13 20:06:59 ": "@Richard2277 she has quality taste in animals. #datslothhh", "Tue Apr 23 05:10:56 ": "So stoked. That is all. #bigthingscomin", "Sun Apr 14 20:47:56 ": "@HavenAurland it's probably cause they are teachers, and didn't amount to anything", "Wed Apr 17 03:27:57 ": "Off to bed at 9:30..... #whitepopleproblems #oldpeopleproblems", "Thu Apr 18 04:28:23 ": "Well jazz, it's time for a change.  I say let millsap go.  Please make a good free agent signing, no more Marvin Williams type mess ups.", "Mon Apr 22 21:32:09 ": "\"I will always be an imperfect human being, just being me\" @garretrapp rules.   Hope our bands cross paths some day!", "Sat Apr 13 21:55:10 ": "As a jazz fan, I hate Kobe. But I wanted to see the jazz earn their playoff spot, not have it handed to them by Kobe's  torn Achilles.", "Thu Apr 18 20:31:58 ": "@TheJessicaEss  @Alex_lyman one of these things is not like the other. One of these people should be verified. #neververifyalexlyman", "Tue Apr 23 17:31:55 ": "I LOVE ALL YOU GUYS AND GALS! 😘😍😛 Even @Alex_lyman  #feelinggrateful #sostokedonlife", "Tue Apr 23 05:17:42 ": "@KadenWalker3 get on it! Sorry I couldn't come to your show buddy, hope it went well!", "Tue Apr 23 18:31:47 ": "I wouldn't be anything without support from my friends and family, that's YOU guys.  None of the support you give goes unnoticed, thank you.", "Sun Apr 21 20:14:37 ": "I love my Utah mountains.", "Mon Apr 22 21:09:50 ": "“@JibbyGibbs: @Garrettgarfield like..... Call them bitch an stuff?”&lt; ---- this one works every time too!", "Thu Apr 18 18:16:12 ": "RT @Alex_lyman: @Garrettgarfield Listened to same music since 4th gd... Dad did get me a ricky martin cd for xmas.. took me a month to t ...", "Thu Apr 18 21:08:19 ": "Pretty sure ADD is an unsaid requirement to be in my group of friends. #aintnobodygottimetofocus", "Sun Apr 21 20:02:54 ": "RT @FRONZ1LLA: There are no \"rules\" or \"boundaries\" in music. Hate all you want, but you're foolish if you believe that.", "Tue Apr 16 23:38:50 ": "In the past two days I have slept a total of 10 hours and worked a total of 16 hours. #loosing #fml", "Mon Apr 15 14:50:34 ": "Thanks for the snow in April mother nature! You know me so well you dirty  slut.  #gohomemothernature #summersaveme", "Sat Apr 20 19:15:20 ": "So proud of the @HeartsHandsUT album. Can't wait for you all to hear!", "Thu Apr 18 18:06:35 ": "Name a band you absolutely regret listening to as a young teen! Mine is for sure creed. #whydidilistentothem", "Fri Apr 19 06:32:28 ": "That point of exhaustion where you feel straight up high, yep, that's me.... Right  now!!!! Atbakshnaosgsnsphsnsisg #yabadabadoo", "Fri Apr 19 00:06:16 ": "@elsalinas EFF YOU SALINAS!!! More kick pedal,  less talking.", "Sun Apr 14 19:28:04 ": "You can either go through life letting a trial hold you back, or you can let a trial mold and transform you into someone stronger. #growth", "Wed Apr 17 16:56:25 ": "Don't try an tell me this isn't the coolest shirt you've ever seen. #johnstockton #utahjazz… http://t.co/KSyZCU1toD", "Wed Apr 17 00:41:43 ": "There is nothing better than receiving a high quality back stretch from your significant other.", "Tue Apr 23 20:02:53 ": "“@BrandonElkins31: @Garrettgarfield sounds like Disturbed lolol”nailed it!", "Tue Apr 23 16:24:48 ": "I'll definitely always miss @BECOMINGEVEREST", "Wed Apr 17 00:07:21 ": "@BlooSkadoo you are correct. The other 22 weren't spent sleeping or working.", "Sun Apr 14 19:16:02 ": "@FletcherLights life would rule. Shoot ducks, listen to si all day and enjoy a nice nostalgic lesson or thought round the dinner table after", "Thu Apr 18 01:25:16 ": "Depression and anxiety is a match made in hell. #notagoodday", "Tue Apr 23 18:37:28 ": "@Big_Tapp deal!", "Sun Apr 21 17:26:04 ": "Former \"popular\" girls in high school always go way to hard on instagram after they graduate.#stoptakingpictures   #stillstuckonyourpedestal", "Sun Apr 21 22:18:46 ": "Be proud, but never satisfied.", "Sat Apr 20 19:01:49 ": "RT @ryanseaman: Happy record store day, too bad kids now won't have the joy of going to a store, picking out the cd, reading the lyrics and…", "Sat Apr 13 22:00:31 ": "“@Richard2277: @Garrettgarfield @growuprhys And canada ?” Only if bieber comes!", "Thu Apr 18 20:29:17 ": "@Alex_lyman apparently twitter thinks you're more shot than I am. #suckstosuck #kissmybuttyabigmean", "Fri Apr 19 00:15:20 ": "@elsalinas @alex_lyman I thought drunk people couldn't feel the cold! #mormonproblems", "Mon Apr 15 00:40:05 ": "@Alex_lyman you told me that was local, asshole.", "Tue Apr 23 05:23:21 ": "@hannahyandow no way! I'm talking BIG. All caps kinda business. Hope you're doing well Hannah!", "Tue Apr 23 16:42:00 ": "RT @FletcherLights: I've chased my dreams since I was a kid. I lost everything I loved, I've been homeless, and gone without a lot. It pays…", "Tue Apr 16 17:11:48 ": "@Prey_To_Trey If you're patient I'll one up you, you can hear it recorded and you'll have the lyrics ;)", "Fri Apr 19 20:53:37 ": "Do you ever say a word and think \"that words sounds so weird\".  Word of the day = goose. Such a weird one.", "Tue Apr 23 05:21:58 ": "@KadenWalker3 yes! I'm too stoked man, text me goon", "Tue Apr 23 17:11:29 ": "#lifewouldrule if Mr. Rodgers was my neighbor #friendliestdude", "Mon Apr 22 17:04:46 ": "RT @FletcherLights: @Garrettgarfield I know a guy who can make that happen. #homiehookup #operationsavedad", "Tue Apr 16 17:22:21 ": "If she's into nickleback #itsadealbreaker", "Mon Apr 22 23:50:15 ": "@Kylypso ya stay outta my nature, you and your damn perfect hair.", "Tue Apr 16 04:19:57 ": "\"@margiejphelps obey gods law Boston , too late to pray for your sins #picketfunerals \"  #shitnobodysays #letspicketawestborobaptistfuneral", "Wed Apr 17 16:22:50 ": "Three ninjas made me wish with all my 11 year old heart someone would rob my house so I could kick some burglar ass. #childhoodmemories", "Mon Apr 22 17:19:15 ": "Music makes everything better, always.", "Sun Apr 21 22:53:13 ": "Just saw a dad on a long board with his kids. #Whataguy", "Sun Apr 14 18:57:05 ": "Life would rule if uncle si was my uncle. #duckdynasty", "Tue Apr 23 23:15:35 ": "Watching my little brothers baseball games&gt; #familyfirst", "Mon Apr 15 23:55:26 ": "All the girls around these parts swear in highshool that they wont become another one of those girls that gets married way too young #theydo", "Tue Apr 16 04:36:37 ": "Be grateful u live in a country where the frequency of major tragedies like today arent daily,Thats the reality for people in some countries", "Fri Apr 19 16:20:26 ": "#fbf to the glory days with the little brothers! http://t.co/7b1FxnAYaN", "Wed Apr 24 03:29:36 ": "@Prey_To_Trey Good job dude! Keep doing your thing", "Sun Apr 21 20:07:45 ": "Looking homeless people in the eyes with signs is harder than frying my eyeballs by staring directly into the sun.", "Sun Apr 14 19:16:46 ": "There's a time and a place to die, but this ain't it.", "Sun Apr 14 22:50:59 ": "@Alex_lyman said he wouldn't answer my calls cause he was too busy talking to Jefree star.  #truestory", "Sat Apr 20 20:32:47 ": "“@adelinaYDG: @Garrettgarfield I think you need this shirt http://t.co/JUnHspFJGJ” it's perfect!!", "Sat Apr 20 19:05:40 ": "Haven't been this stoked for a lazy weekend since high school. 😬", "Tue Apr 23 16:22:01 ": "RT @Alex_lyman: “@Garrettgarfield: Adderall, y u so focusy?! #icanconqueranything\" dude........ Understatement", "Sat Apr 20 20:23:52 ": "It's only on the brink where people find the will to change.", "Sat Apr 13 21:15:18 ": "“@GrowUpRhys: @Garrettgarfield I love Hearts&amp;Hands, please come to England after the full length!” Deal!", "Sun Apr 14 20:18:06 ": "@Alex_lyman doesn't have to time talk on the phone, but time to tweet kind things to me #lymanlogic #callmemaybe", "Sat Apr 13 20:30:19 ": "Congrats to tianlang Guan on making the cut at the masters! When my kids are 14, I want them to be just as Asian as you. #themasters", "Mon Apr 22 15:41:16 ": "\" I love Mondays!! :D\" #saidnobodyever", "Tue Apr 23 15:59:05 ": "Adderall, y u so focusy?! #icanconqueranything", "Mon Apr 22 17:13:10 ": "The new @HeartsHandsUT scrims are just gonna be blowups of Ryan goslings face and abs. #gayforgosling #whataguy", "Mon Apr 15 18:37:03 ": "When did getting tan get cool?Back in the day wasn't it super dope for chicks to look like vampires?  Now we're infested with Oompa Loompas.", "Sun Apr 21 01:04:19 ": "@alex_lyman but you play guitar, automatically makes it way better looking", "Wed Apr 24 00:54:03 ": "It's crazy that we forget about most of our actions,and that some of those things we forget about turn into things others hold on to forever", "Thu Apr 18 17:45:36 ": "Thursdays are like piers Morgan, cause they suck.", "Tue Apr 23 18:38:08 ": "“@mike_yebbs: @Garrettgarfield come back to Tucson soon man! Super stoked for the new album!” Of course dude! Will do 😎", "Sun Apr 21 18:47:33 ": "Sunday hike? Yes.", "Fri Apr 19 02:00:08 ": "SOFTBALL IS FUN AND I DON'T CARE WHO KNOWS! #nohomo", "Tue Apr 23 15:43:40 ": "When you start seeing results from your hard work, it's a lot easier to work hard.", "Tue Apr 23 16:36:44 ": "Nothing quite Like a good ole @BECOMINGEVEREST pile up.", "Thu Apr 18 20:53:07 ": "If you are not willing to grow and change with a band, and the growth they makes with their music and as people, don't call yourself a fan.", "Mon Apr 22 21:00:15 ": "Football, please come back. Football &gt;", "Sun Apr 21 18:48:16 ": "RT @justinkeith1: @Alex_lyman @Garrettgarfield radio rock/pop tuned in A? I'm into it", "Mon Apr 22 23:47:56 ": "I loose my wallet at least five times a day. 😔", "Tue Apr 23 18:30:17 ": "@mike_yebbs DAT visor! &lt;3", "Tue Apr 23 16:37:27 ": "@Kylypso @becomingeverest I sure hope! We'll at least release new jams I'm sure :)", "Sun Apr 21 01:02:09 ": "@alex_lyman dude. If your penis doesn't look like a fungus behind a forest of pubic hair, go for it!", "Sat Apr 20 19:01:11 ": "RT @Alex_lyman: @badpunkhayy If you post things on twitter it raises the chances of people replying to you. So it's not your best bet to no…", "Mon Apr 22 16:47:04 ": "I wish that a baby sloth wearing a tiny cowboy hat and riding a puppy like a horse would come rescue me from work.  #mywish", "Fri Apr 19 19:35:24 ": "Singing at a wedding, hanging with @aaronsbot, and seeing LYDIA! #TGIF", "Sat Apr 20 18:57:08 ": "Saturday! You beautiful son of a gun 😎", "Tue Apr 23 21:55:25 ": "If you didn't vote for Obama because he's black, you're racist.  If you voted for Obama because he is black, you're racist.", "Sat Apr 13 20:24:20 ": "@FletcherLights @kylypso lets do it!", "Tue Apr 23 18:36:29 ": "OOU AH AH AH AH!"}