{"Sun Apr 21 09:25:37 ": "@EarleyKen Hi Ken, we have a dedicated sales team on 0818724724 Mon-Sat, or you can apply online. http://t.co/HORhENpQYm  Thanks^TR", "Sun Apr 21 13:05:19 ": "@kevosullivan07 Hi Kev, if you call our card services team on 01 2695022 they can discuss ordering business lodgement cards, Thanks ^TR", "Mon Apr 22 19:19:25 ": "@georgehogan1 Hi George, Please follow this link http://t.co/AOaijh8taT  which explains our fees and charges. Thanks ^KF", "Mon Apr 22 08:10:41 ": "@dohville @lukeming Hi, this is a secure form used to investigate issues, rather than ask for info on Twitter, thanks^ER", "Sun Apr 21 12:29:31 ": "@PetRabbitte Hi Pat, If you want to fill in http://t.co/zN7m9Hlh0e , and we can take all of your feedback, Thanks ^TR", "Mon Apr 22 13:14:48 ": "@brendanmar212 Hi Paddy, please see here for more information on 2nd Level Accounts http://t.co/H4dzW4AI2N thanks^NH", "Sat Apr 20 09:11:45 ": "@jcvkjcvk Hi John, please visit your branch and they will be able to help you with this. Thanks^AH", "Sat Apr 20 09:58:15 ": "@keegthedeege Hi Shauna, When you apply for  a loan online, approval takes 24hrs excluding the weekend. thanks^AH", "Mon Apr 22 08:54:27 ": "@alankelly1992 Hi Alan, no sign of an app for the Windows phone at present, we've sent on your feedback to the Development Team, thanks^ER", "Sat Apr 20 09:15:05 ": "@PaddyC88 Hi Paddy, sorry you're not happy with the service you've received, please send your feedback to http://t.co/lY9J53I7FY Thanks^AH", "Mon Apr 22 19:23:10 ": "@emersonhex Hi Emmett, If you call the cards team on 01-2695022. They will be able to assist you further. Thanks ^KF", "Sun Apr 21 15:33:15 ": "@faduda Hi Gerard, sorry you're not happy with the service you've received, please send your feedback to http://t.co/lY9J53I7FY Thanks^AH", "Fri Apr 19 14:09:57 ": "New @AskAIB / @AmarachResearch #Retail report launched today #Outlook http://t.co/7BVwx9zN0w", "Sat Apr 20 19:17:40 ": "IBB is now back up and running sorry for any inconvenience caused. Thanks ^ND", "Sun Apr 21 12:42:43 ": "@Claredaisy Hi Clare, if you fill out http://t.co/zN7m9Hlh0e we can get a colleague to discuss this further, Thanks ^TR", "Sat Apr 20 08:58:39 ": "@muyseg Hi Lindi, please give the Card Services team a call 01 269 5022 and they'll be happy to help. Thanks^AH", "Mon Apr 22 15:11:35 ": "@etummon Hi Eoghan, if you use your card at the wknd the trans may appear in pending transactions until next working day. Thanks^NH", "Mon Apr 22 13:17:29 ": "@AandQ Hi Andrea, here is some more information on switching your current account http://t.co/pvShcUOPqX thanks^NH", "Sat Apr 20 14:01:32 ": "@gregskerries Hi Greg, Banklink Control are aware of this and will get an engineer out to fix it. thanks^AH", "Sun Apr 21 14:21:54 ": "@alatawiarif Hi, the card reader will work outside of Ireland having any difficulty call 35317712424. Agents here 24hrs a day. Thanks ^TR", "Sun Apr 21 12:15:31 ": "@GerFuckinStorey Hi Ger, AIB will not call you looking for your account details. You can call us on 0818724724, to discuss further, Tks ^TR", "Sun Apr 21 13:24:57 ": "@katewbu_ Hi Kate, we appreciate the feedback, thanks for taking the time, ^TR", "Sun Apr 21 14:28:09 ": "@stukydaman Hi Mark, you can apply for this on 1890788336, 8-9 Mon-Fri, 9-6 Sat. This is our student graduate team. Thanks ^TR", "Sun Apr 21 18:18:23 ": "@spagbollock Hi Kevin, For ATM Limits http://t.co/yPl1tv65VH or call 0818724724. thanks^AH", "Mon Apr 22 09:01:52 ": "@tonguelash Hi Aislinn, government stamp duty is charged on debit &amp; credit cards, for more info on the msg, pls call 01 668 5500, thanks^ER", "Sun Apr 21 13:22:01 ": "@bhreathnadoir Hi, appreciate your feedback, Thanks ^TR", "Sun Apr 21 10:55:15 ": "@Catherine2207 Hi Catherine, if you fill in  http://t.co/zN7m9Hlh0e and somebody will be in contact to discuss this further. Thanks ^TR", "Mon Apr 22 13:30:20 ": "@AandQ Hi Andrea, you will need to contact the bank you are thinking of switching to. Thanks^NH", "Sat Apr 20 13:53:35 ": "@Topper120488 Hi David, you can transfer funds using your card reader on the internet if you are registered for internet banking. thanks^AH", "Sun Apr 21 13:09:51 ": "@kevosullivan07 Hi Kev, apologies for the delay, you can call 01 2695022 to order these, Thanks ^TR", "Mon Apr 22 08:16:07 ": "@DamianCounihan Hi, we've no plans for free banking at present; here's a link to limit info http://t.co/ruxg6qLacQ Thks for yr feedback^ER", "Mon Apr 22 15:04:01 ": "@LindaHally Hi Linda, if you call the cards team on 01-2695022 they can check when you will be issued a Visa Debit. Thanks^NH", "Mon Apr 22 15:26:16 ": "@kiliandoyle Hi Killian, thanks for the tweet. I'll pass your feedback on to the Credit Cards team. ^NH", "Mon Apr 22 09:52:42 ": "@Jessiepoo410 Hi Jessica, please call 01 269 5022 and the Cards team will be happy to help. No need to wait, thanks^ER", "Sun Apr 21 09:13:03 ": "@Chilli_77 Hi Alan, if you are registered for the phone&amp;internet service you can do this online or through an agent on 0818724724, Tks ^TR", "Mon Apr 22 08:35:25 ": "@faduda Hi Gerard, apologies, please find attached http://t.co/zN7m9Hlh0e thanks^ER", "Fri Apr 19 14:32:37 ": "@happychappy01 Hi Mark, standard 20c electronic transaction charge applies. Min spend depends on retailer. Thanks^NH", "Sat Apr 20 09:54:35 ": "@bohoe Hi Angel, An upgrade is being released for IBB today. IBB is unavailable until after 17:00. Sorry for the inconvenience. Thanks^AH", "Sat Apr 20 17:28:53 ": "@TeamBuildingIRE  hi can I ask you to be specific about what aspect of the service you are referring to please. Thank you^ND", "Fri Apr 19 14:35:13 ": "@vananna36 Hi Vanessa, to transfer to your Visa card select transfers &amp; payments and use the pay a bill option. Thanks^NH", "Fri Apr 19 14:37:41 ": "@ciarakelly20 Hi Ciara, you can call our savings team on 1890 724 724 they will be happy to help. Thanks^NH", "Sun Apr 21 13:56:56 ": "@lesbilerrie online with a card reader. If you go to http://t.co/aSSMEQnytX or call 0818 724724, an agent can talk you through this, Tks ^TR", "Sun Apr 21 15:52:02 ": "@spagbollock Hi Kevin, sorry for the delay in responding to you. What was your original query? thanks^AH", "Sun Apr 21 13:15:47 ": "@lukeming Hi Luke, if you would like to fill in http://t.co/zN7m9Hlh0e  and a colleague will be in contact to discuss your query, Thanks ^TR", "Fri Apr 19 16:14:22 ": "@HazeD17 Hi Hazel, please call 0818 724 724 and the Phone Banking team will be happy to help, thanks^ER", "Mon Apr 22 15:58:38 ": "@etummon Hi Eoghan, this can depend on the merchant or retailer. If you have a query on a certain trans pls call 0818724724 thanks^NH", "Mon Apr 22 11:30:05 ": "@eamon_sherry Hi Eamon, did you receive an error message? Thanks^NH", "Sun Apr 21 09:43:12 ": "@GerFuckinStorey Hi Ger, Please call 0818 724724 to discuss this further. Thanks ^TR", "Mon Apr 22 08:12:40 ": "@rugby_is_best Hi, your available balance is what you have to spend. Thanks^ER", "Fri Apr 19 19:04:27 ": "@CathalSherlock Hi Cathal, Glad to hear you have received your new Visa Debit Card, Thanks ^JT", "Sun Apr 21 15:45:54 ": "@stephendngn Hi Stephen, we were very busy on Tuesday. Hope you got through later and had your query answered. Thanks for feedback ^AH", "Mon Apr 22 16:43:16 ": "@Beggers3 Hi Cathal, if you call the cards team on 01-2695022 they can check when you will be issued a Visa Debit. Thanks^KF", "Sun Apr 21 08:51:04 ": "@ails79 Hi if you have Phone &amp; Internet banking this can be done online with a card reader, call our  service team on 0818724724.  Thanks^TR", "Sun Apr 21 09:40:40 ": "@EPNolanator Hi Emma, if you call 01 2695022 Mon-Fri 9am-5pm, you can get further information on this. Thanks ^TR", "Fri Apr 19 20:17:15 ": "@CiaranMcMonagle Hi Ciaran, Sorry here is the correct link  http://t.co/O8A7lwIlQo Thanks^JT", "Fri Apr 19 19:47:29 ": "@Bocadillos2 Hi, Thanks for giving us your feedback, ^JT", "Mon Apr 22 08:52:39 ": "@charlene1994_ Hi Charlene, please call into your branch with proof of your student status to change your account, thanks^ER", "Mon Apr 22 11:26:28 ": "@ChinHairHoran Hi, if you would like to send us more detail please use this link http://t.co/zN7m9Hlh0e thanks^NH", "Fri Apr 19 14:57:06 ": "@onlygreyhounds Hi Geoff, if you require assistance pls call 0818 724 724. No Card Reader req if the CC is your AIB card. Thanks^NH", "Mon Apr 22 08:39:08 ": "@despod Hi, thanks for taking the time to send your feedback, we'll let the Branch Banking team know^ER", "Mon Apr 22 15:03:12 ": "@DJPADDYMC21 Hi, can you please email us more detail and we can help to resolve the issue http://t.co/zN7m9Hlh0e Thanks ^NH", "Sun Apr 21 10:31:57 ": "@saoili Hi Saoilí, thanks for the feedback, if you are concerned with any aspect of security pls call 0818724724 to discuss further. Tks ^TR", "Mon Apr 22 11:30:57 ": "@greenkeeper1964 Hi David, pls call the cards team on 01-2695022 they should be able to assist you. Thanks^NH", "Fri Apr 19 13:04:17 ": "@onlygreyhounds Hi Geoff, add the CC as a bill payment on your Internet banking this will allow you transfer as you please. Thanks^NH", "Sat Apr 20 10:44:09 ": "@cloudsteph Hi Stephanie , Phone &amp;  Internet Banking for personal customers is available all weekend. IBB is down for upgrade. thanks^AH", "Sun Apr 21 14:00:40 ": "@hackitgood Hi Paul, everyone is being issued a card by branch or you can call 01 2695022 to order one, Thanks ^TR", "Sat Apr 20 14:18:53 ": "@Pmitch1010 Hi Paul, you can lodge cash at An Post or lobbies in Naas or Grafton St. branches or at The Lab at Dundrum. thanks^AH", "Sun Apr 21 10:11:14 ": "@Macca196940 Hi Martin, Thanks for your feedback if you have concerns with this you can call 01 2695022 to discuss this further. Thanks ^TR", "Sat Apr 20 10:32:32 ": "@griffik2 Hi Joe, we have no plans to do so at the moment. thanks^AH", "Mon Apr 22 09:51:48 ": "@Dave762a Hi David, please call 01 269 5022 and the Cards team will be happy to help, thanks^ER", "Sat Apr 20 14:04:05 ": "@EiTechGuy Hi David, please give the Card Services team a call 01 269 5022 and they'll be happy to help. Thanks^AH", "Mon Apr 22 19:14:24 ": "@OverheardDublin Hi, If you could complete this form http://t.co/zN7m9Hlh0e  and someone will contact you in relation to your query. Tks ^KF", "Sun Apr 21 13:55:00 ": "@lesbilerrie Hi Ruth, if you get the paypal sort code and account number along with your reference number with paypal, this can be done", "Sun Apr 21 13:51:51 ": "@EarleyKen Hi Ken, if you want to fill in http://t.co/zN7m9Hlh0e and we can look at getting more information for you, thanks ^TR", "Fri Apr 19 19:43:15 ": "@CiaranMcMonagle @TheLabAIB Hi sorry you're not happy with AIB Fees &amp; Charges please send feedback to http://t.co/lY9J53I7FY Thanks^JT", "Sun Apr 21 13:18:42 ": "@damiandublin Hi Damian, if you would like to fill in  http://t.co/zN7m9Hlh0e and we can look into this for you, Thanks ^TR", "Sat Apr 20 09:21:54 ": "@LimkAbu Hi Mike, Please phone the customer service team on 01 7712424 and they can advise. thanks^AH", "Sun Apr 21 14:06:44 ": "@blush_01 Hi, appreciate the feedback, I don't have an update on a timeframe for this but will certainly pass it on. Thanks ^TR", "Sun Apr 21 09:36:19 ": "@EPNolanator Hi Emma, You can call our card services team anytime on 01 2695022, they can arrange for your card to be replaced, Thanks ^TR", "Mon Apr 22 09:03:44 ": "@ken_obrien Hi Ken, please contact your branch to discuss your options, thanks^ER", "Sat Apr 20 16:14:12 ": "@bohoe Hi Mr Gonzalez sorry for any inconvenience caused, we will pass on your feedback. Thank you ^ND", "Mon Apr 22 13:10:36 ": "@cormie Hi Cormac, sorry you had to queue for so long. I will pass the feedback on to the management team. Thanks^NH", "Fri Apr 19 14:55:56 ": "@OldManPhillips Hi Brian, if you require assistance please call iBB helpline on 0818720000. Thanks^NH", "Mon Apr 22 18:56:06 ": "@john_fee Hi John, You can view 1yr by clicking on statements &amp; adv and then on estatements. To go back further call 01-6685500. Thanks^KF", "Mon Apr 22 13:06:00 ": "@eamon_sherry Hi Eamon, if you would like to email us with more details please use this link http://t.co/zN7m9Hlh0e thanks^NH", "Sun Apr 21 13:59:25 ": "@floracrowe Hi Flora, thank you for the feedback, if you fill out http://t.co/zN7m9Hlh0e to discuss this further, Thanks ^TR", "Fri Apr 19 13:41:34 ": "@onlygreyhounds Hi Geoff, select transfers &amp; payments then manage my payees and select add new payee.. thanks^NH", "Mon Apr 22 19:35:11 ": "@sarahthedork Hi Sarah, If you follow this link http://t.co/ZdHTnRfET0 it will explain what a tracker mortgage is. Thanks ^KF", "Fri Apr 19 19:05:37 ": "@Bocadillos2 Hi, Yes you will be able to use your Card in the UK . The Visa Debit is accepted worldwide. Thanks ^JT", "Sun Apr 21 10:06:34 ": "@lunamatic Hi Sandra, our sales team are available Mon-Sat on 0818724724 to discuss different options that may better suit your needs. ^TR", "Mon Apr 22 09:54:02 ": "@Jessiepoo410 Hi Jessica, please call 01 269 5022 and the Cards team will be happy to help. There's no need to wait, thanks^ER", "Sun Apr 21 10:21:58 ": "@rcunnyD12 Hi Rob, apologies for any inconvenience caused, I will pass on your feedback. Thanks ^TR", "Sun Apr 21 14:30:56 ": "@faduda Hi Gerard, if you call 016685500, the card services team who will have more info on the disputed transactions process. Thanks ^TR", "Mon Apr 22 11:27:51 ": "@riffy69 Hi, if you call the cards team on 01-6685500 they will be happy to assist you with your query. Thanks^NH", "Mon Apr 22 09:05:38 ": "@Gegedrama Hi Geraldine, sorry you're not happy, we'd like to try and help, please complete http://t.co/zN7m9Hlh0e thanks^ER", "Sun Apr 21 10:42:08 ": "@AldwellFiona Hi Fiona, please fill out this customer support form and this will be followed up. http://t.co/zN7m9Hlh0e Thanks ^TR", "Sat Apr 20 13:49:43 ": "@visualsenseie Hi Rowena, We hope to have IBB back up after 17:00 this afternoon. thanks^AH", "Mon Apr 22 11:25:09 ": "@jockstrap Hi, sorry to hear you had a poor experience. Pls send us more detail &amp; we can look into this for you http://t.co/zN7m9Hlh0e ^NH", "Sun Apr 21 12:12:38 ": "@MsCadburyBubble Hi Nadine, if you call our card services team on 01 2695022, they can discuss this with you, Thanks ^TR", "Sun Apr 21 10:59:26 ": "@jwbirch Hi, thanks for the feedback, much appreciated, ^TR"}