{"Fri Jan 25 18:41:44 ": "Big Wreck's album \"Albatross\" is available for pre-order now at Newbury Comics. Autographed CD booklets are... http://t.co/X1r3Z7Tv", "Mon Feb 25 15:20:11 ": "JUST ANNOUNCED: Big Wreck will be heading out on a cross-Canada tour with Motley Crue! Keep your eyes on... http://t.co/o3IaJ2l5DS", "Thu Aug 23 14:48:12 ": "Casby 2012 Nominees http://t.co/VRziuhLO", "Sat Dec 15 19:37:30 ": "Big Wreck has been featured on http://t.co/20ctLRYW. Check out Ian Thornley's interview with Loudwire here:... http://t.co/PK8ZyTQr", "Thu Aug 23 14:42:41 ": "Big Wreck has been nominated for 'Favourite New Album' and 'Favourite New Single' at the 2012 CASBY Awards! \nVote... http://t.co/NfOcHf1a", "Mon Feb 18 16:58:16 ": "Just Announced: Big Wreck will be playing Pittsburgh, PA on April 9th at Altar Bar! \nTickets go on sale February... http://t.co/ZHlUaX1S", "Fri Jun 15 15:35:14 ": "Check out the live video for \"So Far So Good/Wolves\" from Big Wreck's Traynor Amps session at Revolution Recording... http://t.co/PLKKBvQn", "Wed Jun 27 21:12:25 ": "Catch Big Wreck at the Safari Niagara Amphitheatre on July 6th! http://t.co/ow3ZNjU2", "Mon Apr 23 02:07:29 ": "Check out an interview with Ian Thornley live on CP24 tomorrow morning between 7:36 AM – 7:43 AM EST!", "Fri Jan 11 17:52:25 ": "Have you downloaded your free copy of the single \"Albatross\" yet? Go to http://t.co/uO4I0nAx and enter your... http://t.co/A34zICXl", "Thu Dec 20 19:16:13 ": "Thank you Canada for the amazing tour. We had a great time, and we want to wish you and your families a Happy Holiday. Here's to 2013!", "Fri Jan 25 18:58:26 ": "BIG WRECK will be performing at Rock On The Range in Columbus, OH! Performance date and time will be announced in... http://t.co/3U1jlDOt", "Wed May 09 19:31:34 ": "Ian will be featured as a guest artist at Guitar Workshop Plus this summer! He’ll be sharing some of his... http://t.co/4AsvAd8w", "Mon Aug 13 16:47:28 ": "We are extremely honored to be the newest addition to the DigiTech/HardWire family! We have used their pedals on a... http://t.co/6jQt029d", "Sun Apr 21 15:50:08 ": "First night on the tour, thank you Penticton! http://t.co/wNTHviPSoF", "Tue Sep 18 23:44:51 ": "Excited for the CASBY's in less than two weeks. Don't forget to vote for Big Wreck here: http://t.co/hlIwxXVu", "Fri Sep 28 04:50:01 ": "Big thanx to all! What a blast. The moment was not lost on us! Appresheashe!!!", "Tue Jan 01 05:13:30 ": "Happy New Year everyone!", "Sat Dec 29 22:54:04 ": "Ian Thornley chats with MusicRadar about his \"Famous Firsts\"... http://t.co/YvGTEudk", "Wed Jul 11 14:30:44 ": "Win a Meet and Greet with Big Wreck at Rogers Sarnia Bayfest! Listen to K106.3FM - Great Classics &amp; The Best New... http://t.co/qQRc2MVD", "Mon Sep 03 00:06:21 ": "RT @_TheAdamSandler: DON'T STOP RETWEETING THIS! http://t.co/vqWHjXVQ", "Tue Mar 05 16:13:34 ": "Don't forget to vote for BIG WRECK for Rock Group of the Year in the SiriusXm Indie Awards!\n\nhttp://t.co/lo5d8cVIfJ http://t.co/hqNel20ufc", "Wed Sep 19 22:38:12 ": "Pre-sale tickets for Barrie's show will be released starting tomorrow at 10:00 AM until Friday at midnight. The... http://t.co/rOUbRfi2", "Mon May 21 00:48:11 ": "Watch Jesse Stone tonite on CBS, Christine Tizzard is in it!!!", "Tue Dec 18 18:11:45 ": "See you tonight, Vancouver. \nLast show on the tour... Going to be great!", "Fri Jun 08 21:41:10 ": "Check out the live video for “All Is Fair” from Big Wreck’s Traynor Amps session at Revolution Recording Studios!... http://t.co/ml7oKsmr", "Tue May 15 21:40:28 ": "Friday's show in London is the last one for this leg of the tour. To celebrate, our friends at Rocksmith Canada... http://t.co/eTTNdhyi", "Tue Dec 11 21:49:53 ": "http://t.co/b0xajFI0 http://t.co/PFCtlSOe", "Mon Mar 26 00:45:30 ": "badnutbeats's photo http://t.co/xfsiyv6R via @instagram", "Mon Feb 18 01:23:29 ": "Congratulations to Craig Kelly, you are the winner of this week's Big Wreck prize pack! Please send us a direct... http://t.co/Slm9uVFb", "Sat Mar 31 00:14:16 ": "RT @bigwrekthornley: Big Wreck - Wolves - official video: http://t.co/HWPuR9QT via @youtube @bigwreckmusic", "Thu Feb 28 17:28:30 ": "Would you like the chance to have your photos featured in Big Wreck's upcoming lyric video for \"Albatross\"?... http://t.co/0zp6TI7FvJ", "Wed Jan 16 16:04:12 ": "What is your all-time favourite Big Wreck song?", "Sun Apr 21 15:51:13 ": "Oh, Canada http://t.co/Bp8oM65g0E", "Fri Apr 20 14:38:47 ": "Check out Big Wreck performing live and acoustic on Q on CBC Radio this morning, at approximately 10:45 AM. You... http://t.co/TNJ761hV", "Fri Feb 01 21:17:39 ": "Big Wreck has been nominated for Rock Artist/Group of the Year Award in the SiriusXM INDIES ! Vote for them now... http://t.co/RtHtgEha", "Mon Dec 10 19:28:21 ": "Attention: Edmonton Fans planning to attend the show on Friday, December 14th at the Shaw Conference Centre – the... http://t.co/BWgJFJwX", "Fri Apr 05 12:30:49 ": "Another great crowd in West Chester (Philly). These US shows are good for the soul! Gotta do this more often.", "Mon Dec 03 22:07:32 ": "See you in a few hours, Windsor! http://t.co/h1NKRc4S", "Tue Mar 05 16:13:57 ": "Don't forget to vote for BIG WRECK for Rock Group of the Year in the SiriusXM Indie Awards!\n\nhttp://t.co/lo5d8cVIfJ http://t.co/iKXwUxRFZP", "Thu Jul 12 17:41:55 ": "RT @sekoulumumba: Jeff Buckley’s ‘Grace’ is a perfect album. No debate. Ok, good talk!", "Sat Apr 13 22:37:30 ": "RT @ChefTizzard: #OldBay Kale Chips? @bigwreckmusic @BaltimoreMD http://t.co/eJGvfKC1Cj", "Thu Jul 12 15:05:42 ": "I posted a new photo to Facebook http://t.co/Q3D4NWVD", "Mon Mar 26 18:58:47 ": "Check out this awesome article on Big Wreck from the MusicNerd Chronicles... http://t.co/5wlGKM0W", "Tue Aug 07 12:52:27 ": "The NFLD accent truly is music to my ears. I love it here.", "Tue Jul 24 21:41:39 ": "Thanks for being awesome, Winnipeg. http://t.co/5dDSn7KK", "Fri Sep 28 15:31:15 ": "Big Wreck takes home two CASBY awards for 'Favourite New Single' and 'Favourite New Album' - thanks to all the... http://t.co/15XeSlew", "Tue Oct 09 21:01:02 ": "Thursday November 22nd 2012 at the K-Rock Centre in Kingston, Ontario has just been added to the tour! Tickets go... http://t.co/Q41xdlPE", "Tue Sep 18 23:43:29 ": "Pre-Sale tickets for select markets go on sale September 20th and 21st. Please see the list below for links to... http://t.co/fWy762B4", "Wed Aug 08 14:34:16 ": "Big Wreck will be headlining the 2012 Ford Racing Festival in Montreal on Saturday August 18th! Check out... http://t.co/XGcZCyez", "Wed Jul 04 20:01:15 ": "Vote for Big Wreck for the Fearless 5 @ 5 on 102.1 the Edge!... http://t.co/OCcsJufR", "Mon Feb 25 00:36:32 ": "Congratulations to Jenna Revis, you are the winner of this week's Big Wreck prize pack! Please send us a direct... http://t.co/SkX8aODOat", "Mon Feb 04 19:30:28 ": "Would you like to win a Big Wreck prize pack including an autographed copy of 'Albatross?' Leave a comment AND... http://t.co/1Rb8YmbF", "Fri Sep 28 15:20:24 ": "Thanks again to all our fans for helping us win 'Favourite New Album' and 'Favourite New Single' at the #CASBY Awards last night!", "Thu Apr 04 15:31:32 ": "Head over to Amazon during the month of April and get a digital copy of Big Wreck's new album 'Albatross' for... http://t.co/u0p8ZMbRU0", "Tue Feb 26 00:17:59 ": "http://t.co/oGpM111aLN\n\nCheck out the NEW video for \"A Million Days\"! http://t.co/cafXQj6Md7", "Tue Feb 12 23:37:36 ": "Three US Tour Dates announced! \n\nApril 4th - West Chester, PA @ The Note\nApril 5th - Buffalo, NY @ The Town... http://t.co/16kxwQDC", "Fri Jun 22 15:23:24 ": "Check out the live video for \"The Oaf\" from Big Wreck's Traynor Amps session at Revolution Recording Studios!... http://t.co/E65aBtY1", "Mon Mar 04 17:06:13 ": "Congratulations to Brett Bair, you are the winner of last week's Big Wreck prize pack! Please send us a direct... http://t.co/96Hk5QztMc", "Sat Nov 24 17:28:57 ": "Thank you Barrie, you rocked it hard. See you tonight Ottawa! http://t.co/Sq1aEgZe", "Tue Feb 19 20:07:00 ": "Best Buy Exclusive of 'Albatross' on sale now for $9.99 - includes 3 live unreleased tracks! http://t.co/kkUHzPEe", "Fri Nov 16 23:05:42 ": "Visit http://t.co/1jrTJknu to get 25% off tickets to all Ontario shows starting today and ending Midnight on Sunday. http://t.co/wD2IdJ8u", "Wed Sep 19 15:56:07 ": "VIP Packages for the Big Wreck/Theory of a Deadman tour are now available at:... http://t.co/GjBiA0jz", "Tue Oct 02 15:50:59 ": "Big Wreck still has some VIP packages available for purchase, which include:\n- One General Admission Floor Ticket... http://t.co/PEYky3vR", "Sat Nov 24 23:55:02 ": "Mr. Brad Park during sound check tonight in Ottawa. Killin' it! http://t.co/EQlHykcj", "Mon Feb 11 17:31:06 ": "Would you like to win this week's Big Wreck prize pack including an autographed copy of 'Albatross'? Leave a... http://t.co/0qMNjcmb", "Thu May 24 20:39:52 ": "Check out http://t.co/uO4I0nAx for upcoming summer concert dates, with more coming soon! http://t.co/PqajmNLf", "Sat Mar 24 22:45:11 ": "\"@CHRIS_Daughtry: Been listening to the new @bigwreckmusic album \"Albatross\" and I love it! One of my favorite bands!\" Thanx Chris!", "Thu Jul 12 15:01:43 ": "Ottawa, you came and we rocked together. We had fun at Bluesfest! - Ian http://t.co/BgPuQZ6X", "Wed May 02 22:34:08 ": "'Albatross' is Album of the Week on iPhone iTunes! Go get your copy on your iPhone for only $6.99 from now until Monday.", "Thu Jul 12 15:02:24 ": "I posted a new photo to Facebook http://t.co/ZNGM8j8X", "Wed Feb 20 16:58:20 ": "Big Wreck has been nominated for a JUNO Award for Rock Album of the Year! http://t.co/UjHSInOg http://t.co/mYf72eUx", "Mon Mar 26 18:58:07 ": "Check out this awesome article on Big Wreck from the MusicNerd Chronicles... http://t.co/RvU5RzIk", "Tue Feb 26 00:27:17 ": "For your chance to win a Big Wreck prize pack including an autographed copy of 'Albatross', Share this post to... http://t.co/9w3hVpVpzm", "Mon Sep 10 22:00:31 ": "Enter for a chance to win VIP passes to the CASBY's and attend the pre-CASBY Party with Big Wreck... http://t.co/chyC1RjN", "Fri Jun 29 15:03:58 ": "Check out the live video for \"Come Again\" Big Wreck's Traynor Amps session at Revolution Recording Studios!... http://t.co/jWJ5xL1A", "Wed Sep 19 15:54:18 ": "VIP Packages for the tour are now available at:\n\nhttp://t.co/pNoaf33u\n\nPackages... http://t.co/P29p3m3d", "Fri Dec 07 19:06:16 ": "“It is a f***ing killer rock record. If you don’t buy it, you’re a d***.” \n\nStix Zadinia of Steel Panther chose... http://t.co/RALFnXVP", "Tue Oct 09 21:14:03 ": "Tuesday November 27th at the Centennial Hall in London, Ontario has also just been added to the tour. Tickets go... http://t.co/kLkLDKva", "Tue Dec 04 16:05:57 ": "\"But for me, it's all about singing songs with a guitar. I've just always been that guy.\"\n\nCheck out Ian... http://t.co/IG0psdVo", "Wed Apr 10 14:41:58 ": "Big Wreck will be performing at Rock on the Range in Columbus, OH on May 19th! Check out the lineup at... http://t.co/GAztn6qnKv", "Thu Jul 26 20:19:10 ": "Big Wreck will be headlining this year's Battlefords Bridgefest! Check out http://t.co/o4qKvxXv for... http://t.co/N7b1UHwZ", "Thu Jul 12 15:02:11 ": "Ottawa, you came and we rocked together. We had fun at Bluesfest! - Ian http://t.co/3AD6hqi0", "Thu Apr 04 03:55:10 ": "Baltimore wins! What a town, and what a crowd. Thank you so much! Nice to be back after all these years!", "Sat Jun 23 00:54:01 ": "Having a beautiful stay, and even better dinner at Glenn Burney Lodge. Wow! Check it out!", "Thu Feb 14 22:35:57 ": "Baltimore has been added to the list of US dates being played in April! \nTickets go on sale February 16th, check... http://t.co/WUcc0rlZ", "Mon Mar 18 20:40:46 ": "This Wednesday, March the 20th is the last day to submit your photos for the chance to be featured in Big Wreck's... http://t.co/rVynZcob21", "Fri Feb 08 21:35:14 ": "Congratulations to Kevin Lovelace, you are the winner of a Big Wreck prize pack! Please send us a direct message... http://t.co/ryoIBrzV", "Tue Oct 02 19:07:59 ": "This cover of Glass Room by Justin Zaccato is killer! Full props dude  http://t.co/p5VuRkua", "Tue Aug 07 12:43:53 ": "RT @Tammyhaggerty: @bigwreckmusic http://t.co/goJ2oquI  thx guys &lt;3", "Wed Jan 30 05:58:51 ": "The Rock On The Range pre-sale starts Wednesday January 30th at 10 AM EST! Visit... http://t.co/K7C2Vmza", "Mon Sep 17 18:17:55 ": "BIG WRECK TOUR ANNOUNCEMENT\n\nBig Wreck will be heading out on an extensive cross-Canada tour which kicks off in... http://t.co/kF8rULfc", "Mon Mar 26 20:23:09 ": "Check out InMusic's exclusive video premier of \"Wolves\"... http://t.co/RMXe6zhr", "Thu Jan 31 21:18:52 ": "Smartphone Users: The Big Wreck App is now available on all iPhone, Blackberry and Android devices! \n\nThe app... http://t.co/235N5Xka", "Tue Feb 19 16:35:49 ": "'Albatross' is released in the US today, in stores and online! Get your copy at the link below. \n\nFor your chance... http://t.co/FW2WksWS", "Tue Nov 27 16:02:45 ": "Massey Hall attendees: we would like to apologize for the lack of encore last night - Union rules enforce a... http://t.co/sT8hbuEK", "Fri Apr 20 14:40:35 ": "Check out Big Wreck performing live and acoustic on Q on CBC Radio this morning, at approximately 10:45 AM. You... http://t.co/zpqRa8i5", "Tue Dec 25 17:10:12 ": "Merry Christmas everyone!", "Mon Feb 04 19:31:13 ": "Would you like to win a Big Wreck prize pack including an autographed copy of 'Albatross'? Leave a comment AND... http://t.co/CNMsTq3D", "Mon Dec 10 19:36:03 ": "Attention: Edmonton Fans planning to attend the show on Friday, December 14th at the Shaw Conference Center – the... http://t.co/a4YCPR6l"}