{"Tue Apr 23 08:52:06 ": "@LordHernandez Not that I'm aware. They behave themselves!", "Tue Apr 23 06:58:11 ": "@TobyCybernaut Unfortunately I don't have that information from site. As soon as I have an update I will pass it on", "Tue Apr 23 07:02:43 ": "#Havant Trains now on the move northbound from Havant.", "Tue Apr 23 16:32:18 ": "@liamtarvit It's unlikely that one will be able to get to Weybridge. Can get to Virginia Water, then replacement transport from there.", "Tue Apr 23 07:37:20 ": "@AndyBarry87 That will get to Woking at 09:02. There is a train for Waterloo running a couple of minutes behind this train. Apologies", "Tue Apr 23 14:49:09 ": "Barnes Bridge - Amended service will remain in place through peak (until at least 19:00) http://t.co/omIE96x8dW", "Tue Apr 23 16:33:17 ": "@jonsanjose No, either bus from Barnes or 15/45 past which goes the long way (richmond line first).", "Mon Apr 22 20:25:40 ": "@sneekerzdude I will speak to our train planning team. Thanks for your suggestion.", "Tue Apr 23 08:16:39 ": "We have delays of up to 10 mins through Wimbledon towards Waterloo due to signalling problems. Engineers are en route.", "Tue Apr 23 14:13:59 ": "Trains from London Waterloo to Weybridge via Hounslow will not call at stations between Barnes Bridge and Hounslow.", "Tue Apr 23 05:30:55 ": "@Kirsty_D_ Hi. I'm showing that train leaving platform 7 on time. Suspect the app didn't update. Apologies", "Mon Apr 22 17:35:10 ": "The line has reopened at #AshVale Trains between Guildford and Ascot may still be delayed by up to 20 mins while service recovers", "Tue Apr 23 06:45:45 ": "#Havant Signalling problems are ongoing. Engineers are still assessing the equipment and as soon as I get an update I will update. Apologies", "Tue Apr 23 06:22:32 ": "#Havant signalling problems affecting northbound trains only at the moment.", "Tue Apr 23 09:19:54 ": "@EllaMason Hi. Which train are you on? Thanks", "Tue Apr 23 14:49:30 ": "Underground and London Buses accepting SWT tickets on the Hounslow Loop.", "Mon Apr 22 18:17:14 ": "@Tanky0688 Hi, this is due to signalling problems at Frimley. Sorry for the delay,", "Tue Apr 23 09:05:23 ": "@tshepherd10 Trains running ok on that route now. Sorry for the delay", "Tue Apr 23 06:37:24 ": "@TomPooleAV Delays from Guildford are likely. Which train are you waiting for?", "Tue Apr 23 07:12:25 ": "#Havant - The signalling has been restored, residual delays of 50 minutes until further notice", "Tue Apr 23 16:24:39 ": "@monkeybuxton @CoxeyLoxey Travle to either Weybridge or Virginia Water, replacement transport will be arranged.", "Tue Apr 23 06:33:57 ": "#Havant Engineers are on site inspecting the equipment. I will update once they report in.", "Tue Apr 23 10:17:48 ": "@pkrpmusic Apologies. I know our Customer Relations team are working hard to catch up with all outstanding refunds etc", "Tue Apr 23 16:36:24 ": "@jonsanjose Not replacement bus, TFL bus (tickets are valid).", "Tue Apr 23 06:41:30 ": "@s3buj We use a different system based on individual cases. Our Customer Relations dept handle all refunds customerrelations@swtrains.co.uk", "Tue Apr 23 06:47:34 ": "@nettypgw This is due to a fault which mean we had to take 4 coaches out of service. Apologies.", "Tue Apr 23 08:08:27 ": "@Louise_Clark ...Woking are affected.", "Tue Apr 23 08:55:29 ": "@tshepherd10 Where are you travelling from? Thanks", "Tue Apr 23 07:14:20 ": "@nessa_j_ Hi. We are introducing additional carriages on many routes including through Surbiton over the next 15 months", "Tue Apr 23 16:11:51 ": "@ThorneyThorne Yes, that journey is OK.", "Tue Apr 23 07:03:32 ": "@clarkerm Yes I'm afraid so. It has left Havant on it's way to you", "Tue Apr 23 06:46:43 ": "@TomPooleAV The 07:54 from Guildford will be the next one - currently running on time with an expected arrival at Waterloo of 08:32", "Tue Apr 23 08:09:23 ": "@splashsquelch I'm not sure. I will pass your comments on to the ticketing team", "Tue Apr 23 16:41:38 ": "@bigtonyb37 It's taxis. Please use help point on station.", "Tue Apr 23 08:39:56 ": "CLEARED: Delays between Fareham / Portsmouth Harbour and Havant. \n            Trains are now running normally between Fareham / ...    #fb", "Tue Apr 23 07:14:50 ": "@harder2305 It was a problem with the equipment that links the signals and the points", "Tue Apr 23 07:53:36 ": "@pkrpmusic Hi. We've had 3 trains call there going towards London in the last 15 mins. Are they still at Haslemere? Thanks", "Mon Apr 22 22:43:30 ": "@chrisfsmith Hi, no problems reported so not sure of the reason just yet.", "Tue Apr 23 07:07:47 ": "@LottiVerde Sorry for the problems this morning. Which train are you waiting for? Thanks", "Tue Apr 23 14:00:20 ": "Amended service in operation on Hounslow Loop currently due to signalling problems. Details here: http://t.co/omIE96x8dW", "Tue Apr 23 07:20:35 ": "@nick_thompson It can be many things.  In this case it was a fault with the equipment that links the signals and the points on the track", "Tue Apr 23 10:22:25 ": "@Mitty_15 Some of our trains do and some don't. Which route do you travel on?", "Tue Apr 23 08:03:40 ": "@oldladyal Can't promise it every time!", "Tue Apr 23 09:08:04 ": "@craysie399 Sorry for the problems this morning. The decision was taken by our Control Centre in order to keep trains flowing as the train..", "Tue Apr 23 05:32:52 ": "08:37 Guildford to Waterloo via Cobham will be formed of 4 coaches instead of 8 this morning. Apologies if you are affected.", "Mon Apr 22 17:48:38 ": "@Keynesian330nws No just that one, due to an earlier train fault. Sorry.", "Tue Apr 23 16:01:55 ": "NEW: No trains between Virginia Water and Weybridge until further notice. \n            A signalling problem ... http://t.co/U5oj4CejLC   #fb", "Mon Apr 22 19:55:11 ": "@sneekerzdude Because only \"peak\" (busier) services stop there.", "Tue Apr 23 08:54:50 ": "@EmitaMee Sorry for the problems this morning. Which train are you on? Thanks", "Tue Apr 23 10:21:09 ": "@RicheyRich1 Not at Alton but the line between Aldershot and Ascot is closed on Sunday until 16:50. Where are they travelling from?", "Tue Apr 23 08:14:12 ": "@antmeasures Apologies. The train was delayed on it's journey to Shepperton and left there late.", "Tue Apr 23 16:24:58 ": "@bearcatquiz Due to signalling problems between Barnes and Barnes Bridge.", "Tue Apr 23 07:34:44 ": "@Jinjaninja Apologies for the problems this morning. Which train are you waiting for? Thanks", "Tue Apr 23 08:42:55 ": "The signalling problems affecting trains through Wimbledon have been fixed. Sorry if you have been affected", "Tue Apr 23 06:54:24 ": "@DanielleFoggin @FGW Hi. Which train are you on? Thanks", "Tue Apr 23 10:26:48 ": "@RicheyRich1 If they are going on Saturday there are no engineering works on that day. On Sunday the line between Virginia Water and...", "Tue Apr 23 08:17:37 ": "@maakusan Looks like you have been delayed by a few more minutes. Estimated time of arrival at Waterloo is 09:47. Sorry", "Tue Apr 23 08:04:44 ": "@Philippa_Pearne That train is running on time - it's just left Liss. No plans to terminate it at Woking", "Mon Apr 22 21:55:38 ": "@H5989 courtesy of Twitter :) absolutely awesome if you don't mind me saying so. Thank you.", "Mon Apr 22 18:01:19 ": "@Georgiaacurtis Hi, think that one closes when the ticket office does at midday. Sorry.", "Tue Apr 23 14:17:55 ": "@SkyNewsLucie Engineers still assessing problem at the moment. Will update when I know more.", "Tue Apr 23 06:05:55 ": "@Pringers78 Great. Thanks. I'll ask the depot to take a look.", "Tue Apr 23 15:14:58 ": "NEW: Amended service through Barnes until approximately 19:00 http://t.co/bkFhEBGB16", "Tue Apr 23 06:44:59 ": "NEW: Delays between Fareham / Portsmouth Harbour and Havant until further notice. \n            A signalling ... http://t.co/FWAHlzliHD   #fb", "Tue Apr 23 07:08:52 ": "@TobyCybernaut The next London-bound train from Milford should be there are 08:38. Sorry for the problems this morning.", "Tue Apr 23 07:13:47 ": "@neil_p There is a cycle rack next to the Station Approach entrance to the station.", "Tue Apr 23 10:19:06 ": "@Jordanna_Denny Sorry you were affected by the problems at Wimbledon this morning. Our track maintenance team are working to improve..", "Mon Apr 22 19:59:05 ": "@sneekerzdude Good point, no it's not.", "Mon Apr 22 20:54:01 ": "CLEARED: Delays between Guildford and Ascot . \n            Trains are now running normally between Guildford and Ascot ...    #fb", "Tue Apr 23 15:28:48 ": "@CharlotteBuck1 Oh, trains are still running from Kew Bridge, 2 an hour at 11 and 41 minutes past.", "Tue Apr 23 09:19:39 ": "@andy_j_corbett Hi. This is so we can run 10-car trains on all suburban routes.", "Tue Apr 23 16:12:21 ": "@clock_nine Yes but they will be going via Richmond first so longer journey time. 15 and 45 minutes past.", "Tue Apr 23 09:35:41 ": "@EllaMason That line is operated by @SouthernRailUK They may be able to help.", "Tue Apr 23 06:57:02 ": "@DanielleFoggin Thanks. There is a train in the platform at Bedhampton so your train isn't able to move into the platform. Sorry.", "Tue Apr 23 14:55:48 ": "@JackMarian2 Really sorry about that. You can contact our customer relations team here: http://t.co/IWGZED80E6", "Tue Apr 23 16:13:37 ": "@loz_jack Travel to Barnes then Weybridge service from there. If sig probs aren't fixed at Addlestone road transport will be provided.", "Tue Apr 23 08:32:00 ": "@scotsw12 Hi. Sorry about that. Please contact our Customer Relations Dept who will be able to help you: http://t.co/IWGZED80E6", "Tue Apr 23 15:17:22 ": "@CharlotteBuck1 No, probably need to take the bus from Richmond (number 65). Sorry for the disruption.", "Tue Apr 23 07:01:09 ": "@clarkerm That train is at Havant. It should be on the way very soon. Apologies", "Tue Apr 23 07:42:35 ": "@richginders Apologies for the problems. We had a fault with signalling equipment at Havant this morning which has caused a lot of delay", "Tue Apr 23 07:50:08 ": "@Philippa_Pearne Sorry for the problems this morning. Where are you travelling from/to? Thanks", "Tue Apr 23 11:07:36 ": "@GolfMoan Hi. Yes although the lorry has just been removed so the road should be opening very soon", "Tue Apr 23 10:28:47 ": "@RicheyRich1 Excellent. I hope they have a good day!", "Tue Apr 23 07:28:13 ": "Residual delays of 30 minutes between Fareham / Portsmouth Harbour and #Havant expected until 09:30", "Tue Apr 23 07:04:46 ": "@maakusan Hi. Which train are you on? Thanks", "Tue Apr 23 07:27:03 ": "@jezzaneaves Hi. Sorry for the problems. The engineers have made repairs and trains are running again.", "Tue Apr 23 06:21:35 ": "We have signalling problems at #Havant at present. Engineers are expected on site in 10 mins. More when known. Apologies if affected", "Tue Apr 23 16:42:04 ": "@MS_Higashinada Yes but going the long way (Richmond first).", "Tue Apr 23 06:48:51 ": "@RyanCooperAscot We have over 100 additional coaches coming into service over the next 15 months.", "Tue Apr 23 07:36:12 ": "@escimo The first extra carriages will be brought into service in June with over 100 being introduced by the end of 2014", "Tue Apr 23 08:54:01 ": "@wazzerphuk Apologies. Where are you travelling from/to? Thanks", "Tue Apr 23 08:13:10 ": "@roadstoruin It's not permanent. We have some coaches out of service with a fault. Should be back to 8 coaches soon", "Tue Apr 23 08:04:06 ": "Residual delays of 10 minutes between Fareham / Portsmouth Harbour and #Havant expected until 09:30", "Tue Apr 23 07:57:24 ": "@oldladyal Sorry for the problems this morning. There should be a train arriving at Farncombe in the next couple of minutes", "Tue Apr 23 10:19:34 ": "@Jordanna_Denny ..the long term performance of our infrastructure however things do go wrong.", "Tue Apr 23 16:36:34 ": "@liamtarvit Staff are aware now.", "Tue Apr 23 06:04:13 ": "@Pringers78 Hi. Which train are you on? Thanks", "Tue Apr 23 08:08:18 ": "@Louise_Clark Apologies. The trains coming up from the Portsmouth area have been affected by signalling problems. Not all services from..", "Tue Apr 23 07:00:08 ": "#Havant Some trains will divert between Fratton and Woking going via Eastleigh. We are still unable to run northbound from Havant. Apologies", "Tue Apr 23 09:08:57 ": "@craysie399 ..had missed it's usual slot into Waterloo which would have caused further delay to this and other trains."}