{"Sat Apr 20 20:24:22 ": "@graz906 it would be a bus to Twickenham.", "Mon Apr 22 07:36:41 ": "07:54 Hampton Court-Waterloo had the passenger alarm activated due to an ill passenger. This is causing a few mins delay through Vauxhall", "Mon Apr 22 16:24:27 ": "@paulthehairy Which direction was it heading?", "Mon Apr 22 08:01:49 ": "@LondonTimes Delays of up to 8 mins expected for anther 15 mins. Apologies", "Mon Apr 22 20:25:40 ": "@sneekerzdude I will speak to our train planning team. Thanks for your suggestion.", "Sun Apr 21 11:50:57 ": "@SharonBradbury @my6percent I will ensure that it's fed back to our bus replacement team in order to improve this in future.", "Sun Apr 21 11:19:04 ": "@PaulFoster1303 Not stopping?", "Sun Apr 21 09:28:51 ": "@K_Rumble No sorry, buses to Shepperton, Twickenham and New Malden.", "Mon Apr 22 06:06:41 ": "@helen_em Hi. There are 2 on the Surbiton route affected: 08:48 and 09:12 departures", "Mon Apr 22 16:20:58 ": "@paulthehairy Really? Where did you this?", "Mon Apr 22 15:41:45 ": "@Kennelliver For this to be investigated properly by their managers could you please contact customer relations: http://t.co/IWGZED80E6", "Mon Apr 22 05:46:02 ": "08:17 Woking to Waterloo and 08:37 Guildford to Waterloo (via Cobham) both 4 coaches instead of 8 this morning. Apologies if affected", "Sun Apr 21 15:04:43 ": "@joanyrr 19:42", "Sat Apr 20 23:13:31 ": "@michael_jrogers Hi, no, that train should be fine. It's planned to run all the way to London.", "Sun Apr 21 18:09:39 ": "@phreaking back to normal tomorrow, sorry for the disruption today.", "Mon Apr 22 16:06:21 ": "@Kennelliver No, in that case the train did depart early.", "Mon Apr 22 18:17:14 ": "@Tanky0688 Hi, this is due to signalling problems at Frimley. Sorry for the delay,", "Sun Apr 21 00:29:05 ": "@trickybroon No worries. From Waterloo they leave at 11 mins and 41 mins past every hour, except the 07:10 and 07:40 (first trains)", "Sun Apr 21 10:14:05 ": "@ruthemorris Which train? No reports of any issues in that area.", "Sun Apr 21 16:16:33 ": "The emergency engineering work at #LdnWaterloo has been completed. Residual delays of 10 minutes expected until 18:00.", "Sun Apr 21 08:13:45 ": "@Nicomentarista Yes, there is a train at 17 minutes past.", "Sun Apr 21 16:32:10 ": "Trains are now running normally to and from London Waterloo following emergency engineering work #LdnWaterloo", "Mon Apr 22 10:01:28 ": "@the_jezster I'll pass on your comments. Apologies for the problems while we carry out station improvements.", "Mon Apr 22 11:41:31 ": "@Erin_J_Olsen Hi. That will leave from Platform 9 - Portsmouth Harbour service.", "Mon Apr 22 07:38:44 ": "@therajman Apologies. There is an ill passenger on this train which is being met at Waterloo", "Sun Apr 21 08:02:15 ": "@Danni_OC Really? Shouldn't be delays.", "Mon Apr 22 17:05:58 ": "@Becky_Wren 20:01.", "Mon Apr 22 15:42:41 ": "@DarthGore Thanks. Will let the stations team know.", "Mon Apr 22 17:11:41 ": "Signals sorted at Frimley - 17:23 Ascot to Guildford has left Frimley 27 minutes late.", "Mon Apr 22 05:47:49 ": "@fiwi73 Apologies. We had a fault on a train that meant 4 coaches had to be taken out of service.", "Sun Apr 21 22:51:48 ": "@duffyamy hi, you can contact our lost property office to see if they have it, here are the details: http://t.co/ebmqvqVd1H", "Sun Apr 21 14:52:24 ": "@joanyrr Next one is at 16:46. You can contact our customer relations about delays http://t.co/IWGZED80E6 Sorry.", "Sun Apr 21 08:06:40 ": "@PA_Clarabell Yes, normal service tomorrow.", "Mon Apr 22 09:48:30 ": "@steffiesin Hi. Sorry for the delay. Where are you travelling from/to? Thanks", "Sun Apr 21 08:24:52 ": "@Nicomentarista There are 6 trains an hour from Wimbledon.", "Sun Apr 21 07:59:03 ": "@sophiecarter71 @chelsmarc It's an amended timetable, no delays at present.", "Mon Apr 22 07:34:41 ": "@Womblegirl14 The train in front of you had the passenger alarm activated which is being investigated. Apologies for the delay", "Sun Apr 21 09:04:10 ": "One more..... http://t.co/Fo1KSb2KPY", "Mon Apr 22 10:12:34 ": "@raddougall Brilliant. Thanks", "Sun Apr 21 15:38:41 ": "Services to and from #LdnWaterloo may be delayed by up to 10 mins because of a member of train crew being unavailable, expected until 18:00", "Sun Apr 21 16:34:55 ": "CLEARED: Delays to and from London Waterloo. \n            Trains are now running normally to and from London ...    #fb", "Mon Apr 22 15:17:47 ": "@Kennelliver Really sorry about that. Can't excuse that behaviour. What time did the 16:02 leave?", "Mon Apr 22 15:42:25 ": "@Kennelliver With reference to train leaving, once doors are closed (30 seconds before departure) train can leave.", "Mon Apr 22 10:10:37 ": "@raddougall Apologies for the lack of reply. I will pass the picture on to the Train Presentation team. Thanks", "Mon Apr 22 17:48:38 ": "@Keynesian330nws No just that one, due to an earlier train fault. Sorry.", "Mon Apr 22 16:27:13 ": "@paulthehairy Thanks. That train should be nearly at Waterloo now. Will ask them to keep an eye out.", "Sat Apr 20 23:08:55 ": "@londontimes Hi, you will need to change at Wimbledon for a train to Waterloo. What time are you wanting to travel please?", "Sun Apr 21 09:28:16 ": "@hanibalhawke Train at 10:31 from East Croydon (change at Clapham Junction).", "Mon Apr 22 09:47:51 ": "@raddougall Hi. Please do", "Mon Apr 22 07:44:18 ": "@Womblegirl14 Doesn't sound the best. Sorry. Hope it dodn't inconvenience you too much", "Mon Apr 22 10:11:04 ": "@steffiesin Which station are you at and travelling to? Thanks", "Sat Apr 20 23:43:11 ": "@trickybroon There is a half hourly service from WAT/CLJ to Weybridge tomorrow. Do you need any times?", "Sun Apr 21 11:17:22 ": "@My6Percent @19smithy78 Unfortunately we don't have the space on board replacement buses to carry large items like buggys and bikes.", "Sat Apr 20 21:39:34 ": "@chelsmarc Sorry for the disruption but it is essential that the work is done. You can plan your journey here http://t.co/gjyELh9vfI", "Sat Apr 20 23:22:25 ": "@trickybroon Hi, where are you travelling from please?", "Sun Apr 21 09:03:05 ": "Photo of the engineering work taking place at Waterloo (replacement crossing) http://t.co/sbgtalPo1Q", "Sun Apr 21 10:03:30 ": "@TD_101 Yes, two trains affected at present. 7 and 10 minutes late.", "Sun Apr 21 09:03:42 ": "And another.... http://t.co/KomNBKS6DQ", "Mon Apr 22 16:21:57 ": "@paulthehairy see this* I will get the station staff to check it out.", "Sun Apr 21 11:28:02 ": "@My6Percent @19Smithy78 tickets are released 12 weeks prior to travel, as is notification of the work 2/2", "Sun Apr 21 06:44:41 ": "@Danni_OC yes, normal Sunday service.", "Mon Apr 22 21:55:38 ": "@H5989 courtesy of Twitter :) absolutely awesome if you don't mind me saying so. Thank you.", "Mon Apr 22 18:01:19 ": "@Georgiaacurtis Hi, think that one closes when the ticket office does at midday. Sorry.", "Mon Apr 22 19:55:11 ": "@sneekerzdude Because only \"peak\" (busier) services stop there.", "Sun Apr 21 08:51:45 ": "@MelissaSparkie Information here: http://t.co/ydyPyTXP6D", "Mon Apr 22 17:05:25 ": "@TD_101 Ones on the single line I believe.", "Mon Apr 22 19:59:05 ": "@sneekerzdude Good point, no it's not.", "Mon Apr 22 20:54:01 ": "CLEARED: Delays between Guildford and Ascot . \n            Trains are now running normally between Guildford and Ascot ...    #fb", "Sat Apr 20 20:27:37 ": "@CharlarellaWho yes that will be fine.", "Sun Apr 21 15:23:27 ": "Services to and from #LdnWaterloo may be delayed by up to 20 mins because of a member of train crew being unavailable expected until 18:00", "Mon Apr 22 14:56:47 ": "@alexgbourne That's a seperate railcard: http://t.co/pmyu21MdWf", "Sun Apr 21 10:43:10 ": "@damajaboy @my6percent @19smithy78 Sorry, didn't realise you were running and therefore already there.", "Mon Apr 22 05:45:09 ": "@NiniPiag Apologies. We do have 3 trains with fewer carriages than normal this morning.", "Sun Apr 21 10:39:40 ": "@My6Percent @19smithy78 Where are you travelling from and to?", "Sun Apr 21 15:07:36 ": "Services to and from #LdnWaterloo may be delayed by up to 20 minutes because of a member of train crew being unavailable.", "Mon Apr 22 09:14:41 ": "@thewayoftim Sorry to hear that. Anything I can help with?", "Mon Apr 22 14:21:48 ": "@sueohare I don't think we have one. Our customer relations team might be able to help: http://t.co/IWGZED80E6", "Mon Apr 22 16:43:10 ": "Ascot to Guildford services are being disrupted due to signalling problems at Frimley. Tickets accepted on stagecoach bus route 1.", "Sun Apr 21 09:00:08 ": "@RachAHall That's great news. Have a fantastic day!", "Sun Apr 21 17:38:32 ": "@BareGubs no probs. thanks for the feedback.", "Mon Apr 22 07:44:48 ": "@EltontoNick Sorry I'm not sure about the procedures of the other TOCs", "Mon Apr 22 17:06:15 ": "@spmaskell Sorry, your service was delayed due to a train fault at Salisbury.", "Mon Apr 22 16:14:26 ": "@Kennelliver Sorry you feel that way, I will let the station manager at Wimbledon know.", "Mon Apr 22 17:07:31 ": "@Becky_Wren Enjoy!", "Sun Apr 21 08:03:56 ": "@LauraSpires Anything I can help with?", "Sun Apr 21 07:57:12 ": "@Therealolliep No problems to report in that area.", "Mon Apr 22 17:35:10 ": "The line has reopened at #AshVale Trains between Guildford and Ascot may still be delayed by up to 20 mins while service recovers", "Mon Apr 22 16:47:52 ": "NEW: Delays between Guildford and Ascot until further notice.\nA signalling problem is causing ... http://t.co/IcgvOEW4z2 #fb", "Sun Apr 21 14:21:22 ": "@Cherries_r_yum @My6Percent This was changed in the timetable for today to avoid congestion in the Wimbledon area. Sorry.", "Sat Apr 20 23:06:54 ": "@chelsmarc Here is some more info on how it will affect your route http://t.co/SNzaxEZ7R0", "Sun Apr 21 12:00:45 ": "@DavidBlackm0re @TfLOfficial You will need to contact our customer relations team http://t.co/IWGZED80E6", "Sun Apr 21 11:48:45 ": "@nationalrailenq @franksale Really sorry about that. If your ticket is unused you should contact customer relations http://t.co/IWGZED80E6", "Sun Apr 21 08:03:27 ": "@Danni_OC Have a good day.", "Mon Apr 22 05:49:25 ": "@olde_coalface Sorry for the problems again this morning. We had to take some coaches out of service due to a fault", "Sun Apr 21 11:40:31 ": "@HelenMaryH @My6Percent @19Smithy78 Those buses are only a backup as we are running trains as well from Wimbledon and Clapham J.", "Mon Apr 22 22:43:30 ": "@chrisfsmith Hi, no problems reported so not sure of the reason just yet.", "Sat Apr 20 22:51:35 ": "@chelsmarc Where are you travelling from and to please tomorrow?", "Mon Apr 22 14:49:35 ": "@MontyWanty Sorry about that! Will feedback to our catering suppliers.", "Sun Apr 21 15:04:20 ": "Engineering work at Waterloo is finished. All platforms have reopened. Check here for details of departures/arrivals: http://t.co/uzZULyiDIK", "Sun Apr 21 11:27:37 ": "@My6Percent @19Smithy78 The work, and restriction on buses would have been advertised when tickets were bought 1/2"}