{"Thu Apr 04 00:36:00 ": "@TravisReilly tough as nails", "Tue Apr 09 17:47:27 ": "@StephSissy shouldn't have been. that game sucked haha", "Sun Mar 24 15:56:51 ": "@MilkBoyPhilly will it be a different set than tonight??", "Thu Apr 04 00:49:03 ": "this phillies season is going to kill me.", "Sun Mar 03 09:00:31 ": "Sunday is an off day so if anyone has a ride on the sabbath for @EADave he just needs to get an envelope for me on Monday. So blessed!", "Fri Mar 15 00:15:13 ": "@EAJimmie god dammit i'm up in jersey recording. missing you again. sad face", "Mon Mar 25 17:22:20 ": "louis ck has to be my favorite human being.", "Mon Mar 04 02:14:59 ": "i wonder how much money i've spent on ATM surcharges in my life time", "Sat Mar 02 14:35:22 ": "recording friends - what's the best drum software to use? recording with an elec. kit. addictive drummer, superior drummer? bueller?", "Fri Mar 08 16:17:00 ": "@htlnick I hate that I laugh aloud to everything you say. After this wanna get an apartment together?", "Thu Apr 04 03:20:44 ": "@missy_mont hahah oh wow i forgot you're gonna have to deal with that. you moved there right when they got talent too", "Thu Mar 28 00:23:12 ": "@thepeejatron @pitchforkmedia  I GET IT!", "Sun Mar 03 08:43:39 ": "It's hard for @EADave to get around cause he doesn't have a car so if you could help us that would be awesome!", "Fri Mar 15 02:17:10 ": "after watching dave grohl say how much he likes gagnam style i feel like i can admit how much i love this new paramore song. well done.", "Mon Mar 04 21:02:55 ": "@LOLjett well that is just inappropriate! but sure", "Tue Mar 12 20:34:31 ": "i like logging into snapchat for the first time since i made it and getting only things from @charliesaxton. punk.", "Thu Mar 28 23:12:18 ": "@monicakath isn't that your every night?", "Thu Mar 28 18:20:06 ": "loving the new front bottoms song. pretty excited for their full length.", "Fri Mar 08 22:47:21 ": "@thedommm wait, you drink?", "Wed Apr 10 01:22:16 ": "@StephSissy me too! i wanna go to one game in the boston series its at the end of may. let's get a crew together", "Tue Feb 26 21:51:09 ": "@BuzzFeed and @MMFlint you guys should kiss.", "Tue Mar 12 02:26:57 ": "@YMAEWK you certainly will! if you need a drummer you know who to call. im only about an hour from you", "Tue Feb 26 23:59:34 ": "@andieallthetime SIGN ME UP", "Fri Apr 05 02:51:10 ": "spent the better part of today wondering if @galeamonster likes basketball. more to come tomorrow.", "Sat Mar 02 18:33:34 ": "@TheChasMyers okay perfect just got superior! i have reason and superior. once i get protools i'll be good to go!", "Tue Mar 26 01:46:11 ": "@hopelessnatalie is that from something? cause i am laughing here by myself. well done.", "Mon Apr 22 20:35:37 ": "the phillies starting pitcher tonight is younger than me. i now officially feel old.", "Sat Mar 02 03:13:27 ": "The only thing I know is that I would rather kill myself than have to sit through that \"21 and over\" movie", "Sun Mar 10 16:13:26 ": "@StephSissy me!", "Fri Apr 05 23:38:22 ": "RT @racheldemy: I take great delight in assuming the first word uttered on stage by The Postal Service in 10 years will be \"smeared\".", "Wed Apr 17 16:21:44 ": "@gfacepatton i've been saying that for years", "Tue Mar 19 17:04:19 ": "@YoungStatues @visforvig That sounds amazing. What shall we do? Also where are ya staying?", "Wed Apr 24 04:25:27 ": "@shannamcglynn you got the wrong guy!", "Mon Mar 04 21:01:48 ": "i feel like my drum keys are part of toy story but they run away every time i'm looking for them.", "Wed Mar 13 18:48:46 ": "@jadecarlson well like, that seems about right", "Thu Mar 14 00:13:48 ": "@tpierce2 pope-pope gets a treat?", "Wed Mar 20 18:46:10 ": "Matt Cameron is the master of making odd time signatures sound 4/4.", "Tue Mar 19 15:34:21 ": "Yeah ill take the meatball salad.", "Thu Mar 28 02:22:20 ": "@chaseigliori @mitchellwojcik please send pictures", "Thu Mar 07 13:05:11 ": "wait are all the episodes of season 4 of arrested development being released at the same time or is a weekly release? @netflix", "Sun Mar 10 17:07:23 ": "@StephSissy hit up the @Fishcakesswag !", "Thu Mar 07 01:41:45 ": "IM NOT CRYING, IM ALLERGIC TO JERKS.", "Sat Apr 20 13:50:34 ": "in honor of RSD i watched empire records. damn the man, save the empire!", "Sat Apr 20 01:16:22 ": "@detroitarun Fried or fertilized?", "Sat Mar 09 08:01:42 ": "@HANA_BRUNNER ill just be here eating cookies", "Sun Mar 03 08:42:08 ": "Can anyone in Los Angeles,California give @EADave a ride to the post office from his place? It's been over a week and he can't get a ride.", "Wed Mar 27 18:47:58 ": "@itshellogoodbye i vote crocs", "Thu Mar 14 19:50:22 ": "@monicakath that was the best thing i've read all day", "Sun Mar 24 21:48:37 ": "@galeamonster nailed it", "Mon Mar 25 23:41:08 ": "@YoungStatues hahah dude i say that everytime that station is on. or 933", "Tue Mar 26 13:24:54 ": "@KthomasDiPas @jay_murt @drewmsmith @SteveDClark He must have had a Pepsi", "Fri Mar 08 16:09:16 ": "@htlnick I always thought its gonna be so weird if Connor oberst dies the day after playing a show cause like he'd sing that song...and shit", "Wed Mar 20 01:09:57 ": "RT @JosephMarro: Working concessions at a DJ show &amp; a guy asked if I'd seen his friend Molly. Took me 20 mins to realize he was tryi ...", "Sun Mar 24 20:31:22 ": "been on a serious weezer kick as of late.", "Wed Apr 03 15:16:40 ": "@hopelessnatalie @mattDBF yeah that happened", "Thu Mar 07 13:07:15 ": "@mattDBF wow im gonna be out of commission for 8 hours straight", "Sun Mar 03 13:59:49 ": "I wish 476 traffic was like this on weekdays", "Thu Apr 18 07:24:30 ": "@johnyyy_mac I'm so alone", "Fri Mar 08 16:11:54 ": "@JonTheLyons you running the Philly marathon? You go getter you!", "Tue Mar 12 00:55:31 ": "my friends started a new band! check it out ya'll. http://t.co/2JZfgeZAeQ", "Wed Mar 20 16:21:53 ": "Just a couple of pals on Halloween @eajimmie http://t.co/a3lTFsKgqt", "Sun Apr 21 22:38:42 ": "@andieallthetime that is the cutest thing i've ever seen!", "Sat Mar 16 00:34:54 ": "Finished up drums on these songs! Excited how they're turning out. Kinda sounds like the vengaboys meets chumbawumba", "Thu Feb 28 04:35:08 ": "@hopelessnatalie make me merry merry happy but you obviously didn't wanna stick around", "Tue Apr 02 16:16:09 ": "@EAJosh oh wow that's kind of awesome", "Sat Mar 09 02:44:55 ": "King lebron gets his way", "Mon Apr 22 04:56:16 ": "@kgarling1 \"Oh my god\" is so funny! Louis ck is just the best", "Tue Mar 19 17:29:57 ": "@TheDatingLifeTv Boy I wish we did", "Sat Mar 09 16:12:03 ": "@tpgoodwin avalon's where it's at this summer. see you today son", "Mon Apr 08 18:01:25 ": "having the same amount of kick drums and toms does not make any sense to me.", "Fri Apr 12 21:57:31 ": "@tpierce2 gimme those ingredients", "Fri Apr 05 03:36:41 ": "@thepeejatron michael vick?", "Mon Apr 22 03:48:24 ": "@JakeMaydayP @DerekSanders just saw you guys were in town tonight and i did not know. bummer!", "Sat Mar 02 18:34:00 ": "@htlkevin okay just DL'd superior. hahah and no im not this is just for demoing...but like, maybe i will...", "Thu Feb 28 03:16:33 ": "Philly friends! Playing the @MilkBoyPhilly tomorrow night. who doesn't want to have a few cocktails on a thursday night? doors at 8!", "Wed Apr 10 00:14:53 ": "@rainnwilson rainncarnation?", "Thu Mar 28 00:22:27 ": "@shannamcglynn my hero", "Fri Apr 19 23:49:19 ": "@jessistares Well next time I'm feelin' blue ill head down to Nashville and drown my sorrows!", "Fri Apr 19 23:12:22 ": "Having a bar in this airport named rock bottom seems like a really bad move.", "Sat Apr 20 07:42:22 ": "@KaileyCost amen sista", "Tue Apr 02 18:22:11 ": "RT @ThatEricAlper: Today in 1990, Nirvana went into Smart Studios in Madison, Wisconsin and started work on demo versions of \"In Bloom,\" ...", "Tue Apr 23 17:21:09 ": "might go check out this @ModernBaseball band all the kids are hollerin' about tomorrow.", "Sun Mar 24 18:20:47 ": "@gbchristian So true", "Tue Mar 12 02:12:26 ": "RT @hopelessnatalie: its spring which means it's almost summer which means it's almost fall so its almost christmas again. YUS!", "Sat Mar 16 19:58:06 ": "@IamKinman yeah I'm up recording with like crazy I was bummed! :(", "Wed Mar 06 23:34:45 ": "RT @htlnick: I like how everyone's talking about how cool the 90's were, yet nobody has the balls to get their eyebrow pierced", "Tue Mar 12 02:13:37 ": "@YMAEWK wow that design is too awesome.", "Fri Mar 01 23:36:59 ": "drinking game for the new @CONDITIONSband record - take  shot every time they say \"human race\" or \"evolution\"", "Sun Mar 24 15:50:19 ": "Going to see Kate Nash tonight! So excited. Also I have an extra ticket if anyone is trying to go", "Sun Mar 31 18:17:47 ": "jesus wanted to die for light beer and deviled eggs.", "Thu Apr 18 06:14:40 ": "this dude gets it http://t.co/UlRm0APAIW", "Wed Mar 27 19:29:29 ": "Tell em large marge sent ya", "Thu Mar 14 00:13:34 ": "RT @tpierce2: Oh my god. This is the greatest thing ever. I feel like @dennisea would appreciate this. http://t.co/3PIRMJC4ac", "Sun Mar 10 16:18:34 ": "@kACE_hood with a k", "Tue Apr 23 20:29:43 ": "new twitter name! how cool is that?! so i went to your room and read your diary...", "Mon Apr 08 20:50:06 ": "my first phils game of the year! get em roy.", "Sun Mar 03 05:17:35 ": "Everyone is ugly.", "Sun Mar 03 09:14:56 ": "LOS ANGELES! @EADave needs a ride to the post office! any post office! let me know or contact him if you can make it happen! Thanks! : )", "Thu Feb 28 04:33:32 ": "@TheJoeFlack yeah that place rules. just started a new band were called \"like crazy\" acoustic pop rock sorta thing?maybe? recording in march", "Thu Apr 04 03:21:15 ": "@AlexGoRadio it will be hard but i'll do my best"}