{"Fri Feb 15 06:38:10 ": "Met a dude with (iwrote this part of the tweet many hours later)", "Thu Feb 14 17:44:36 ": "@OLBOYB yeah forgot about that", "Sun Mar 17 04:49:07 ": "Saturday night live really has their finger on the pulse of the dead wrist of corporate music's corpse.", "Mon Mar 18 02:00:29 ": "@hannahdmarks it's on the list.", "Sat Mar 23 04:42:53 ": "I didn't think I had a biological clock then some feral kitten comes back to its mom from deaths door and I realized I'm a cat.", "Tue Mar 19 21:20:57 ": "RT @HarlemWhateverr: I think my twitter has been hacked. I didn't tweet that. Either that or my butt or other personalities figured out  ...", "Wed Apr 10 21:54:43 ": "Just told a vet that my kittens pee smelled \"white\"", "Wed Mar 13 22:58:38 ": "I wish white smoke was the new pope", "Thu Feb 21 05:40:48 ": "@Carlos_s__  lacecurtainsband@gmail", "Mon Feb 18 23:39:07 ": "@PrintsOfficial well it's out on tape from burger records. It's called grape st.", "Thu Feb 28 20:31:28 ": "@lizathorn hanging out in a swamp reading your press http://t.co/Hz7RqBZ1td", "Sat Feb 16 02:14:01 ": "I think the world would be better if women were in charge but everything would take forever", "Sat Feb 16 04:09:36 ": "@Toribelle4 that's sweet thank you. If spotify ever starts paying bands anything decent ill let you know when I'm on it.", "Tue Feb 19 03:12:33 ": "Today's thoughts- are chickens an animal coincidently a meal for two?  Quirky indie comedies bum me out. I should get off twitter.", "Fri Feb 22 03:59:59 ": "@PatrikSandberg I like you. But I have a sneaking suspicion I would be on your drop list. X", "Fri Mar 08 22:49:30 ": "@grapestreeterz", "Sat Feb 16 03:49:54 ": "@Toribelle4 I'm not on spotify but you(only you) have my permission to download the record for free and listen wherever. X", "Mon Apr 15 04:40:39 ": "@BURGERRECORDS I'm a burger Hans Berger (1873–1941), German neuroscientist", "Wed Mar 20 02:23:06 ": "I hope aiden and the jazz guy suffocated from having their heads up their own asses.", "Wed Mar 27 16:50:48 ": "Beaches is on tv. I was in the other room not paying attention. that movie could make people sad if it was on in a bank vault.", "Sat Mar 02 23:02:21 ": "@PaponEmmanuel  go to http://t.co/QzfqXmHIfk and use the PayPal if its international it'll be a bit more expensive", "Wed Mar 20 02:28:18 ": "Ugh Berger too. Did any of them date anyone cool? i actually like all the guys they ended up with. *Jerrod was probably as good as hunks get", "Sun Feb 17 09:26:34 ": "So I saw you drinking a ginger beer what's the big secret ?", "Thu Apr 04 23:51:32 ": "RT @grapestreeterz: Grape St. \"a date with you\" out now on austin town hall/female fantasy! http://t.co/oq16cLlLQt", "Fri Mar 01 01:13:10 ": "Trying to explain gay marriage isn't equivalent to bestiality one Floridian at a time.", "Sat Mar 23 04:44:49 ": "And it helped me come to terms with why I hate music and the internet.", "Fri Mar 01 13:54:33 ": "RT @MylesUSA: Holding a phone as high and still as possible is always a gorgeous and noble act", "Thu Feb 28 20:28:46 ": "@PeggyNoland mid Florida likes your ideas http://t.co/rKBYScNcTv", "Sun Apr 14 21:38:56 ": "Lace curtains is now called cat kittens.", "Sun Apr 07 01:00:54 ": "So greasy could slip off sandpaper", "Thu Feb 14 17:44:57 ": "@OLBOYB 5208826083 whenever you're free", "Wed Mar 13 22:18:13 ": "@AmyWastings I texted you do you have a new phone #?", "Wed Mar 13 13:42:31 ": "Inside edition in high definition", "Sat Mar 02 04:19:49 ": "@JessicaSuarez so that's what she does now!? So cool", "Wed Feb 20 21:35:59 ": "I don't want a real job. Can I apply to be a cat? Prefer indoor/outdoor position. No neutering. Wet food a plus.", "Wed Apr 10 20:40:27 ": "Have some meowmo, and there will be meow mo' gas.", "Sat Mar 02 04:21:10 ": "@MylesUSA  is so cool.", "Wed Feb 27 02:15:23 ": "@TvhPatrice thanks", "Sat Feb 16 02:17:01 ": "Smoking causes cancer but cures loneliness", "Tue Mar 19 02:42:12 ": "Can you cook rotten meat til it is completely clear of any pathogens? Asking for a friend('s dog)", "Mon Mar 18 01:48:41 ": "@hannahdmarks nope. I'm in Florida hanging out at a swamp. Are you some kind of virtuoso? If so What instrument?", "Sun Mar 03 22:08:23 ": "@JessicaSuarez yeah I figured she wasn't a pole dancer", "Mon Apr 15 05:23:59 ": "I wish the real housewives of Atlanta would start a band so I could get into new music.", "Fri Mar 01 01:13:53 ": "That said you Yankee fucks don't have anything to be smug about.", "Thu Feb 21 06:54:22 ": "http://t.co/HmrAwxhC8z", "Sat Feb 23 18:20:20 ": "I love Jewish delis that serve blts it's like your grandma bringing you weed.", "Wed Mar 06 17:23:47 ": "Lost in a one room shack", "Thu Mar 14 19:34:47 ": "@_Concepcion no I haven't gotten my shit together for that", "Sun Mar 17 05:33:13 ": "By the way I think all of those things can be sexier than someone with the gift of a body like a fully stocked hotel fridge.", "Tue Feb 26 17:42:32 ": "Just heard sugar ray, smashmouth, then offspring. North Florida holding it down.", "Sun Mar 17 03:10:29 ": "“@OLBOYB: @grapestreeterz  I like the people to taste me.” Curtis this guy is cool be friends with him", "Sun Mar 17 05:35:43 ": "I can get into a toblerone and a Heineken but I wouldn't want to fuck them let alone take them out on a date.", "Mon Apr 01 16:02:04 ": "I just cut the placenta off of a kitten cause the mom couldn't get through it. Just in case you were asked if you ever met a hero.", "Thu Feb 14 21:27:25 ": "RT @ALEXISPENNEY: @MylesUSA I love you", "Tue Mar 26 14:37:48 ": "Had a dream everyone was hating on Hilary Clinton for looking too excited while being let into a huge blue orb. Don't let em get u down hil!", "Thu Mar 07 19:12:08 ": "Jail nails", "Wed Mar 13 22:21:08 ": "All old white men look the same to me congratulations pope sameface mc'grandpa the third", "Thu Mar 28 15:29:53 ": "@PrintsOfficial it's still a still life if its submerged in a clogged sink", "Thu Mar 14 19:44:34 ": "@_Concepcion I've only played that one show", "Wed Mar 13 21:19:18 ": "RT @focuscreeps: Don't say 'No' until you're 25.", "Sat Apr 20 05:23:47 ": "@BabakGanjei I thought today you should start a band with Woodstock called the dinosaurs. Cause he's into them and for when you guys are old", "Tue Mar 19 02:52:30 ": "Thank you all for the quick response. The owner of the dog said \"yeah twitter knows everything\"", "Fri Apr 19 03:03:26 ": "@ALEXISPENNEY I didn't mean to he was abandoned by his mom. Come visit the drag queens and me in Tucson.", "Fri Mar 08 22:49:43 ": "“@grapestreeterz: Miss my friends @lacecurtains” me too", "Sun Apr 14 22:34:24 ": "@notSamIzIlla yeah I still have some", "Wed Mar 13 22:41:32 ": "I love all aspects of religion except for all the people that believe in it and the things they do.", "Thu Mar 14 03:05:43 ": "@HANNAH_HUNT_ That movie is a map.", "Wed Mar 20 02:22:21 ": "I wonder what happened to all the rejected guys from sex and the city.", "Fri Mar 22 00:22:46 ": "@JessicaSuarez I miss your dorm it's do sad it people don't live there anymore", "Wed Mar 13 22:59:10 ": "Or black whatever", "Mon Feb 25 01:48:52 ": "@four_visions thank you very much", "Sun Feb 17 08:57:01 ": "Curtiss album with grape street is so good.", "Wed Mar 20 02:03:52 ": "@PeggyNoland he's named after the pizza delivery driver. His mom didn't read the name tag right.", "Sun Mar 17 04:37:25 ": "RT @brandebtw: I have a mental disease and its called I LIKE ALICIA KEYS LIKE ALOT.", "Wed Feb 27 02:15:11 ": "@headintosound did one in la no plans just yet for another", "Sun Apr 14 21:37:56 ": "I never agreed to be verified. I don't know how they proved its really me.", "Mon Feb 25 22:00:57 ": "I had to turn my radio down out of embarrassment during nprs show on beatboxing.", "Tue Feb 26 00:26:10 ": "Du, du du, du duh. du du du du du  duh. - the drum beat in my head right now. Any guesses?", "Sat Mar 23 01:34:38 ": "Working on lyrics http://t.co/homyDcxTFN", "Sun Feb 24 23:49:24 ": "@four_visions sure do. And t shirts. Both have buy now buttons on http://t.co/QzfqXmHIfk thanks", "Mon Apr 08 19:43:20 ": "@_NathanF_ it's 20$ total to the PayPal at rosecoomers @hotmail.com thanks", "Thu Feb 14 17:40:33 ": "@OLBOYB do you wanna meet for a drink and get that shirt?", "Sat Mar 02 23:04:10 ": "@PaponEmmanuel just noticed your in France it is 30$ or 40 for a record and a shirt. PayPal to rosecoomers@hotmail.com", "Sun Mar 17 05:20:46 ": "If youre not fat,skinny,acne ridden,harelipped,bald,ugly,crosseyed,handicapped,mentally ill,terminally ill or dying I don't care ur opinion.", "Thu Feb 21 06:25:36 ": "Do you think mulder and scully ever met the crypt keeper?", "Mon Apr 15 05:37:25 ": "@notSamIzIlla it's random but suggestions are taken into consideration. Roll the diceeeee", "Fri Feb 15 19:02:55 ": "I think everyone in this restaurant is ovulating.", "Thu Feb 21 03:47:49 ": "@Carlos_s__ what's your address? Media mail can take anywhere from 2 weeks to over a month. Sorry for the delay but ill check if it got mist", "Thu Mar 14 03:39:14 ": "@HANNAH_HUNT_ I just watched that movie too! Are you in Florida? Cheap comedies tap into the underbelly of loss and regret.", "Sat Mar 30 02:00:39 ": "@Jaill_ he probably spent the money to remove the dogs tumors on making upgrades on the cabin.", "Mon Mar 25 00:08:26 ": "I think my riot grrrl membership card is expired but fuck 60 minutes calling pussy riot \"little girls\"", "Tue Mar 19 21:22:13 ": "Fuck I meant that from this account now everything is all fucked up. I'm too old for an iphone", "Mon Mar 04 20:57:00 ": "Heteronormative http://t.co/GhTXEjIbkV", "Tue Mar 19 21:24:40 ": "I have a pretty cool Friendster account if you need to get ahold of me.", "Sat Feb 23 17:43:44 ": "You have to listen to the spice girls super loud to appreciate them.", "Sat Feb 16 03:30:24 ": "Every time I write a tweet and it isn't retweeted I think \"pearls before swine\" so that's how I think of you, unfollow at your leisure.", "Tue Mar 19 21:06:57 ": "Hip pity", "Wed Mar 13 22:37:11 ": "He speaks fluent Spanish. So he'll be that asshole who speaks Spanish while ordering fajitas.", "Thu Apr 18 22:39:57 ": "At petsmart \"if my cat eats this catnip plant and I water it will it grow back?\"  Employee-\"I don't know. Lauren what's up with this plant?\"", "Mon Mar 18 01:58:17 ": "@hannahdmarks thanks if I need a bassist or cellist can I bother you for help?"}