{"Mon Apr 15 16:16:16 ": "@PETA and @HSUS should start an org to replace the BS American Humane:Protection of Animals on the Set http://t.co/uy2WLNGvp0 #PETA #HSUS", "Sun Jan 13 17:47:02 ": "This is why young women are interested in older men: http://t.co/NSMopVEA", "Fri Feb 01 16:24:13 ": "Look at the difference in tone from the Repubs when questioning Hagel vs.Kerry The aggression is a show to curry favor with the Israel lobby", "Fri Mar 15 21:15:31 ": "@Gilmoregirlsnow good idea but you need to access Amy. I would not be the one to do it.", "Sun Mar 17 20:04:56 ": "The Twisted Exclusive Full Episode Sneak Peek Airs March 19 http://t.co/OqjPig83TE", "Fri Apr 19 13:08:48 ": "Here is the link for Zombieland the series on Amazon: http://t.co/o5j4rKL3HW\nYou're welcome.", "Mon Feb 04 03:10:56 ": "Kaperneck kissing his arm is as dumb as it gets.", "Tue Mar 12 00:19:33 ": "@corpmike I disagree #hashtag", "Sun Mar 31 01:39:00 ": "by 2040, the number of Americans over 65 will climb to 79.7 million, up from 44.7 million now, leading to explosive entitlement spending", "Fri Feb 08 16:31:10 ": "@ReneeJGeorge good luck, Renee George.", "Sun Apr 21 16:31:22 ": "And let's legalize Marijuana, add a 5% tax to it and use that money and the resources wasted on drug laws to thwart potential mass murderers", "Fri Apr 19 16:44:04 ": "I am shocked by Farah Bunch's Electricity :http://t.co/sl9lnEtBxh @FarahBunch", "Fri Jan 18 01:27:09 ": "Shit! I just found out my new fake girlfriend is having a hysterical pregnancy. #unbelievable", "Fri Mar 01 23:34:06 ": "@elaine4animals Shower?", "Sat Apr 06 20:34:49 ": "Isn't Kelly Clarkson's Catch my Breath just a string of cliches set to music that sounds like a rip off of some song by Pink?", "Mon Apr 15 12:41:05 ": "I really enjoyed this essay: http://t.co/R1ZY8fTGsB", "Sun Feb 10 18:52:14 ": "RT @rickygervais: Always be nice to the haters who are jealous of you...it drives them fucking mad :)", "Tue Apr 16 23:43:36 ": "Yay for any woman who has sex with me: Circumcision study supports HIV theory http://t.co/GAwoc90Kfv", "Sun Feb 03 21:37:25 ": "6mi 1 percent incline 41:40 personal best. 49 in 3 months. #bannedsubstances", "Sat Apr 06 22:33:37 ": "@ATJogia Have you known me to ever not have an opinion on something?  Don't get me started on One Direction", "Mon Feb 04 02:43:15 ": "Not interested http://t.co/zLxlrIQ5", "Sat Jan 26 19:35:17 ": "@corpmike best film of the year.", "Sat Feb 09 06:00:39 ": "@LeaKThompson @TwistedABCF @ATJogia Thanks Lea!!!!", "Tue Mar 19 01:15:11 ": "An ABC Family two hour event tomorrow night!  OMFG, Avan Jogia is sooooooo hot!!!!!: http://t.co/c2LY24Xzcy via @youtube @ATJogia #ILoveAvan", "Wed Jan 30 21:17:59 ": "It just keeps getting better. Manti Te'o hoax suspect says he's 'in love' with football star http://t.co/gEzlR2W6", "Fri Mar 08 03:50:15 ": "Because I was ruining my health in Atlanta for the last 2 1/2 weeks, I just got to watch the last 3 eps of Enlightened.   What a great show!", "Sun Apr 21 17:38:15 ": "And legalize and tax prostitution, too.  Really,what is the difference between being a call girl and being Donald Trump's wife?", "Fri Mar 01 14:54:27 ": "The ex-nazi, ex-pope gave up his red shoes for, as I heard on NPR, a pair of custom loafers made from the \"skins of baby lambs\".  Revolting.", "Sat Apr 20 02:33:56 ": "Most Muslims are not terrorists.  But most terrorists are Muslim..", "Mon Feb 11 06:41:21 ": "Health Tips:  Clearing Congestion http://t.co/RIRsDsh3", "Mon Jan 21 16:41:43 ": "@peterzwhite Yes.", "Wed Feb 13 05:23:54 ": "Farewell to an Uninspiring Pope http://t.co/30mrdNft", "Tue Feb 12 18:55:41 ": "New PB http://t.co/8JuqiFpM", "Sat Feb 09 05:59:33 ": "I suuuuuck!!!!!", "Sat Jan 26 23:23:44 ": "@Only1Konway ha. Nice try.", "Mon Apr 08 18:18:47 ": "Obviously, this well reasoned essay is applicable to film/TV and music: The Slow Death of the American Author http://t.co/KdQFbeoAFl", "Sun Jan 27 05:06:02 ": "I am special. http://t.co/aynJi7wq", "Sat Mar 09 20:23:14 ": "RT @EmileHirsch: It's literally impossible not to look stupid on a segway #SXSW", "Sat Apr 20 02:48:59 ": "@idrathernot the truth can be uncomfortable at times.", "Sun Apr 07 17:18:37 ": "NYT article on how corrupt our gov't is and why we can't cut the deficit: Tax Lobby Ties to Chairman of Finance Panel http://t.co/wZdYcf3MhP", "Thu Feb 07 15:41:17 ": "@ZoeyDeutch @ATJogia @GavinPolone @TwistedABCF I wish you hadn't passed on my other pilot so I could be annoying you both independently!", "Sat Feb 23 17:58:10 ": "This might be my favorite video on youtube: Edison Lighthouse - Love Grows (HQ) (TOTP 5-2-1970): http://t.co/vaT3g8Q98I via @youtube", "Wed Jan 23 19:57:51 ": "Heck out Penn's piece:NYTimes: Is Atheism a Religion?\nhttp://t.co/LDy9UFFk", "Sat Feb 23 02:12:57 ": "You just cannot put Ricky Rubio, or some other small white guy, on Kevin Durant and hope to beat OKC.", "Thu Mar 07 17:37:46 ": "Please fill out this form and RT Urge @NIHforHealth to retire ALL government-owned chimps to sanctuary: http://t.co/0XbQLC1vzO", "Sun Mar 03 13:53:59 ": "Please watch this short video by The Humane Society about the reitrement of gov't chimps to Chimp Haven: http://t.co/Snu1cKs1ee via @youtube", "Mon Feb 25 01:06:18 ": "Oh shit, Adele just ate Kristen Chenoweth on fucking live TV!!!", "Fri Mar 01 15:08:48 ": "Five Military Cuts That Would Fix Sequestration http://t.co/ZFeSVPNFEo via @BW", "Sun Apr 07 18:07:04 ": "The Harvard School of Public Health reported those who consumed the highest levels of red meat had the highest risk of death during study,", "Sun Mar 03 14:53:09 ": "Fuck http://t.co/gV4LP4jXMD", "Tue Apr 02 14:50:54 ": "Guy at the gym just came up to me and asked '' are you Ezra''. I feel insulted.", "Sun Feb 10 19:21:46 ": "Pls read and retweet.  It shows the hypocrisy of the AKC and the evil of dog breeders:  http://t.co/gIgVUg83 #dogs #pets #dogrescue #evil", "Mon Jan 28 03:45:09 ": "I love Girls and Enlightened. #iamstraightnoreallyiam", "Sun Jan 27 06:44:23 ": "http://t.co/sR43wFo1", "Tue Mar 19 18:16:34 ": "6mi 0 percent incline, 40:09, new PB, 6 weeks until 49! Owe it to the excitement about sneak preview of #Twisted tonight at 9p on #ABCF", "Sat Jan 26 19:34:43 ": "@achillessimi you need an agent to submit you.", "Sat Jan 26 19:30:39 ": "@achillessimi Yes.  There are casting directors who are organizing them.", "Tue Feb 05 21:50:38 ": "This is an essay I wrote for a new website: I LOVE MUTTS - http://t.co/lRXOnVZh", "Sun Apr 14 17:39:44 ": "My homey Dr. Dre came through with a gang of Tanqueray\nAnd a fat ass J, of some bubonic chronic that made me choke.", "Sun Apr 21 15:59:24 ": "Let's get tougher on self-protection: more surveillance, pick up those with expired tourist visas, more profiling, less benefit of the doubt", "Mon Jan 21 16:58:56 ": "@peterzwhite No, Amazon.  They're doing TV series now.", "Sun Mar 10 03:23:02 ": "NYTimes\nhttp://t.co/vrjpajh6my They spend $500 million a year on film subsidies but are cutting aid to the disabled. Fucking stupid.", "Tue Apr 16 13:42:35 ": "@Nirvannic You need to go home to Promises Malibu.", "Wed Jan 23 00:09:59 ": "@abhaywilde sorry, I am not looking for new projects.", "Sun Jan 13 20:31:03 ": "New personal best, 6mi, 1 percent incline in 41:47.", "Sun Jan 27 05:22:27 ": "http://t.co/WsHreR6o", "Sun Jan 13 17:56:47 ": "@rebeccasandulak I agree it is about attention. We're talking about a cultural difference between generations.  Older men don't act that way", "Sun Mar 31 19:40:10 ": "New PB: 1 percent incline, in honor of  Aaron Kweskin's bday http://t.co/aZYytLAV98", "Sat Apr 20 17:57:26 ": "@idrathernot Maybe in number, not in risk to U.S. citizens.  The IRA isn't even as dangerous to the English as radical muslims are today.", "Tue Feb 05 23:40:58 ": "I think I'm suffering from eclampsia.", "Mon Feb 11 06:25:42 ": "Jack White, best performance of the night.", "Sat Mar 02 16:33:38 ": "Unpleasant. http://t.co/swpge0CAAz", "Sun Jan 27 05:29:44 ": "http://t.co/I8E2eoiV", "Mon Feb 25 10:45:33 ": "When will Obama attack this $11Billion loop-hole?  If he doesn't, it proves he's been bought off, like Sen. Schumer: http://t.co/A6CfzfQ09i", "Sat Jan 26 19:39:13 ": "@corpmike Last I heard, Al Qaeda hasn't banned harsh treatment of prisoners.  Has the CIA beheaded anyone and put the video on the internet?", "Sun Jan 27 05:14:50 ": "Almost http://t.co/jCzox8Ro", "Wed Apr 10 13:49:46 ": "The newer life fitness treadmills are easier than the old ones, so this doesn't count as a PB. http://t.co/xvSUBCKX59", "Mon Feb 04 16:01:18 ": "@courtenaytaylor even dumber", "Thu Feb 21 17:45:22 ": "So Michael Bay: Rolling gun battle on Las Vegas Strip leaves 3 dead, 3 injured http://t.co/UB5OiurimB", "Sat Feb 23 17:50:05 ": "@TheJudalina not enough.  If all incentives were ablolished, most movies and TV shows would still get made.", "Fri Jan 25 00:31:08 ": "Guy next to me at commerce ordered this and it is disturbing me. http://t.co/OD34QkwM", "Wed Mar 13 21:35:25 ": "Watch the Twisted Full Hour Exclusive Sneak Peek March 19 http://t.co/OqjPig83TE", "Sun Jan 27 05:16:39 ": "Me and Sona! http://t.co/iJGfkZ1Z", "Sun Mar 31 22:41:42 ": "How I know it is dinner time for the cats. http://t.co/msvmYPKJk2", "Thu Apr 18 04:25:22 ": "@Nirvannic I miss you more.  Forreals.", "Mon Feb 04 02:06:46 ": "I need a libretto to understand what the fuck Shannon Sharpe is saying.", "Sun Jan 13 19:12:46 ": "@ChazzCScripts bad run in the tournament. Did ok at 5-10. You did get crazy unlucky.", "Wed Jan 30 03:10:02 ": "This says it all: California unable to disarm 19,700 felons and mentally ill people http://t.co/BZhEQ6Zh", "Sun Mar 31 16:26:19 ": "I am risen (I post this every year, and it still makes me smile)", "Wed Feb 13 03:19:06 ": "Excellent speech Mr. President.", "Sat Mar 02 00:18:25 ": "Why are people who eat cows and pigs suddenly concerned about eating horses? Pigs are as smart as dogs.  Maybe it's all wrong?", "Sat Feb 23 14:28:01 ": "The $1.5 billion in film subsidies that states provide,could pay for 23,500 middle school teachers, 26,600 firefighters, and 22,800 police.", "Wed Feb 20 11:38:46 ": "I am coming out of the closet and admit that I have plantar faciitis: No Consensus on a Common Cause of Foot Pain http://t.co/ldyzaDF8", "Fri Feb 08 16:16:41 ": "@ReneeJGeorge Looks fun.", "Thu Jan 17 19:16:29 ": "How do I get me one of them fake dead girlfriends?  Is there a http://t.co/scTkATwE or an even http://t.co/hwcxWbs8 I could try?", "Tue Jan 15 18:03:41 ": "2013 Love &amp; Compassion (playlist): http://t.co/6aaxltkH via @youtube", "Fri Apr 19 13:42:48 ": "Ok, allow me to say it: we let too many people from sketchy countries like Chechnya, Yemen and any of those that end in \"stan\" into the U.S.", "Fri Jan 18 17:18:07 ": "We must free the chimps Via @nprnews: Figuring How To Pay For (Chimp) Retirement http://t.co/HHvL9rdO", "Sun Mar 03 14:31:14 ": "Yeah Morrissey: On Friday night, Moz set his sights on Beyonce, noting that her choice of handbags has led to the extinction of the rhinos.", "Sat Feb 09 20:09:53 ": "@ZoeyDeutch @ATJogia Happy Birthday, Avan.  I will buy you a Labatt's next time I see you."}