{"Thu Apr 11 20:02:01 ": "♫ Just Announced: Morristown, NJ - Jun 21 at Mayo Performing Arts Center http://t.co/d5UkkPM2CB", "Thu Apr 18 16:12:45 ": "We want to wish @TheKellyHansen a very Happy Birthday! #JukeBoxHero http://t.co/PRejH8xVfN", "Tue Dec 04 22:24:18 ": "♫ Just Announced: Saint-Julien-En-Genevois, France - Jul 21 at Guitare en Scene Festival http://t.co/hhvL4yyf", "Tue Nov 27 21:33:51 ": "♫ Just Announced: Lima, Peru - Apr 2 at Centro de Convenciones Maria Angola Miraflores http://t.co/ulOpxq8a", "Mon Dec 17 20:00:34 ": "♫ On Sale Tomorrow: Longford, Canada - Mar 8 at Casino Rama http://t.co/rhT56HOB", "Mon Nov 19 21:55:44 ": "♫ Just Announced: Hollywood, FL - Jan 9 at Seminole Hard Rock Hotel http://t.co/LEc7II49", "Fri Jan 25 22:40:57 ": "♫ Just Announced: Indianapolis, IN - May 25 at Snakepit Ball http://t.co/0EVlUrQw", "Thu Nov 22 20:00:26 ": "♫ On Sale Tomorrow: Ocean City, MD - May 4 at Oc Inlet Parking Lot http://t.co/yEtHoYWO", "Thu Apr 11 21:56:42 ": "♫ Just Announced: Newport, RI - Jun 28 at Newport Yachting Center Commercial Wharf http://t.co/rbOxUTJUFB", "Fri Feb 22 17:11:31 ": "Great day for hard rock as @TheMickJones &amp; @LouGramm are elected to Songwriters Hall of Fame! Congrats to @IamStevenT &amp; @JoePerry too!", "Mon Nov 19 22:33:47 ": "♫ Just Announced: Carlton, MN - Jan 19 at Black Bear Casino http://t.co/70g5rdij", "Mon Nov 19 23:17:46 ": "♫ Just Announced: Longford, Canada - Mar 8 at Casino Rama http://t.co/2RC4RSS3", "Thu Nov 22 20:00:54 ": "♫ On Sale Tomorrow: Ocean City, MD - May 3 at Oc Inlet Parking Lot http://t.co/8wNxXKkx", "Thu Feb 28 23:00:40 ": "Tickets go on sale tomorrow at 10:00AM ET for @Mets vs @Cubs 6/14/13 with post-game Foreigner concert included w/tix! http://t.co/1LYZLcsMD7", "Wed Apr 17 18:41:06 ": "♫ Just Announced: Zug, Switzerland - Jul 31 at Arenaplatz (Bossard Arena) http://t.co/eoHzyLuPmk", "Mon Nov 19 22:57:46 ": "♫ Just Announced: Longford, Canada - Mar 2 at Casino Rama http://t.co/lAPDr17F", "Wed Dec 19 22:48:53 ": "♫ Just Announced: Baltimore, MD - May 3 at Pier Six Pavilion http://t.co/oj8aLLB0", "Fri Nov 23 20:01:37 ": "♫ On Sale Today: Ocean City, MD - May 4 at Oc Inlet Parking Lot http://t.co/ckYAqTL8", "Tue Apr 02 20:00:39 ": "♫ Today: Lima, Peru - Apr 2 at Centro de Convenciones &amp; Eventos Claro http://t.co/Wwft0kOblc", "Tue Apr 23 21:29:15 ": "Nothing inspires like a deadline. Well this is it! Foreigner Merch contest closes end of day Friday, 4/26! https://t.co/BXavZMvBAh", "Tue Mar 12 20:26:00 ": "♫ Just Announced: Kennewick, WA - Aug 21 at Benton Franklin Fair http://t.co/2rFx2fGiFu", "Thu Dec 06 21:01:00 ": "♫ On Sale Tomorrow: Biloxi, MS - Mar 15 at Hard Rock Live http://t.co/ZmtfVP3I", "Fri Jan 18 21:01:07 ": "♫ Today: Red Wing, MN - Jan 18 at Treasure Island Resort &amp; Casino http://t.co/KsqroLRO", "Tue Apr 02 22:18:24 ": "♫ Just Announced: Jackson, NJ - Jun 16 at Northern Star Arena @ Six Flags Great Adventure http://t.co/SmIbS1Cu2m", "Thu Jan 03 16:59:02 ": "♫ Just Announced: Paducah, KY - Feb 15 at The Carson Center http://t.co/4CFoKUwD", "Tue Feb 26 19:43:07 ": "Mick Jones and Lou Gramm to reunite on stage for Songwriters Hall of Fame Awards Ceremony!http://t.co/q9vwmfRN96", "Thu Jan 24 20:31:55 ": "Thanks for the great behind-the-scene pics @RollingStone! http://t.co/gUUKDGOu http://t.co/TiEmcj2f", "Mon Dec 03 20:00:06 ": "♫ On Sale Today: Plant City, FL - Mar 1 at Strawberry Festival http://t.co/4sgjKr08", "Mon Apr 15 20:02:51 ": "♫ Just Announced: Traverse City, MI - Jul 1 at National Cherry Festival http://t.co/zqauANpuq2", "Thu Feb 28 20:48:49 ": "Mick talks about Foreigner, @SongwritersHOF &amp; working with @OfficialOzzy in an interview with AOL Music's @Noisecreep!http://t.co/w4UZDa0tTX", "Sun Apr 07 18:00:23 ": "♫ Today: Buenos Aires, Argentina - Apr 7 at Teatro Gran Rex http://t.co/tHCmEqcSDz", "Wed Feb 27 22:28:23 ": "Watch live webcast tomorrow of acoustic show at noon ET! Links to participating radio websites at this link:\nhttp://t.co/LdsTaVvxia", "Mon Dec 17 20:00:48 ": "♫ On Sale Tomorrow: Longford, Canada - Mar 9 at Casino Rama http://t.co/SLnarflV", "Mon Apr 15 21:13:19 ": "♫ Just Announced: Littleton, CO - Aug 11 at Hudson Gardens &amp; Event Center http://t.co/RLmjYtHtra", "Fri Mar 01 22:32:48 ": "♫ Just Announced: Lichtenfels, Germany - Aug 2 at Schutzenanger Lichtenfels http://t.co/tWUnsLne4u", "Fri Dec 21 20:01:43 ": "♫ On Sale Today: Baltimore, MD - May 3 at Pier Six Pavilion http://t.co/hNlTaZAd", "Fri Mar 15 17:49:20 ": "RT @VH1Classic: Don't miss #BehindTheMusic Remastered: @ForeignerMusic TOMORROW night at 9/8c! SNEAK: http://t.co/kXgE45iyuR", "Fri Dec 21 21:01:09 ": "♫ Who's Coming?: Red Wing, MN - Jan 18 at Treasure Island Resort &amp; Casino http://t.co/oRFTIFy9", "Sat Apr 20 22:00:12 ": "♫ Today: Riverside, CA - Apr 20 at Fox Performing Arts Center http://t.co/w7YX8bcPBf", "Sat Dec 22 21:00:31 ": "♫ Who's Coming?: Carlton, MN - Jan 19 at Otter Creek Event Center http://t.co/luKhbapc", "Tue Dec 04 20:09:17 ": "♫ Just Announced: Emmendingen, Germany - Jul 20 at Schloßplatz Emmendingen http://t.co/505RAuvp", "Thu Feb 28 22:20:24 ": "Foreigner to play at @CitiFieldEvents for post game concert June 14th! @Mets vs @Cubs! http://t.co/nO8eXQi4hp", "Thu Feb 28 22:10:20 ": "♫ Just Announced: Laughlin, NV - Jun 1 at Riverside Outdoor Amphitheater http://t.co/8Log7XNZRO", "Sat Apr 06 18:00:21 ": "♫ Today: Sao Paulo, Brazil - Apr 6 at HSBC Brasil http://t.co/tm9coHI6OF", "Tue Apr 16 18:49:11 ": "♫ Just Announced: Albany, OR - Aug 24 at Northwest Art &amp; Air Festival http://t.co/BpPBP3AyjK", "Tue Dec 18 20:00:15 ": "♫ On Sale Today: Longford, Canada - Mar 8 at Casino Rama http://t.co/E4bmwMIF", "Fri Mar 29 17:00:34 ": "RT @VH1Classic: Take a break from work and watch #BehindTheMusic Remastered with @ForeignerMusic online now: http://t.co/wBHMO65gO5", "Fri Dec 07 21:00:03 ": "♫ On Sale Today: Biloxi, MS - Mar 15 at Hard Rock Live http://t.co/fyLRjctS", "Tue Nov 20 19:09:52 ": "♫ Just Announced: Mount Pleasant, MI - Mar 2 at Soaring Eagle Casino &amp; Resort http://t.co/sBwumYdY", "Sat Feb 02 20:00:52 ": "♫ Today: Harris, MI - Feb 2 at Island Showroom http://t.co/MlY1AnnU", "Mon Apr 15 21:49:36 ": "♫ Just Announced: Lancaster, CA - Aug 17 at Antelope Valley Fair http://t.co/hj8rpHnAdu", "Fri Mar 08 20:00:55 ": "♫ Today: Longford, Canada - Mar 8 at Casino Rama http://t.co/qcslIrBo4W", "Thu Nov 29 20:21:06 ": "♫ Just Announced: Plant City, FL - Mar 1 at Strawberry Festival http://t.co/CC9DSySc", "Tue Nov 27 21:39:53 ": "♫ Just Announced: Buenos Aires, Argentina - Apr 7 at Teatro Gran Rex http://t.co/RgRfckxq", "Tue Feb 26 17:25:12 ": "Kelly Hansen writes travel article for today's New York Times! Don't forget your scarf!#scarf http://t.co/uFC3dwJC9n", "Wed Jan 02 20:04:33 ": "♫ Next Week: Hollywood, FL - Jan 9 at Seminole Hard Rock Hotel http://t.co/oOeVqFQO", "Fri Nov 09 21:00:29 ": "♫ On Sale Today: San Antonio, TX - Apr 15 at Majestic Theatre San Antonio http://t.co/TMf2b94B", "Sat Feb 16 20:03:03 ": "♫ Today: Florence, IN - Feb 16 at Belterra CenterStage http://t.co/VqVjt1AD", "Tue Nov 27 21:38:54 ": "♫ Just Announced: Sao Paulo, Brazil - Apr 6 at HSBC Brasil http://t.co/TVf7KJj1", "Mon Nov 19 22:21:49 ": "♫ Just Announced: Red Wing, MN - Jan 18 at Treasure Island Resort &amp; Casino http://t.co/YTnUuQar", "Mon Apr 15 22:16:11 ": "♫ Just Announced: Boise, ID - Aug 20 at Western Idaho Fair http://t.co/MrmdCs21Mp", "Wed Feb 27 22:56:02 ": "Acoustic 80s y'all! Watch the live webcast at noon tomorrow! #acoustic80s http://t.co/NExcX20WkS", "Tue Feb 26 17:19:24 ": "RT @inrockmusic: Kelly Hansen, lead singer of Foreigner, has a No. 1 tip for air travel, regardless of the climate on the groun... http: ...", "Thu Jan 10 20:01:46 ": "♫ Today: Fort Lauderdale, FL - Jan 10 at Rock Legend Cruise II http://t.co/JsFmZxi6", "Tue Feb 26 18:24:46 ": "RT @TheKellyHansen: Fun &amp; entirely amusing, to me!\nhttp://t.co/UHy5MJK1HX", "Tue Apr 16 20:19:43 ": "♫ Just Announced: Wauseon, OH - Sep 1 at Fulton County Fair http://t.co/dbWKzf2Pxs", "Wed Jan 09 20:00:39 ": "♫ Today: Hollywood, FL - Jan 9 at Seminole Hard Rock Hotel http://t.co/s987Jb73", "Fri Apr 12 18:00:16 ": "♫ Just Announced: Milwaukee, WI - Jul 6 at Summerfest http://t.co/s2apbuYckS", "Fri Apr 12 20:00:50 ": "♫ Today: Marksville, LA - Apr 12 at Paragon Casino Resort http://t.co/TukqKsQr1v", "Tue Dec 18 20:00:13 ": "♫ On Sale Today: Longford, Canada - Mar 9 at Casino Rama http://t.co/SwIquv6K", "Thu Apr 04 19:00:19 ": "♫ Today: Santiago, Chile - Apr 4 at Teatro Caupolican http://t.co/ro4R35Ug3q", "Thu Jan 24 20:58:45 ": "Playing @Indy500's race-eve party, the Snakepit Ball, on May 25! #Indy500 http://t.co/Fuq1g41L", "Mon Dec 10 20:00:18 ": "♫ On Sale Today: Harris, MI - Feb 1 at Island Showroom http://t.co/2r9OtbI8", "Tue Nov 27 21:35:53 ": "♫ Just Announced: Santiago, Chile - Apr 4 at Teatro Caupolican http://t.co/3DF3BH7i", "Fri Feb 08 17:21:06 ": "Juke Box Hero from the GRAMMY Museum now on Youtube for your sharing pleasure! #SharingIsCaring http://t.co/ncxptlBj", "Tue Jan 22 20:22:14 ": "@RollingStone goes behind the scenes on our recent photo shoot! With #TheKellyHansen &amp; #TheMickJones http://t.co/gUUKDGOu", "Mon Feb 18 19:13:38 ": "Cold As Ice in NYC but we're on tour, so pls send some @stouffers mac &amp; cheese to our one of our fav charities @FeedingAmerica #localwarming", "Sat Mar 09 20:00:53 ": "♫ Today: Longford, Canada - Mar 9 at Casino Rama http://t.co/tGEf4cLkye", "Wed Dec 12 20:01:12 ": "♫ Who's Coming?: Hollywood, FL - Jan 9 at Seminole Hard Rock Hotel http://t.co/QpT9lhqD", "Mon Apr 15 20:00:03 ": "♫ Today: San Antonio, TX - Apr 15 at Majestic Theatre San Antonio http://t.co/L6NyEjaJfR", "Fri Nov 23 20:00:57 ": "♫ On Sale Today: Ocean City, MD - May 3 at Oc Inlet Parking Lot http://t.co/heqfW4r1", "Fri Dec 07 21:01:57 ": "♫ On Sale Today: Carlton, MN - Jan 19 at Otter Creek Event Center http://t.co/ChcrLgDb", "Mon Apr 15 20:52:56 ": "♫ Just Announced: Bethlehem, PA - Aug 7 at Musik Fest http://t.co/2XTPvpxs6j", "Fri Feb 22 19:34:47 ": "Congratulations @TheMickJones on your election into the Songwriters Hall Of Fame! http://t.co/ngwrsCES1p", "Fri Apr 12 21:15:32 ": "♫ Just Announced: Blue Ash, OH - Jul 4 at Red, White , &amp; Blue Ash http://t.co/8mH0qj6FES", "Fri Apr 19 22:00:11 ": "♫ Today: Reno, NV - Apr 19 at Silver Legacy Casino http://t.co/GDOPB3kgXh", "Tue Jan 22 20:25:29 ": "RT @TheKellyHansen: See, This is why I don't tweet everyday!!\nhttp://t.co/tJOUq9de", "Thu Jan 03 20:07:00 ": "♫ Next Week: Fort Lauderdale, FL - Jan 10 at Rock Legend Cruise II http://t.co/mZlVl1Vb", "Sun Dec 02 20:01:05 ": "♫ On Sale Tomorrow: Plant City, FL - Mar 1 at Strawberry Festival http://t.co/ZWstm74w", "Tue Apr 16 19:36:18 ": "♫ Just Announced: New Lenox, IL - Aug 31 at New Lenox Community Center http://t.co/nUfUMtaZoM", "Fri Feb 15 20:00:02 ": "♫ Today: Paducah, KY - Feb 15 at The Carson Center http://t.co/HUEDb5ee", "Tue Dec 04 23:22:17 ": "♫ Just Announced: Winterbach, Germany - Jul 23 at Zeltspektakel Winterbach http://t.co/w2Chgiba", "Wed Dec 05 23:03:06 ": "♫ Just Announced: Biberach, Germany - Jul 28 at Biberach Open Air http://t.co/1s4jNmCI", "Sun Mar 03 20:00:32 ": "♫ Today: Mount Pleasant, MI - Mar 3 at Soaring Eagle Casino &amp; Resort http://t.co/tdTVboj22E", "Tue Nov 27 21:29:54 ": "♫ Just Announced: Mexico, NY - Mar 31 at José Cuervo Salón http://t.co/csquQWbK", "Thu Feb 28 20:00:46 ": "♫ Today: Plant City, FL - Feb 28 at Strawberry Festival http://t.co/x4W2clrrUI", "Sun Dec 09 20:01:12 ": "♫ On Sale Tomorrow: Harris, MI - Feb 1 at Island Showroom http://t.co/CXfFP9vY", "Thu Dec 13 20:07:40 ": "♫ Who's Coming?: Fort Lauderdale, FL - Jan 10 at Rock Legend Cruise II http://t.co/Q4khQPLE", "Thu Mar 28 18:27:30 ": "♫ Just Announced: Munhall, PA - Mar 28 at Carnegie Library Music Hall http://t.co/nbGsHnCDw4", "Mon Nov 19 23:21:47 ": "♫ Just Announced: Longford, Canada - Mar 9 at Casino Rama http://t.co/ZbPdTlMY"}