{"Thu Aug 23 03:59:37 ": "just used my business cadence on the phone.  i was cutting a deal.", "Fri Oct 05 16:12:30 ": "i don''t think very many people realize that Bob Marley wore mostly denim and t shirts.", "Thu Nov 03 15:49:49 ": "i'm kind of over the viola right now", "Tue Jan 24 01:02:52 ": "annoyed", "Thu Nov 08 03:02:02 ": "Lately, if i don't feel like doing something, I just say that I have Bronchitis.", "Mon Dec 03 07:50:30 ": "look it up if you don't believe me", "Thu Aug 23 04:03:45 ": "self portrait of me on a bike http://t.co/XHcfskDe", "Sat Sep 15 09:06:36 ": "a set of brothers separately confessed their love for me today.", "Mon Dec 31 01:38:26 ": "@pile_of_eggs oh it was nice thanks!  I was in the south and ate lots of homemade buttermilk biscuits.  How was yours?", "Sat Sep 15 09:06:54 ": "one is 5 the other is 9.  i love them too.", "Thu Dec 06 05:54:06 ": "\"'Wit da perfume, all you need is the CH CH.............. das it\" \n\n---Lady on street talking perfume vs. body spray", "Mon Dec 03 07:56:46 ": "RICK RO$$I", "Fri Apr 20 23:58:22 ": "@IMDibe I can't believe you live tweeted Wednesday's episode of Doc Oz.", "Tue Apr 03 16:07:15 ": "@broken_records that took me a minute!", "Mon Oct 22 18:12:51 ": "watching twin peaks for the first time", "Tue Mar 27 05:06:58 ": "@bunnyleopard cool. see you soon", "Wed Feb 13 22:10:42 ": "Who wants to read me a chapter from their favorite book over the phone?", "Mon Dec 31 21:34:17 ": "@pile_of_eggs I was in North Carolina spending time with my nieces who I never get to see bcuz they live in ENGLAND", "Sat Jul 28 08:59:42 ": "somebody called me RIck Rossi and i liked it", "Sun Apr 29 00:36:17 ": "I am looking to buy a Fender Mustang guitar. Are you selling one? do you know anyone who is?", "Sun Dec 16 03:32:27 ": "My \"Vincent Black Lightning\" http://t.co/M571ukqj", "Tue Jun 12 15:19:51 ": "@3syllables Oh Okay. Okay.  that b lookin right for me.", "Tue Feb 12 04:08:44 ": "RT @BerlinSunThtr: Check out Berlin Sun Theater with Mick Taussig, Kyle Bukhari and @Anni_Rossi and @BMLSInc on Sat Feb23rd, 8pm at the  ...", "Fri Nov 02 17:31:24 ": "no one will play yahtzee with me", "Thu Aug 02 22:03:42 ": "http://t.co/d82TZqby   made it on my iPod", "Thu Oct 25 17:07:35 ": "RT @cootae: annie http://t.co/3J4JegU9", "Fri Aug 03 06:10:41 ": "@TWRHQ  thx TWR    it was really fun to make", "Thu Feb 07 06:14:14 ": "I just became a pen pal. Never met this person. It's a fun way to expose myself", "Tue Oct 09 05:51:24 ": "I just took a quiz and it said I am stuck in the Latency phase.  Do u get what i'm talkin about?", "Sat May 19 16:47:56 ": "@pile_of_eggs  yup!! may 7th is the date - THX!!", "Wed Dec 07 20:22:46 ": "@redyellowcab  hi!  and thanks.  been working on new music.  would be nice to see you soon.  i live in brooklyn now", "Fri Oct 05 16:16:41 ": "My half birthday is approaching in 2 days", "Fri Nov 02 17:32:53 ": "@lawsonwhite I like this idea.  They sound good and have really nice inflections", "Wed Mar 28 05:15:25 ": "Glaciers by Anni Rossi via #soundcloud http://t.co/0Cs26Nj2", "Tue Jan 24 01:10:07 ": "@cillian17 my laptop is from 2001", "Tue Nov 08 14:42:21 ": "a sliver of wood about 3.5 inches long just punctured my leg from an unfinished table.  i am so confused.", "Tue Feb 05 07:40:46 ": "I've decided that cooking bacon in the house is not worth the lingering smell it leaves.", "Sat Nov 24 02:40:58 ": "wearing my fanciest dress and shoes and fur coat for no particular reason while lying on my bed listening to groove theory.", "Sat Feb 16 07:01:17 ": "RT @scoutist: now i know why i scare the shit out of men.\n\nOn s'en fout #10: Scout Niblett: http://t.co/EoFDw1Uy via @youtube", "Sat Jan 12 15:01:59 ": "If you are in Berlin tomorrow come to my show at 6pm http://t.co/w49YPB2F", "Tue Mar 06 02:27:26 ": "RT @daytrotter: Encore @Anni_Rossi session is up now!! http://t.co/9WurCVZN", "Tue Apr 03 05:39:30 ": "today i said \"LIKING MY BOCK UP\" instead of \"locking my bike up\" to a restaurant hostess.", "Tue Dec 25 20:07:05 ": "@IsobellaJackson Thanks Miss Jackson!!", "Fri Feb 24 09:27:31 ": "dudes in vegas askin me too many questions. i sat down at a slot machine and won $45 dollars on my first spin and cashed out.", "Sun Oct 30 20:54:54 ": "@EmilyHopePrice   please text me again.  we have to hang out and I didn't save your info.", "Thu Aug 23 04:05:49 ": "this so funny.  saw it while i was waitin for the train http://t.co/IYOSrjAt", "Tue Sep 04 19:23:09 ": "photos of me doing laundry and hanging in my house + interview  http://t.co/jCQYv1mc", "Sun Dec 23 15:24:23 ": "My \"Last Christmas\". Big Love. Kiss Kiss http://t.co/HWKXCE79", "Mon Aug 13 01:35:42 ": "nother demo i made on my ipod touch http://t.co/WSOJ3cyL", "Wed Apr 11 15:42:33 ": "@ohaliciajo pop it out girl", "Mon Jan 28 03:45:00 ": "RT @Liz_Dosta: My friend Anni made baked ziti for me and three of our friends. It feels very Sopranos meets Girls. #HBO", "Sat Nov 24 02:45:13 ": "http://t.co/8rcNrZ4F", "Mon Apr 22 21:15:58 ": "I laid on a grand piano last night for the first time in my life.  Should have done that years ago.", "Thu Aug 16 20:34:01 ": "@JR1Nelson  thx j.r.  I will def keep you posted.  i might come to chicago in oct!", "Tue Aug 07 16:02:16 ": "new demo i made on my ipod  in in my room http://t.co/9ASskp6W", "Tue Jun 12 15:23:08 ": "\"Ima Kill U\"  - A drawing I made for my bedroom. http://t.co/gi8ICRea", "Fri Oct 05 16:18:15 ": "@veritsusman wish i could come hear that", "Mon Dec 31 01:29:21 ": "RT @iamdannylove: @anni_rossi was that you I saw in Nordstrom Seattle tonight?", "Fri Sep 14 00:49:18 ": "http://t.co/YofxjewP    new song i made in my room on my ipod touch", "Sun Oct 28 08:57:11 ": "RT @kcurtain: VIDEO: Last night Rockstxr Jones w/ live band The Sound headlined the Americas Next Hot Music Producer Showcase @... http: ...", "Tue Nov 15 07:14:49 ": "@johnsharnhorst Isabel showed me your videos. They are true and real.  I told her I would marry you J S.", "Thu Jan 24 07:17:11 ": "lost in a Senna youtube marathon", "Wed Oct 31 17:59:50 ": "I need a back up vocalist or 2 that sound like relatives of both me and Sade.  Any leads?", "Tue Feb 12 04:00:00 ": "@veritysusman hey dm me your email.  I have a proposal for you.  xx", "Mon Jan 30 08:55:31 ": "just booked a bunch of plane tix to begin the recording of my next album.   OMG!!!!", "Sun Jan 13 13:40:51 ": "Check out this New Years video by Rollin Hunt! So Cool!  I am playing the guitar. http://t.co/yEdMJglo", "Mon Feb 04 22:34:13 ": "My dad thinks Beyonce' is called \"BOUNCY\".", "Thu Nov 08 03:35:54 ": "RT @hipsterchicago: @Anni_Rossi clever girl.", "Mon Dec 31 01:31:00 ": "@iamdannylove  no but I love the feeling of running into a friend at the mall :-)", "Mon Feb 11 04:43:55 ": "@Dominic_Dominic Know anyone there with a piano who wants to host my show at their house in July? I wanna do mini tour of house shows.", "Mon Dec 03 07:49:25 ": "i'm sick of defending my pronunciation of the MOOG to dudes.   MOOG  rhymes with VOGUE.  its not like \"i hawked a LOOGy MOOGy\"", "Sun Oct 14 01:20:09 ": "i am so giggly tonight", "Mon Feb 18 07:53:54 ": "@hipsterchicago color it with words bb", "Sat Feb 23 09:07:11 ": "Playin music I wrote 4 a play tonight @ the whitney @ 8pm.  If u look at me while I am playing I will start cracking up like an 8th grader.", "Mon Feb 11 19:06:15 ": "@Dominic_Dominic cool! can you DM me your email?", "Mon Sep 17 15:30:36 ": "I look like i got my head smashed in right now because my roommate is doing makeup for a horror film and I am her dummy today", "Mon Aug 13 03:00:52 ": "@pile_of_eggs i'll be twitterin' sum more then", "Fri Nov 02 17:38:56 ": "@DreamPanther  yeaaaa", "Sun Oct 30 20:44:17 ": "My song Land Majestic is gonna b on the Good Wife tonight.  Look for it in both a cab scene and a bar scene.", "Sat Nov 24 02:41:41 ": "why don't they make a banana flavored seltzer?", "Fri Mar 09 19:10:33 ": "any leads on a tight remix of Downton Abbey theme song?", "Mon Aug 13 03:37:41 ": "@dream_panther just got outta the hot tub.  no joke", "Mon Nov 05 18:55:25 ": "i get so OCD over my marinara.  there is  always room for improvement.", "Thu Nov 03 15:51:06 ": "it's like my first love that i've out grown.  time to move on tho, but its tough.  break ups are hard.", "Mon Feb 20 21:33:46 ": "GENRESHIFT", "Mon Feb 06 17:49:07 ": "fried egg with cupcake", "Mon Dec 26 19:46:18 ": "@Lhhhn its a silly little song :-)", "Mon Apr 16 14:17:35 ": "\"DRINKIN\"    been drawing a lot http://t.co/RnLMrZmt", "Mon Jan 16 07:52:52 ": "craycray  @thejeffreysmith @jirvindally", "Mon Jan 14 21:27:36 ": "Why did the Germans lock my suitcase without asking? I had to cut it open with a butcher knife.", "Wed Apr 11 15:39:37 ": "@efterklang sounds mischievous. excited to      hear it!", "Thu Nov 08 03:27:57 ": "@hipsterchicago na u just gotta text it and avoid talking on phone", "Sat Sep 15 09:05:02 ": "made homemade marinara all day", "Sun Apr 29 00:43:27 ": "@robinnnewman  I loved chatting with you punkin!", "Mon Feb 20 18:30:44 ": "@phantomlungs can i hear it?", "Mon Aug 13 06:52:15 ": "@songadaymann i will when i get back.  i am in new jersey at a mansion with a hot tub and an infinity pool.", "Mon Aug 13 01:34:50 ": "money shot in my bed http://t.co/WVQRbSPW", "Tue Jan 24 01:36:30 ": "@cillian17 it def does, so thanks!", "Sun Dec 16 03:41:52 ": "@Levertis_Minter Thanks!!", "Tue Sep 04 19:24:34 ": "prank phone calls are becoming part of my sound."}