{"Tue Sep 11 17:49:07 ": "Thanks to those who stuck around last night to watch us and thanks to Daytripper, Earthrise and Much Worse for... http://t.co/QKm0Nd6P", "Fri Apr 15 19:11:32 ": "played a song Jumping The Shark by AMBASSADOR GUN on @Myspace http://lnk.ms/Mqkkb", "Sat Sep 29 18:50:34 ": "Come see us open tonight for a round of amazing bands tonight at Hells Kitchen in Minneapolis. We play at 1015.", "Wed Nov 10 10:56:29 ": "Nuclear Blast EUROPE have just launched their completely new and improved Website and Online Shop! Check it out! http://fb.me/JBHQoKNH", "Tue Jun 14 22:31:53 ": "played a song When you wake up(feat.Britt.todd.)… http://www.myspace.com/daysoftorment/music/songs/when-you-wake-up-feat-britt-todd-80075281", "Mon Jan 09 19:34:38 ": "New intro, new songs, free show, cheap beer sick support. You really have no good reason to miss our first show of the year.", "Wed Jun 06 22:19:57 ": "We are playing another new song on 15th at the Hexagon. Heavy is the new direction.", "Sat Aug 27 18:08:12 ": "played the song 'Nine Lords' by Grand Demise of Civilization on @myspace http://t.co/vPxES62", "Wed Mar 14 19:12:45 ": "Warm weather is here! Lets book some shit! Hit us up at the-crinn@hotmail.com", "Fri Sep 02 19:57:32 ": "Do us a huge favor and please tell your friends about us and tell them to listen and \"like\" our page. The season... http://t.co/GI5kwUN", "Thu Mar 24 17:15:23 ": "THE CRINN played a song RULE OF WRIST by The Plague Years&trade; on Myspace http://lnk.ms/LChWN", "Mon Apr 18 20:38:19 ": "We are writing. Yes it is different.", "Thu Nov 11 17:57:59 ": "On our way to Detroit! Show is at the Corktown Tavern and doors are at 9!", "Fri Dec 07 10:31:40 ": "The new jams are coming along nicely. Writing for the album is almost complete. We can't wait to get into the studio for this one.", "Wed Aug 03 12:56:21 ": "We are looking for someone to video our set on Saturday, anyone up for it?", "Sun Jan 09 03:44:45 ": "Don't forget about us, we are writing more music for your pretty little ears.", "Mon Aug 22 19:53:20 ": "Drums tracked, bass on Wednesday.", "Fri Jan 06 21:03:45 ": "https://t.co/GEAV9Jnw http://t.co/fdgICPZD", "Fri Jul 08 03:20:54 ": "played a song Idle Hands by FRONTIER on @myspace http://lnk.ms/NQBnM", "Thu Mar 24 17:03:55 ": "THE CRINN played a song DAWN OF OUR EPIDEMIC by The Plague Years&trade; on Myspace http://lnk.ms/M5F99", "Sun Jul 31 22:44:52 ": "DETROIT : \n\nGo to this show tonight!\nTIGER FLOWERS\nSun, Jul 31, 8:00 pm at The Comet Bar in 128 Henry Street, Detroit MI\nw/ MEEK IS MURDER", "Thu Mar 24 17:10:02 ": "THE CRINN played a song SWORD THE TRUTH by The Plague Years&trade; on Myspace http://lnk.ms/M5Fkl", "Thu Mar 24 17:19:20 ": "THE CRINN played a song PRELUDE TO DARKNESS/ENDTIMES by The Plague Years&trade; on Myspace http://lnk.ms/LChhX", "Sat Jan 07 22:32:23 ": "I posted a new photo to Facebook http://t.co/BXtcYqk1", "Sat Jul 07 13:29:02 ": "Triple Rock tonight! Doors at 9. Come early and see all our awesome friends!", "Wed Jun 01 19:58:16 ": "We're gonna play a new track or two at this show!!! Don't miss out! http://fb.me/YAAud1zk", "Sun Nov 14 14:41:13 ": "Please share us with your friends!", "Fri Mar 04 19:15:48 ": "Roberts Bar in Mounds View tonight, starts around 8 so get your sausages and tang down there and party!", "Thu Mar 24 17:06:53 ": "THE CRINN played a song THE INHUMAN CONDITION by The Plague Years&trade; on Myspace http://lnk.ms/LCh0p", "Sun Apr 03 02:41:58 ": "played a song Indestructible by Robyn on Myspace http://lnk.ms/Gs82b", "Sat Nov 13 22:22:51 ": "Special thanks to all of the promoters, friends and fans that came out to our shows this week. We had a great... http://fb.me/JPh7UYGi", "Sun Oct 02 19:29:12 ": "We have the music down for our first cover song ever. Putting the vocals to it next practice and playing it live at our Oct. 29th show!", "Sun Oct 23 20:10:11 ": "Limited sizes, but some sweet prices on a few of our older t-shirt designs. Click on the store tab to the left!", "Sat Nov 26 01:16:24 ": "played the song 'Slaughterhouse-Five' by BURY YOUR DEAD on @myspace http://t.co/HSdD7XQ3", "Sat Apr 23 07:32:21 ": "Thanks to everyone that came out to the Hexagon to see us tonight! Another great time.", "Thu Apr 21 19:53:14 ": "Friendly merch store reminder. Get your cheap shirts and old EPs!\n\nhttp://www.thecrinn.bigcartel.com/ http://fb.me/LyE9I5mi", "Sun Oct 23 18:21:44 ": "Thanks Mankato, we had a great time! Hope to be back soon. Next is the Solar Apocalypse Fest, come get some.", "Fri Apr 01 02:56:06 ": "Come to \"The Crinn @ Hexagon Bar w/ Blue Ox and Ambassador Gun and You Wretch\" Saturday, April 23 from 3:00 am to... http://fb.me/WK7FCOAP", "Fri Dec 16 04:16:07 ": "played the song 'The King's Collapse' by Nehemiah on @myspace http://t.co/7nZ3AT4x", "Sat Apr 14 16:53:24 ": "http://t.co/AtYxRuJb", "Mon Apr 04 22:06:29 ": "played a song Breathe by CHON (2 New Shows!!) on @Myspace http://lnk.ms/MWbdY", "Sat Nov 26 01:13:53 ": "played the song 'Black and Blue Kisses' by Thuraya on @myspace http://t.co/1tDgQ1Ax", "Sat Oct 08 19:57:59 ": "Come to \"Mankato Metal Mayhem\" Saturday, October 22 from 10:00 pm to 1:00 am. http://t.co/iyyZIEwH", "Wed May 25 15:40:56 ": "played a song Slaughterhouse-Five by BURY YOUR DEAD on @myspace http://lnk.ms/PJf1v", "Thu Aug 09 22:51:27 ": "We are busy writing new songs, shows are in progress of being booked, and we're feeling better than ever before... http://t.co/Pt2V0lzk", "Fri Oct 21 20:45:50 ": "Tomorrow we drive to Mankato. We will drink beers. Probably whiskey. Some new songs will be played. A good time... http://t.co/E1JcjSjM", "Thu Aug 25 01:47:38 ": "Effects? Check. Fast Finger Video Clips? Check. Two minute song? Check. Dirty Grind? Check. The Future? The Future.", "Sat Mar 05 14:51:25 ": "Thanks to all the old and new friends that came out last night!", "Tue Jan 11 14:14:03 ": "Haven't posted one of these in a while. . .\nhttp://www.metalunderground.com/reviews/details.cfm?releaseid=4578 http://fb.me/EzvRs1aP", "Sun Jan 16 20:02:28 ": "Come to \"THE CRINN AND SEVEN YEAR EXISTENCE\" Friday, March 4 from 8:30 pm to 1:00 am. A really good night to come... http://fb.me/SjrjxDUU", "Wed Aug 22 22:41:36 ": "This will be heavy. http://t.co/Yuzbb6f3", "Sat Aug 06 18:13:02 ": "TONIGHT @ The Beat in Uptown! 5PM. $5. You will not want to miss this one! http://fb.me/1dQC5mlW8", "Wed Jan 02 20:56:33 ": "We will be destroying Hell's Kitchen with all new jams on Fri January 18th with help from some awesome bands, Nerves and Maeth!", "Mon Apr 02 18:39:14 ": "We are playing a bran bran new song at our April shows, and would love to see some bran bran new faces as well. Bring yo friends!", "Mon Apr 25 18:43:27 ": "Well, We finally broke 1000 fans on Facefuck. The first person to comment on this status with the full name of the... http://fb.me/VKp0SvDq", "Fri Apr 13 22:55:42 ": "FARGO! We drove four hours, you drive four minutes. Let's rock! New Direction style.", "Wed Aug 22 22:58:37 ": "This will be heavy. https://t.co/QaXS5JF1 http://t.co/FMhJN8W3", "Tue Aug 02 21:17:44 ": "This Saturday! http://fb.me/wduVmBTr", "Sun Aug 07 11:25:23 ": "Thanks to everyone for coming out last night!", "Tue Jan 31 19:52:44 ": "Thanks to everyone that came out last night to see us at the Triple Rock. The most enjoyable show in my recent memory! -Chad", "Fri Oct 07 20:41:49 ": "First person to say what song from out oktober set list is a cover song, and! Tell us who the original artist is... http://t.co/4VRmqMku", "Fri Oct 28 23:41:29 ": "We play EARLY tomorrow. Get there by 630 or risk missing the pain.", "Fri Jul 08 03:23:46 ": "played a song Forced Hand by MUCH WORSE on @myspace http://lnk.ms/QN0Hx", "Tue Jul 19 20:19:39 ": "Will be one hell of good time, Twin Cities! http://fb.me/1aiPHu6V7", "Thu Mar 24 17:12:11 ": "THE CRINN played a song MARCH OF THE BLACK DEATH by The Plague Years&trade; on Myspace http://lnk.ms/M5FvY", "Sun Jan 29 03:48:18 ": "Hi, see you Monday.", "Fri Jul 08 03:25:17 ": "played a song Suicide Brigade by WOLVHAMMER on @myspace http://lnk.ms/QzSgT", "Tue Apr 12 19:53:27 ": "played a song Jumping The Shark by AMBASSADOR GUN on @Myspace http://lnk.ms/Mqkkb", "Tue Sep 04 19:27:18 ": "Next Monday GADDAMMIT! http://t.co/25Hmafog", "Sat May 07 03:33:27 ": "This will be an amazing show. We will even have a new song or two to play!... http://fb.me/1234GUzT4", "Wed Mar 13 17:11:35 ": "Just have to give the finishing touch to one more song, then we start with the demos. We are so stoked to get... http://t.co/4H6W2703RV", "Sat Oct 08 19:59:31 ": "Come to \"Solar Apocalypse Festival\" Saturday, October 29 from 3:30 pm to 6:30 pm. http://t.co/1vm2KNgd", "Fri Jul 08 03:29:07 ": "played a song BARBIE SMELLS LIKE BANDAIDS by THE CRINN on @myspace http://lnk.ms/QzTF5", "Sat Oct 29 17:43:19 ": "Tonight is Solar Apocalypse Fest II!", "Thu Mar 24 17:24:16 ": "THE CRINN played a song BLOOD DRUNK by The Plague Years&trade; on Myspace http://lnk.ms/LChxr", "Mon Jan 07 02:02:36 ": "this. http://t.co/xjYlk6Va", "Tue Mar 27 20:15:24 ": "Fargo, April 13th. \nMinneapolis, April 14th\nhttps://t.co/3SO8p4GJ http://t.co/vSaEFzIy", "Sun Oct 09 21:13:44 ": "http://t.co/b2NiseXY", "Fri Oct 07 19:36:00 ": "Set list for our Oktober shows : Come out to hear the old, the new and the covered.\n\nDeaf Effort\nAnaphylatic Shock... http://t.co/X7124Mj1", "Wed Sep 12 20:37:36 ": "Heard a couple people say The Current mentioned our show on the radio the other day. Thanks to them, but weird also.", "Thu Jun 23 20:37:52 ": "Tonight at Nick & Eddies! See you there!", "Sat Oct 01 14:29:33 ": "The pisser http://t.co/OlABfCuw", "Fri Jan 18 19:59:09 ": "Looking forward to seeing friends old and new tonight at hells kitchen. Come on out to hear some new jams!", "Mon Feb 28 18:24:54 ": "This Friday we shred at Roberts Bar in Mounds View MN. Come out and party with us! http://fb.me/PG82zjJo", "Sun Nov 14 14:44:46 ": "If you live in the Twin Cities area, come check out Chris' side project \"The Fisting\", Mon. Nov. 22nd at Memory... http://fb.me/IwkBy0Bo", "Fri Sep 23 22:32:01 ": "John did some vocal tracking for the demos last night. I got some sweet video and even did some vocal tracking... http://t.co/Gw9RwyDT", "Sat Jan 19 21:40:19 ": "Thanks again to everyone who came out last night! Thanks to Nerves and Maeth (Mayeth not Meth had to clear that... http://t.co/zj9lsrpv", "Tue Sep 06 19:16:20 ": "Halloween, friends, make believe and heavy music...doesn't get much better! http://t.co/5cA3q4z", "Wed Aug 17 16:43:24 ": "We are tracking demos for 3 new songs on Sunday!", "Wed Apr 27 21:52:35 ": "played a song Seven Stitches by Disembodied on @Myspace http://lnk.ms/NNvyR", "Mon Dec 20 03:08:56 ": "Buy your friend/grandmother our album Dreaming Saturn for the Holidays! Thats the link for... http://fb.me/vRdB1UAe", "Mon Jun 20 16:43:05 ": "This Thursday! We play two new songs! So come bang your head with awesome bands with awesome dudes with awesome... http://fb.me/XnjzMCgK", "Mon Jun 27 23:14:09 ": "played a song NEW: Creationed by White Arms of Athena on @myspace http://lnk.ms/NLKx3", "Mon Dec 12 01:54:17 ": "We were offered beer to stop playing music today. Life is good in The Crinn.", "Sat Nov 20 22:24:51 ": "If you live in the NYC area and for some reason don't know who Tiger Flowers are, then you really need to do... http://fb.me/Om5t3WLL", "Sat Nov 26 01:19:06 ": "played the song 'NEW: Creationed' by White Arms of Athena on @myspace http://t.co/o741PoXm", "Wed Oct 12 21:08:51 ": "Metal. http://t.co/B6iAnwWw", "Thu Mar 31 23:36:06 ": "In the days of Myspace we had over 17,000 \"friends\"...on Facebook...well...no, not that many...PLEASE invite your... http://fb.me/YvcEHzyk", "Sat Apr 14 16:36:17 ": "We had a great time at the New Direction in Fargo last night. Thanks so much to friends, old and new. Lets do it... http://t.co/7RGstLTV", "Fri Jul 22 15:47:39 ": "If we were going to \"cover\" a song from Kills Curiosity, which one would you have us do?!?"}