{"Thu Nov 15 10:51:33 ": "&amp; Me. &amp; You. You And Me... I'm confused", "Wed Nov 28 14:30:26 ": "Thanks everyone for the birthday wishes!!! I feel the love :)", "Mon Dec 31 11:43:13 ": "I wish you all great things for the year to come! A big thank you to everyone who came to the rooftop party in... http://t.co/TJdeCVHM", "Fri Jan 25 11:17:24 ": "@OkainDj du plus haut niveau!", "Sat Jan 19 19:15:08 ": "Wow!\n\nhttps://t.co/JaFKpta9 http://t.co/YK4mXqVC", "Tue Nov 13 11:28:28 ": "The Winstons' Amen break, and the story of how 6 seconds from 1969 shaped the future of dance music. Priceless.... http://t.co/rnYJDnmk", "Wed Jan 23 18:21:38 ": "My new sounds: JULIEN CHAPTAL - ILLIN EP PREVIEW SNIPPETS http://t.co/AfIjnuxV on #SoundCloud", "Tue Dec 25 13:46:06 ": "I am more than a little excited about coming back to play in South Africa! I am taking a loooong route from Paris... http://t.co/lIlYEuWz", "Fri Feb 08 18:46:40 ": "Damn, we're gonna see even more phones on dancefloors!\n\nhttp://t.co/6tGLMrOs http://t.co/CHWLcZp7", "Sat Jan 05 18:59:05 ": "http://t.co/Ozvu6djU http://t.co/PvH8RK4v", "Fri Dec 07 14:41:07 ": "Working with hardware gear is a fantastic thing which i feel priviledged to be able to indulge in. But looking to... http://t.co/OiBdjDqV", "Sat Oct 20 19:17:03 ": "I will be playing a DJ set tonight at the Loveland party in Westerunie, and then Live at Henk at the NDSM at 8 in... http://t.co/g6M0XyJU", "Mon Feb 11 18:49:51 ": "Nile Rogers, my favorite producer of all times (together with Chic's departed other half Bernard Edwards),... http://t.co/4N0D2IPx", "Fri Feb 22 11:44:29 ": "http://t.co/KzQVsCzWGp", "Thu Sep 20 12:49:08 ": "http://t.co/1AfYD6RG\nhttps://t.co/aypLKPoF http://t.co/f1hBuSCW", "Mon Feb 11 14:33:34 ": "Finishing up the remixes for Luke Solomon! Very much looking forward to releasing these.", "Fri Feb 01 21:54:01 ": "Fun fun at the Smoor studio yesterday! http://t.co/12nGAaWR", "Fri Nov 02 15:47:57 ": "And tonight i play as MFD together with David Labeij live at Perron in Rotterdam with Mathias Kaden. Hoppaa! http://t.co/59w78j6r", "Fri Feb 22 11:45:48 ": "Julien Chaptal - Sun Goes Down http://t.co/V1iRIB5aWR", "Fri Mar 08 14:44:11 ": "Very much looking forward to play at this edition of Welcome To The Future at Studio 80 tomorrow with Darren... http://t.co/j6v7eRJ0tk", "Thu Sep 20 10:15:53 ": "Getting ready for very a special weekend! Starting with WKND tonight at Amsterdam's Studio 80, tomorrow at V.C.F... http://t.co/kODgUql2", "Wed Oct 17 11:40:40 ": "Just finished giving a Dance Music Producer's workshop for the Berklee College Of Music students and made a cool... http://t.co/rRd9uRlY", "Mon Jan 21 16:47:47 ": "@kill_frenzy thanks!", "Mon Apr 01 17:58:55 ": "Good times :) http://t.co/4kMJh3L8UP", "Thu Mar 21 16:11:06 ": "Here is a sneak preview of one of the remixes i did for a track from Luke Solomon's upcoming album on Classic!... http://t.co/zm3iskoVfS", "Fri Dec 07 13:22:25 ": "Coming across some wonderful tunes in my box today....\nhttp://t.co/B9uth5EA http://t.co/tPCIp3PZ", "Mon Dec 10 14:53:53 ": "You can already have a sneak peak at the upcoming MFD release on Decks.de. The early support is already massive!... http://t.co/9zFq3MDm", "Fri Jan 25 11:22:06 ": "Here's a little update on what's happening in my world, the Chaptal blog.\nhttp://t.co/1V3whslw http://t.co/5jroNzKA", "Fri Feb 08 18:42:59 ": "Wow i just saw Facebook finally allowed the merge of my 2 pages, just passed the 10000 followers. Thanks everyone!", "Wed Mar 06 15:18:53 ": "Ableton 9 is finally here, looking forward to humming to control my synths!", "Wed Oct 24 18:03:03 ": "Machinedrum madness!!!!", "Tue Oct 30 00:34:08 ": "Linnstrument, Ableton Push. Yes Thank You More Please!", "Sun Jan 27 18:01:27 ": "Going through the Prince discography, makes me feel humble...\nhttp://t.co/vjTRRYSS http://t.co/o6j4G2iP", "Thu Jan 17 14:32:52 ": "Winter is so absolutely well suited to endless studio sessions!", "Mon Jan 21 14:50:57 ": "My new sounds: Julien Chaptal - Elephants On A String EP http://t.co/mp3azOet on #SoundCloud", "Mon Apr 08 17:40:08 ": "One of the remixes i made for Luke Solomon's Say Something EP is out today! Thanks for the amazing feedback on... http://t.co/74ToFX1NUS", "Wed Nov 07 18:47:36 ": "@SimonDunmore Very excited about this one!", "Fri Feb 08 18:40:54 ": "On my way! \n\nhttps://t.co/IBMT1b7z http://t.co/GJakKya4", "Fri Nov 02 15:41:05 ": "And tonight i play as MFD together with David Labeij live at Perron in Rotterdam with Mathias Kaden! Bang bang! http://t.co/WCp9KiFF", "Mon Jan 21 14:36:27 ": "My new sounds: Julien Chaptal - Seem Phony http://t.co/GMkahMHj on #SoundCloud", "Fri Apr 12 16:10:36 ": "You can also get the remix i did for Luke Solomon on Classic Music Company Here! http://t.co/JhFD7ky5ai", "Mon Jan 21 14:53:33 ": "I have uploaded the tracks of my last EP on Intacto Records for those of you who didn't hear it yet.... http://t.co/3COmqmJA", "Wed Nov 07 18:54:01 ": "It was a nice inspirational visit at the Redbull Studios in Amsterdam today. Can't wait to get a session rolling there.", "Thu Feb 07 21:46:53 ": "I have been tweaking and editing Prince songs a la sauce Chapsy in a kitchen near Paris with Travel Kit 2.0.... http://t.co/5wYbUCvE", "Wed Nov 07 18:47:43 ": "RT @SimonDunmore: Signed, sealed, delivered......not Obama....but a fine 3 track ep from @julienchaptal.", "Tue Apr 09 10:02:09 ": "New Chart online! http://t.co/CGsqG3kk2J", "Sat Feb 09 19:32:39 ": "MFD phone covers. hoppa! http://t.co/f9RWeVSZ", "Thu Feb 07 21:45:55 ": "I have been tweaking and editing Prince songs a la sauce Chapsy in a kitchen near Paris with Travel Kit 2.0.... http://t.co/l5uxU5KB", "Thu Sep 20 12:49:44 ": "Frieda's Büxe http://t.co/aZ3hZB5j", "Fri Dec 07 13:17:03 ": "snowy mood of the day\nhttp://t.co/wHPlpHiY http://t.co/IB1SrL47", "Mon Feb 11 15:47:09 ": "I have to share this, lo-fi goosebumps moment http://t.co/VxS8uCxq", "Wed Jan 23 17:14:20 ": "MFD2 number 7 in the techno charts and climbing. This is great! http://t.co/eR12wfUz", "Fri Dec 07 13:26:19 ": "http://t.co/phPSrthg http://t.co/HifJfdaB", "Sat Nov 03 05:46:29 ": "Perron was a blast tonight!!! Thank you Rotterdam.", "Thu Dec 13 19:04:52 ": "Im playing WKND at Studio 80 tonight!\nhttp://t.co/e4owoe5r http://t.co/syung9fZ", "Sat Oct 13 16:08:23 ": "@djantbrooks Likewise! Thanks", "Sat Dec 01 17:13:11 ": "Representing Studio 80 in London tonight with homie David Labeij at Junk. This one will be hot hot hot!!!", "Thu Apr 04 13:30:53 ": "This is where it's at tomorrow night in Utrecht! http://t.co/nDaxloREZm", "Thu Jan 17 18:55:31 ": "@classicmusicco @lukesolomon I'm stoked!", "Sun Feb 03 19:57:49 ": "Can't believe the amount of clubs per square meter there are in the area where i am staying in Lille!", "Mon Mar 04 17:20:58 ": "Here's a film of me improvising with Ties Mellema on Sexy MF. It was a fun night! http://t.co/XCPXARdWB1", "Fri Jan 18 12:20:42 ": "MFD2 is out and the response is great so far! You can listen to the preview and buy it here:... http://t.co/882XhYBv", "Mon Apr 22 11:27:53 ": "My first release on the mighty The Official Defected In The House label is out today! I am incredibly proud of... http://t.co/wu7owA9rHX", "Wed Jan 30 23:47:57 ": "Soundcloud doesn't let me upload my own tracks because of copyright infringement?!? Even though its unreleased...... http://t.co/qdqtjkar", "Thu Jan 10 18:27:32 ": "Back in Amsterdam, looking forward to dusting the machines and firing up the studio after 2 weeks of South... http://t.co/8r1lPU7g", "Mon Jan 28 17:47:00 ": "My Illin EP on Saved Records &amp; Events is out on Beatport today!\nhttp://t.co/E4JKAbN4 http://t.co/PAhWIVxU", "Sat Sep 08 09:40:59 ": "And so the holidays are definitely over! I was was offered to teach a Dance Music production class at the... http://t.co/II9SOE5d", "Thu Jan 17 16:43:43 ": "Do watch this video on Johannesburg. The music runs deep and the people are fantastic, i can't wait to be back... http://t.co/jsf9rxLv", "Wed Jan 23 12:30:06 ": "Checkout the preview video of my next EP coming out on Saved Records next week!\nhttp://t.co/9YyrD0kH http://t.co/bYkugLrV", "Sat Jan 19 15:16:11 ": "Enjoy the weekend!\nhttp://t.co/gJum5ZTL http://t.co/FZfy0Uv7", "Mon Jan 21 14:18:33 ": "I will shut down this personal account so if you want to keep in touch please like my Julien CHAPTAL page! http://t.co/l61GszlY", "Mon Apr 01 18:00:55 ": "Good times :) http://t.co/fXr3F17I8X", "Mon Mar 04 20:36:31 ": "I posted 9 photos on Facebook in the album \"Press pictures by Juliana Joly Rosier 02-2013\" http://t.co/ZjQPYKqtap", "Fri Nov 16 17:59:44 ": "Antibas at the Melkweg tonight. yayaya! http://t.co/Oz4faTyE http://t.co/cwtJE8Uc", "Fri Feb 15 19:49:51 ": "Check out this f...ing great remix of my buddy San Proper. Can't get it out of my head for days. http://t.co/FT88zG6I", "Sat Dec 08 17:03:53 ": "Digging through records for my set tonight at Sugar Factory!\nhttp://t.co/H22acW9f http://t.co/DIiSfGpx", "Fri Jan 25 09:49:19 ": "Le meilleur prof. Apprenez a mixer en 2 minutes!... http://t.co/kCqH3Kau", "Wed Feb 13 16:16:58 ": "Are you ready? http://t.co/eRmQTOQq", "Sat Oct 13 16:04:41 ": "@los_suruba All good guys? It's been a looooong time!!!", "Mon Dec 10 14:50:04 ": "A big thanks to everyone who was at the Sugarfactory lat Saturday, that was epic!", "Wed Jan 23 18:18:36 ": "Just heard i will be part of the lineup of the prince tribute evening on 5 days off festival. I will be doing a... http://t.co/CMz0dpWC", "Wed Nov 07 18:50:23 ": "@nathanbarato nice EP on Bang Bang man!", "Wed Jan 23 18:36:15 ": "Here are the previews of the tracks for my upcoming EP on Saved Records &amp; Events http://t.co/PL775tEA", "Fri Feb 22 11:40:46 ": "Thank you everyone for sending your demos! Please use info[at]http://t.co/5WvY2bXwGV", "Fri Apr 19 09:31:13 ": "RT @DefectedRecords: Making his first team debut for Defected...step forward @julienchaptal http://t.co/y1I7ADHpdq", "Fri Feb 15 12:18:03 ": "@rivastarr THANKS!", "Thu Mar 21 15:59:06 ": "This kid is already playing the piano better at the age of 4 than most of us could ever dream of in an entire life! http://t.co/jnwtBWRhIR", "Tue Apr 09 17:15:00 ": "Here's a little interview from yours truly on the The Official Defected In The House website, where you can also... http://t.co/gX43556bWY", "Mon Jan 14 18:13:28 ": "Working on a remix for Luke Solomon's new album on Classic. The original is so inspiring i've already made 2 versions. Watch this space.", "Thu Mar 21 11:49:35 ": "I will be playing all night long tonight at Your WKND starts here. Come early!", "Thu Jan 17 14:35:16 ": "Checkout this wicked dutch producer!\nhttp://t.co/tyFZwwys http://t.co/HmRQPJhf", "Thu Jan 17 15:01:22 ": "Does anyone know a synth wizard who could fix my Juno near Amsterdam?", "Sat Feb 02 21:02:30 ": "A new, classic analogue synth revived by Korg in mini format is definitely worth a check! The original was... http://t.co/UmsY1Kty", "Sat Jan 05 18:47:39 ": "Loving the Cape Town vibe!", "Sat Dec 08 17:10:08 ": "This is what i feel like!!! Playing alongside my buddies from Specker in the Sugarfactory. Be there if you're in... http://t.co/H7O4f1Y9", "Mon Mar 04 17:15:04 ": "Thanks everyone for charting Eat Ya Foe on Resident Advisor!... http://t.co/fydooUmggr", "Sun Apr 21 18:13:15 ": "RIZLA EVENT 2013 - La Cucaracha (CT) http://t.co/AWmuADtwnY", "Sat Apr 13 09:27:05 ": "Ballroom dancing tonight with my buddy David Labeij, representing the Studio 80 homebase at our friend's @JunkClub... http://t.co/lWd5a7KjBQ", "Fri Dec 21 09:18:52 ": "Getting ready for Xmas in Paris, and a South African tour starting with Johannesburg on the 26th. That is, if... http://t.co/MVGoDSZw", "Wed Jan 23 18:37:08 ": "Here are the previews of the tracks for my upcoming EP on Saved Records &amp; Events http://t.co/H4rTZDLC"}