{"Thu Apr 18 18:57:35 ": "lol, youth. \"Is it possible for you to either remove the article or just remove the name Delta Gamma\" http://t.co/pBSVNNIF6p", "Sat Apr 20 01:00:27 ": "RT @granulac: we did it you guys. we watched the whole thing", "Sat Apr 20 01:11:05 ": "You know how everyone always says we can't let the terrorists change who we are? That means sticking w/ the Constitution.", "Sat Apr 20 00:57:32 ": "Pretty sure they're already 6 deep RT @marcambinder Congress should pass a law giving everyone in the Boston area a couple of beers tonight", "Mon Apr 22 00:04:53 ": "RT @kumailn: \"Legally blonde, right? Wow. You can go.\" -the way it was supposed to go down", "Fri Apr 19 13:57:19 ": "RT @BrettLoGiurato: On Globe's report of suspect's Twitter handle RT @tonymanfred: @BrettLoGiurato looks fake, changed handle/name/avatar h…", "Sat Apr 20 00:55:47 ": "RT @thecajunboy: Good job, good effort. RT @UPROXX: The Fox News Closed Captioning Person Won The Boston Bomber Standoff Coverage http://t.…", "Sun Apr 21 23:28:28 ": "RT @ForrestW: @DanAmira More hated: Dzhokhar Tsarnaev, Anne Hathaway.", "Fri Apr 19 15:25:31 ": "Dzhokhar Tsarnaev \"smokes a little weed here and there,\" former classmate says  http://t.co/TxpWjXMxIt", "Thu Apr 18 20:58:46 ": "This is so good [charts!]:  Leading Men Age, But Their Love Interests Don’t\nhttp://t.co/i3YCEJBIuU", "Sun Apr 21 22:45:06 ": "Not even close RT @cschweitz Lawyer who takes Dzhokhar's case will \"become the most despised person in the country\" http://t.co/TCCw2FPcol", "Thu Apr 18 18:47:16 ": "For every time a term like this slips out of a lawmaker's mouth in public, he says it 500 times in private http://t.co/SuMshn9QkV", "Fri Apr 19 15:24:37 ": "So who is Tamerlan's girlfriend? Has to be only a matter of time, right?", "Sat Apr 20 00:54:18 ": "RT @JuddLegum: As news spreads the suspect is in custody, fans at Mets game breaking into spontaneous cheer: \"USA, USA\" via @AndreaSmith", "Fri Apr 19 19:40:46 ": "Uncle on CNN right now is exasperated, doesn't get why reporters are asking him these stupid questions.", "Sat Apr 20 00:51:22 ": "slow news week", "Thu Apr 18 21:11:12 ": "\"Suspect #1 is colloquially known as Roof Man. Suspect #2 has been referred to as Running Away Man.\"", "Thu Apr 18 21:17:33 ": "RT @briangaar: [Biden puts away nunchucks] \"Come in\"", "Sat Apr 20 01:29:26 ": "RT @daveweigel: LOLing at the \"enemy combatant!\" crowd, then signing off for a while. You should, too. You have a date with whiskey. http:/…", "Fri Apr 19 22:21:50 ": "For all we know he crawled into a hole and died.", "Fri Apr 19 15:16:47 ": "Dead Boston bomber Tamerlan Tsarnaev loved the movie \"Borat\" http://t.co/882zhtchGp", "Fri Apr 19 13:42:54 ": "Just to be clear: Father did not know they were the bombers. Was worried they might have been hurt as bystanders, according to ABC News.", "Fri Apr 19 23:53:09 ": "Can they, like, shoot sleeping gas at him to knock him out? Honestly curious if that's feasible. Would be great to interrogate him.", "Sat Apr 20 01:15:57 ": "RT @kibblesmith: Our long national nightmare is over for probably a couple of days.", "Fri Apr 19 22:21:23 ": "To everyone asking how Dzhokhar got away, it's probably easier than you'd think in the dark in the chaos of a shootout.", "Mon Apr 22 03:45:55 ": "I dont understand, was this a candid mugshot?  http://t.co/9JhvKcj0Oo", "Fri Apr 19 16:28:00 ": "RT @J_tsar mama, im a criminal", "Sat Apr 20 04:27:11 ": "RT @pareene: Administration will not Miranda suspect due to public safety exemption and because suspect is reportedly \"such a Samantha\"", "Sat Apr 20 04:26:37 ": "Jack Dorsey's vines just piss me off because every day he's in some other global hotspot and I'm in bed looking at his vines", "Fri Apr 19 13:52:49 ": "Dzhokhar Tsarnaev was pro-gun-control (head explodes) https://t.co/Nz0EnR29pI", "Mon Apr 22 14:52:22 ": "This is awesome and I had no idea people hated Leann Rimes https://t.co/r9teOUSLer", "Fri Apr 19 16:34:40 ": "RT @J_tsar one day you will close your eyes, forever.", "Fri Apr 19 23:40:53 ": "What if it's just a hobo taking a nap", "Fri Apr 19 13:48:08 ": "This might be the most ironic thing I've ever seen, or will ever see https://t.co/Nz0EnR29pI", "Thu Apr 18 22:16:04 ": "I'd be shocked if the guy in the white hat wasn't identified by the end of the day", "Sat Apr 20 18:45:10 ": "@brianbeutler I kept a note on my desktop to copy and paste from", "Fri Apr 19 22:47:13 ": "Now America is just totally confused RT @stephenfoley Czech ambassador emails to say: the Czech Republic is nothing to do with Chechnya", "Thu Apr 18 21:09:07 ": "Not even exaggerating, I have butterflies right now", "Fri Apr 19 16:01:11 ": "Dzhokhar RT @J_tsar No one is really violent until they're with the homies", "Thu Apr 18 22:21:22 ": "RT @Reuters: Reuters published an obituary of George Soros in error. Reuters withdrew the article as soon as it appeared.", "Sat Apr 20 00:58:36 ": "RT @mckaycoppins: Very cool. RT @RosieGray: The officer that started cheering, high fiving a photographer http://t.co/YSYqgKGVvt", "Fri Apr 19 15:42:11 ": "That boxing photo essay of Tamerlan appeared in \"The Comment,\" the magazine of BU's Graduate School of Communication http://t.co/VIicxfvJWX", "Mon Apr 22 18:23:30 ": "Video: Al Franken implies that Pat Leahy is stoned http://t.co/O6lzpguMs3", "Sat Apr 20 21:14:14 ": "RT @FCC: David Ortiz spoke from the heart at today's Red Sox game. I stand with Big Papi and the people of Boston - Julius", "Thu Apr 18 20:54:10 ": "Oklahoma's \"Jew me down\" lawmaker is basically Borat http://t.co/eOASsR392j", "Fri Apr 19 13:39:58 ": "ABC News: Father of bombers spoke to them yesterday. He was worried they were hurt, they told him they were ok.", "Thu Apr 18 20:43:32 ": "Oklahoma Lawmaker Uses the Term ‘Jew Me Down’ and Everybody Laughs, Because Oklahoma http://t.co/eOASsR392j", "Thu Apr 18 16:30:03 ": "\"They picked the wrong city. The right city would have been, like, Seattle, maybe.\" -- Obama #awkward", "Thu Apr 18 21:20:15 ": "Gonna throw up from anticipation all over @joecoscarelli", "Fri Apr 19 13:29:13 ": "RT @HariSevugan: Sigh. It's a public school. “@DailyCaller: Report: Dzhokhar Tsarnaev attended the same prestigious prep school as actors D…", "Sat Apr 20 18:45:45 ": "RT @pbump: I imagine the people who donated that blood didn't expect it to end up inside a suspected terrorist.", "Sun Apr 21 20:36:46 ": "RT @nycsouthpaw: the Feds believe Dzhokhar shot himself in the neck in an attempted suicide, per NYT.  http://t.co/CrgAKUug8W", "Thu Apr 18 22:19:37 ": "NY Post reporting that FBI released photos of 12 Saudis", "Fri Apr 19 18:25:19 ": "82 Things That Dzhokhar Tsarnaev Tweeted About: Game of Thrones, Nutella, Breaking Bad, Death ... http://t.co/G5FqgDwZT8", "Fri Apr 19 16:40:06 ": "RT @J_tsar everyone becomes a story, strive not to be fake in yours", "Thu Apr 18 21:10:10 ": "Mostly I have butterflies because I really don't want it to be Running Away Man", "Fri Apr 19 22:55:00 ": "Fact check: Chechnya is not the same thing as the Czech Republic but it is the capital of Czechoslovakia", "Sat Apr 20 19:33:17 ": "um RT @msnbc The FBI has released an updated wanted poster for bombing suspect Dzhokhar Tsarnaev http://t.co/7ltrd3p3aU", "Mon Apr 22 16:47:13 ": "Why Mayor Bloomberg now supports raising smoking age to 21 in NYC after threatening to veto same proposal in 2006 http://t.co/1OOXmYobuR", "Thu Apr 18 16:31:11 ": "@commiegirl1 problem?", "Fri Apr 19 12:03:09 ": "CHECHENS????", "Sat Apr 20 17:14:32 ": "@elisewho wow, thanks Elise.", "Fri Apr 19 13:58:30 ": "Looks like @Dzhokhar_ is fake, sorry. https://t.co/P7ecAPAd8J", "Thu Apr 18 21:58:28 ": "I dont know, guy in the white hat looks Icelandic to me...", "Fri Apr 19 16:29:12 ": "RT @J_tsar a decade in america already, i want out", "Fri Apr 19 14:43:48 ": "Dead Boston bombing suspect Tamerlan Tsarnaev: \"There are no values anymore.\" http://t.co/2ZKXSZsdiX", "Mon Apr 22 03:19:41 ": "Don's Heinz ad was so much better", "Mon Apr 22 13:46:39 ": "Remember Kim Jong Un?", "Fri Apr 19 21:48:03 ": "Father, mother, and aunt are alleging a conspiracy. One uncle is pissed, another uncle and a sister are shocked http://t.co/AhzadMT96i", "Sat Apr 20 01:08:15 ": "RT @repjustinamash: The last thing I want to do is discard Constitution. MT @GrahamBlog: The last thing we may want to do is read Boston su…", "Thu Apr 18 21:15:55 ": "Can't wait to see how the NY Post fucks this up somehow", "Sat Apr 20 01:24:16 ": "RT @netw3rk: Breaking: Yooooj pahty in the pahkin lawt of Dunks right now.", "Mon Apr 22 00:03:05 ": "@palafo probably saved the taxpayers a lot of money", "Fri Apr 19 23:36:57 ": "Anyone make a lazy \"I'm on a boat\" joke yet? Everyone? Ok.", "Fri Apr 19 15:29:17 ": "@AlexPasternak @ReformedBroker yeah, just wondering when her name will come out", "Fri Apr 19 15:28:55 ": "@EdBajwa @ReformedBroker @AlexPasternak know her name?", "Fri Apr 19 22:35:49 ": "@stevensonseth I dont think it was like he was sitting in the car surrounded by police, and vanished into thin air. Seemed pretty chaotic.", "Sat Apr 20 18:49:16 ": "whoops RT @jaredbkeller Big Papi: 'This is our fucking city!' http://t.co/es9EtDjF6A", "Fri Apr 19 16:33:02 ": "RT @J_tsar When I die, I want to go peacefully like my Grandfather did, in his sleep -- not screaming, like the passengers in his car.", "Thu Apr 18 16:15:01 ": "[something obama just said at the thing we're all watching]", "Thu Apr 18 16:35:16 ": "@commiegirl1 it's a joke? feel like you're misinterpreting", "Sun Apr 21 20:09:01 ": "Mother Tzarnaev was a 9/11 Truther http://t.co/2KGQSnVAnc . So was Dzhokhar, according to his twitter", "Mon Apr 22 03:48:39 ": "Also-Ran Running, Also, Again? MT @JoshuaGreen Least burning question of the 2016 presidential race http://t.co/x724SEvUP3", "Fri Apr 19 21:59:41 ": "@MattOrtega That's the mom", "Fri Apr 19 18:03:07 ": "This aunt has SASS", "Mon Apr 22 03:54:09 ": "@dankois that ad is great", "Fri Apr 19 21:48:17 ": "A Guide to the Extended Tsarnaev Family http://t.co/AhzadMT96i", "Sun Apr 21 17:10:45 ": "Saw all these sad tweets about iverson and thought he died. So I'm actually pretty happy to learn that, no, his life is just in shambles", "Fri Apr 19 23:45:39 ": "In addition to being a maniac terrorist this guy has no respect for the news cycle", "Fri Apr 19 17:18:30 ": "RT @J_tsar text back with your titties on it", "Fri Apr 19 13:38:44 ": "How lucky for all the internet sleuths out there that Dzhokhar Tsarnaev is named that", "Thu Apr 18 18:50:03 ": "RT @michaelroston: This headline gets a front page tomorrow too, right? http://t.co/t2uv2ThcTz", "Sat Apr 20 01:12:46 ": "Exactly RT @DavidGrann Reading the Boston bomber suspect his Miranda rights is the ultimate triumph of American ideals.", "Sat Apr 20 01:02:20 ": "RT @stefanjbecket: So who had “in a boat in a backyard under a tarp”?", "Fri Apr 19 16:30:05 ": "Clue RT @J_tsar back to the home land this summer word", "Sat Apr 20 22:07:06 ": "RT @mikeleffingwell: \"And... uh... chocolate kills dogs.\" - God puts the finishing touches on life on earth.", "Thu Apr 18 21:12:36 ": "RT @emmacargo: .@jimcookeIII simba'd jeter: http://t.co/hV7LjmbTLi", "Mon Apr 22 03:32:34 ": "@michelleruiz Don's actually would have been nice with a little bottle next to the slogan", "Fri Apr 19 22:56:47 ": "CNN reporter on the ground in Watertown says he just heard what sounded like multiple rounds of gunfire from assault rifles", "Sat Apr 20 01:04:16 ": "BUT THE FOUNDERS oh right RT @MarkSimoneNY NBC reporting Obama admin will treat terrorist as a \"criminal\" and not enemy combatant."}