{"Thu Nov 29 14:02:21 ": "♫ This Weekend: Gdansk, Poland - Nov 30 at Parliament http://t.co/j2QPlXbt", "Wed Feb 06 05:17:00 ": "@DragonForceHQ recently performed @70000tons. Members @HermanLi_ @hudsonforce @vadlife played the final song n the hot tub on the pool-deck!", "Fri Mar 29 00:37:11 ": "RT @vadlife: Dragonforce - Through The Fire And Flames (Live In Japan 2012) http://t.co/UmHL1NUoYJ", "Sat Nov 17 19:58:06 ": "Madrid, we've had a blast last night. Thank you for your support. Lisbon tonight \\m/ so fi @ Paradise Garage http://t.co/ZbS7ii5T", "Wed Nov 28 14:01:04 ": "♫ Tomorrow: Wroclaw, Poland - Nov 29 at Alibi http://t.co/UqaidKHV", "Wed Nov 28 14:05:00 ": "♫ Next Week: Budapest, Hungary - Dec 5 at Petofi Hall Music Club http://t.co/RDtoBbwc", "Fri Jan 18 22:02:26 ": "RT @HermanLi_: This is what I use for warming up before the  show. Here is a video of me improvising to the BOSS JS-10 for fun :) http:/ ...", "Tue Nov 20 14:00:19 ": "♫ Tomorrow: Bordeaux, France - Nov 21 at Rock School Barbey http://t.co/Ca9D0HjH", "Sun Nov 11 13:30:08 ": "Having a dinner with Huntress and Kissin' Dynamite guys @HuntressKills @Kissingdynamites http://t.co/13WdmZ8C", "Mon Dec 03 14:00:52 ": "♫ Tomorrow: Bratislava, Slovakia - Dec 4 at Randal http://t.co/qkUTSisV", "Mon Dec 31 20:00:15 ": "♫ Who's Coming?: Miami, FL - Jan 28 at 70000 Tones Of Metal http://t.co/E0cXvE51", "Tue Dec 04 14:02:42 ": "♫ Tomorrow: Budapest, Hungary - Dec 5 at Petofi Hall Music Club http://t.co/AFJ4tpsE", "Tue Dec 04 14:19:07 ": "It was great to play in Prague last night. Thanks for all of you guys for coming to the  @ Randal Music Club http://t.co/hDDDVMoz", "Thu Dec 06 11:00:48 ": "♫ This Weekend: Saint Petersburg, Russian Federation - Dec 7 at Zal Ozhidaniya http://t.co/quz3UbjQ", "Sun Mar 31 12:52:22 ": "Happy Easter everyone!", "Fri Apr 12 14:00:21 ": "DRAGONFORCE COMPLETE WRITING FOLLOW UP TO THE POWER WITHIN http://t.co/NWGrL4V9dk", "Wed Feb 27 05:35:23 ": "♫ Playing Live: Quezon City, Philippines - Apr 27 at PULP Summer Slam 13 http://t.co/Gbb6z9Hdl2", "Thu Feb 28 20:44:17 ": "Full-length version of the exclusive DragonForce track \"Galactic Astro Domination\" of @CapitalOne commercial is out! http://t.co/RVHdxsOa9Y", "Mon Nov 26 14:02:40 ": "♫ Next Week: Prague, Czech Republic - Dec 3 at Rock Café http://t.co/GIzQngpf", "Wed Nov 14 14:04:48 ": "♫ Next Week: Bordeaux, France - Nov 21 at Rock School Barbey http://t.co/AYcCgpLg", "Thu Mar 07 14:34:35 ": "Thank you Australia. It's been awesome playing for you guys. We hope to see you next time on tour! http://t.co/UMrvTCWyeE", "Thu Feb 14 21:36:02 ": "♫ Just Announced: Gävle, Sweden - Aug 10 at Getaway Rock Festival http://t.co/epZINoRo", "Thu Nov 29 14:04:07 ": "♫ This Weekend: Warsaw, Poland - Dec 1 at Progresja http://t.co/1UylSM1O", "Sat Dec 01 15:50:41 ": "Thank you for your support last night Gdynia. We hope to see you again soon! Getting ready to kick @ Proxima http://t.co/60LjTTxJ", "Fri Nov 16 12:53:25 ": "Having some drinks with our fans in Barcelona after the show last night :) Good times! -V http://t.co/TaP8phJf", "Sun Dec 02 14:00:56 ": "♫ Tomorrow: Prague, Czech Republic - Dec 3 at Rock Café http://t.co/5uPHFBUF", "Tue Nov 27 14:03:20 ": "♫ Next Week: Bratislava, Slovakia - Dec 4 at Randal http://t.co/7arPJmcf", "Wed Dec 05 12:18:16 ": "Mind-blowing show in Bratislava last night! A big thank you to all of our fans for making this happen. Budap http://t.co/oFxdgxn2", "Mon Mar 25 18:21:56 ": "♫ Just Announced: Donington, United Kingdom - Jun 14 at Download http://t.co/b0rrMDhRm3", "Mon Nov 12 13:02:03 ": "Thank you Italy for making us feel at home. We can't wait to come back and play for you soon. \\m/ http://t.co/OFUCEwJI", "Tue Nov 27 14:35:08 ": "We've had a blast last night in Amsterdam. Thanks to all that turned up to support us. It was the last show http://t.co/wLpr3OG3", "Mon Nov 26 14:00:11 ": "♫ Tomorrow: Esch-Sur-Alzette, Luxembourg - Nov 27 at Rockhal http://t.co/i519X3cH", "Thu Nov 08 14:00:39 ": "♫ Next Week: Barcelona, Spain - Nov 15 at Salamandra 1 http://t.co/bCxgiGhh", "Tue Nov 13 12:54:20 ": "Thank you to the Dragonforce fans in Switzerland last night. You guys were amazing. Check out this awesome g http://t.co/Ydcki0Sp", "Wed Nov 21 14:00:53 ": "♫ Tomorrow: Paris, France - Nov 22 at Cigale http://t.co/EsaNYW2N", "Mon Mar 25 18:22:55 ": "After a 4 year absence, DragonForce to play @DownloadFest! Friday 14th June, and it’s good to be back!", "Sat Nov 24 14:47:23 ": "Merci beaucoup Strasbourg! Excellent public pour une excellente soirée! :) http://t.co/QFBTn4vh", "Mon Nov 19 14:02:14 ": "♫ Next Week: Amsterdam, Netherlands - Nov 26 at Melkweg Max http://t.co/4J4scO4f", "Sun Nov 11 14:02:36 ": "♫ Next Week: Bilbao, Spain - Nov 18 at Rock Star Live (Barakaldo) http://t.co/P1jfS3tj", "Tue Apr 09 16:16:55 ": "♫ Just Announced: Weissenhäuser Strand, Germany - Nov 15 at Metal Hammer Paradise http://t.co/4OiOwkzqHk", "Thu Nov 29 18:49:11 ": "♫ Playing Live: Gdynia, Poland - Nov 30 at Klub UCHO http://t.co/BvCzS5z2", "Fri Nov 30 11:00:16 ": "♫ Next Week: Saint Petersburg, Russian Federation - Dec 7 at Zal Ozhidaniya http://t.co/4CaKqHBS", "Fri Jan 18 23:38:22 ": "DragonForce will headline Bandung Clothing Expo @bandcloth_fest on April 28th at Lapangan Gasibu, Bandung in Indonesia!", "Fri Feb 22 19:30:16 ": "Who's coming to see Dragonforce play today at Soundwave Festival? Don't miss the signing session after the show! @soundwavefest", "Wed Nov 07 14:07:37 ": "♫ Who's Coming?: Budapest, Hungary - Dec 5 at Petofi Hall Music Club http://t.co/GInZWcl7", "Thu Nov 22 14:03:31 ": "♫ This Weekend: Lille, France - Nov 24 at Le Splendid http://t.co/DQkFwX2r", "Fri Feb 01 20:28:48 ": "\"Jack, I'm flying!\" @TitanicMovie http://t.co/Chev49Aa", "Thu Nov 29 15:55:41 ": "Thank you Luxembourg! Hope you're ready for us tonight Wroclaw! http://t.co/4eKt88Jv", "Sun Nov 25 14:03:26 ": "♫ Tomorrow: Amsterdam, Netherlands - Nov 26 at Melkweg Max http://t.co/5NECJyIZ", "Fri Nov 16 14:03:25 ": "♫ Next Week: Strasbourg, France - Nov 23 at La Laiterie http://t.co/lfRUqkQ7", "Sat Nov 10 11:00:03 ": "♫ Who's Coming?: Moscow, Russian Federation - Dec 8 at KKZ Moskva http://t.co/I8UtrmS0", "Sun Nov 11 14:01:25 ": "♫ Tomorrow: Solothurn, Switzerland - Nov 12 at Kofmehl http://t.co/cVQWdBbs", "Thu Jan 03 07:45:47 ": "♫ Just Announced: Quezon City, Philippines - Apr 27 at Amoranto Stadium http://t.co/dPr8CJWx", "Sun Apr 07 09:02:53 ": "lur, atos gaduh tiket kanggo nonton mamang konser di gasibu teh? Upami teu acan mangga meser di sadaya @indomaret_co_id", "Fri Jan 18 21:52:47 ": "♫ Just Announced: Bandung, Indonesia - Apr 28 at Bandung Clothing Expo http://t.co/A5fc6qbZ", "Sat Nov 17 14:02:09 ": "♫ Next Week: Lille, France - Nov 24 at Le Splendid http://t.co/LMgBnqbv", "Wed Feb 27 03:42:32 ": "♫ Playing Live: Sydney Nsw, Australia - Feb 28 at Metro Theatre http://t.co/lldrzJ7OD5", "Thu Nov 22 14:03:44 ": "♫ This Weekend: Strasbourg, France - Nov 23 at La Laiterie http://t.co/NPtGmc2B", "Thu Jan 24 03:00:30 ": "Thanks to our fans in Japan, 'The Power Within' landed at No. 9 on best album chart 2012 voted by listeners of radio prog. Power Rock Today!", "Fri Nov 09 14:09:42 ": "♫ Next Week: Madrid, Spain - Nov 16 at Arena http://t.co/2YOMwDlI", "Fri Nov 23 14:03:52 ": "♫ Next Week: Gdansk, Poland - Nov 30 at Parliament http://t.co/oHErx23a", "Fri Nov 30 17:57:24 ": "It's nice to be back touring Poland again after 7 years. Thank you Wroclaw. You kicked ass last night! http://t.co/zw90UB5b", "Mon Nov 12 14:01:42 ": "♫ Tomorrow: Marseille, France - Nov 13 at Le Moulin Club http://t.co/v1bxHPWk", "Sat Mar 23 04:39:47 ": "♫ Just Announced: Nickelsdorf (Aut), Austria - Jun 15 at Nova Rock http://t.co/WHOBXugXWn", "Sat Mar 23 04:44:29 ": "♫ Just Announced: Lichtenvoorde, Netherlands - Jul 27 at Zwarte Cross http://t.co/BHkVPt03wa", "Wed Nov 14 14:01:55 ": "♫ Tomorrow: Barcelona, Spain - Nov 15 at Salamandra 1 http://t.co/2xlkfwMX", "Wed Feb 06 05:17:32 ": "RT @rrusa: Watch this insane video of @DragonForceHQ's Herman Li on the 70000 Tons of Metal cruise! http://t.co/VolAUWkD #guitarsolo #hottub", "Thu Nov 22 14:16:53 ": "♫ Next Week: Wroclaw, Poland - Nov 29 at Alibi http://t.co/VWrDyEk5", "Thu Jan 24 03:01:41 ": "Also 'Cry Thunder' video http://t.co/KZpU8LdP landed at No. 3 on the best video chart of 2012 voted by viewers of TV program Rock City!", "Mon Jan 28 04:14:53 ": "Smoking some cigars in Miami. http://t.co/e2cJlXUE", "Fri Nov 23 13:28:00 ": "Thank you Paris. Last night was a blast! Strasbourg tonight! \\m/ http://t.co/NMMdvIKd", "Thu Nov 15 14:16:34 ": "♫ Next Week: Paris, France - Nov 22 at Cigale http://t.co/mXriGDxt", "Thu Dec 06 11:00:07 ": "♫ This Weekend: Moscow, Russian Federation - Dec 8 at KKZ Moskva http://t.co/q1ttIALg", "Sat Nov 24 14:01:05 ": "♫ Next Week: Warsaw, Poland - Dec 1 at Progresja http://t.co/DlAXX3FQ", "Wed Dec 05 14:00:27 ": "♫ Today: Budapest, Hungary - Dec 5 at Petofi Hall Music Club http://t.co/sMUNYijU", "Sat Dec 01 11:00:05 ": "♫ Next Week: Moscow, Russian Federation - Dec 8 at KKZ Moskva http://t.co/PuxFgY4j", "Mon Feb 25 04:00:12 ": "♫ Today: Melbourne Vic, Australia - Feb 25 at Forum Melbourne http://t.co/JBYfsCvlby", "Fri Nov 09 11:00:07 ": "♫ Who's Coming?: Saint Petersburg, Russian Federation - Dec 7 at Zal Ozhidaniya http://t.co/GG7bGX7J", "Mon Nov 26 00:11:04 ": "Thank you Lille. You were phenomenal last night. Get ready to party with us tonight Amsterdam! http://t.co/CL6wl0pD", "Thu Nov 15 15:02:42 ": "♫ This Weekend: Lisbon, Portugal - Nov 17 at Paradise Garage http://t.co/cx2uDd3N", "Mon Jan 28 02:28:21 ": "Sam and Vadim trying to get a sun tan in Miami. http://t.co/XGNuAHAR", "Wed Jan 23 03:28:10 ": "Our Cry Thunder video on YouTube has gone past the 2 million view mark. Thanks for being part of this :) http://t.co/KZpU8LdP", "Mon Apr 08 17:57:48 ": "RT @vadlife: Check out the Official Dragonforce Russian community page. Join the community and spread the word! http://t.co/XC64zesG0w", "Tue Nov 20 14:02:27 ": "♫ Next Week: Esch-Sur-Alzette, Luxembourg - Nov 27 at Rockhal http://t.co/R1c98ola", "Fri Apr 19 09:09:42 ": "To our fans in Indonesia: Sampurasun bandung, hoyong lagu naon wae engke pas dragon force maen di bandung?", "Sat Mar 23 04:42:20 ": "♫ Just Announced: Ballenstedt, Germany - Jul 12 at Rock Harz http://t.co/Udju0aGozX", "Wed Feb 06 05:19:03 ": "Check out the video footage @70000tons where Herman dove into one of the on-deck hot tubs, guitar and all! http://t.co/ru59BmnB", "Sun Feb 03 20:30:01 ": "Thanks to all the fans who came out to see us play at the 70.000 tones of metal cruise! @70000tones http://t.co/2axQdD0E", "Sat Apr 20 00:57:54 ": "Can't wait to play our first show in the Philippines at the PULP SUMMER SLAM next week! Our stage time is 6:20pm. @PULPMagazinePH", "Thu Nov 15 14:04:52 ": "♫ This Weekend: Bilbao, Spain - Nov 18 at Rock Star Live (Barakaldo) http://t.co/rOM7gAz7", "Thu Jan 03 07:38:44 ": "♫ Just Announced: Amneville, France - Jun 9 at Sonisphere http://t.co/ga9YQ06M", "Fri Mar 22 07:19:22 ": "Sampurasun Bandung DRAGONFORCE bakalan konser di Bandung kaping 28 april di gasibu, meser tiket na da murah ngan Rp 15.000 (limabelasrebu)", "Sat Mar 23 04:44:13 ": "♫ Just Announced: Visnye, Hungary - Aug 2 at Fezen Festival http://t.co/b25zpKlFZ2", "Thu Nov 15 14:03:53 ": "♫ This Weekend: Madrid, Spain - Nov 16 at Arena http://t.co/5oAmFLsm", "Sat Feb 16 05:40:25 ": "@hermanli_ TO APPEAR ON CBBC ‘HOW TO BE EPIC AT EVERYTHING’ by @DragonForceHQ http://t.co/7oT6GYjR", "Sun Dec 02 14:15:08 ": "We've had an awesome time at the in-store signing yesterday before the show in Warsaw. Thank you guys. We lo http://t.co/iJW0tGNG", "Sat Nov 10 15:00:01 ": "♫ Next Week: Lisbon, Portugal - Nov 17 at Paradise Garage http://t.co/hNrUL8xt", "Tue Feb 05 09:32:23 ": "RT @vadlife: Pool play at #70000tons of metal! http://t.co/9cy8s8ZV", "Mon Apr 15 04:33:48 ": "Check out 'Holding On' recorded live at Loud Park 2012 in Japan.\nhttp://t.co/YSNdQp9ylq", "Fri Dec 28 18:53:21 ": "@DragonForceHQ in TV Commercial. Check it out!!! http://t.co/tghQHYkn"}