{"Fri Apr 19 17:11:39 ": "Gym Buddy Calls Tamerlan Tsarnaev a ‘Nice Guy’ But ‘Very Distant’ http://t.co/9RETvSGhod", "Sat Apr 20 00:14:02 ": "@BlakeWilliamsNY NBC livestream here: http://t.co/M5DQJGqBcF", "Fri Apr 19 15:12:58 ": "Cover of MIT student newspaper this morning http://t.co/yb3nqjutRZ", "Sat Apr 20 00:31:24 ": "RT @BostonDotCom: BREAKING NEWS: Three people taken into custody in New Bedford as part of Boston Marathon terror bombing investigation.", "Fri Apr 19 22:48:55 ": "RT @Slate: The @BostonGlobe is reporting that Dzhokhar Tsarnaev went to a college party on Wednesday night: http://t.co/fqEUXgiZQb", "Fri Apr 19 15:20:30 ": "RT @ReutersUS: U.S. Boy Scouts set to end ban on gay members: spokesperson http://t.co/FIV9FZZC0Q", "Fri Apr 19 16:37:14 ": "Boston police say there will be a \"controlled explosion\" at house on Norfolk St. in Cambridge this afternoon.", "Sat Apr 20 00:45:28 ": "RT @BostonDotCom: BREAKING NEWS: Boston Marathon terror bombing suspect has been arrested.", "Sat Apr 20 00:42:23 ": "WHDH: SUSPECT IN CUSTODY", "Fri Apr 19 23:00:30 ": "RT @WNYC: .@WCVB reporter. RT @SeanKellyTV Shots fired in area of possible suspect hiding in area of boat.", "Fri Apr 19 23:51:52 ": "\"LOUD, OBVIOUS\" GUNFIRE HEARD", "Fri Apr 19 23:04:45 ": "RT @BostonGlobe: BREAKING: Source says bomb suspect pinned down in Watertown", "Sat Apr 20 00:32:32 ": "RT @BostonGlobe: BREAKING NEWS: New Bedford police say they assisted feds in executing a search warrant on home in New Bedford.", "Fri Apr 19 23:35:55 ": "CONTINUING UPDATES: Suspect Pinned Down Amid Gunfire in Watertown http://t.co/PfYqSg7N9J", "Sat Apr 20 00:30:19 ": "Continuing updates here: http://t.co/PfYqSg7N9J", "Sat Apr 20 02:53:23 ": "Purported video of the firefight: http://t.co/H9usiFbmju", "Fri Apr 19 22:06:43 ": "Boston state police: We do not have an apprehension of a suspect.", "Fri Apr 19 22:16:36 ": "RT @AlexJamesFitz: \"Yes, I believe he's still in Massachusetts.\" - Mass. State Police Col. Alben", "Fri Apr 19 22:08:42 ": "Stay indoors request lifted in Watertown, says Gov. Patrick.", "Fri Apr 19 17:28:20 ": "WEST NEW YORK, N.J. (AP) — The FBI is at the northern New Jersey home of the sister of the Boston Marathon bombing suspects.", "Fri Apr 19 23:48:52 ": "WHDH has exclusive video of shots fired. Several dozen heard.", "Fri Apr 19 22:58:24 ": "RT @GarrettQuinn: SCANNER DEMANDING RADIO SILENCE.", "Fri Apr 19 22:10:06 ": "Mayor Menino: \"Boston will stand tall. We will never back down.\"", "Fri Apr 19 17:53:03 ": "On the scene: RT @cddNY: @intelligencer This is the scene outside the sister’s home in New Jersey. http://t.co/mjycmRNCbZ", "Fri Apr 19 23:04:27 ": "WATCH LIVE: http://t.co/YS4ScKRexV", "Sat Apr 20 00:45:13 ": "STATE POLICE CONFIRM TO NBC THAT SUSPECT IS ALIVE", "Sat Apr 20 00:41:14 ": "New Bedford police wouldn't respond to questions about suspects reportedly taken into custody, told us \"the feds are in charge of that.\"", "Mon Apr 22 16:48:57 ": "Mayor Bloomberg now supports raising the age for purchasing cigarettes to 21, which he vowed to veto in 2006. http://t.co/CupkgO5Jg3", "Fri Apr 19 21:51:29 ": "A Guide to the Extended Tsarnaev Family http://t.co/FdUACdV0lh", "Mon Apr 22 16:56:41 ": "Why Boehner Will Betray His Base on Immigration http://t.co/PP8EQTkVot", "Fri Apr 19 22:21:34 ": "Police say suspect fled on foot after firefight early this morning.", "Sat Apr 20 00:12:56 ": "PETE WILLIAMS: FIRE IN THE BOAT", "Sat Apr 20 04:36:30 ": "Front page of tomorrow’s Boston Globe (via @globecynthia): http://t.co/ob5IB2PUjx", "Mon Apr 22 14:55:44 ": "Kim Jong Il Ate Spiders http://t.co/cXshfeKDH3", "Sat Apr 20 00:50:31 ": "LIVE UPDATES http://t.co/PfYqSg7N9J", "Sat Apr 20 01:44:12 ": "PRESIDENT SPEAKING SHORTLY", "Sat Apr 20 03:28:17 ": "RT @ABC7: PHOTO: ATF confirms this image is their medic working on suspect Dzhokhar Tsarnaev http://t.co/OOXETeMyeq", "Fri Apr 19 23:39:59 ": "The wishbone-shaped object in the backyard is the boat in which the suspect is reportedly pinned down. http://t.co/USalUttgf1", "Fri Apr 19 15:21:24 ": "21 things to know about dead suspect Tamerlan Tsarnaev, including his love of Borat and his girlfriend http://t.co/CTD9M0RsOs", "Fri Apr 19 18:51:36 ": "82 Things That Dzhokhar Tsarnaev Tweeted About http://t.co/6eWwQufK3s", "Fri Apr 19 22:13:18 ": "Officials encouraging public to call 1-800-CALL-FBI with any information about suspect http://t.co/7kKDtYml4V", "Fri Apr 19 23:55:23 ": "Video and audio of first round of gunshots, via @ryanpbroderick: http://t.co/yrxv1KuYor", "Sat Apr 20 03:29:14 ": "RT @stefanjbecket: Watertown man steps outside for cigarette, finds bomb suspect Dzhokhar Tsarnaev hiding in his boat http://t.co/lFz1mOE0W2", "Mon Apr 22 16:42:16 ": "Neither of the suspected Boston bombers was licensed to carry a firearm. http://t.co/cSewiMXQXB", "Sat Apr 20 00:43:27 ": "\"It's all over.\" – WHDH", "Sat Apr 20 00:00:02 ": "PETE WILLIAMS: POLICE NOW ASSAULTING THE BOAT", "Fri Apr 19 23:29:08 ": "RT @grace_lightning: Fox News: Suspect is alive, surrounded and still moving", "Fri Apr 19 15:50:04 ": "PHOTOS: Boston on Lockdown During Marathon Bomber Manhunt http://t.co/9RNyM6ag2v", "Fri Apr 19 20:42:44 ": "RT @DylanByers: 'What a week': Jeff Zucker's memo to CNN http://t.co/jNC3eC6dM3 via @POLITICO", "Fri Apr 19 17:03:21 ": "Brian Williams takes over live coverage on @NBCNews special report: http://t.co/a8JGpgKG2t", "Fri Apr 19 22:56:43 ": "RT @SeanKellyTV: Many shots fired in WATERTOWN", "Fri Apr 19 15:56:09 ": "Here's what you should know about the Boston Marathon bombing suspects: http://t.co/i4Y8qvO0Jd http://t.co/7kKDtYml4V", "Fri Apr 19 17:33:17 ": "Officials in Boston are advising that \"sheltering in place\" at work in the search area should go home.", "Sat Apr 20 00:16:24 ": "WHDH: Suspect covered in blood, police believe he may have been injured in last night's firefight.", "Fri Apr 19 23:15:31 ": "Two SWAT team vehicles moving into place http://t.co/MIrmkJRhEO", "Fri Apr 19 23:01:37 ": "WCVB reporter: RT @KathyReports: Multiple shots fired in Watertown. Body found on a boat in a backyard. #wcvb", "Fri Apr 19 23:18:37 ": "67 Franklin St., where police reportedly have suspect pinned down in boat in back yard, per WCVB http://t.co/USalUttgf1", "Mon Apr 22 14:13:10 ": "Tamerlan Tsarnaev Described As Angry, Militant, and Maybe a Murderer Before the Bombing http://t.co/8RArDWoOpZ", "Fri Apr 19 23:51:16 ": "LIVE GUNSHOTS HEARD http://t.co/XvNNufaXiu", "Fri Apr 19 22:08:21 ": "\"We are committed to seeing a conclusion to this case.\" – Mass. State Police", "Sat Apr 20 02:47:37 ": "Update, 10:29 p.m.: http://t.co/PfYqSg7N9J", "Fri Apr 19 23:23:50 ": "NBC NEWS: \"BODY FOUND ON BOAT\"", "Fri Apr 19 16:20:53 ": "Multiple outlets confirming this is the Boston bombing suspect's Twitter account: @J_tsar", "Fri Apr 19 17:51:30 ": "@cddNY Are you on the scene?", "Sat Apr 20 02:06:12 ": "RT @AntDeRosa: \"Our nation is in debt to the people of Boston and the people of Massachusetts.\" - President Obama http://t.co/Njr6cANPq1", "Fri Apr 19 16:42:06 ": "RT @vplus: Dzhorkhar Tsarnaev became a US citizen September 11, 2012, a federal official tells CNN", "Fri Apr 19 23:59:06 ": "RT @BostonDotCom: BREAKING NEWS: Police are using 'flash bangs' to disorient and distract the suspect. They have seen him sit up.", "Mon Apr 22 17:50:47 ": "PDF: Justice Department complaint against suspected bomber Dzhokhar Tsarnaev http://t.co/4HcoLvYmH8", "Sat Apr 20 00:19:11 ": "Pete Williams: Nonlethal flashbang grenades were thrown into the boat. Still no resolution.", "Fri Apr 19 20:53:57 ": "Sen. Lindsey Graham: Boston bombing “is Exhibit A of why the homeland is the battlefield” http://t.co/FkU6JJ0KWX", "Mon Apr 22 15:43:26 ": "Tsarnaev Brothers Wanted to Go to New York http://t.co/RZ2ma6lXSc", "Fri Apr 19 23:33:40 ": "TO RECAP: Multiple shots fired. Officials believe they have Boston bombing suspect pinned down in a boat in a backyard in Watertown, Mass.", "Sat Apr 20 00:48:11 ": "Suspect will be taken into federal custody.", "Fri Apr 19 15:05:11 ": "MT @BostonGlobe: Search for bombing suspect focuses on 20-block area in Watertown; officials fear he may be wearing explosive vest", "Sat Apr 20 00:25:46 ": "RT @nbcnightlynews: Negotiator has arrived on the scene in #Watertown, Mass., officials tell NBC News", "Fri Apr 19 22:14:44 ": "Police: \"We don't think he'd get much further. His ties seem to be here [in Boston].\"", "Fri Apr 19 23:45:06 ": "WCVB: Police initially responded to report of a body in the boat. Suspect is moving.", "Fri Apr 19 22:05:01 ": "LIVE: Officials brief the press with updates on the ongoing manhunt in Massachusetts. http://t.co/7gCNs0rD8A", "Mon Apr 22 18:42:52 ": "Dzhokhar Tsarnaev Charged With Using Weapon of Mass Destruction in Boston Marathon Bombing http://t.co/cQjk2C2nA2", "Sat Apr 20 00:46:40 ": "WATCH LIVE: Officers and onlookers break out into cheers after reports suspect is alive and in custody http://t.co/M5DQJGqBcF", "Fri Apr 19 23:49:19 ": "WATCH LIVE: NBC NEWS SPECIAL REPORT http://t.co/M5DQJGqBcF", "Sat Apr 20 03:42:41 ": "RT @petesouza: Photo of POTUS on the phone w FBI Director Robert Mueller shortly after second suspect was taken into custody http://t.co/Qq…", "Fri Apr 19 17:27:07 ": "\"I just wish they never existed. I am wordless.\" The uncle of the Boston bombing suspects speaks out: http://t.co/atn2SvaqRR", "Mon Apr 22 18:25:10 ": "In Which Al Franken Implies That Patrick Leahy Is Stoned http://t.co/4f6n004ivm", "Fri Apr 19 20:50:57 ": "Here are all of the people who were mistakenly identified as suspects in the Boston investigation: http://t.co/7RYKfkthdU", "Mon Apr 22 14:21:32 ": "Teen Wears NRA Shirt to School, Gets Arrested http://t.co/CptcgrQxlV", "Sat Apr 20 02:05:14 ": "LIVE: President Obama speaks from the White House briefing room. http://t.co/BgT8I6OUqa", "Fri Apr 19 23:16:02 ": "WCVB reporter: \"I've never seen this many police.\"", "Sat Apr 20 00:17:14 ": "The suspect reportedly fled on foot last night after a firefight in which 200 rounds were exchanged.", "Fri Apr 19 19:34:39 ": "RT @dorseyshaw: Good friend of bombing suspect reached out to him after FBI press conference: \nhttp://t.co/Nzq8tFg3P9", "Fri Apr 19 22:58:37 ": "RT @nbcnightlynews: 'A barrage of gunshots has just been heard' - @KerryNBC #NBCNightlyNews", "Fri Apr 19 16:33:33 ": "LIVE: Gov. Deval Patrick updates reporters on the situation in Boston. http://t.co/ZV1B5QEflM", "Sat Apr 20 00:43:04 ": "SUSPECT ALIVE AND IN CUSTODY; REQUEST FOR MEDIC ON SCENE -- WHDH", "Mon Apr 22 16:54:06 ": "RT @WCVB: Source: Bomb suspect arraigned in hospital bed http://t.co/DcSYdwzFHm #breaking", "Fri Apr 19 23:13:41 ": "RT @BretBaier: Sources tell Fox News that a suspect is 'down,' after gunfire heard in Watertown, Mass.", "Mon Apr 22 19:08:35 ": "RT @vulture: CNN says last Friday they drew their biggest full-day audience for a nonpolitical breaking news event since 2003. http://t.co/…", "Fri Apr 19 21:49:44 ": "CNN reporting that suspects admitted to victim of carjacking that they were wanted for the Boston bombings.", "Sat Apr 20 00:19:23 ": "@innerproduct Unclear.", "Fri Apr 19 23:23:12 ": "RT @mpoindc: .@PeteWilliamsNBC: \"body found on boat\"", "Fri Apr 19 21:22:22 ": "President Obama: The full force of the Federal Government will continue to be made available until those responsible are brought to justice."}