{"Sun Apr 14 18:18:27 ": "@MissEndahxo I didn't unfollow you? That's odd. But I followed you back :)", "Mon Apr 22 16:19:27 ": "RT @chasitytaylorr: Listening to country love songs and smiling today! Who better to jam to when you're in this mood than @TyBlakeBarham &l…", "Thu Apr 18 18:13:20 ": "1,000 people were on the waiting list for this event??? I now know why. This seminar is brilliant. #NashvilleCreates", "Fri Apr 12 18:37:21 ": "@Its_Afton Girl, you forget I'm from Montana! This is amazingggg weather for me :) haha", "Wed Apr 24 01:00:25 ": "@kellyynicole931 It is kinda crazy. I don't get it either, but I'm definitely not complaining about it :) Twitter must be a fan! Haha", "Wed Apr 10 02:39:16 ": "@KayyMarieB Thank you, thank you Kayla for supporting me &amp; buying my original songs :) Means the world to me! Which one is your favorite?", "Thu Apr 18 18:07:32 ": "@_ChrisBoyd Amen. Another word to the wise, get the Tomato Squash soup along with it! It's got a kick, but it's the BOMB! #NashvilleCreates", "Fri Apr 12 20:32:09 ": "@InternAmber Thanks for the follow Amber! It was great to meet you last night at the show :)", "Tue Apr 23 19:39:17 ": "@JackieNicole07 haha I've never seen anything like that, but that doesn't surprise me at all! Especially in Montana haha", "Tue Apr 23 19:36:59 ": "Meetings :) #thankful #blessed http://t.co/cZdPpZgFO1", "Wed Apr 10 02:38:40 ": "@Krissyyy_Nicole Gosh! Thank you sooooo much Kristen :) You don't know how much that means to me. Do you have a favorite?", "Fri Apr 12 03:48:30 ": "@brynns_mama haha yes I did follow you :) And now here's a tweet too! Thank you for supporting me", "Tue Apr 23 19:37:51 ": "@Niall_Liam014 you've got it! You'll do great :) good luck", "Sat Apr 13 19:30:09 ": "YES! I'm verified again :) Thank you so much for the follow @verified &amp; for doing that! It definitely helps avoid confusion &amp; impersonation", "Wed Apr 24 18:40:21 ": "@samcstephens It was a blast &amp; you all are so much fun! I'm excited to see the finished product of it :)", "Wed Apr 10 02:40:22 ": "@KPromessa I'm glad it's fine :) Thank you for supporting me!", "Wed Apr 10 17:51:08 ": "@schulte_r @katie_basden Thank you so much Rachel! That definitely means a lot to both of us. And I'm so glad you enjoy listening to it :)", "Fri Apr 19 17:15:07 ": "Mat Kearney was also there! Definitely a big fan of his music. http://t.co/MRxpCm4RC3", "Wed Apr 17 17:32:59 ": "Excited to be in the studio today recording :) #passion #music #blessed #thankful http://t.co/KWdRwb7wbp", "Mon Apr 22 15:12:35 ": "RT @MissRaynaROCKS: #nowplaying \"17 &amp; Young\" by @TyBlakeBarham on @froggy1049", "Wed Apr 24 00:58:04 ": "@jaredscottmusic Dude! I totally wish I could man. I'm actually headed back to Montana on Thursday so I'll just miss it :( but I'll be back", "Sat Apr 13 23:48:25 ": "It was great to meet Chuck Wicks the other night. His show was awesome! The \"Whole Damn Thing\" haha… http://t.co/DiAG0XdVEh", "Thu Apr 18 17:27:54 ": "Gotta love LUNCH TIME!!! But seriously learning A TON at this Google for Creators/YouTube event today! For real. #NashvilleCreates", "Tue Apr 09 03:52:05 ": "RT @Nichols31Tn: Pitino may look like a mob boss, but after that duck and tuck its safe to say.......he aint about that life", "Fri Apr 19 17:18:23 ": "One last picture from yesterday Haha. The amazing Sheryl Crow :) Grew up on her music &amp; she was… http://t.co/ZTqZVNw1VH", "Wed Apr 17 01:08:24 ": "Me-\"Do you get to keep the cups?\" Waiter-\"SURE!\" Haha Gotta love souvenirs &amp; free cups! http://t.co/Dm1vMrjbye", "Fri Apr 12 19:38:25 ": "@heartnick13 Hi Crystelle! I'll be sure to follow you too :) All the way from the Philippines!? That's so awesome. Thank you for the support", "Wed Apr 10 02:42:18 ": "@saranicole7195 @savannahb73 haha thank you for making me a new fan! You're the best :) Definitely love getting new supporters &amp; friends", "Mon Apr 08 23:18:03 ": "@KsPistol Well yours will be counted too then :) don't worry! Thank you for tweeting me", "Tue Apr 16 05:11:49 ": "@ammariemusic @nialhay that wasn't him playing guitar lol", "Wed Apr 10 03:22:36 ": "@Krissyyy_Nicole That's awesome to hear that cuz that's my all time favorite too! And it's my current single out at radio right now :)", "Wed Apr 17 21:45:54 ": "Squirrels are crazy. Seriously.", "Wed Apr 24 00:58:35 ": "@jaredscottmusic in June so we'll definitely all have to hang out when I get back! I'll be moving here so it's gonna be an awesome Summer :)", "Wed Apr 10 02:44:03 ": "@halina_kennedy Gosh Halina! Thank you so much for having me as one of your inspirations. It's an honor. Seriously", "Thu Apr 18 18:36:12 ": "Fireside chat with Jake Coco from YouTube at the Google for Creators Event https://t.co/3A3WxUvPIE", "Fri Apr 12 00:47:32 ": "Tunin' in to Chuck Wicks at Dave &amp; Busters at his EP release party! http://t.co/NObQbuG973", "Sat Apr 13 00:12:17 ": "Haha GAC party with @nickidtv &amp; @heatherjmaywood. Clearly a good time judging by our faces! http://t.co/PptOYGeEbk", "Sun Apr 14 20:06:31 ": "@kpeterman19 is my first \"Tyler Tweet of The Week\" for the week of April 8th :) This one stood out to… http://t.co/DER1TPiOtr", "Tue Apr 09 04:47:56 ": "Although such a dark &amp; ominous storm we passed through on the way back from Missouri, still an awesome… http://t.co/9C9NjDoR3k", "Fri Apr 19 17:10:18 ": "Ashley Monroe last night at the Google for Creators event! Such a fun day :) http://t.co/CwmPkSHifx", "Sun Apr 14 00:00:29 ": "Have to post this one &amp; give a shout out to @halleblair7! She's such a great friend &amp; has been to so… http://t.co/7Izd7bmqQD", "Fri Apr 12 00:50:37 ": "Chuck Wicks show haha https://t.co/PTzTjGndAu", "Wed Apr 10 02:41:41 ": "@clw08 Hey Chelsea :) it's going good! How are you lately?", "Fri Apr 12 03:56:51 ": "@kelseeykaay Dave and Busters is totally a blast! And Chuck Wicks was awesome. Glad you like the new cover &amp; not sure what the next one is", "Wed Apr 10 02:43:38 ": "@lovelyk_xoxo haha I actually don't know! I used to live in Colorado actually when I was a kid :) I haven't been there in years though", "Wed Apr 10 03:23:33 ": "@angelamontana15 @verified haha why thank you! I hope they do too. Not that I need to be verified, but it helps people know it's actually me", "Mon Apr 08 23:19:02 ": "@Sarah_5853 Thank you SO much Sarah! It's such an honor to hear that &amp; that's what I want my songs to be about. Every artist's dream :)", "Wed Apr 10 03:03:35 ": "@haleygreynolds Thank you so much Haley! I did have a good day :) can't complain. I really hope you had a good day too ya know", "Wed Apr 10 01:28:17 ": "RT @Krissyyy_Nicole: I came across these on iTunes and had to buy them. 💙🎶 @TyBlakeBarham http://t.co/G8bDWBH1yW", "Fri Apr 12 03:49:01 ": "@kelseeykaay haha actually just left Dave &amp; Busters! Went to Chuck Wicks's show and then played some games which was fun :)", "Sun Apr 14 19:37:45 ": "Today I choose the tweet that stood out to me the most this past week :) I'll then Instagram it &amp; give a shout out to that person!", "Tue Apr 23 19:30:58 ": "\"I don't know exactly where I'm going, but I'm definitely on my way\" #inspiringquote #blessed #thankful", "Tue Apr 09 21:41:08 ": "@chuckwicksmusic Got the \nnew EP &amp; it sounds great man. @HalleBlair7 made me a big fan! \"Whole Damn Thing\" is my favorite. Follow back? Haha", "Fri Apr 19 02:42:54 ": "At the seminar today, my tweet made it on the big screen! Pretty awesome :) http://t.co/KvoG7Gru2V", "Sun Apr 21 21:48:59 ": "@ATLBYEAsh1DTW THAT IS AWESOMEEEEE! I love it :) Thank you for including me on there! You'll have to take a pic of it when it's finished", "Tue Apr 16 16:45:42 ": "It's a new day today, but still praying for Boston. I wanted to pass this on &amp; keep thoughts for the… http://t.co/ZYQQB894u5", "Thu Apr 18 04:33:47 ": "Studio time in Flintland earlier today! #passion #whatilivefor http://t.co/4qna2uxJDr", "Tue Apr 09 21:42:24 ": "@chuckwicksmusic @HalleBlair7 And also man, I'm thinking we should write sometime! I think we could come up with a killer tune.", "Mon Apr 08 23:19:39 ": "@FashionPR_Diana So glad you got the New CD Diana! Again, I'm so sorry the first one was scratched :/ sigh. But hopefully I can come to TX!", "Sat Apr 20 04:42:47 ": "@nicolewright563 we didn't hit it though! It almost hit us!!! How rude of the bird in my opinion to come out of nowhere like that lol", "Mon Apr 22 23:20:29 ": "A view from the Sirius XM meeting earlier today! Shows just how much of a beautiful blue sky day it… http://t.co/CUVXg9pmAu", "Fri Apr 12 18:15:53 ": "Blue skies, Green grass, &amp; my Von Zipper Skitch's. What a beautiful Tennessee day! #sunny #hot #Skitch… http://t.co/KnBh5e2RtX", "Sat Apr 20 04:43:58 ": "@kelseyjones884 Heck yah :) Thanks for tweeting me about it Kelsey!!! Definitely love the support from KKOW! You guys are amazing", "Wed Apr 24 00:59:41 ": "@jaredscottmusic I'm sure the Summer will be filled with a lot of hangouts. Happy Early 21st to you though! Have a blast &amp; be safe haha", "Thu Apr 18 14:03:07 ": "At the Google for Creators event in Nashville today. Bing who? Haha #NashvilleCreates @findyourflo http://t.co/A6jT2diEzy", "Fri Apr 19 02:17:46 ": "RT @OTBPPodcast: @TyBlakeBarham getting ready for our talk on Friday. We'll talk all about being young and loving country music.", "Wed Apr 24 01:04:25 ": "@Kgilley20 I followed you cuz I saw your \"gotta have faith tweet\" in my feed that someone else retweeted &amp; I wanted to retweet it as well :)", "Wed Apr 10 02:38:02 ": "RT @KayyMarieB: Just bought all of @TyBlakeBarham songs. I think I'm in love 😍😍", "Mon Apr 08 23:16:53 ": "@GageTGoodman Thanks so much Gage! This tweet is awesome and I appreciate you spreadin' the word on my music", "Wed Apr 10 17:49:50 ": "Special shout out to c0untry_girl09 for posting this picture with my lyrics to \"17 &amp; Young\". I CANNOT… http://t.co/Wal7bXBMxt", "Sun Apr 21 21:34:47 ": "I just realized I've never posted a Black &amp; White picture on here before haha. Happy Sunday everyone! http://t.co/lLGQWjMFn6", "Mon Apr 22 23:36:34 ": "Also met with CDX today where I was honored to be their very first \"Hallway of Fame\" performance :)… http://t.co/ORc5IFBSzC", "Sat Apr 13 19:35:20 ": "@InternAmber oh I'm sure I will! I head back ton MT the 25th but am moving here &amp; will be back in June so I'll be sure to come to more! :)", "Thu Apr 11 23:21:06 ": "Here's my new cover of @chuckwicksmusic \"Whole Damn Thing\" :) Please watch, enjoy, share, RT! http://t.co/4dhoE7dQAx", "Thu Apr 11 18:48:43 ": "Almost Friday...So Close haha http://t.co/W8TnZ8m3Ex", "Sun Apr 21 22:26:51 ": "This week's \"Tyler Tweet of the Week\" goes to @Tiff_Jones24 :) Thankful to hear that my songs bring… http://t.co/VsmedMTpCM", "Wed Apr 24 01:02:12 ": "“@Kgilley20: You just gotta have faith.” So simple &amp; true. Saw this &amp; couldn't help but retweet :)", "Wed Apr 17 01:32:57 ": "Tunin' into a writer's round of Stephen Barker Liles from Love &amp; Theft, Trent Tomlinson, Canaan Smith,… http://t.co/bCTnIpbImX", "Tue Apr 16 05:13:29 ": "@ammariemusic it looked a little bit like him though haha. The guy that played guitar for Chuck was older", "Tue Apr 09 22:51:37 ": "Along with me bein' a kid at heart, I'm a huge fan of Monster's Inc! Lol @lisatellbe drew this &amp; it… http://t.co/s2YxQlQ7AE", "Wed Apr 10 02:47:26 ": "@heyrachdisco @hunterhayes It's a good song for sure &amp; I bought it! I still have my own vibe though &amp; style ;) don't forget it haha", "Fri Apr 12 17:17:00 ": "@98WSIX Last night's Chuck Wicks show was awesome!!! My favorite was \"Whole Damn Thing\". I even did a cover of it :) http://t.co/4dhoE7dQAx", "Mon Apr 08 23:16:22 ": "@JackieNicole07 Haha thanks Jackie :)", "Sat Apr 20 04:42:20 ": "RT @kelseyjones884: @TyBlakeBarham your on air at 96.9 the Kow right now!", "Mon Apr 08 23:16:13 ": "@nicolewright563 gosh! Thank you for thinking that Nicole :)", "Tue Apr 23 19:32:21 ": "@KaVaFiMo I love seeing this tweet! Thank you so much for buying some of my songs &amp; going on a spree ;) which one is your favorite?", "Mon Apr 22 22:53:32 ": "Met with John Marks today from @SiriusXM! Definitely had a great time meeting &amp; playing him some of my songs :) http://t.co/glNBqoRvr5", "Wed Apr 24 16:22:23 ": "@shanetallant, @samcstephens, &amp; @IAmTheAntMan! I had an awesome time being a guest on @CountryNowTV :) Can't wait to see how it turns out!", "Fri Apr 19 03:47:06 ": "@CountryNowTV Yah! She talked about specific highlights of YouTube &amp; mentioned you guys as a Country specific channel to check out :)", "Sat Apr 13 23:52:30 ": "johnmgriffin &amp; I realized that we never took any pictures during the radio tour so we took one after… http://t.co/jO3j0o2d2g", "Wed Apr 10 02:43:05 ": "@angelamontana15 I actually don't know why I'm not @verified anymore :( It just happened one day. I wish I could get them to verify me again", "Sat Apr 13 19:38:01 ": "@InternAmber And I never saw my Chuck Wicks cover get retweeted by 98WSIX lol. It's okay if you can't :) Just would be really cool!", "Thu Apr 18 18:11:09 ": "@CountryNowTV! I'm at the Google for Creators &amp; Vivian Lewit totally gave you guys a shout out as a highlight of YouTube! #NashvilleCreates", "Wed Apr 24 01:05:49 ": "@Kgilley20 You're welcome :) Haha", "Sat Apr 20 02:50:37 ": "@nicolewright563 Why am I mean? :(", "Mon Apr 08 23:17:23 ": "@KrystinaBowen I love to be involved in the Man Crush Monday :) Thank you so much for this!!! Made my day", "Tue Apr 23 19:31:34 ": "RT @KaVaFiMo: iTunes shopping spree for some of my fav artist songs :)  ;) @TyBlakeBarham http://t.co/L7m3In2YXo", "Thu Apr 11 01:05:42 ": "Don't know what I'd do without my older brother, Levi. He's always been my biggest inspiration.… http://t.co/jR1Ij29wiI", "Fri Apr 19 20:34:38 ": "Ridin' in the car &amp; almost hit a bird! It dodged us just barely! But do you think it's stomach dropped cuz it was such a close call? Haha", "Fri Apr 12 01:47:43 ": "Here's my new cover of @chuckwicksmusic \"Whole Damn Thing\" :) Loved the show @98WSIX! You guys rock!!! http://t.co/4dhoE7dQAx"}