{"Fri Apr 05 17:03:10 ": "Six of the first eight Americans to walk on the moon, including pioneers Neil Armstrong and Buzz Aldrin, were Scottish Americans. #TartanDay", "Fri Apr 19 03:08:01 ": "Thanks again to @MassCEC for taking part in today's roundtable. It is always great to learn more about clean #energy in MA!", "Mon Apr 15 12:26:36 ": "RT @USAinUK: Together we can end #humantrafficking  http://t.co/HavddjKJ5q", "Thu Apr 18 20:34:42 ": "#CGSusie welcomes Minister Fallon to Boston; a sad week, but one full of hopeful messages.", "Mon Apr 15 22:30:47 ": "RT @RedCross: Due to high volume, Safe and Well is experiencing slow page loads at this time. Please continue to check back. #bostonmarathon", "Fri Apr 19 11:03:57 ": "RT @BUPolice: Stay away from Kenmore square area due to police activity.", "Mon Apr 15 20:50:29 ": "RT @AlistairBurtFCO: Shocked &amp; saddened to hear of cowardly attacks across Iraq. Thoughts are with those killed &amp; injured &amp;  ...", "Fri Apr 19 13:08:08 ": "RT @Harvard: Harvard University will remain closed for the day. Please watch Harvard's Emergency page for updates: http://t.co/t10dBHGG3a", "Mon Apr 15 21:46:38 ": "For all the latest news on the #bostonmarathon please follow @MassEMA, @RedCross, @bostonmarathon and ,@Boston_Police", "Fri Apr 19 13:12:10 ": "RT @BrooklineMAPD: Brookline residents have now been asked to stay inside, reverse 911 call being sent", "Fri Apr 19 10:29:06 ": "RT @Boston_Police: #CommunityAlert: Vehicle traffic in and out of Watertown suspended.", "Mon Apr 15 20:45:44 ": "RT @bostonmarathon: The Family Meeting Area has been moved to Boston Common. Runners are being directed there to meet friends and... htt ...", "Fri Apr 12 15:45:02 ": "Today #CGSusie traveled to #CT to meet with @GovMalloyOffice! http://t.co/nIK4D0NM7E", "Mon Apr 15 20:20:14 ": "Massachusetts Emergency Management Agency is providing safety and logistical support for those in and around the finish line\n@MassEMA", "Tue Apr 16 01:10:06 ": "RT @MassEMA: The FBI has set-up 1-800-CALL-FBI (1-800-225-5324), prompt #3, for anyone who has information", "Thu Apr 18 16:01:20 ": "RT @mayortommenino: To speak to a counselor by phone, please call the @healthyboston Mayor's Health Line: 617-534-5050. #oneboston", "Mon Apr 15 21:41:08 ": "For all British Nationals in need of emergency Consular assistance, please call the Global Response Center at1 877 854 6872", "Fri Apr 19 18:48:09 ": "RT @MassGovernor: The stay indoors request stays in place due to continuing developments. Only allow uniformed, identified, officers into y…", "Sat Apr 20 18:21:00 ": "Boston - Kept Calm and Carried On!\n#BostonStrong #BostonPride #BostonStrongPhotos http://t.co/BrlMyif54H", "Mon Apr 15 20:15:03 ": "RT @MassEMA: Runners East of Massachusetts Avenue directed to Boston Common.  \nRunners West of Massachusetts Avenue directed to Kenmore  ...", "Fri Apr 05 17:45:57 ": "Did you know: More than five million people in the US claim Scottish ancestry, one of the largest such populations in the world #TartanDay", "Sat Apr 20 01:27:24 ": "RT @bostonmarathon: The B.A.A. joins all citizens of the Commonwealth of Massachusetts in thanking the federal, state and city law... http:…", "Mon Apr 08 15:55:39 ": "Few will ever equal the legacy of Lady Thatcher. She paved the way for women in public service. Thanks to @SenatorCollins for her thoughts.", "Wed Apr 17 12:52:32 ": "Big congrats to RMA Sandhurst on their #rugby win last night against Harvard. Great job soldiering on!", "Thu Apr 18 20:36:15 ": "Upon arriving to #Boston, Minister Fallon expressed his deepest sympathies for Monday's tragedy.", "Mon Apr 15 22:51:52 ": "RT @Number10press: PM: \"The scenes from Boston are shocking and horrific - my thoughts are with all those who have been affected.\"", "Fri Apr 12 18:25:17 ": "New GREAT http://t.co/QiX7DXBnwl", "Fri Apr 05 15:31:49 ": "#TartanDay is tomorrow! Show us your love for tartan and we'll show you ours with the gift of a Scottish flag memento!", "Mon Apr 22 19:23:41 ": "RT @MassGovernor: Together we share in a moment of silence. God Bless the people of Massachusetts. #BostonStrong http://t.co/plWWO7cg3a", "Tue Apr 09 18:41:21 ": "New GREAT poster http://t.co/QiewN3jv3H", "Mon Apr 15 20:24:32 ": "RT @RedCross: Right now, connecting with loved ones is the best way to help. http://t.co/1Ta8I7mfJu #BostonMarathon", "Wed Apr 17 18:11:52 ": "RT @Boston_Police: Daily briefing has been scheduled by the FBI today @5pm  @Westin Copley #boston_police #FBIpressoffice #bostonmaraton", "Fri Apr 19 13:11:48 ": "RT @MassDOT: @BostonLogan: Logan is open and operating under heightened security. Please check with your airline on flight status.", "Tue Apr 16 13:13:19 ": "RT @rowe: RU a Back Bay startup without a place to work? CIC is offering refugees free space this week, fcfs. Call to arrange: 617-758-4200", "Mon Apr 15 20:18:06 ": "RT @mbtaGM: Service Update: All B- and C-Line service temporarily suspended. http://t.co/m4jQy1CJxl #mbta", "Thu Apr 04 16:31:53 ": "Ever wonder why #TartanDay falls on 6th April? This date marks the anniversary of the signing of the Declaration of Arbroath in 1320.", "Fri Apr 19 12:31:50 ": "RT @MassEMA: #breaking ALL of #Boston is advised to stay indoors and shelter in place (expanded from initial Allston/Brighton area) @Bos ...", "Sat Apr 20 02:11:35 ": "RT @whitehouse: POTUS: \"Boston Police and State Police and local police across the Commonwealth of Massachusetts responded with professiona…", "Tue Apr 16 01:07:10 ": "RT @MassDOT: #MBTA: Copley Station will remain closed tomorrow, Tuesday, April 16. http://t.co/1BjOgVebaL", "Wed Apr 10 13:07:47 ": "Green is GREAT http://t.co/Fp1ENs8gGj", "Fri Apr 19 10:46:51 ": "RT @BostonGlobe: What's closed in #Boston due to manhunt: http://t.co/F8kcJOD23x All MBTA, most schools included", "Fri Apr 19 11:03:23 ": "RT @NotifyBoston: Residens of Watertown, Newton, Belmont, Cambridge and Allston/Brighton: continue to stay indoors until further notice.", "Mon Apr 15 20:50:08 ": "RT @WilliamJHague: Appalled by news of explosion at Boston marathon. My thoughts are with everyone affected by it and all those waiting  ...", "Mon Apr 15 20:23:09 ": "RT @RedCross: Reconnect with loved ones in Boston via Twitter, FB, or #RedCross Safe and Well: http://t.co/1Ta8I7mfJu #BostonMarathon\n ‏", "Sat Apr 06 14:31:34 ": "Happy #TartanDay! Show us your love for tartan and we'll show you ours with the gift of a Scottish flag memento!", "Mon Apr 15 12:29:10 ": "Up &amp; at'em in #lexington for the #PatriotsDay battle reenactment w/ #CGSusie for UKinBoston http://t.co/hv09NIa0oM", "Tue Apr 16 13:11:58 ": "RT @NotifyBoston: Information &amp; resource center open today, 9am, Park Plaza Castle. Latest City details: http://t.co/NYMeXnZadc", "Sat Apr 06 14:45:50 ": "Happy #TartanDay! Each #NewEngland state has its own official tartan. FIrst up: #Massachusetts. http://t.co/qnSfvzKdxX", "Thu Apr 04 19:02:50 ": "#CGSusie is really looking forward to hosting @kathleenkennedy and @gitboston for a fireside chat tonight.", "Mon Apr 15 22:21:00 ": "RT @Boston_Police: BPD asking people not to congregate in large crowds #tweetfromthebeat via @CherylFiandaca", "Sat Apr 06 19:02:17 ": "#Vermont has had an official state tartan since 1994, the same designer has made a \"dress\" version since 1996. http://t.co/9eqfgUNY0k", "Fri Apr 19 10:44:36 ": "RT @mbtaGM: ATTENTION: The #MBTA is SUSPENDED on ALL modes until FURTHER NOTICE.", "Fri Apr 05 13:35:39 ": "This morning #CGSusie plans to #leanin to a breakfast with Facebooks’ COO  @SherylSandberg. #nevcasandberg.", "Mon Apr 15 20:17:32 ": "RT @MassEMA: RedCross Safe and Well is active.  Individuals can register themselvs as  safe or search for loved ones at http://t.co/Ky1x ...", "Fri Apr 19 10:33:47 ": "The British Consulate-General, Boston is closed today following police advisory. Please check @Boston_Police for updates.", "Mon Apr 15 20:42:16 ": "RT @Boston_Police: Boston  Police looking for video of the finish line #tweetfromthebeat via @CherylFiandaca", "Fri Apr 19 17:13:30 ": "RT @MassEMA: From @MassStatePolice: There will be a controlled explosion on Norfolk Street in #Cambridge this afternoon by authorities", "Mon Apr 08 13:32:53 ": "RT @David_Cameron: It was with great sadness that I learned of Lady Thatcher’s death. We have lost a great leader, a great Prime Ministe ...", "Mon Apr 15 20:41:24 ": "RT @NotifyBoston: Information on MBTA closings and delays: http://t.co/GWUxo3I6W5", "Thu Apr 18 23:47:43 ": "Looking forward to dinner with Minister Fallon, @BP_America and @mitenergy. #energy", "Thu Apr 18 23:44:30 ": "Another great meeting between Minister Fallon and @mitenergy director Frank O'Sullivan.", "Mon Apr 15 16:53:21 ": "GREAT http://t.co/th24tax8tw", "Thu Apr 18 23:21:04 ": "Some inspiring discussion from today's roundtable with @MassCEC. A great first stop for Minister Fallon on his trip to #Boston. #energy", "Fri Apr 12 18:19:42 ": "#FF @UKinUSA @UKinChicago @UKinCalifornia @UKinDenver @UKinFlorida @UKinTX @UKinNewYork @UKTIAtlanta @PeterWestmacott", "Thu Apr 18 16:16:18 ": "RT @whitehouse: President Obama on the bombing in Boston: \"It should be pretty clear by now that they picked the wrong city.\"", "Sat Apr 20 02:15:02 ": "RT @Boston_Police: Mayor Tom Menino: \"I am so proud of all our first repsonders. Thanks to them - the people of Boston will sleep well toni…", "Fri Apr 19 10:28:55 ": "RT @Boston_Police: #CommunityAlert: Search for armed suspect continues in Watertown. Residents reminded to remain indoors. All vehicle t ...", "Fri Apr 19 11:54:40 ": "RT @mbtaGM: #MBTA Service Continues to be Suspended on ALL MODES Until FURTHER NOTICE. Please DO NOT Wait at Bus and Station Stops.", "Tue Apr 16 01:05:44 ": "RT @Boston_Police: FBI has taken over the investigation #tweetfromthebeat via @CherylFiandaca", "Fri Apr 19 00:18:06 ": "Representatives from #business, #politics, and #academia all present at dinner to discuss the MA #energy landscape.", "Tue Apr 16 01:12:51 ": "RT @NotifyBoston: Via @boston_police, the following crime scene perimeter has been established: http://t.co/mtIMOfcLg7", "Sat Apr 20 02:11:48 ": "RT @whitehouse: POTUS: \"Tonight our nation is in debt to the people of Boston and of Massachusetts\"", "Fri Apr 19 10:30:22 ": "RT @NotifyBoston: Allston-Brighton Residents: Please stay home. Shelter in place. Police actively prushing armed and dangerous person.", "Fri Apr 05 15:55:35 ": "Thanks to everyone who helped 'fire up' a lively discussion last night! @kathleenkennedy @USmktNavigator @gitboston @sechobot", "Fri Apr 05 18:45:59 ": "Ever wonder why #TartanDay falls on 6th April? This date marks the anniversary of the signing of the Declaration of Arbroath in 1320.", "Fri Apr 19 13:56:23 ": "RT @CambridgePolice: We appreciate public's patience during our responses to suspicious/unattended items. Be informed, not afraid. #SeeS ...", "Thu Apr 04 14:53:16 ": "RT @DFID_UK: News: New UK aid for @theHALOTrust to clear all landmines from Afghanistan's Herat Province by 2018 http://t.co/bqoV26MgWS  ...", "Fri Apr 19 10:29:12 ": "RT @Boston_Police: All MBTA service has been suspended until further notice", "Fri Apr 19 17:59:25 ": "RT @richardbranson: At the Virgin London Marathon we will be supporting all those affected in Boston http://t.co/6LHYEvkRE3 #VLM2013", "Fri Apr 19 23:50:50 ": "RT @MassEMA: This has been a difficult &amp; emotional week. If you need crisis counseling, call 1-800-985-5990 or Mayor's Health Line: 617…", "Mon Apr 08 15:31:36 ": "Kind words from @ScottBrownMA. Lady Thatcher's legacy goes far beyond Great Britain and she is sorely missed.", "Fri Apr 19 17:14:09 ": "RT @massgov: RT @amtrak: UPDATE: All #Amtrak service NYC to Boston is suspended indefinitely. Trains are currently operating as scheduled D…", "Sat Apr 06 20:02:11 ": "Did you know that the first colour photograph to use the three-colour method was of a #tartan ribbon in 1861? #TartanDay", "Sat Apr 06 16:45:54 ": "#Maine lays claim to the oldest official state tartan in the United States designed in 1964. #TartanDay http://t.co/vzdgSUWAJQ", "Fri Apr 19 10:30:09 ": "RT @NotifyBoston: With MBTA suspended, please do not congregate at stations and bus stops. Please go home. http://t.co/gLxzHIWjzp for up ...", "Fri Apr 19 18:03:19 ": "RT @Boston_Police: #CommunityAlert: Per MEMA – People who went to work this morning not expected to remain there. Workers encouraged to ret…", "Tue Apr 16 13:15:16 ": "RT @fcotravel: #USA: Boston explosions emergency hotline 001 617 635 4500. Possible disruption to travel. See http://t.co/TGWR68fXRg for ...", "Fri Apr 05 16:21:09 ": "In case you missed it: #CGSusie chatted with @kathleenkennedy and @gitboston about the importance of mentorship http://t.co/nYs1FdqBua", "Thu Apr 18 16:16:46 ": "RT @whitehouse: President Obama to the people of Boston: \"Your resolve is the greatest rebuke to whoever committed this heinous act.\"", "Tue Apr 09 13:55:01 ": "Great to see the international links at @MassArt this morning - creativity is GREAT!", "Mon Apr 15 20:29:31 ": "All staff at UK Consulate-General Boston are safe and accounted for.", "Sat Apr 06 17:15:57 ": "#RhodeIsland adopted it's blue and green tartan in July 2000, making it the second-youngest tartan in #NewEngland. http://t.co/NgBFX7MPHs", "Fri Apr 19 18:01:58 ": "RT @MassEMA: For employees leaving, local authorities may have specific restrictions for certain areas given local conditions or security c…", "Sat Apr 06 15:45:50 ": "#NewHampshire tartan gets its colours from the beauty of the the states mountains, forests and wildlife. #TartanDay http://t.co/1NfOE1lisg", "Fri Apr 19 11:13:18 ": "RT @CambridgePolice: Ongoing investigation in Watertown &amp; surrounding areas. Police advising residents to shelter in place http://t. ...", "Thu Apr 18 12:44:39 ": "RT @UKinChicago: Business &amp; Energy Minister Michael Fallon visits Detroit to promote the UK auto industry http://t.co/aElx1FDeNS @bi ...", "Fri Apr 19 10:31:42 ": "RT @CambridgePolice: Residents advised to shelter in place. #MBTA service suspended in Cambridge &amp; the region. Report any suspicious ...", "Mon Apr 15 22:18:28 ": "RT @MassEMA: Another people finding resource: http://t.co/1p0Mkm53ht #bostonmarathon", "Fri Apr 19 12:30:50 ": "RT @Boston_Police: All taxi service in the City of Boston has been suspended pending further notice.", "Mon Apr 08 18:15:52 ": "RT @WilliamJHague: She changed our country forever and all of us owe so much to her. A legacy few will ever equal. Rest in peace Margaret"}