{"Sun Mar 31 00:09:46 ": "@MaurkicePouncey pouncey I need a new pair of gators do you want some action", "Fri Apr 12 18:01:58 ": "@Fitz2314 That's not Kobe's fault.", "Sun Apr 21 02:02:41 ": "@realelementof1 @MiamiHEAT @willcolon66 Big J I was just playing I'm a LAKER til I DIE.  Kobe the greatest flat out", "Sat Mar 30 23:51:50 ": "@Marcus_Ray29 Marcus ray is whack and I own him in madden 13 and trey Burke the greatest athlete ever from Columbus Ohio", "Sun Apr 21 05:11:13 ": "@I_TALK_DAT_SHIT she flops every play", "Sat Mar 30 02:49:33 ": "Thank God they didnt used Mcgary all year cause he would've been 1 and done", "Sun Mar 31 19:53:13 ": "@Marcus_Ray29 @CatoJune it's called reverse jink strategy", "Mon Apr 15 20:39:38 ": "Congrats Emmanuel sanders. Get u a new benze now I'm tired of that old one.  Just playing save your money. Lol", "Sun Mar 31 00:37:33 ": "@Your_highNESSA you kiss your kids with that potty mouth.  Thank god  for resurrection weekend", "Thu Apr 04 18:08:12 ": "Women against violence and child protective services needs to pay a visit to mike rice house", "Sun Mar 31 20:20:23 ": "@MaurkicePouncey should I wear all blue suit or all orange suit with these blue and orange gators", "Tue Apr 09 11:30:57 ": "@3Spence1 I got them D.wade coming don't trip", "Fri Apr 12 01:58:37 ": "@JB1544 Birnberg I just got a spike tattoo", "Fri Apr 12 18:18:36 ": "@D_VanDyke8 Get out of here with that LBJ stuff. We talking about mj and Kobe.  LBJ do not belong", "Tue Apr 09 02:43:31 ": "All they do is foul!!!!!!!!", "Mon Apr 08 18:36:02 ": "@3Spence1 a pair of jays", "Tue Apr 16 21:52:34 ": "Pat summerall  RIP. he was awesome!!!", "Sat Apr 20 23:46:32 ": "Andre millers game reminds me of Hines ward game", "Thu Apr 18 00:07:39 ": "@Marcus_Ray29 That's the wackiest pre-season big ten mag ever.  That's probably why we started 0-2", "Mon Apr 15 22:26:37 ": "@RRR0XXX I'm so sorry u the man  (woman).", "Thu Apr 11 20:53:25 ": "@papichulo2025 I don't call another man papi but whatupdoe chulo", "Sat Mar 30 02:41:37 ": "C Webb best big man", "Sat Mar 30 02:07:46 ": "It's great to be a Michigan wolverine!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Sat Mar 30 21:30:32 ": "@mommy2OandM @maxstarks78 @heathmillerfans @LaMarrWoodley on Monday of that week", "Sat Mar 30 00:59:07 ": "@docmsb at bagger Dave's watching the game", "Sat Apr 13 02:59:46 ": "@E_Sanders88 \nU sign with the pats we beefing.   Detroit down baby", "Tue Apr 16 17:22:50 ": "RT @KeithaButler: I'm bringing a special guest, Pastor Wieslaw Ziemba to WOF Southfield tomorrow at 7pm. Bring a friend. RETWEET.  #WOFICC", "Tue Apr 09 02:59:46 ": "That wasn't on Mcgary !!!!!!!!", "Fri Apr 12 17:43:58 ": "You can't argue that Kobe getting better at 34 and mj was declining.", "Tue Apr 02 22:54:20 ": "Ian gold whatupdoe", "Sat Mar 30 18:43:31 ": "@mommy2OandM @maxstarks78 @heathmillerfans @LaMarrWoodley and u got some tickets coming your way this fall", "Mon Apr 22 02:15:03 ": "@plaxicoburress you know where im from. basketball is in my DNA", "Thu Apr 11 20:50:58 ": "Any tutors in westbloomfield for ACT SAT", "Wed Apr 10 01:40:59 ": "@mommy2OandM  in the word of god tonite", "Fri Apr 12 18:07:16 ": "MJ played on a way better team than Kobe if I'm lying why did his team make it to game 7 eastern finals against NY", "Wed Apr 10 00:11:56 ": "@Umich83 @Victor_Hobson u are mr Peter himself.", "Sun Mar 17 02:27:14 ": "RT @steelerchick83: @LarryFoote313 Can I get a retweet on my 30th birthday?", "Tue Apr 09 03:07:24 ": "Refs suck!!!", "Sun Apr 21 05:09:20 ": "only reason i watch clippers game, is my homie Jamal Crawford. and i throw up watching Ms blake floper every game", "Sun Apr 21 05:02:17 ": "@drewsamuto WHAT!!!!!!!!!!!!!!!!!!!!!!", "Sun Mar 31 16:26:58 ": "Thank u Jesus for getting up and thank u for these Keys", "Sat Mar 30 02:02:45 ": "Call the foul on the put back", "Sun Apr 21 01:25:08 ": "@willcolon66 My wife a Knicks fan that makes me a Knicks fan", "Sat Mar 30 00:38:47 ": "Vote for my daughter...  http://t.co/CnMLBGVDRy", "Wed Apr 10 16:55:05 ": "@iplantwatergrow @Victor_Hobson Ian are u insinuating that your grown and mature.", "Fri Apr 19 00:27:01 ": "@ReeseClarett13 @Victor_Hobson @Marcus_Ray29 @Umich83 @CatoJune @drewhenson7 Clarett u would've had a hamstring that game", "Fri Apr 12 20:10:25 ": "Pittsburgh &amp; Detroit     This is overrated.  Sand on my feet and I'm getting sun burn.  Lol http://t.co/PKEs1sU2WO", "Fri Apr 12 18:16:39 ": "@JoshR_7 That's what happens when u put arguably the best player ever with a team that went far in playoffs.", "Fri Apr 12 02:08:53 ": "@RRR0XXX @Trojan81 Alex be trying to hang with the kardashians", "Tue Apr 09 02:02:42 ": "All Louisville do is reach and grab", "Tue Apr 09 03:11:06 ": "That should be #3. But the refs suck", "Fri Apr 12 18:04:16 ": "@D_VanDyke8 Man LBJ hid in the corner just 2 years ago in the finals.  I can't forgive him for that", "Tue Apr 09 03:25:06 ": "Here come the make-up calls", "Sat Mar 30 18:42:05 ": "@mommy2OandM @maxstarks78 @heathmillerfans @LaMarrWoodley ms Jennifer that's why it's awesome to play 4 the steelers. !!!!!!!!!!!!!!!!!!!!!", "Wed Apr 10 00:08:38 ": "@Victor_Hobson since I shaved my head women  been calling Boris", "Wed Apr 10 00:10:46 ": "@Victor_Hobson my wife gets mad when she hears that cause she said I'm way better looking than him", "Tue Apr 09 23:12:34 ": "@Victor_Hobson Vic if u gonna be on twitter, come up with your own quotes.", "Sun Mar 17 02:40:42 ": "got to hang out with JON KOLB. awesome man of GOD. I could've listen to his old school stories all day", "Tue Apr 09 01:46:04 ": "College refs suck", "Tue Apr 09 23:23:05 ": "@Victor_Hobson call me Boris Sammy Sosa", "Thu Apr 11 20:48:23 ": "@CharlieBatch16 @ImaginePgh cbatch how do I get a check mark for my twitter.", "Tue Apr 09 23:43:17 ": "@JustVETTE  whatupdoe how did your boy do", "Fri Apr 19 00:25:11 ": "@ReeseClarett13 @Victor_Hobson @Marcus_Ray29 @Umich83 @CatoJune @drewhenson7 I wasn't there and if i was there $uckeyes don't go to the ship", "Sat Apr 13 00:36:37 ": "@Victor_Hobson @Nuvokev What y'all talking about????", "Wed Apr 10 17:32:53 ": "@Victor_Hobson @iplantwatergrow @CatoJune big girls need love too. Lol", "Mon Apr 22 21:39:15 ": "@Valerie_Georgia ms valerie i hope u took notes on how to squat. thats why my legs are so much bigger than yours. lol", "Fri Apr 12 15:16:13 ": "@willcolon66 U not from NY.  And u better shut up b4 I get my Harlem cats to holla at u", "Thu Apr 11 20:54:40 ": "@Victor_Hobson for my sister Mr Sosa", "Sun Mar 31 20:12:44 ": "Albrecht needs to come play corner this fall", "Sun Mar 17 05:37:20 ": "cant sleep excited about church tomorrow!!!!!!!!", "Sun Mar 17 02:38:52 ": "And i dominated the klinvex fam basement. went undefeated at the old school hockey game, not going to mention who i beat", "Sun Mar 17 02:44:17 ": "pittsburgh show my main man connor klinex from wexford some luv", "Mon Apr 08 18:32:32 ": "@3Spence1 yeah !!!!!!!!!!!!!!!!!!!!!", "Fri Apr 12 01:52:20 ": "@StayBurke @Trey_Burke3 @JB1544 trey Burke get your money.  Don't worry Derrick Walton will carry the torch.", "Fri Apr 12 17:36:55 ": "Kobe the best basketball player ever.   Flat out !!!!!!!!!!!!!", "Fri Apr 12 20:14:16 ": "@SerbianLutka95 Why your account not verified? Ms Nina lol.  Charlie batch is whack and his pool game whack", "Sat Mar 30 01:05:14 ": "Why are we standing and watching", "Thu Mar 07 03:29:50 ": "i hope u guys been watching what kobe has been doing", "Fri Apr 12 01:38:16 ": "@Trojan81 @RRR0XXX @CharlieBatch16 @ImaginePgh your maize &amp; blue on the inside just ask your Daddy", "Sun Mar 31 00:10:16 ": "@MaurkicePouncey and tell your side kick Gilbert", "Tue Apr 09 03:24:14 ": "Yeah I'm crying about the officiating", "Sat Mar 30 02:10:54 ": "Jalen rose 1a trey Burke 1b of all-time", "Sun Mar 31 00:06:51 ": "Trey Burke the only guy  from Columbus to do anything for the maize and blue.  Take that", "Sat Mar 30 02:03:51 ": "@JDwyer27 you know itttttttttttttt", "Fri Apr 12 02:01:10 ": "@JB1544 U can't cause next year your gonna be in A2 competing with him for girls", "Sun Mar 31 19:54:29 ": "@Marcus_Ray29 @CatoJune u didn't even do a bracket.  Chump city", "Sat Mar 30 21:30:06 ": "@mommy2OandM @maxstarks78 @heathmillerfans @LaMarrWoodley make sure send me a message the week u want to come and I'm gonna leave u 4 tic", "Mon Apr 15 22:54:48 ": "Run to the bible for answers not the tv or papers. Christ is the savior of the whole world.  Receive the gift of salvation. Rom 10:9", "Sun Mar 31 00:41:56 ": "@Marcus_Ray29 buster Douglas from Columbus Joe Louis from Detroit.  That should end the D vs Columbus.    Take that", "Sun Mar 31 20:16:00 ": "@Marcus_Ray29 @CatoJune fat people always making food jokes", "Sun Mar 17 02:31:56 ": "the Klinvex fam threw one of the best house parties that i have been to in a long time", "Thu Apr 04 16:45:21 ": "@KeithaButler get'em Bishop", "Thu Apr 18 02:56:28 ": "@CatoJune @Umich83 @Marcus_Ray29 @drewhenson7 @Victor_Hobson c/o 98 tied a upperclassmen up and threw him at coach carr feet", "Fri Apr 12 01:55:07 ": "@Trojan81 Yeah big Alex hook me up cbatch slipping.", "Sun Apr 21 04:58:08 ": "blake griffin will never be a champion or superstar. he flops every play", "Fri Apr 12 17:58:55 ": "Mj was u guys first love that's all.  And competition is way better now than the 80s&amp;90s.   Just look At international ball", "Sun Mar 17 02:28:19 ": "@steelerchick83 30 the new 20 have a safe night", "Wed Apr 10 17:16:34 ": "@iplantwatergrow @Victor_Hobson @CatoJune we know 4sho that Ian and Vic have never been invited to a coke party. Lol", "Mon Apr 15 21:21:53 ": "I finally got my check mark.     Alex Holmes the man!!!!!!!!!!!!!!!", "Sat Apr 13 00:30:57 ": "@KristiEidt You just got back from Bahamas"}