{"Sat Dec 29 00:49:50 ": "Awesome to see peeps out in Canterbury yesterday at Rhythm and Alps - enjoy the rest of the party! We're in Sydney... http://t.co/Nqasy69r", "Wed Jun 20 13:18:08 ": "It has taken us quite a few days to recover from our epic DJ party set at Warsoul last Saturday night in Warsaw.... http://t.co/2gA1ktHC", "Thu Aug 23 05:11:27 ": "@LeFtO thanks man we got a small dilemma. Details just emailed to you. Holla if you can help! Thx", "Fri Jun 08 20:06:28 ": "Photo: First time in Rotterdam. On stage in 10. Feels good. http://t.co/t8F7NQJx", "Sat Aug 11 14:55:45 ": "Photo: Myele putting pen to paper. http://t.co/rFcEsBHj", "Mon Jul 30 07:16:29 ": "EU TOUR NEWS: We're excited to be performing at Sziget Festival on the 9th of August at A38. Our first time in... http://t.co/3rzrpIAr", "Sat Jun 23 01:35:01 ": "Photo: Shout out to Maurice and the whole crew at Stall 6 in Zurich. Good to be back in Switzerland. http://t.co/NW4001u7", "Wed Oct 17 19:54:52 ": "our parents are arriving and we'll be rehearsing all weekend for our show at Nelson Arts Festival next Wednesday... http://t.co/2PU6eDfV", "Mon Nov 26 02:14:36 ": "this week it's all about WELLINGTON! As well as The Hobbit premiere we are playing twice at San Francisco Bath... http://t.co/bEIFamfy", "Sat Aug 11 14:39:15 ": "Photo: Thanks to Adri and the whole crew at Sziget Festival. Gonna need to return to beautiful Budapest very... http://t.co/wTC9c7tg", "Sat Jun 23 14:12:23 ": "Soundcheck knocked out - feeling good. Weather is primo. Desi it is tonight Nuemberg!", "Wed Jun 20 20:13:06 ": "Photo: http://t.co/dC3MknU6", "Fri Oct 05 07:06:12 ": "Thanks to Auckland Museum and PSC for the late night last night and our team of merry men and women out in... http://t.co/Mi2oszoE", "Mon Nov 26 02:20:02 ": "this week is all about WELLINGTON! As well as The Hobbit premiere we will be playing twice at San Francisco Bath... http://t.co/hEQN7MUH", "Sat Oct 27 23:33:49 ": "For any vinyl heads in Christchurch today Myele Manzanza Music has 7 copies of our limited edition vinyl LP on... http://t.co/MXHOuPLd", "Tue Oct 09 05:50:34 ": "One way of having a family reunion - https://t.co/QL3oVr5d http://t.co/KSJKk3Im", "Wed Oct 03 22:21:03 ": "Back on home soil! AKL tonight for LATE at The AK Museum then PSC for the after party. Come join fam!!", "Tue Aug 21 11:00:53 ": "crazy last few days in the UK! Thanks to everyone who came along to our shows and hosted us. We're back on the... http://t.co/VaJgEZ4j", "Sat Oct 27 20:30:46 ": "Go Christchurch! http://t.co/hdLngZw2", "Thu Dec 06 21:55:29 ": "this is us on the 28th of December! Stoked to be performing at a festival in Canterbury at Rhythm and Alps and... http://t.co/x2vpdOCe", "Fri Aug 17 17:05:22 ": "beautiful day and the venue's wild! Going to be a good night tonight in London town! We're on stage at 10:15pm... http://t.co/jA7pEf2a", "Sun Apr 14 20:53:41 ": "thanks to @hippy_parents for producing this beautiful insight into our Family show http://t.co/jHNZh0zAAV", "Sun Apr 14 20:54:00 ": "@hippy_parents @Dropbox YES!", "Mon Apr 22 00:49:11 ": "Photo: Good times in the south this weekend. Sporting local threads fireside. Great company. #wanaka... http://t.co/twH7A1NboN", "Sat Aug 11 14:54:42 ": "Photo: Fine dining in Christiania. http://t.co/qMi9d435", "Wed Aug 22 20:18:21 ": "@LeFtO are you in Brussels tomorrow bro? We need a helping hand....", "Sat Jun 09 05:54:46 ": "Photo: Thank you Rotterdam. http://t.co/JencYFku", "Sat Sep 01 07:32:53 ": "hard to believe our epic EU tour is coming to an end with only 2 shows left! Tonight in Erfurt we say auf... http://t.co/LyQMTB1R", "Wed Dec 05 00:13:13 ": "an epic weekend in Wellington and a great welcome home! Thanks to everyone who came out on Thursday and Friday... http://t.co/XnhkTA7Z", "Fri Nov 30 06:07:25 ": "doors open at 9pm tonight for round 2 at San Francisco Bath House &amp; if you want to get a doorsale you're advised... http://t.co/OId1xwhu", "Mon Feb 18 22:29:00 ": "we've got some cool gigs coming up and we're particularly stoked to be involved with this project which launches... http://t.co/NKdKKaJV", "Thu Nov 29 22:33:43 ": "nice vibes at San Francisco Bath House last night. Thanks to everyone that made it out on a Thursday night &amp; for... http://t.co/6vOUPS1f", "Sat Jun 16 19:57:17 ": "Photo: TK and our #1 Bolzi - Greg - via Chicago. Second half - Polska vs Czech Republic… power up! http://t.co/Aa1GpL98", "Tue Sep 25 21:29:19 ": "Tēnā koutou! We are back in the land of the long white cloud, Aotearoa, still reeling from our european... http://t.co/IFZyzIR4", "Sat Jun 23 01:48:52 ": "All Swiss ev'rythng.", "Sat Aug 11 11:25:38 ": "The last couple of days have been surreal. A brisk trip to the beautiful city of Budapest to play at the mammoth... http://t.co/jmIstwJu", "Thu Oct 25 03:57:14 ": "big thanks to the Nelson Arts Festival for a beautiful time in Nelson and everyone who came to the EWH Family... http://t.co/wxi5ESkp", "Sat Jun 16 19:58:07 ": "Photo: Kicking back in Warsaw watching Miles. http://t.co/mCyM08Jv", "Sat Jun 23 01:26:30 ": "Photo: Words by hand - Swiss style. http://t.co/X0KzL7cC", "Sat Aug 11 14:53:46 ": "Photo: On the border of Christiania, København with our man Sean. http://t.co/OOIPj5Ze", "Sun Apr 14 20:52:23 ": "excited to be heading down south to perform the EWH Family show at @festivalcolour this weekend! http://t.co/jHNZh0zAAV", "Tue Aug 14 10:11:55 ": "Thanks to all the DK crew that made our show at Pumpehuset, CPH such an amazing vibe! We're really looking forward... http://t.co/0QBuYFkF", "Thu Jun 21 01:46:40 ": "@MarMusic Ha! Classic - slow off the mark - my bad bro! Done...", "Thu Jul 05 21:27:33 ": "Photo: Our spread in the latest issue of Street Wear Today. Shout out to Vibol @foxtree and our Bochum Fam. http://t.co/EwqYcUZe", "Thu Aug 09 06:07:57 ": "woooo our first show in Hungary today at the biggest festival we've ever been too - Sziget Festival Official in... http://t.co/hZrGkCeh", "Sun Jul 08 21:35:54 ": "Thanks to everyone who made last night something we'll never forget. One of the most beautiful settings yet.... http://t.co/ZYgoEggr", "Thu Jun 14 11:49:46 ": "Looking so so forward to this week when we go back to our roots and back to the Warsoul crew in Warsaw. We... http://t.co/rRU4Prvf", "Sat Apr 20 22:45:17 ": "thank you Queenstown and Festival of Colour for a great show last night! Now we're off to Wanaka!", "Thu Aug 23 05:29:02 ": "Frankfurt tonight with the fellas The Black Seeds. Kiwi reunion am Main!... http://t.co/mK21CnwY", "Thu Jul 05 21:26:06 ": "Photo: @BRIGHT Berlin for our pop-up show. http://t.co/oeOuDcmg", "Wed Oct 24 01:01:55 ": "sound checking for our show tonight at Nelson Arts Festival with our parents! Nelson is looking and sounding good!... http://t.co/uTrsXXCg", "Thu Jul 12 09:56:02 ": "@gillespeterson it was a pleasure and an honour. A beautiful place to play. Thankyou for having us!", "Mon Aug 06 20:05:33 ": "we have some very exciting shows coming up this week. Our first show in Hungary at the mighty Sziget Festival on... http://t.co/jr41Knlo", "Thu Nov 29 06:25:28 ": "for y'all coming to our show tonight at San Francisco Bath House we're starting half an hour earlier at the more... http://t.co/uT9AHnOZ", "Thu Jun 21 01:48:39 ": "@TheRealBenjiB Deviation - live -represent! Respect bro.", "Sun Nov 25 01:00:10 ": "Thanks to RDU 98.5 FM for bringing us home to Christchurch last night to party with the RDUnited crew! Much love... http://t.co/MKFxZ1Ey", "Thu Mar 07 20:39:23 ": "This time next week we will be heading up to Taranaki where we are very blessed to be reassembling our whanau to... http://t.co/BwqIpDz6Ew", "Wed Oct 03 03:46:40 ": "back into it tomorrow night with a little shindig at Auckland Museum! Catch us there as part of the LATE program... http://t.co/OdG19Eva", "Thu Nov 01 23:06:11 ": "Congratulations to all whānau who's hard mahi was recognised and celebrated at the VNZMA's last night and well... http://t.co/sj4MhxEU", "Fri Apr 19 23:43:22 ": "@MyeleManzanza warming up for our Family show tonight at @festivalcolour. Got that Queenstown chill! http://t.co/bkoo4nNllC", "Fri Nov 02 05:56:02 ": "we were going to tell you on Monday but we couldn't wait - 2 shows at San Francisco Bath House Wellington.... http://t.co/559wpaMm", "Mon Jul 02 07:28:13 ": "Berlin show 3 July 2012 http://t.co/0Z2nGD3G", "Fri Aug 17 07:11:24 ": "LONDON! We're coming for you! Looking forward to seeing all our LDN peeps at the show tonight innit ;)... http://t.co/3E9njvcR", "Sat Aug 11 14:41:45 ": "Photo: Shout out to The Roots. http://t.co/1qL1OJFD", "Thu Mar 14 22:16:18 ": "Heading up to WOMAD New Zealand today! Catch the EWH Family show at 10:45pm tomorrow night at the Shell Gables Stage!", "Tue Jun 26 11:47:25 ": "looking for some fresh drums for our new album recording in Berlin tomorrow @Gretsch_Drums, @sonorusa, @YamahaDrums any ideas...? ;)", "Wed Nov 28 21:23:39 ": "big night tonight! first time on a stage in Wellington for quite a while - nervous but looking forward to seeing... http://t.co/DaSRNgD8", "Sun Nov 25 00:28:44 ": "Great to be reconnected with our long time friend and creative director for RDUnited Christchurch : James Meh… http://t.co/9maUNuw8", "Thu Jul 05 21:16:59 ": "Photo: Mara outside the old Stazi headquarters ahead of our show with Street Wear Today at BRIGHT in Berlin. http://t.co/GUR3p1Uk", "Thu Mar 21 20:41:04 ": "AK peeps - our drummer Myele Manzanza Music is performing tonight with his band 'The Eclectic' at Leigh Sawmill... http://t.co/76HnkPAsEF", "Sat Jun 23 01:29:43 ": "Photo: New band shot : left to right : Mara, Taay &amp; Myele. Trillll. http://t.co/2RV68lzg", "Sat Aug 18 11:33:39 ": "@LONDON thankyou  for joining us last night for our bikram session / show @somethinksounds thankyou for having us. 'twas a blast!", "Sun Jul 22 16:11:19 ": "Shout out to Sandra, Monica, Istven and the whole fam at Tamsta Music Festival for an amazing weekend in Lithuania. Much respect!", "Mon Jun 25 20:56:44 ": "@bluntcunts mix n match - Swiss style", "Wed Jul 04 09:08:44 ": "and we are just a little bit excited to be a part of the AMAZING line up at Worldwide Festival this weekend in... http://t.co/fMH3lZWs", "Tue Nov 27 22:02:27 ": "we'll be on the airwaves on RadioActive.fm's Amplifier show at 12:15 today talking with Don Luchito about the 2... http://t.co/YsIh3Igs", "Sun Jul 08 21:37:41 ": "Photo: Shout out to everyone who was a part of last nights show at Theatre de la mer. Was something we won’t... http://t.co/lPcQdoYe", "Sat Apr 20 04:54:42 ": "ready to go with our Family show tonight in Queenstown as part of the Festival of Colour, join us and our whanau... http://t.co/ZeG1YWp2wM", "Fri Jun 22 21:47:17 ": "About to play Stall 6 Zurich!", "Mon Nov 19 02:37:09 ": "got 3 choice gigs coming up soon in our 2 hometowns. The 1st is this Saturday in none other than the Churchur!... http://t.co/SnjMgjrS", "Thu Nov 29 03:07:49 ": "setting up at San Francisco Bath House for our show tonight and getting ready to perform some new tunes for the... http://t.co/0D9bIUav", "Sat Aug 11 14:46:17 ": "Photo: On the border of Christiania, København with our man Sean. http://t.co/1RQ68jDv", "Sat Jun 23 01:25:35 ": "Photo: Lamps on lamps - Stall 6, Zurich. http://t.co/Fy5npNty", "Wed Nov 21 01:04:10 ": "looking fwd to Sat! https://t.co/SPp7AnsM http://t.co/tHgOons6", "Sat Aug 18 12:04:37 ": "scorching day in LDN. setting up for our @AllSaints_ basement / rooftop session!", "Thu Dec 27 22:04:57 ": "on our way to Rhythm and Alps! see you at 5pm", "Mon Jul 02 07:01:52 ": "Berlin show tomorrow night at Festsaal Kreuzberg....who's with us?", "Wed Jul 04 07:48:15 ": "Thanks for coming out on a Tuesday night and showing us some love Berlin! and thanks to Festsaal Kreuzberg for having us X", "Sat Jun 23 01:28:27 ": "Photo: Stall 6 - previously a military horse stable turned theatre, restaurant and venue. http://t.co/04U3X03I", "Mon Jul 30 15:12:52 ": "FYI London (if you're listening ;) ...new venue for our show on the 17th August as the former is no longer... http://t.co/lvA1jGId", "Tue Jul 03 08:02:31 ": "these guys will be at our show at Festsaal Kreuzberg, Berlin tonight...the last available brand new limited... http://t.co/V5P1ADFd", "Thu Jul 05 15:24:44 ": "Photo: Tonight - pop-up show with our Streetwear Fam at the old Stazi HQ in Kreuzberg. 7:30-8pm - come hit... http://t.co/OCEKPksf", "Thu Feb 21 20:53:56 ": "2 years ago today since Papatūānuku rose up and our beloved (other) hometown, the place of Tautahi, Christchurch... http://t.co/BQcJGZEcAT", "Tue Jul 03 16:23:35 ": "all of y'all that want a sneak preview of some of the material we have been working on for album#2 the place to be... http://t.co/RcO58te8", "Sat Jun 16 17:02:08 ": "Back in Warsaw tonight for the return of Warsoul with our brother Maceo! So good to be back in Polska.", "Sat Aug 11 14:53:01 ": "Photo: Buda Castle from a distance, Budapest. http://t.co/nN8bQ8Sp", "Fri Nov 23 23:26:11 ": "Back in Chur town tonight for the RDUnited ReLaunch Party! Going to be massive and can't wait to see everyone in... http://t.co/pxPZyPMG", "Sun Jul 08 21:30:08 ": "Photo: An incredible night in Sete for Worldwide 2012. http://t.co/aamCTKXR", "Sun Jul 22 16:14:23 ": "Photo: Tamsta Music Festival, Lithuania. http://t.co/M7dMYgYu", "Mon Oct 22 03:33:58 ": "@Benny_Tones Nice One BT, great to be back together again! EWH Family show at Nelson Arts Fest WEDs night 24 Oct! It's a family reunion!"}