{"Sun Apr 21 20:27:05 ": "@ifyouseetaj I have a fully finished album that I can't release currently... but its pretty much ready haha :) x", "Mon Apr 22 09:04:25 ": "@ellescriptette it's really cool! He's  mega down to earth and full of cool ideas. Great guy to work with :) x", "Mon Apr 22 21:06:12 ": "@NattyDear I've got to record it first... Only those who retweeted will get to see it :) will reveal soon! X", "Sun Apr 21 20:18:04 ": "@Scriptdraker oh dear! That was just a demo I did when I was bored once... must update my soundcloud! Haha x", "Sun Apr 21 02:21:50 ": "@A_SecretUnicorn scentless apprentice (live) or All apologies :) x", "Sat Apr 20 19:54:45 ": "RT @Shasty_Santos: @TheScript_Danny on 5 Acts... Amazing Acts in Fact ;) @nadeem_leigh @Mitchelemms @ABegleymusic @smithandjonesuk @ConorRu…", "Sun Apr 21 19:06:56 ": "@SliimShadyyy someone who knkws good radiohead songs, legend! :) x", "Tue Apr 23 13:05:36 ": "MisterNothing rehearsal at 3pm, will get back and record my 21 answers to the 21 questions I chose from you guys! :) @MitchelEmmsFans", "Sun Apr 21 19:58:47 ": "@Scriptdraker awh man, so glad you like it! :D x", "Sat Apr 20 20:11:06 ": "Well done Laura!! Welcome to Team Danny! ;) @BBCTheVoiceUK #thevoiceuk", "Mon Apr 22 14:39:12 ": "RT @ChristyJohansen: @Mitchelemms young people should leave school and go live lives instead. #adventureoverpaper", "Mon Apr 22 22:46:41 ": "RT @ch_ch_char: @Mitchelemms got 99 problems but the Mitch ain't one", "Mon Apr 22 21:23:39 ": "@TwiztiddLette69 your snake is a legend! :D", "Mon Apr 22 14:35:45 ": "@MitchelEmmsFans I'll be uploading a proper video tomorrow answering the questions, giving everyone time to get their questions in! :) x", "Mon Apr 22 15:59:07 ": "@xlilshayneex @MitchelEmmsFans I was in London for the whole of last week! Haha :) but yeah I'd love to! x", "Sun Apr 21 20:36:55 ": "@Scriptdraker ive got covers up on YouTube already and some new ideas, but might ask peeps on twitter for suggestions! :) x", "Sun Apr 21 18:42:51 ": "@SliimShadyyy any other ideas of a radiohead song? Creep might be too predictable :p x", "Sun Apr 21 18:42:04 ": "@urrrmmmm oh dear! Haha :p thank you though!! X", "Sun Apr 21 20:17:06 ": "@Script_4Life I love bands that do ethereal, heartbreaking music. Sigur Ros are another favourite when im in that kind of mood.", "Tue Apr 23 00:14:57 ": "RT @NuttyDevil7: Was lovely to meet @Mitchelemms tonight. Your a wicked lad http://t.co/h5wQSVafXA", "Sun Apr 21 19:56:59 ": "@mugzylogie no worries! Im so glad you love it, it means a hell of a lot :) xx", "Sun Apr 21 01:06:51 ": "RT @DannyMacaroons: We wont kill you. Promise. RT @nadeem_leigh: @Mitchelemms @TheScript_Danny @BBCTheVoiceUK Whats gonna kill ya is the ma…", "Mon Apr 22 20:46:45 ": "RT @Stevielaurax: Just met @Mitchelemms from the voice in the pub and he's sooo lovely, good luck in the show!! Xx http://t.co/R5eJ2WzN2w", "Mon Apr 22 23:38:31 ": "RT @helterspiral: And the Bieber edit everyone's seen http://t.co/H5wf4GHzZh", "Mon Apr 22 20:48:54 ": "@leonamcmullan what are you referring to? Haha x", "Mon Apr 22 07:49:20 ": "@sianybarney 2nd of May :D", "Tue Apr 23 00:19:50 ": "@MitchelEmmsFans much appreciated! I'm sure Bieber has enough fan pages! :p love you and all the followers too :) #feelthelove", "Tue Apr 23 00:29:49 ": "@MitchelEmmsFans have a good day tomorrow! Night night :) XxxxxX", "Sun Apr 21 19:51:57 ": "@mugzylogie like everyone else by taking the easy way out. Im real glad it means something, I hate fake meaningless music! X", "Mon Apr 22 21:50:15 ": "@SarahBlackie1 yes!!!", "Mon Apr 22 21:03:41 ": "@NattyDear I have indeed ;)", "Mon Apr 22 19:18:14 ": "@sianybarney I owe you a pint! Haha you can download it on my soundcloud :)  xx", "Sun Apr 21 14:22:44 ": "RT @Moore91J: Look Who I Bumped Into In Primark ;) x @Mitchelemms http://t.co/ehfOOpCZDE", "Sat Apr 20 20:24:09 ": "Welcome to Team Danny @itsKarlMichael !!! Cant wait to see you soon dude :) awesome audition! - @BBCTheVoiceUK #thevoiceuk", "Mon Apr 22 21:01:35 ": "@leonamcmullan ;)", "Sat Apr 20 19:46:03 ": "They should've put nick through! Shame :( #thevoiceuk", "Sat Apr 20 20:56:05 ": "@ConnarRidd haha awesome, you should've said hi :)", "Sat Apr 20 19:57:39 ": "Wow, that was unexpected!! Harmonies were so damn awesome. Well done to the @BBCTheVoiceUK for showcasing different genres! #thevoiceuk", "Mon Apr 22 12:42:02 ": "About to slap this badboy of an LP on my vinyl player while I do some tidying up. X http://t.co/4yQlF98KMW", "Sun Apr 21 18:43:19 ": "@Scriptdraker engaging! Hi :) x", "Sat Apr 20 19:50:32 ": "Well done @gvinny678 !!! :D nicely done! X", "Mon Apr 22 20:48:08 ": "@claudsdamonster come to the Midlands then! :) x", "Sun Apr 21 23:29:51 ": "http://t.co/hG7xHXqkBL - This tumblr page is making me snigger repeatedly. #thomyorke #radiohead #fakequotes", "Mon Apr 22 17:09:25 ": "Dont forget guys, you can download my EP for free from here! :) http://t.co/gtAXSSdVKi xx", "Mon Apr 22 21:01:16 ": "@melissaaleks West Bromwich Albion... Gotta support the baggies as I'm drinking in a baggies pub atm haha x", "Sun Apr 21 20:35:10 ": "Right guys! Im feeling some new YouTube covers should be done soon, any suggestions? :) x", "Sun Apr 21 19:51:01 ": "@mugzylogie im glad that it helps! The song really is about not being afraid of who you are and expressing yourself rather than just being", "Mon Apr 22 18:54:32 ": "@OliverbAwsome just out and about, having some curries and beers shortly! :D you?", "Mon Apr 22 20:57:44 ": "@HeatherCounsell oh man, I'm sure it isn't!", "Sun Apr 21 20:46:25 ": "@ifyouseetaj all depends what happens on and after the show, might never get released, who knows? But 3 tracks are online :) x", "Mon Apr 22 21:44:26 ": "Can't get over how good the album \"Kid A\" is by Radiohead #bestalbumever #whydidinotlistentothisalbumyearsago xx", "Tue Apr 23 00:21:09 ": "@leonamcmullan haha love love love love, all around! :) x", "Sun Apr 21 18:41:07 ": "@Shasty_Santos ^_^ x", "Mon Apr 22 23:28:46 ": "Picked my top 21 questions... Will see you all in video form tomorrow! Xx @MitchelEmmsFans", "Mon Apr 22 14:34:17 ": "I know a lot of you are coming home from from School/College at the moment. You guys have a good day/crap day? x #mondaysucks", "Mon Apr 22 14:00:52 ": "Loving all these brilliant questions from everyone... so hard to choose favourites. Keep them coming! :) xx @MitchelEmmsFans @TeamEmms", "Tue Apr 23 00:15:16 ": "@NuttyDevil7 I look sinister in this! Haha x", "Mon Apr 22 21:23:51 ": "@tomharrydandoug I try! Haha x", "Mon Apr 22 20:57:21 ": "@YaraaYounis nooooo, I'm picking the 21 favourites tonight and then uploading a video tomorrow :) x", "Sun Apr 21 17:11:33 ": "Getting the train back from London shortly, it's been a whirlwind 7 days... will be nice to get home and work on new things for you guys! X", "Sun Apr 21 19:56:15 ": "@Script_4Life no way! Mine are Katy Song, Strawberry Hill and Have You Forgotten :)", "Sun Apr 21 20:19:29 ": "@Scriptdraker that was in my old old band who were quite classic rock. Glad to be doing more modern stuff these days :) x", "Sun Apr 21 21:23:59 ": "@BHoughton98 Thanx :)", "Mon Apr 22 09:02:51 ": "@ellescriptette Talk You Down is probably one of my favourites :) x", "Tue Apr 23 09:34:35 ": "RT @TwiztiddLette69: First exam today. Art D: So, listening to @Mitchelemms EP really helps me to relax for it :3 Gosh, I hope I don't fail…", "Sat Apr 20 20:28:26 ": "So! 2 new members on Team Danny! Yesss! Who was your favourite? :) @BBCTheVoiceUK #thevoiceuk", "Tue Apr 23 00:16:34 ": "@MitchelEmmsFans everyone's entitled to an opinion! To each their own :p :) x", "Mon Apr 22 21:08:19 ": "@tomharrydandoug I have one ready, but can't release it yet, I've got 3 tracks from it on my soundcloud free to download? :) xx", "Sun Apr 21 18:41:38 ": "@Stars_squared thank you so much Becca! X", "Mon Apr 22 09:00:40 ": "Didn't make 4000 last night, but for those who did retweet the competition, I'll be coming up with  a consolation prize :) @mitchelemms fans", "Tue Apr 23 11:33:19 ": "@chloegkennedy Fine thanks Chloe! Yourself? x", "Sun Apr 21 17:22:57 ": "RT @Andiferum: @Mitchelemms Do another acoustic cover ;)", "Sat Apr 20 20:53:57 ": "@ConnarRidd I was indeeed, why? :) x", "Mon Apr 22 11:57:58 ": "#21questionswithMitch Tweet me your questions &amp; by tonight I'll pick 21 and make a youtube video answering them all! Go! @MitchelEmmsFans xx", "Sun Apr 21 20:16:59 ": "@CloserCloser_ you can listen to my EP tracks and covers on YouTube! - http://t.co/kVWIws13le :) x", "Mon Apr 22 20:55:53 ": "@leonamcmullan haha doesn't count if it's black skinnies and a stonewash shirt ;) x", "Mon Apr 22 18:09:19 ": "@OliverbAwsome It seems I've ran out of free downloads on Bandcamp! So I've changed it so you can download the tracks free off my Soundcloud", "Mon Apr 22 20:59:10 ": "Picking my top 21 questions in a couple of hours, anyone got any more questions they need to ask? :D uploading the video tomorrow! Xx", "Sun Apr 21 19:40:12 ": "@mugzylogie really? :) what is it about the song that means so much to you? x", "Mon Apr 22 06:47:02 ": "Goodmorning everyone! Thank you new followers and all suggestions for a new cover! Hope  you all have A kickass start to the week :) x", "Sun Apr 21 20:02:50 ": "@Scriptdraker oh really? Haha amazing that you like it, what's your most/least favourite one? :) x", "Mon Apr 22 10:20:01 ": "@Bass1st @JCDkatie Fan of Alice in Chains then? :p and thanks! :)", "Mon Apr 22 22:34:40 ": "@Harley_RAWR why not! Haha :) xx", "Sun Apr 21 20:22:02 ": "@Scriptdraker im waiting for an opportunity to release my album but im already working on new stuff ^_^ x", "Mon Apr 22 08:02:52 ": "@FlarePhotos @yelyahwilliams I like your thinking! Not a paramore  fan but I did really like Decode :)", "Tue Apr 23 09:45:58 ": "@katie_pat Indeed ;)", "Sun Apr 21 18:44:04 ": "@CaoimheWatson thank youuuu!!! :) xx", "Sat Apr 20 22:36:59 ": "Heading up Big Red, holloway road, London, in a bit... if anyone of you are in the area, say hi! :) x", "Mon Apr 22 18:10:08 ": "Correction for the last tweet, you can download the EP tracks for FREE properly here! haha - http://t.co/60qDh22W5u", "Mon Apr 22 20:03:33 ": "@EmmarrFielding that's my old band :) have you listened to my new band material? :) x", "Sun Apr 21 20:23:56 ": "@Scriptdraker you have revealed my near future plans ;) haha :) x", "Sun Apr 21 20:00:20 ": "@mugzylogie I finished the album a few months ago, and only 3 tracks are available online atm so you havent missed too much! Haha x", "Sun Apr 21 14:54:09 ": "Looks like im going to be shy of 4000 followers today in order for someone to win my competition! #sad #unpopular", "Sun Apr 21 20:18:35 ": "@ImNotMoving_ you can download my EP for free if you like? :) http://t.co/vjIgqloQZc xx", "Sun Apr 21 19:47:59 ": "This album means so much to me. A very unknown album but Red House Painters are painfully beautiful. X http://t.co/6gr1vb53uK", "Sun Apr 21 20:21:04 ": "@Scriptdraker just wish I could release my album! :( legalities and whatnot while on the show etc", "Mon Apr 22 18:15:32 ": "@OliverbAwsome thanks for pointing it out dude! Much appreciated :)", "Mon Apr 22 09:02:19 ": "@ejmananquil Damn straight! :) thank you! ^_^ x", "Mon Apr 22 14:38:09 ": "@proudscriptette whaaaaaaaaaattt!!", "Mon Apr 22 10:19:09 ": "@EmmaScriptette http://t.co/vjIgqloQZc under discography  :) x"}