{"Tue Apr 16 21:37:27 ": "We travel to BRISBANE tonight to play with @chancewaters  at THE ZOO. Who's having a beer with Smizzy? Although it's 7:37am I'm pretty keen!", "Tue Apr 23 10:58:38 ": "@Sammy_MG Im sure they listen but they have trouble understanding cos they only speak Ukrainian", "Wed Apr 10 04:59:07 ": "@TurntUpRissole hahaha he had no problem with finding the 3rd mandolin button though", "Mon Apr 08 22:19:11 ": "Pulled this sucker off my dogs eye lid last night. It's a paralysis tic so fingers crossed Rascals all… http://t.co/503icjSE2b", "Mon Apr 15 05:03:03 ": "Such a good snap of Willow. Friggin hilarious! http://t.co/mPLx3vplAb", "Sat Apr 06 08:49:54 ": "Thank you Wagga for a great show, now to hit the town! I hear the bird house is poppin?", "Sun Apr 07 11:09:55 ": "This is just love!! Made me laugh so much. Best shot :) effyink http://t.co/fyCdZTp5vw", "Mon Apr 15 01:00:51 ": "First show of the @chancewatersau #infinitytour http://t.co/dnkAltVxc3", "Sun Apr 14 09:53:46 ": "Best night playing in Syd City last Friday. Brisbane, Byron and Toowoomba here we come this week! http://t.co/vQyrIfnGDV", "Thu Apr 11 09:17:03 ": "RT @homeandhosed: See this earlier? I premiered the messy new @MindOver_Matter video for 'Real Life' http://t.co/IhWEZZPyNO", "Mon Apr 22 07:28:23 ": "Fuck you Dad!! You think you're better than me cos you can spuff!?!!... When I grow up I'm gona spuff everywhere. @LukeRundle1", "Mon Apr 08 06:51:01 ": "@ElemontMusic @chancewaters we definitely plan to. Will we see you at any of the shows?", "Mon Apr 15 05:04:31 ": "Jimmy getting his make up did on the set of the Real Life video shoot http://t.co/p76CYfGCl2", "Sat Apr 06 05:16:17 ": "WAGGA WAGGA we're playing today at Bolton Park at 5:30. It's a beautiful day for it :)", "Fri Apr 05 03:58:43 ": "Quote of the day \"if you're watching porn and playing pac man then you're gona have a bit of swag to you\" - Willow", "Mon Apr 15 05:07:04 ": "RT @HCCoLab: @MindOver_Matter i heard a song of yours on the j's this a.m. had to wait in the bathroom till it ended to see who it was.  ...", "Thu Apr 04 09:50:34 ": "RT @Streamlyne: Sorry for the spam, but all $ from iTunes sales of this go to charity. Share maybe? http://t.co/Icy1XeEh8Q @JohnnyUtahAu ...", "Tue Apr 16 21:34:16 ": "RT @LukeGirgis: Looks like @chancewaters and @MindOver_Matter will be hitting Coffs Harbour on the Infinity Tour! Details at http://t.co ...", "Wed Apr 17 03:42:25 ": "@LukeGirgis I went the normal fillet. #thankthelord", "Fri Apr 05 03:59:18 ": "@JohnnyUtahAus Aww thanks babe xoxoxoxo", "Thu Apr 18 16:43:06 ": "This Way to... http://t.co/dI0FssnaKo", "Fri Apr 05 12:09:47 ": "Typical car in Wagga. http://t.co/hd5t3HBDnh", "Tue Apr 09 22:48:41 ": "Just got a mix by @CraigBauer back for a track of ours called God's Snare. So stoked!!", "Thu Apr 18 01:44:08 ": "@sevensies @chancewaters @TheTongueIsDead although chance is vegan, so maybe he'd go some sort of salad with nuts and balsamic vinigar??", "Wed Apr 10 08:44:29 ": "Keep your eye on the @homeandhosed blog. @domalessio will be premiering it!", "Thu Apr 18 01:36:46 ": "@sevensies @chancewaters @TheTongueIsDead give it a month &amp; they'll be sitting down for milkshakes. 3 months eating ribs. 2 years collab EP", "Thu Apr 04 02:30:21 ": "@eminpee @triplejplays not even kidding I just got a warm fuzzy feeling from that tweet haha I didn't think it was possible. Thanks Mary", "Sun Apr 07 03:48:55 ": "We had the coolest night in Wagga last night. Ended up jamming back at a mates place and filmed it, we'll throw it up on YouTube shortly.", "Mon Apr 15 01:08:17 ": "Haha ok. #why #notnotlovingit #theymustliketheiforgetsorrybusinessmodel… http://t.co/g17Zz2sfG0", "Mon Apr 15 00:11:13 ": "Smiles: So cos the website's down I have to pay more money to book over the phone? Tiger airways guy: Yes that's right sir. #thetigerstiffy", "Fri Apr 05 01:29:00 ": "New @blissneso House of Dreams clip check her out!! https://t.co/IH1pF79RbK", "Thu Apr 18 13:14:18 ": "@JohnnyUtahAus it's true I've killed many trespassers too to feed my family and their families and their families families and various pets", "Wed Apr 10 21:13:59 ": "Head over to the @homeandhosed blog before you head off to work this morning, our Real Life video clip is live! http://t.co/hdTCpycZyw", "Sat Apr 06 02:03:39 ": "RT @niconprojectu: Just wrapped up an interview with Willow from @MindOver_Matter - we talked about glitter and strip twister with old p ...", "Wed Apr 10 08:43:48 ": "Happy Real Life! The film clip will be out tomorrow, you guys will be able to watch it before you leave for work in the morning.", "Mon Apr 22 23:34:44 ": "Also available in white. Sizes men's and women's S-XXL http://t.co/qUsldduITT 'store' http://t.co/jd11jhrZdk", "Tue Apr 09 23:29:48 ": "I'm wearing these today.. I know, I've lost it. http://t.co/aR8LvWOiMu", "Fri Apr 19 03:17:37 ": "Banging @rufussounds and big boi on the road to toowoomba", "Fri Apr 19 02:51:17 ": "TOOWOOMBA we're playing at The Spotted Cow TONIGHT on the @chancewaters #infinitytour tickets on the door. See you soon xo", "Sat Apr 06 05:15:29 ": "@Sneeke you do have a point!!", "Fri Apr 12 23:58:42 ": "@Sacrleh of coarse!!! I was going G? G? G? Haha you've done well!!", "Tue Apr 09 00:14:59 ": "RT @ProjectUdotTV: .@mindover_matter on progression, touring with @chancewaters, collabs &amp; old people playing strip twister. #divers ...", "Wed Apr 10 22:32:31 ": "RT @Malachi_John: I was feeling sad, so I watched MoMs new video and it made me smile again... \nhttp://t.co/KEUumhel2B\n( @MindOver_Matte ...", "Mon Apr 08 04:53:32 ": "@CraigBauer @hinge_studios how's she coming?", "Thu Apr 11 23:33:28 ": "@RyanAtkinson7 I honestly just thought to myself what is something that would be a complete out of 'Real Life' experience... Strip twister!!", "Tue Apr 09 00:15:30 ": "@ProjectUdotTV @chancewaters The write up turned out great! Thanks Nic.", "Mon Apr 22 23:20:19 ": "Do you ever talk to things that aren't alive? Like when reaching for a cup at the back of the cupboard you say \"come here you son of a bitch", "Sat Apr 06 03:13:50 ": "In the studio with @rahjconkas http://t.co/bk5QqdWZk7", "Mon Apr 15 05:09:08 ": "@HCCoLab Stoked that you waited to find out who was behind it, even more stoked you then let us know!! Ultimately I'm just stoked all round", "Mon Apr 15 09:50:02 ": "Writing beats again with the big homie @JonReichardt almost done!!", "Thu Apr 04 09:49:35 ": "I wrote a verse in my head like Jay Z does apparently. Just recorded a dummy and am stoked with it. Jay might be on to something here", "Mon Apr 15 10:36:17 ": "RT @sevensies: NEW TRACK (w/ @atMrHill and @butchdaddy ) 'From Me'. Listen here: https://t.co/9zWAtPG1iT", "Mon Apr 22 22:26:06 ": "Every morning I wake up with a new song in my head. This morning it was Backstreet's Back. Great way to start the day!", "Thu Apr 11 23:35:02 ": "@RyanAtkinson7 Here she is brother https://t.co/NFcBiMl29w", "Mon Apr 15 11:43:55 ": "Life... I just rolled you up and smoked you. Half price pack of Tim Tams $2.30. Fucking owning shit.", "Mon Apr 15 01:02:09 ": "The 3 best friends that any-one-ever-had http://t.co/H5UH05PNQu", "Wed Apr 10 06:54:54 ": "Me and @LukeRundle1 just got our handy man on and soldiered a earth wire in a turn table. Year 9 DT paying off finally!", "Wed Apr 17 03:48:48 ": "Then I listened to the new J Cole EP and his Friday Night Lights mixtape. My faith in lyricism was then restored.", "Fri Apr 19 23:29:55 ": "Toowoomba really came out to play last night!! We were completely blown away!", "Mon Apr 08 06:49:17 ": "A year working on a song and i transform it completely today in 10minutes. It's amazing how things work out sometimes.", "Thu Apr 11 11:51:09 ": "Final rehearsal before the start of the @chancewatersau tour tomorrow in Sydney!!! http://t.co/jNd896qoLJ", "Mon Apr 08 22:14:57 ": "@tobinickolas thanks heaps for the kind words. I also loved the 👌symbols used they really say a lot haha", "Thu Apr 18 13:12:36 ": "RT @JohnnyUtahAus: #ScienceFactsIKnow - Smiles Again ( @mindover_matter ) is 1/3 Mongolian.", "Thu Apr 11 23:32:24 ": "RT @megansteph: Almost seen Marty from @MindOver_Matter naked ;) so life's almost complete :):) great clip boys xo", "Wed Apr 10 03:04:43 ": "Xylophone. My new toy. http://t.co/oABQ0DfDhA", "Mon Apr 15 00:28:53 ": "Our video clip is up and poppin for 'Real Life' We get our kits off with some elderly people and play twister. https://t.co/NFcBiMl29w", "Wed Apr 17 04:15:01 ": "IFS crew all getting their Red Bull deliveries. One saved me and the crews lives this morning with… http://t.co/KCDregmpLf", "Tue Apr 16 21:34:52 ": "@sevensies pleasure brother anytime!", "Tue Apr 09 04:55:55 ": "This man's name is @jonreichardt we also call him Jun Jun and Junasaurusrex. Right now this dinosaur… http://t.co/CuPFOL674E", "Thu Apr 18 16:11:06 ": "Night club pic http://t.co/IGFGUxwa3y", "Thu Apr 11 06:06:18 ": "A big thank you to Triple j's @domalessio for debuting the video clip for #reallife on the… http://t.co/x5SsPmtFmf", "Thu Apr 11 00:19:35 ": "RT @ProjectUdotTV: A lovely chat with @mindover_matter's Willow, about progression between records, glitter, and a lot of other things.  ...", "Fri Apr 12 23:57:29 ": "RT @Sacrleh: One of the best parts of the night! @MindOver_Matter @chancewaters @LukeGirgis &lt;3 http://t.co/ucxUPuO6or", "Fri Apr 19 23:37:27 ": "Check out @chancewatersau cock!! http://t.co/hmFdr3fAlA", "Sat Apr 06 04:49:41 ": "Smizzy and Ntaprize sumo off!! http://t.co/8wseJ459Y5", "Wed Apr 17 03:47:54 ": "Listened to Lil Wayne's new album today. All I got from it was that he sleeps with a lot of women and that hes quite content with his penis", "Wed Apr 17 03:43:28 ": "Listened to The Game's new album today, had some cool tracks.", "Fri Apr 12 23:55:44 ": "RT @ginarush: GO WATCH THE NEW @MindOver_Matter CLIP IF YOU LIKE FRUIT PLATTERS AND/OR NAKED TWISTER. http://t.co/TOFx1OWGA5", "Tue Apr 23 10:57:21 ": "@LukeGirgis if tweets only lasted for 5 seconds I wouldn't have been able to reply to this.", "Mon Apr 08 06:49:39 ": "RT @tobinickolas: @MindOver_Matter Real Life is a great tunes guys. 👌👌👌👌", "Mon Apr 08 04:51:39 ": "@chancewaters keys, wallet, peach ice tea, phone.. Yep ready to leave the house :) Chizzy can u call me soon as you can", "Thu Apr 18 01:48:17 ": "@sevensies @chancewaters very cheeky @TheTongueIsDead  Have to give it up though #veganjoke #classicvegangags #sorryvegans #howgoodarenuts", "Wed Apr 17 04:13:19 ": "I'm not normally one to brag but I fucking nailed this park. Shame we had to move. http://t.co/NshdtF6h8I", "Tue Apr 23 10:59:11 ": "@DoelBattleGear that's so beautiful, poetic in fact", "Fri Apr 19 02:46:53 ": "Toowoomba here we come!!   2hrs away #infinitytour http://t.co/m9EtDOvVLq", "Thu Apr 18 03:34:05 ": "SURFERS PARADISE. We're playing at the SURFERS BEER GARDEN TONIGHT with @chancewaters come &amp; have a ball cos thats exactly what you'll have", "Mon Apr 08 04:53:07 ": "If there was a guy named Gluton &amp; he went to jail briefly then was released &amp; he spoke very basic English, he'd probably say \"Gluton free\"", "Tue Apr 09 01:43:52 ": "3 days writing beats with the big homie @JonReichardt", "Mon Apr 15 00:00:29 ": "A review of last Friday's show, and one of the funniest pics I've seen of Willow - Check it out! http://t.co/52WL9Stfme", "Mon Apr 15 01:53:21 ": "The best man ever Mr, DJ ntaprize http://t.co/5bb1U9dvpt", "Sat Apr 06 02:04:13 ": "I am yet to meet a weed smoker that is willing to answer a call from a private number haha", "Fri Apr 05 12:23:14 ": "This jumper of Willow's has great colours but terrifies me. #sniperedhim http://t.co/8WLSXYWef7", "Thu Apr 18 02:00:13 ": "\"Hey dickhead\"... \"Hey Dickhead\".... \"What mum?\"", "Fri Apr 19 23:30:30 ": "@stuartshields @chancewaters far too kind!! Thanks for coming out and waving a fist!!", "Wed Apr 17 03:13:44 ": "Thinking about giving this three pepper chicken a go at subway. Wadda-ya-reckon-uh?", "Tue Apr 09 00:51:28 ": "@donjoyride hey brother whats the best email to get hold of you on? Either hit me back or email me at info@mindovermattercrew.com cheers", "Mon Apr 08 06:50:34 ": "@tobinickolas thanks heaps for the kind words. I also loved the 👌symbols used they really say a lot haha", "Wed Apr 17 04:16:28 ": "So keen to catch one of these @rufussounds tour dates. Anyone keen? http://t.co/qUFTvUdNdQ", "Thu Apr 18 01:26:32 ": "Soon as @chancewaters finished up on stage in Brizzy he played @TheTongueIsDead  album as the interim music. Chizzy is just the man.", "Fri Apr 12 23:56:23 ": "RT @LukeGirgis: Sydney getting a piece of @mindover_matter right now! http://t.co/FajobHSQOo"}