{"Thu Feb 14 15:03:22 ": "You might want to print and frame this for your valentine today. http://t.co/019XF5JB", "Sat Apr 20 00:06:44 ": "@JoeStakun just Leisure Suit Larry", "Tue Mar 26 18:53:26 ": "RT @dontkillsam: \"I love that @ThePissedJeans and R Kelly are playing @pitchforkmedia Fest\" -- @dicklaingsales", "Sat Apr 20 17:42:24 ": "Very excited to be visiting the home city of Bovine records today.", "Thu Apr 18 14:51:30 ": "RT @pitchforkmedia: Daughn Gibson announces new album, Me Moan, on @subpop. Listen to new track \"The Sound of Law\" http://t.co/3YqPC8Z5tn", "Sat Apr 20 17:35:03 ": "We are back in business and blasting King of the Road for good van karma", "Mon Apr 15 00:27:01 ": "Debut of Ninja Korvette tonight?", "Mon Mar 25 17:42:57 ": "RT @_danmcevoy: I put the pissed jeans on record dead loud and this happened  http://t.co/8dYPxVJl9f", "Sat Feb 16 15:30:56 ": "Thank you to all who came out to UA last night. Lantern &amp; Leather were great.  Sorry for our technical difficulties.", "Wed Feb 27 11:14:28 ": "RT @Dragonfly_RPh: @UltraMantis my voice was featured in a video game once. It was called custer's revenge.", "Thu Feb 28 15:11:04 ": "Last Night I had a dream I was playing basketball with @JSharkeyIII and he was hitting every three pointer.", "Fri Mar 01 02:17:56 ": "Matt talks about boots here http://t.co/dlmWoXHOmg. @thefader", "Fri Feb 15 20:09:12 ": "Spending the afternoon thinking about tonight's pre show meal from @HipCityVeg", "Thu Feb 14 22:25:52 ": "RT @JoeStakun: My Valentine's Gift to you!  https://t.co/vc8ReAf9", "Tue Feb 12 16:52:44 ": "Congrats, @JoeStakun is currently up for the VMA - \"Director with the Best Hair\" &amp; \"Director that looks most like Clay Matthews\"", "Fri Apr 19 20:48:00 ": "Our battery died in a freezing rain storm.  Maybe you're not supposed to charge 4 phones, a slow cooker, PS3 &amp; food dehydrator while driving", "Tue Feb 12 18:52:56 ": "RT @en_cohen: Hey, you can't have the pleasure of interviewing @ThePissedJeans if you're not a music writer. This was awesome. http://t. ...", "Tue Mar 26 16:46:19 ": "RT @david_j_roth: If Pissed Jeans didn't make records, I wouldn't be able to edit or write late at night.", "Wed Mar 13 14:41:31 ": "Hello, we'll be in Austin tomorrow playing ah show &amp; then relaxing in 70 degree weather.  We're mildly excited.", "Sat Feb 23 21:39:58 ": "@bwhit223 yes, we do.", "Wed Feb 20 20:10:34 ": "A day doesn't go by without us being asked-who should my favorite wrestler be? Let us help you out : http://t.co/mFDtNMyL", "Wed Feb 13 19:13:44 ": "RT @SPINReviews: SPIN Essential: PISSED JEANS' 'Honeys' is a  surprisingly thoughtful tantrum &amp; stellar heir to the noise-rock linea ...", "Tue Mar 12 04:07:57 ": "RT @theimvdb: New Video Chats! @JoeStakun talks about \"Bathroom Laughter\" by @ThePissedJeans, and getting the shot no matter what. http: ...", "Tue Feb 12 19:05:44 ": "Tonight at 9:30 pm, listen to our 5 song studio session live on http://t.co/mv1OaRux.  Here's how it looked http://t.co/IpPSpqAb", "Thu Feb 14 21:35:45 ": "RT @ericwareheim: Reset the router! Purple Skittles! Coffee Date! CJQ- Pissed Jeans - Bathroom Laughter  http://t.co/Mt6jqTwI", "Sun Mar 03 19:22:10 ": "@avalanche_edin @SubPopWorld 3 at Food Lane, 1 at  Von's Veggie Village.", "Tue Mar 05 19:41:05 ": "@Vallikatt sorry, only that show for us.  The rest of the time will be spent in hot tubs or at thrifts.", "Sat Mar 16 17:41:19 ": "RT @catscarlett: Look, I was notified you favorited my tweet and then you just unfavd it. hvae fun in ur pissed jeans with the band piss ...", "Fri Apr 05 00:05:02 ": "RT @JSharkeyIII: This Phillies team had officially reached its St. Anger period. #Philliestalk", "Thu Mar 07 03:40:55 ": "@TNWRA we are and Randy is a big fan of sandwiches. http://t.co/eVnR7DvjhZ", "Fri Feb 15 19:31:36 ": "Thank you MSN for bringing me the news http://t.co/bV13HQzM", "Wed Feb 20 22:28:27 ": "RT @thebedouin: In wk45 @Alabama_Shakes up 130% w/ 29k (426k total). @frank_ocean passes 500k in wk32 w/ 16k. @ThePissedJeans debut w/ 2197.", "Mon Feb 25 14:16:49 ": "RT @SubPopWorld: \"Honeys\" is the new LP from @ThePissedJeans and is now out today in the UK from all the usual haunts. Buy from an indie ...", "Wed Mar 06 03:28:10 ": "KDU Randall http://t.co/sX8wfQzfVl", "Mon Apr 15 18:21:52 ": "Thank you Boston for this nice drawing on the side of our van. http://t.co/WIiFHaUcvG", "Thu Feb 14 11:30:49 ": "@fwnspts nothing set yet, but we're trying", "Tue Mar 26 02:19:15 ": "RT @PurlingHiss: PHILLY record release show - Friday April 5th !!\nhttps://t.co/QhDGEhn5kp @TestosterTunes @dragcityrecords @AXIS_SOVA", "Tue Feb 19 20:10:58 ": "It's been a very sad afternoon.  My eBay search for \"NOS Gatorgum\" returned zero results", "Fri Feb 15 20:54:59 ": "@NGHTBRDS yes!!!!", "Fri Apr 19 15:27:33 ": "RT @Mudhoney_: .@ThePissedJeans will be supporting Mudhoney at the @MusicHallofWB in Brooklyn, NY on May 11. http://t.co/ofaySJoEcr", "Wed Feb 20 19:51:39 ": "RT @SPINmagazine: Meet Pissed Jeans, the band that's created 2013's most searing, searching, terrifyingly nuanced hunk of hardcore fury  ...", "Sat Apr 13 22:53:41 ": "Wondering If Raven will show up to our show in the Bowery tonight.", "Fri Mar 08 00:24:02 ": "RT @SPINmagazine: Purling Hiss spiral through space in their (well-timed) \"Mercury Retrograde\" video http://t.co/pKhlLuIa4c", "Sat Apr 13 14:01:45 ": "Joyous time in DC last night. The Black Cat knows how to pick fonts we like. http://t.co/EF3WLQQKmH", "Sat Mar 09 11:34:47 ": "Enjoy your saturday  http://t.co/uPlFHocGzc", "Tue Apr 16 01:39:43 ": "Ninja Korvette showed up at the Sinclair http://t.co/iqTkoO2pP3", "Tue Feb 12 22:18:07 ": "RT @iamkatygoodman: Best one chord song of all time goes to Pissed Jeans - Boring Girls", "Wed Apr 10 13:27:17 ": "We start a 10 day tour friday and I have nothing funny to say about it.  Details: http://t.co/gMDomTcygx.", "Wed Feb 13 23:12:17 ": "Listen to our XPN studio session right here and support XPN by donating your gas guzzler. http://t.co/pjMKX3W6", "Fri Mar 01 15:58:54 ": "RT @pitchforkmedia: Pitchfork SXSW lineup cont: Cloud Nothings, @ThePissedJeans, @Savagesband, @AutreNV, @foxygentheband, @iconapop, mor ...", "Tue Feb 12 19:33:10 ": "RT @fdnieto: Yes!!! @ThePissedJeans' Matt Korvette on why he hates Jet's \"Are You Gonna Be My Girl\" http://t.co/Ak6qgYB3  (check it out  ...", "Mon Feb 18 20:28:28 ": "RT @sluteverforever: ladies and germs, we are selling our stuff to pay our rent, introducing http://t.co/BQcUQr2P", "Wed Mar 13 15:42:07 ": "@SexyChuckieT I have a Bruise Brothers ECW shirt", "Fri Feb 15 15:13:35 ": "Come tonight to Underground Arts for an artistically underground record release w/ Lantern &amp; Leather.", "Thu Mar 14 01:35:04 ": "@chuckscumfuc well, maybe that one Vamos show and also post 2000 W*ing World Stage.", "Thu Mar 14 17:13:27 ": "On our flight to Dallas, I realized the best music for a flight is Martín Denny or the Eric Wood track from Fear of Smell.", "Fri Feb 15 16:05:18 ": "RIP Tim Dog.", "Wed Mar 13 14:43:34 ": "@chuckscumfuc hello chuck, we currently only watch 2001 to 2002 Zipang shows.  Twas their golden age", "Tue Feb 19 20:04:24 ": "RT @pitchforkmusic: Track: Purling Hiss: \"Mercury Retrograde\" http://t.co/BFIhUKko", "Mon Apr 22 05:57:24 ": "@rknLA 1 to 12 years from now", "Sun Feb 17 11:43:29 ": "@SharpCheddar856 thanks for contacting us.  We have sent this information to Matt's Manager's Assistant's Intern for review.", "Thu Apr 11 12:58:41 ": "NWO Greyskull, ya dummies. http://t.co/9cUAF4IE5E", "Tue Apr 23 15:11:49 ": "Hold on, Tour went well AND there are new episodes of Zandig's car.", "Mon Apr 01 19:36:21 ": "Happy Birthday @subpop !!  The April Fools day joke never ended!", "Tue Mar 19 00:03:26 ": "RT @JoeStakun: Youtube comments are the best! @ThePissedJeans http://t.co/GaKWpXczX0", "Sat Apr 13 22:01:50 ": "Bowery Ballroom tonight w/ Roomrunner. We're covering the rap part in that Naked Angels song in Voice of the Voiceless", "Sat Mar 02 02:54:07 ": "RT @JoeStakun: My video for @ThePissedJeans made @Videostatic's Best of February! http://t.co/XrWU1ZRIgJ", "Tue Mar 26 18:56:13 ": "It's kind strange, but we're actually playing some shows this year.", "Fri Feb 15 18:43:50 ": "Someone got to one of our demo 7\"s http://t.co/TI7IaDwA", "Fri Feb 15 14:06:00 ": "RT @tinymixtapes: Music Review: @ThePissedJeans’ “Honeys” shows growth, but is still fiercely uncommercial, ugly, and grim @SubPop http: ...", "Wed Mar 27 13:48:41 ": "RT @atpfestival: Pissed Jeans + Hookworms + Sauna Youth at London Dingwalls is on sale now! http://t.co/pmiZVdgBYq Their first London sh ...", "Fri Apr 05 13:08:50 ": "Starting to get worried we'll never find out who ran over Zandig's car.", "Wed Feb 20 20:00:55 ": "@LeeSpielman if we can figure out a way to get to Cali this year, we should play together", "Fri Mar 08 00:24:14 ": "RT @cameramangary: Ground Control To Major Tom, http://t.co/GXJSEKuWwe", "Sat Mar 16 15:26:38 ": "We're happy to say, the only music we saw at SXSW was Riff Raff.", "Fri Feb 22 15:25:24 ": "RT @selftitledmag: Read Our New Issue, F/ @METZtheband @ThePissedJeans @thebugzoo  @HETHERFORTUNE @AutreNV + Iceage + Grouper + More - h ...", "Sat Mar 16 21:42:27 ": "RT @Dragonfly_RPh: http://t.co/kxjIbtcHf7", "Wed Feb 20 20:05:45 ": "@JoeStakun next time use a 64oz Muscle Milk instead", "Wed Feb 13 02:37:18 ": "Listen to us live right now on http://t.co/7vuh344g.  It fits perfectly over the state of the union.", "Sat Apr 20 17:34:13 ": "@ackypoo oh hell yeah", "Fri Feb 22 16:27:22 ": "RT @UltraMantis: Brielle has been a loyal @chikarapro fan since day one and is a swell human to boot. So I am putting this here: http:// ...", "Fri Mar 15 21:10:13 ": "RT @UltraMantis: UMB the man returns in April. http://t.co/FTS8AHtybK  UMB the band returns in May. Now w/ more guitars for increased cr ...", "Sat Apr 20 19:56:42 ": "It's a bit shocking how vulgar the Bad4Good record is. #cooksey", "Wed Apr 03 18:39:21 ": "RT @SubPopWorld: One of those \"due to popular demand\" announcements - @ThePissedJeans are now playing the Electric Ballroom in London ht ...", "Sun Apr 14 20:49:11 ": "RT @Dragonfly_RPh: Here is a pic i just got from @ThePissedJeans...looks like they are tearing it up on their spring tour http://t.co/g3 ...", "Tue Apr 02 19:33:06 ": "RT @BlackCatDC: Friday 4/12 (NEXT WEEKEND), @ThePissedJeans and White Lung (@myszkaway)! Tix on sale now! $15 via @TktAlt_DC", "Thu Feb 21 00:35:40 ": "RT @Mudhoney_: Kurt Cobain would have been 46 today, Mark Arm turns 51 tomorrow #SeattleIcons http://t.co/vpjoBBBVDr", "Fri Apr 12 16:42:19 ": "Soon to be filled with sweaty Amps and loud dudes. http://t.co/5R41Ms6PpW", "Wed Feb 20 19:59:34 ": "@JoeStakun the trick is to switch to Gummiesavers after your 3rd bag. It will settle your stomach and then you can return to skittles", "Wed Feb 13 00:35:11 ": "@sophieradiodj @subpop @wxpn http://t.co/mv1OaRux streaming at 930.", "Sun Apr 14 23:40:56 ": "After a few nice meals, Randall is back on track. http://t.co/BDsSWckWGr", "Wed Mar 27 19:34:58 ": "@eastbayash later this year maybe possibly tentatively?", "Tue Feb 12 21:26:16 ": "RT @Dragonfly_RPh: The radio at work is playing the song from the baseball scene of Naked Gun.", "Fri Mar 01 23:11:29 ": "RT @DirectEffectHC: @ThePissedJeans http://t.co/fRVaUzevoe", "Tue Apr 02 18:44:45 ": "@UltraMantis is it true that wrestlecon is now featuring Rich Oliver?", "Wed Mar 20 13:28:21 ": "Hey, we're playing some shows in April. Look here http://t.co/DgqfMv1AVs", "Sat Apr 20 02:57:52 ": "Minneapolis, we are incredibly sorry to miss the show tonight.  Our van is dead.  We tried all we could.", "Tue Mar 26 15:12:51 ": "RT @SubPopWorld: Hello Tuesday @ThePissedJeans are playing in Leeds and London in July. There won't be better news than that today! #bee ...", "Fri Mar 01 01:45:46 ": "Outtakes.  Happy Randall. http://t.co/67D9IApGAs", "Sat Mar 16 17:46:40 ": "this is what we would look like if matt was not in the band. http://t.co/gFPXgNTuMw"}