{"Tue Dec 18 02:00:16 ": "New show announced in Baltimore, MD at Gaylord National Hotel and Convention Center on January 19, 2013 http://t.co/aLXEcDCZ", "Tue Apr 16 21:01:09 ": "6 new shows announced! http://t.co/H4B75nxivV", "Wed Dec 19 19:02:01 ": "Playing a show in Grapevine, TX at 7:00 PM today at Love and War in Texas http://t.co/SsoTL6Mw", "Sun Dec 09 01:00:04 ": "Playing a show in Los Angeles, CA at 11:30 PM today at The Mint http://t.co/zOyPHAYV", "Thu Apr 04 17:01:32 ": "Playing a show in Alpine, TX at 6:00 PM today at Viva Big Bend Food Festival http://t.co/DddeuIGpgg", "Fri Nov 30 18:40:04 ": "Putting on the One Woman Show in ASHLAND, VA tonight @ 8pm! I've got lots of copies of \"Free\" so you can get all your stocking stuffers :)", "Tue Oct 09 02:55:04 ": "Is it dorky to be this excited about my record being on ITunes in 2 hrs?!? By the way...there is a SURPRISE track on the digital album :)", "Fri Mar 15 19:04:38 ": "Playing a show in Conroe, TX at 8:00 PM today at Dosey Doe Music Cafe http://t.co/NkWQAHmiyz", "Tue Jan 15 22:01:44 ": "5 new shows announced! http://t.co/BN4Qn3C3", "Sun Dec 02 15:45:05 ": "Got an 11 hour drive home today - from PA to Nashville, going through Akron and Columbus...anything special I should stop to EAT or see??", "Wed Oct 24 19:05:11 ": "After burning the candle at both ends for three months, my body finally got sick and I've been sleeping for two days. Feelin good now!", "Sat Nov 17 19:00:56 ": "Playing a show in Goshen, IN at 8:00 PM today at Ignition Garage http://t.co/4eO6jTIG", "Tue Nov 06 03:00:14 ": "\"Free\" moved nearly 20 spots this week on the Americana chart and is now resting nicely at #31! Only 30 more spots to get to the top :)", "Sun Dec 09 22:00:29 ": "Playing a show in Las Vegas, NV at 8:00 PM today at National Finals Rodeo http://t.co/Z0oxRJFr", "Fri Dec 14 21:20:05 ": "My heart goes out to the parents and families of the victims of today's tragedy in Connecticut. PRAY for our country, America. Now.", "Wed Apr 03 17:00:40 ": "Playing a show in Houston, TX at 6:50 PM today at The Foodie Train to Viva Big Bend Food Festival! http://t.co/LvaAEBuCe6", "Wed Jan 30 21:00:34 ": "4 new shows announced! http://t.co/BN4Qn3C3", "Thu Dec 13 22:30:09 ": "Sorry to announce the Central Market class for this Friday has been cancelled - we will reschedule for the Spring! Sorry about this!", "Mon Dec 10 20:00:57 ": "Playing a show in La Quinta, CA at 8:00 PM today at Private Party http://t.co/aupIHzjq", "Wed Mar 20 22:20:04 ": "Heading to Shoreline Church for an encore performance at tonight's women's mixer - looking forward to singing for all you beautiful ladies!", "Wed Nov 28 18:01:22 ": "Playing a show in Knoxville, TN at 7:00 PM today at Preservation Pub http://t.co/aQlL4WfR", "Tue Nov 27 18:00:50 ": "New show announced in Charleston, WV at Mountain Stage Radio Show on February 3, 2013 http://t.co/LgTUZUMr", "Thu Jan 03 23:02:11 ": "New shows announced in Austin, TX - Houston, TX - Durango, CO http://t.co/BN4Qn3C3", "Sat Mar 16 00:00:06 ": "Playing a show in Austin, TX at 1:00 AM today at Saxon Pub http://t.co/2d1uHeeG4b", "Tue Dec 04 00:00:54 ": "4 new shows announced! http://t.co/BN4Qn3C3", "Tue Oct 09 18:01:55 ": "Playing a show in Nashville, TN at 7:00 PM today at Third and Lindsley Bar http://t.co/ZpVSl0rf", "Fri Mar 01 22:01:05 ": "New show announced in New Braunfels, TX at Gruene Hall on March 22, 2013 http://t.co/4J3nTkHe5k", "Tue Oct 16 15:25:10 ": "PUMPED about this week's shows w/Lee Roy Parnell - I've got a STAR in my band!! Austin Thursday, Plano Friday, Conroe Saturday - be there!", "Sat Oct 13 17:04:36 ": "Playing a show in San Antonio, TX at 6:15 PM today at San Antonio Botanic Gardens http://t.co/T74Ekc2G", "Wed Oct 24 21:01:34 ": "New show announced in San Diego, CA at Private Party on December 6, 2012 http://t.co/wMIsorxx", "Fri Feb 15 17:00:15 ": "New shows announced in Austin, TX - New Braunfels, TX http://t.co/BN4Qn3C3", "Tue Dec 18 10:00:52 ": "Posts from Ascentia Test for 12/18/2012 - http://t.co/y6fTXt9O", "Wed Dec 12 18:35:05 ": "Amazing Cali tour, maybe best tour ever. Now headed to Houston for the KILT Ten Man Jam...I am representing the NON-Man part of the Jam.", "Thu Oct 18 19:01:36 ": "Playing a show in Austin, TX at 8:30 PM today at Saxon Pub http://t.co/6tZhAFRh", "Tue Jan 15 23:10:14 ": "I've got post-cruise blues!! Been bed-ridden with the flu since we landed in Nashville - glad I got all the fun outta my system LAST WEEK!!", "Wed Feb 13 19:01:14 ": "Playing a show in Nashville, TN at 7:00 PM today at Music City Roots Live From The Loveless Cafe http://t.co/lHMgOYn0", "Fri Nov 30 19:06:45 ": "Playing a show in Ashland, VA at 8:00 PM today at Ashland Coffee and Tea http://t.co/x0WPNcr3", "Fri Apr 05 17:02:56 ": "Playing a show in Alpine, TX at 6:00 PM today at Viva Big Bend Food Festival http://t.co/BNtNkux5AS", "Fri Nov 16 20:02:02 ": "Playing a show in Louisville, KY at 9:00 PM today at Headliner's Music Hall http://t.co/vQ0pRszF", "Fri Mar 01 21:01:20 ": "New show announced in Bridgeport, CT at Two Boots of Bridgeport on May 5, 2013 http://t.co/BuyzWAe4On", "Fri Jan 25 21:07:30 ": "Playing a show in Austin, TX at 9:00 PM today at Saxon Pub http://t.co/5OKjcetH", "Tue Apr 23 19:01:07 ": "New show announced in Brooklyn, NY at The Weigh Station on May 4, 2013 http://t.co/sUAJrjV7Xe", "Fri Oct 19 19:35:08 ": "Amazing first show with LRP last night - gonna kill it again TONIGHT at the Courtyard Theater in Plano. Showtime 8 pm, y'all come on!", "Sat Jan 05 19:00:15 ": "Playing a show in Grand Turk  at 8:00 PM today at Delbert McClinton Sandy Beaches Cruise!!! http://t.co/2Gw2WeQW", "Sun Feb 10 21:01:11 ": "Playing a show in Fort Collins, CO at 8:00 PM today at Avogadro's Number http://t.co/47Bbe3cY", "Sat Nov 03 19:20:05 ": "Dawgs and Aggies: All are welcome to join us for great live music and food TONIGHT @ The Veranda in Starkville @ 10 after the LSU/Bama game", "Fri Mar 29 17:01:03 ": "Playing a show in Decatur, GA at 7:00 PM today at Eddie's Attic http://t.co/y98I2h0EKK", "Sun Feb 17 20:01:21 ": "Playing a show in Yukon, OK at 8:00 PM today at Grady's 66 Pub http://t.co/58NpuNtk", "Mon Mar 04 18:00:05 ": "Playing a show in Highland Heights, KY at 7:00 PM today at Studio 89 http://t.co/zQuCmFifFo", "Fri Nov 16 11:00:17 ": "Playing a show in Louisville, KY at 12:00 PM today at WFPK 91.9fm Studios http://t.co/SvHzOE6Z", "Sat Dec 01 19:02:31 ": "Playing a show in Lock Haven, PA at 7:30 PM today at Avenue 209 Coffeehouse http://t.co/vhyZOlgX", "Thu Feb 28 00:00:53 ": "New show announced in Boston, MA at Johnny D's Uptown Restaurant on May 7, 2013 http://t.co/eyuI5VxLts", "Tue Oct 09 15:25:06 ": "Happy CD release day!! \"Free\" is now available on ITunes, along with a special bonus track - get it, enjoy, and hope ya Love!", "Fri Apr 12 09:00:07 ": "Playing a show in Dubai  at 7:00 PM today at Island Jam http://t.co/QiocbVT7m3", "Wed Jan 23 19:00:51 ": "New shows announced in Evergreen, CO - Fort Collins, CO http://t.co/BN4Qn3C3", "Wed Nov 28 17:10:11 ": "Headed to KNOXVILLE to play WFIV's weekly series at Preservation Pub tonight! Show will be LIVE on air from 7-8pm, but I may play longer...", "Thu Mar 07 19:00:42 ": "Playing a show in Athens, GA at 8:00 PM today at The Melting Point http://t.co/nxe6L38ekc", "Sat Dec 01 20:25:03 ": "Cruisin north along the Susquehanna River to Lock Haven for a show tonight - had no idea Pennsylvannia was so BEAUTIFUL!", "Fri Feb 08 18:03:04 ": "Playing a show in Evergreen, CO at 5:00 PM today at Little Bear Saloon http://t.co/7hLXE6j4", "Wed Oct 10 19:10:05 ": "What an amazing night! Thank y'all for celebrating with us :) Next up: I'll be solo this Saturday at San Antonio Botanical Gardens @ 6:15!", "Tue Oct 30 19:01:28 ": "Playing a show in Nashville, NY at 8:00 PM today at Third &amp; Lindsley http://t.co/5eqovJDC", "Mon Dec 24 15:50:05 ": "Merry Christmas world! May the joy of God's Love and mercy be the gift that fills your soul this season!", "Sat Oct 20 19:35:04 ": "Looking forward to another great night of laugher and music with LRP and the band TONIGHT at Dosey Doe's new Music Cafe in Conroe!! 8:30pm!", "Tue Nov 06 03:00:10 ": "\"Free\" moved almost 20 spins this week on the Americana Charts and is now comfortably resting at #31! Only 30 more to get to the top :)", "Sat Dec 29 20:00:54 ": "Playing a show in Johnson City, TX at 8:00 PM today at Private Party http://t.co/KKV5uM0R", "Sat Jan 19 17:01:19 ": "Playing a show in Baltimore, MD at 6:00 PM today at Gaylord National Hotel and Convention Center http://t.co/aLXEcDCZ", "Sat Jan 26 16:01:20 ": "Playing a show in Luckenbach, TX at 4:00 PM today at Luckenbach Blues Festival http://t.co/iuoCSu6F", "Thu Dec 06 20:02:54 ": "Playing a show in San Diego, CA at 8:00 PM today at Private Party http://t.co/wMIsorxx", "Sun Jan 27 18:00:17 ": "Playing a show in Houston, TX at 6:00 PM today at McGonigel's Mucky Duck http://t.co/NP7hM1FM", "Fri Mar 22 18:07:01 ": "Playing a show in New Braunfels, TX at 7:30 PM today at Gruene Hall http://t.co/4J3nTkHe5k", "Fri Oct 12 12:00:13 ": "New shows announced in Starkville, MS - Louisville, KY - Goshen, IN http://t.co/BN4Qn3C3", "Sun Dec 09 10:00:55 ": "Posts from Ascentia Test for 12/09/2012 - http://t.co/n3DqAQhC", "Mon Dec 17 01:45:06 ": "New York Times just named \"Not Cause I Wanted To\" the #1 song of 2012!! Thanks to Bonnie Raitt for her amazing performance - I'm honored!", "Mon Oct 29 18:00:06 ": "Just picked up a last minute show opening for Tony Lucca at Third &amp; Lindsley tomorrow night! I'll be solo, showtime 8pm sharp :)", "Fri Oct 12 11:10:05 ": "I boarded a plane in the pouring rain...didn't give a damn about anything! Headed to Austin to celebrate with great music and Mexican food!", "Fri Dec 07 18:01:52 ": "Playing a show in Julian, CA at 6:00 PM today at Wynola Red Barn http://t.co/C2ly4qMS", "Sun Oct 21 13:01:20 ": "Playing a show in Houston, TX at 2:00 PM today at KPFT 90.1 http://t.co/Xnqz7eMu", "Sat Apr 06 17:01:08 ": "Playing a show in Alpine, TX at 6:00 PM today at Viva Big Bend Food Festival http://t.co/jpv0DJk3RS", "Sun Jan 20 18:01:43 ": "Playing a show in Nashville, TN at 6:00 PM today at Louie's Kids Resolution Dinner http://t.co/ulV9U06A", "Sun Apr 07 22:00:23 ": "New show announced in Richmond, VA at House Concert on April 28, 2013 http://t.co/tU22Iquz3d", "Sat Feb 16 20:00:14 ": "Playing a show in Waco, TX at 8:00 PM today at Extraco Events Center http://t.co/HnAp6kSe", "Tue Oct 30 19:00:46 ": "New show announced in Nashville, NY at Third &amp; Lindsley on October 30, 2012 http://t.co/5eqovJDC", "Thu Oct 18 14:10:04 ": "TONIGHT!! Bonnie Bishop &amp; Lee Roy Parnell with The Modern Day Prophets LIVE at SAXON PUB @ 8:30PM in Austin, Texas - be there!!", "Sat Oct 20 19:00:45 ": "Playing a show in Conroe, TX at 8:30 PM today at Dosey Doe Music Cafe http://t.co/CcWLxGGb", "Wed Feb 20 23:00:56 ": "New shows announced in College Station, TX - Washington, DC - New York City, NY http://t.co/H4B75nxivV", "Fri Oct 19 19:01:30 ": "Playing a show in Plano, TX at 8:00 PM today at Courtyard Theater http://t.co/aytI0cNP", "Sat Nov 17 15:10:03 ": "Listening to Tift Merritt's \"Travelin' Alone\" and doing just that across the plains of Indiana", "Fri Nov 30 13:00:07 ": "I'm having breakfast on-air with WNRN Charlottesville @ 9am if ya wanna tune in! Gonna find a yoga class in town after that...need2stretch!", "Tue Jan 15 23:00:54 ": "New show announced in Dubai at Island Jam on April 12, 2013 http://t.co/oXJoTbZh", "Sun Feb 03 15:00:17 ": "Playing a show in Charleston, WV at 4:00 PM today at Mountain Stage Radio Show http://t.co/LgTUZUMr", "Tue Oct 16 16:00:19 ": "New shows announced in Waco, TX - Nashville, TN http://t.co/BN4Qn3C3", "Wed Dec 05 18:00:30 ": "Playing a show in Nashville, TN at 6:00 PM today at Woodland Street Revival http://t.co/uPQLbRD2", "Sat Nov 03 21:05:42 ": "Playing a show in Starkville, MS at 10:00 PM today at The Veranda http://t.co/nYw5QRLF", "Wed Oct 24 22:00:13 ": "New show announced in Julian, CA at Wynola Red Barn on December 7, 2012 http://t.co/C2ly4qMS", "Sat Dec 15 10:00:50 ": "Posts from Ascentia Test for 12/15/2012 - http://t.co/93nrsBZ7", "Thu Feb 07 19:02:16 ": "Playing a show in Durango, CO at 7:00 PM today at Strater Theater http://t.co/4AYBTD5z", "Fri Jan 04 00:00:04 ": "New show announced in The Woodlands, TX at Dosey Doe's on July 19, 2013 http://t.co/4iW6YErs", "Thu Mar 21 22:00:09 ": "5 new shows announced! http://t.co/H4B75nxivV", "Thu Nov 15 16:00:41 ": "6 new shows announced! http://t.co/BN4Qn3C3", "Fri Nov 16 13:10:05 ": "Headed to Louisville, KY for WFPKs Live Lunch today! Later tonight opening for Clayton Anderson at Headliner's - no speeding tix today :)"}