{"Wed Apr 03 21:31:08 ": "Hot Topic heard all you guys out there! Get your HT exclusive shirt here:… http://t.co/7y3aAeL8il", "Sun Apr 07 03:42:12 ": "RT @RelapseSymphony: Burn this city down... http://t.co/zS4nuoyBAm", "Fri Apr 05 20:17:11 ": "RT @Edgar_Allan_Poe: Without art there is no humanity.", "Fri Apr 12 01:45:17 ": "@BretVonDehl look at dat azz!", "Sat Apr 20 04:47:37 ": "Got some work done on Alex's car now time to drink and kill some zombies with @AlexFoxx13", "Sun Mar 24 19:24:41 ": "RT @MindBlowing: 86% of people use music as an escape from all the negative things in their life!", "Fri Apr 05 20:23:51 ": "\"Make Your Move\" http://t.co/RYyZbwktUQ", "Sat Mar 23 17:34:49 ": "Do you have your copy yet?! Get it on iTunes: https://t.co/xPeUlLvYR4 … OR Amazon: http://t.co/yC547VgTB9 … NOW! RT  http://t.co/Vpj1uXmswU", "Sun Mar 31 02:36:38 ": "Had a great time at practice with the guys today! Cant wait to see everything unfold this year  #Relapse2013", "Wed Apr 03 20:16:06 ": "RT @JCCharles8: Life is too short and we all have way too much on our own plates to waste time being negative. Fuck drama be happy.", "Sat Mar 23 17:34:14 ": "You demanded that @HotTopic carry our merch, and they listened! http://t.co/Qzh2EK6Mmb … http://t.co/icamjVaRjI  RT!", "Fri Mar 29 16:14:52 ": "RT @UberFacts: The brain waves of two musicians synchronize when they are performing a duet.", "Wed Apr 10 14:06:41 ": "Have you seen our music video for our song Panic! (Times Running Out)? If not check it out here!: http://t.co/4j52agkufb", "Tue Mar 26 20:08:43 ": "RT @DepressedDarth: Beer is the path to the fun side.", "Sun Apr 07 19:45:03 ": "New \"Wrong Side of the Tracks Just Always Felt Like Home\" shirt now available at MerchNOW! http://t.co/K4tRsN5lCs http://t.co/zx6vcep4Xv", "Sat Apr 06 22:43:16 ": "Did you hear our friends over at Hot Topic are having a HUGE sale? Take advantage and pick up one of… http://t.co/cv7lK7sK7i", "Sun Mar 31 02:44:08 ": "RT @MiniMee1996: @AlexFoxx13, @JCCharles8, @BretVonDehl, @brandonkilexxx, and @TylerGloyd are taking over the world. Glad I'm a @Relapse ...", "Fri Apr 05 22:54:50 ": "@moskriah sleep is for the weak :P", "Sun Apr 14 06:39:47 ": "RT @AlexFoxx13: Rooftop chilling https://t.co/rUnHmAFial", "Tue Mar 26 20:04:22 ": "RT @UberFacts: Hugh Hefner (Founder of Playboy) and George W. Bush are cousins.", "Sat Apr 06 04:29:28 ": "@BretVonDehl I was so bummed dude it looks so sick!", "Tue Apr 16 14:55:26 ": "RT Check out our music video for our song Panic! (Time's Running Out) please share! &lt;3 http://t.co/4j52agkufb", "Mon Mar 25 04:03:04 ": "RT @TheIlluminati: Be grateful for the things in your past that no one can take from you, not just sorry for the things you are unable t ...", "Mon Mar 25 04:06:25 ": "RT @UberFacts: October 4th is National Vodka Day and celebrates “the water of life.”", "Sun Apr 14 20:16:48 ": "@KatieFLAGALine helloooo!", "Sun Apr 14 20:16:31 ": "@Careless_Puppet do what makes you happy if you like them then thats all that matters :) dont let someone else influence your decisions", "Sun Mar 24 22:59:09 ": "Ode to Solitude http://t.co/02w4kuQPXy", "Tue Apr 09 21:02:52 ": "Have you seen our music video for \"Panic\" yet? If not check it out and let us know what you think about it! http://t.co/4j52agkufb", "Tue Mar 26 20:00:57 ": "RT @RelapseSymphony: How many of you have ordered our limited edition, exclusive @hottopic shirt?? http://t.co/ywAK16N8lH", "Fri Apr 05 17:39:19 ": "RT @Gregglz_Read97: @TylerGloyd this crazy guy plays drums for this Insane band called @RelapseSymphony follow him and his band:D please ...", "Sun Mar 24 16:52:19 ": "Want TRS merch in your hot topic? Every purchase is a vote to get us in the store!… http://t.co/B44bkWnHWs", "Sat Apr 06 00:40:04 ": "Trashed and Scattered http://t.co/u3PPu4zVm9", "Sun Apr 21 23:13:24 ": "Be sure to buy our debut EP \"Time's Running Out\" get it here: http://t.co/NDKuWjxNbu http://t.co/ZTdCHojZXc", "Sun Mar 24 03:43:20 ": "\"Hallucination Generation\" bitchtits77 http://t.co/3GN2lnrGoM", "Sun Mar 24 19:30:52 ": "RT @DyingVixen: Not gonna lie, @TylerGloyd is on my top #10 list of drummers &lt;3", "Tue Apr 02 04:34:35 ": "RT @RelapseSymphony: Bret Von Dehl - Vlog #2 is now live! Be sure to share, like, comment, and subscribe! &lt;3\nhttp://t.co/pkiTe5tz9G", "Sun Apr 07 06:23:10 ": "@Juliejohphoto it was so sick dude! Rob zombies new movie lords of salem looks fucking gnarly as hell too!", "Sun Mar 24 17:00:37 ": "RT @ashleymevans12: @TylerGloyd settin up last weekend http://t.co/o1JDszRBqZ", "Wed Apr 03 00:32:59 ": "Love is the ultimate outlaw it just wont adhere to any rules. The most any of us can do is sign on as its accomplice", "Sun Mar 24 17:00:06 ": "@ashleymevans12 nice meeting you too! Thanks for coming out", "Fri Apr 05 17:41:06 ": "RT @jkroyston: When you're born for art, you'll die for art. If you weren't, don't pretend to understand.", "Fri Apr 05 01:29:29 ": "Have you check out our new \"Guys\" Hot Topic exclusive tshirt yet? Get yours here: http://t.co/iSqpwFnzQm", "Sat Apr 20 05:08:50 ": "@urstrulykelsey miss ya too girl! Lol you never want to hang out with me anymore GOD!!! Hahaha", "Tue Mar 26 20:01:59 ": "RT @UberFacts: Memories can be strong enough to invoke the exact emotions a person felt when the experience originally happened.", "Tue Mar 26 02:30:59 ": "Want TRS merch in your hot topic? Every purchase is a vote to get us in the store!… http://t.co/B44bkWnHWs", "Sun Apr 14 20:11:45 ": "@ClaudiaBlergh Thank you! &lt;3", "Sat Mar 30 02:38:15 ": "Bout to make some bad choices with my boys @MSG_kSHAN and twitterless Mikey its going to be a goodnight!", "Tue Apr 16 02:10:19 ": "Have you seen our music video for song \"Panic! (Time's Running Out\") yet? Check it out here:… http://t.co/mcTmAioJXQ", "Thu Apr 11 03:38:51 ": "@ZeeIsKing bands like motley crue guns n roses the ramones etc.", "Sun Mar 31 02:39:14 ": "RT @JCCharles8: Today was awesome. Band practice and beer with my best friends. Living the dream!", "Mon Mar 25 20:32:24 ": "RT @KFUCKINGP: Throw a middle finger up right this damn second.", "Wed Apr 17 22:34:08 ": "@bvbfangirl98 happy birthday!!!", "Sun Mar 24 19:29:35 ": "RT @RelapseSymphony: Have you heard the news?? http://t.co/bTxY3Lqgmf", "Mon Mar 25 04:03:45 ": "RT @UberFacts: People who stay up later at night are likely to be more intelligent than those who go to bed early.", "Fri Apr 05 01:46:22 ": "\"Scream The Panic\" http://t.co/t1oUy1r1VQ", "Thu Apr 18 22:11:43 ": "@rebel_freak2 Thank you! &lt;3 dont let people like that get under your skin they are not even worth your time", "Tue Apr 09 21:21:26 ": "Hey @SJCdrums check out me representing my SJC kit in @RelapseSymphony new music video for our song \"Panic!\" http://t.co/4j52agkufb", "Mon Mar 25 20:31:06 ": "RT @UberFacts: Intelligent children are more likely to consume alcohol and binge drink as adults than less intelligent children.", "Fri Apr 05 17:46:38 ": "@kelseycox_xo Stoked to hear you like the EP! Saw the lyrics you tweeted :)", "Wed Apr 10 22:53:07 ": "Vote for us for Best International Newcomer in the Kerrang awards 2013 http://t.co/v5tlTd7fy1 http://t.co/fOoJoEtkQR", "Sun Mar 31 21:57:50 ": "Happy easter to all you Rebels out there!", "Sun Apr 14 20:05:44 ": "RT! Have you seen our music video for \"Panic! (Times Running Out) yet? Check it out here: http://t.co/PYFRqu5Jdt", "Sun Apr 14 06:41:06 ": "RT @AlexFoxx13: Cats don't like Tyler :( https://t.co/ytpz6fNOK3", "Fri Mar 29 16:14:39 ": "RT @DepressedDarth: North Korea is aiming rockets at the U.S. Don't worry America, the Empire is aiming the Death Star's laser at North  ...", "Fri Apr 05 17:47:21 ": "RT @TheIlluminati: There is no passion to be found playing small - in settling for a life that is less than the one you are capable of l ...", "Sun Mar 31 02:38:00 ": "RT @AlexFoxx13: Most bands say their happy playing in a band with their best friends. The one I'm in is more then that. We're brothers n ...", "Fri Apr 12 01:31:19 ": "@BretVonDehl im to drunk to be tweeting this shit lol", "Fri Apr 05 20:06:53 ": "#FF @streetsmartmngt @_machalahh_3 @moskriah @trevdawg333 @kelseycox_xo @AmandaPandaFoxx @Juliejohphoto", "Sat Apr 06 04:24:28 ": "Evil Dead was sold out..... FUCKKKK!!!", "Thu Apr 18 22:16:17 ": "@rebel_freak2 &lt;3", "Fri Mar 29 20:20:47 ": "RT @SheaCeleste: My chemical romance should do a farewell tour", "Sat Apr 06 04:43:37 ": "@BretVonDehl Right? lol", "Fri Mar 29 16:13:27 ": "RT @DepressedDarth: Kim Jong-un needs to be force choked.", "Fri Apr 05 19:59:31 ": "#FF My brothers in arms @BretVonDehl @AlexFoxx13 @JCCharles8 @brandonkilexxx @RelapseSymphony", "Sun Mar 24 19:22:04 ": "RT @UberFacts: \"Whiskey\" is a Gaelic word and means \"water of life.\"", "Wed Apr 03 23:14:43 ": "Also dont forget about our girls Hot Topic exclusive shirt! Get yours here: http://t.co/BZK5Kv97rl http://t.co/F3KGpYniPt", "Mon Apr 08 22:08:50 ": "RT @1stCitizenKane: America's desire to police the world and spread liberal capitalist democracy to all the corners of Earth is precisel ...", "Sat Apr 06 04:33:29 ": "@BretVonDehl Me too! I NEED to see it man haha", "Tue Mar 26 16:17:00 ": "RT @UberFacts: The band Creed once put on a such a bad show that a $1,800,000.00 class action lawsuit was filed on behalf of all the fan ...", "Wed Mar 20 23:15:00 ": "RT @XxEverleneXx: One of my new FAVORITE drummers @TylerGloyd He's pure awesomeness! Cx (/.\\)", "Tue Mar 26 11:52:25 ": "RT @UberFacts: Listening to music is one of the few activities that uses the entirety of the human brain.", "Thu Mar 28 00:26:12 ": "Every purchase of our shirt is a vote to get us in the store! http://t.co/yZDKbUnczw", "Sun Mar 24 19:30:07 ": "RT @UberFacts: Listening to music for an hour every day can reduce chronic pain by up to 21% and depression by up to 25%", "Sun Mar 24 19:27:27 ": "RT @UberFacts: In England, a failed suicide attempt used to be illegal and was punishable by death.", "Fri Apr 05 20:17:48 ": "RT @RelapseSymphony: Hot Topic just released a NEW @RelapseSymphony shirt! Check it out HERE: https://t.co/nJHqbUT173", "Mon Mar 25 04:07:35 ": "RT @BretVonDehl: I'm doing a live chat on Tuesday at 5pm EST! You should stop by and hang with me! \nhttp://t.co/j63hGYjzbr", "Sun Apr 07 19:50:51 ": "@KirstieTRS Im honored! Thank you!", "Fri Apr 05 20:18:14 ": "RT @standbyrecords: The Relapse Symphony - Panic (Time's Running Out!) http://t.co/zaXXhr6b8B", "Mon Apr 08 12:01:31 ": "So rad to see our shirt make it into some of the Hot Topic stores! Thank you Hot Topic and all you… http://t.co/nQ5MaHPxCQ", "Sun Apr 07 03:37:36 ": "Finaly seeing Evil Dead tonight! So fucking stoked!", "Fri Mar 29 16:14:13 ": "RT @RelapseSymphony: Tell the AP Readers Chart that your current favorite album is \"Time's Running Out\" and you could end up in print! h ...", "Sat Mar 23 17:33:54 ": "Want a phone call from us or a ONE OF A KIND sketch by @BretVonDehl? Here's your chance! http://t.co/eY9kPzIAbO ….… http://t.co/VzlZTOY2iC", "Tue Mar 26 20:06:42 ": "RT @BretVonDehl: Don't forget to stop by and chat with me on YouNow tonight at 5pm EST! \nhttp://t.co/j63hGYjzbr", "Fri Apr 05 20:16:46 ": "RT @standbyrecords: Have you picked up The Relapse Symphony's new EP? Its on sale for only $4.95 on iTunes! http://t.co/uKyWC9A7a9", "Mon Mar 25 20:32:52 ": "RT @UberFacts: Falling in love produces the same type of high as doing cocaine.", "Fri Mar 29 03:04:35 ": "No better feeling than being on stage with my brothers @jccharles8 http://t.co/yVRmJj2e64", "Fri Apr 12 17:16:39 ": "Make sure you check out our brand new music video for Panic! (Times Running Out) please share &amp; like it on youtube &lt;3 http://t.co/4j52agkufb", "Fri Apr 05 17:39:45 ": "RT @LipsofaFllnAngl: #FF @TylerGloyd Because he kills the drums. Literally.", "Wed Apr 03 20:15:42 ": "RT @UberFacts: Jägermeister was originally intended to be a cough medicine.", "Wed Apr 17 22:37:10 ": "Can we get \"Panic\" to 20,000 views? Post it on all of your social media sites, and spread the word! Let's do this! \nhttp://t.co/PYFRqu5Jdt"}