{"Fri Mar 01 16:28:05 ": "We'll be in Raleigh this year!! Steve Dilling is having a HUGE party at his house!!! (He just doesn't know it... http://t.co/suppbjnUve", "Fri Mar 29 15:57:43 ": "Thanks to everyone for our #1! http://t.co/HY58kEzwO9", "Tue Apr 23 15:10:33 ": "Check out the amazing lineup of talent for this year's Graves' Mountain Lodge, Inc. Festival! We're very proud to... http://t.co/a9xtkz8SJQ", "Thu Jan 24 19:31:01 ": "This Saturday in Ft. Payne, AL: http://t.co/zKeLuL8F", "Thu Jan 17 21:10:50 ": "Can you guess where Eli Johnston and Laura Tate Ridge are? Wherever it is, they obviously have GREAT taste in... http://t.co/IyKn6KNK", "Sun Jan 20 22:05:39 ": "RT @ThisBe_Jordan: I'll be honest, I get quite giddy inside when @iiirdtymeout tweets me.", "Sun Mar 03 15:26:50 ": "Had a wonderful show at Austin Auditorium in Wingate, NC last night!! Thanks to everyone for your support to this great cause!", "Sat Jan 26 00:47:19 ": "“@DanMason8: @iiirdtymeout  I tried to get your new CD at Cracker Barrell in Morehead,KY today, and it was sold out .” Sold out is good!! :)", "Sat Jan 26 00:45:22 ": "“@everydayjustjen: @iiirdtymeout listening to the new cd once a day keeps the blues away #goodmusic #homeremedy” Thats what we like to hear!", "Thu Mar 07 03:33:03 ": "RT @SyntaxMusic: Congrats to @BalsamRange @DarinandBrookeA @iiirdtymeout on their @iTunesMusic Feature! http://t.co/3XqQ9D3VWL", "Tue Apr 09 20:35:10 ": "@Travistritt Hey there! We're honored to have you following us!! In a Twitter kind of way! Ha!", "Fri Mar 01 02:42:13 ": "“@theroysonline: Looking forward to sharing the stage with y'all this Friday in Waldo FL @iiirdtymeout” Us, too! Should be a fun gig!", "Wed Mar 20 16:28:22 ": "Thanks to Ted Lehmann for covering this great new festival and our part of it! http://t.co/Ag7G8OibQT", "Sun Feb 17 01:42:15 ": "“@OBX12SOUTH: @iiirdtymeout will you guys be playing songs from Timeless Hits at the festivals this summer?” Absolutely!!", "Wed Apr 24 02:51:44 ": "RT @ThisBe_Jordan: If @iiirdtymeout and George Strait would come to West Virginia or even near there soon, it would be greatly appreciated.…", "Mon Mar 11 15:45:22 ": "Hey everybody!! Cracker Barrel Old Country Store is rolling out some new music today from Steven Curtis Chapman... http://t.co/lxDB1VTdU0", "Tue Mar 12 15:48:04 ": "Hey Everybody!! Wayne Benson and our good friend Alan Bibey have a new CD available today! Check it out! http://t.co/WxZ3AotRTa", "Sun Feb 17 01:41:47 ": "RT @richelecole: Early bird tix are on sale for @ShenRiverFest w/ @iiirdtymeout @LonesomeRiverB @HackensawBoys @thewoodshedders &amp; mo ...", "Sun Feb 17 01:39:13 ": "RT @wamubluegrass: PHOTO: @iiirdtymeout performing @wamubluegrass last weekend. http://t.co/uh6Ze7Ci", "Sun Jan 20 22:02:30 ": "“@ThisBe_Jordan: @iiirdtymeout is really improving my day, immensely.”Wow!  That's really good to hear!! :-)", "Thu Feb 28 03:19:12 ": "After a big meal at Cracker Barrel Old Country Store, we're going to be performing at the Dixieland Music Park... http://t.co/uoMDpE0ShC", "Mon Mar 11 13:39:13 ": "RT @KarlThomassen: No i will get @iiirdtymeout new cd at @CrackerBarrel", "Sun Jan 20 22:05:03 ": "“@DanMason8: @iiirdtymeout played a great show at Meadowgreen Park today. http://t.co/429laIP5” Thanks!!", "Sat Mar 02 21:26:57 ": "At the Austin Auditorium @ Wingate University in North Carolina! WOOHOOOO!!", "Sun Jan 20 22:01:32 ": "RT @CrackerBarrel: Russell Moore &amp; @iiirdtymeout's CD proves timeless as it debuts no. 1 on @billboard Top Current Bluegrass Albums  ...", "Mon Jan 28 17:38:22 ": "“@ericageans: @iiirdtymeout my dad got me your new cd at cracker barrell said it was last one! I love it!” Thanks!!", "Fri Feb 08 16:54:10 ": "Well folks! We are overwhelmed with our 4th week at #1 on Billboard with \"Timeless Hits From The Past... http://t.co/Calsr4rN", "Fri Jan 18 13:43:24 ": "We'll be at the Boones Creek Cracker Barrel in Johnson City, TN today 12-1pm EST! Stop by and say hello, won't ya?", "Sun Jan 20 03:14:58 ": "We're on Crook &amp; Chase tonight in the CW. That's channel 58 if you are in the Nashville area. 9-10pm CST", "Sun Mar 03 17:17:02 ": "Just heard about the passing of my friend Alvin Breeden! Rest easy Alvin..I'll remember the good times we had and the laughs we share!", "Wed Feb 20 01:53:37 ": "Hey Everybody! Our show in Appomattox, VA on February 17th was cancelled due to bad weather and has been... http://t.co/1OGhHK3b", "Thu Mar 07 03:32:02 ": "“@ickimmel: @iiirdtymeout Hope you get better soon, Russell!!” Thanks!", "Tue Apr 09 20:37:01 ": "“@ThisBe_Jordan: #proudtobeafanof @iiirdtymeout , obviously!!! ❤” :-)", "Tue Apr 09 20:36:41 ": "@austybrown98 Thanks for the compliment!", "Tue Feb 19 00:57:06 ": "RT @heathpeek: @iiirdtymeout on stage at #BFC at Crown Plaza. http://t.co/i53tv3sk", "Fri Feb 08 17:53:07 ": "Here's an interview with Yallwire during release week of \"Timeless Hits From The Past Bluegrassed\" in Nashville... http://t.co/EFUgOCf6", "Fri Feb 01 14:45:01 ": "Tonight we'll be at the Stuarts Opry House! But first, we'll be at the Zainesville, OH Cracker Barrel for a Meet... http://t.co/JBp2ISqC", "Mon Jan 28 23:08:07 ": "Russell will visit live with WBRF DJ Judith Burnette on Tuesday, 1/29 at 8:15pm EST. Listen here: http://t.co/TIl2mfmg", "Sun Mar 03 15:30:42 ": "One of the prettiest days I've seen in a long time here at Appomattox, VA high school!! Show starts at 1:00 p.m. Come join us!!", "Tue Jan 15 22:47:24 ": "Thanks to Shannon Turner of Bluegrass Today for the article! We had a great visit with her! http://t.co/bl2GS7Of", "Tue Jan 15 02:50:44 ": "@JessicaNorthey Thanks for the chat!! It's been fun! #cmchat", "Sun Feb 03 04:05:55 ": "Visiting with Inside Music Row about \"Timeless Hits From The Past Bluegrassed\" -... http://t.co/jREW7TOF", "Thu Feb 28 00:38:52 ": "Thanks!! “@MusicCityRoots: @iiirdtymeout Congrats guys!”", "Wed Mar 20 17:53:29 ": "Make plans now to join us at the Nothin' Fancy Bluegrass Festival this year! It's always a great time!! http://t.co/ryn0WmUSmh", "Mon Mar 11 21:35:00 ": "We're excited to be part of this great festival this weekend! Y'all come be with us! http://t.co/lLeQDQtEhD", "Mon Mar 11 13:39:21 ": "RT @k3nnyThom: @KarlThomassen @iiirdtymeout @crackerbarrel How convenient", "Thu Mar 07 03:32:23 ": "Thanks!! “@tamairaash: @iiirdtymeout Get well soon Russell!”", "Fri Jan 18 15:51:49 ": "We've got a #1 CD on Billboard!!! Thanks to everyone for supporting us and \"Timeless Hits From The Past... http://t.co/4sRX4pyj", "Thu Feb 28 03:14:26 ": "We'll be at the Cracker Barrel Old Country Store in Gainesville, FL on Friday! Will you? http://t.co/HMxaZ0wLsW", "Thu Jan 17 01:15:34 ": "Thanks to Billboard Magazine for the feature on us! http://t.co/3wfFOJRz", "Mon Feb 25 18:49:24 ": "Wow! We're back at #1 on Billboard! So cool!... http://t.co/roaFZbLtpe", "Fri Mar 01 18:59:58 ": "We had a great time last weekend at the Years Of Farming show in Flemingsburg, KY! Thanks to everyone for coming... http://t.co/xRfKfyGgav", "Mon Mar 11 13:39:37 ": "RT @Slowburnballoon: FINALLY picked up the @iiirdtymeout CD at Cracker Barrel tonight. Awesome! Love Benson's mandolin pickin! #Bluegrass", "Sat Mar 16 17:48:44 ": "Me and my little buddy, Isaac Moore! http://t.co/JckIeyQeIA", "Mon Feb 18 16:39:45 ": "We just want to say a great big THANK YOU to everyone who came out to the shows this past weekend, for your... http://t.co/zps4fAcC", "Tue Jan 15 02:51:50 ": "@JessicaNorthey Our website at http://t.co/rDqS79FA and check us out on Facebook, too - http://t.co/nsu3ikJb #cmchat", "Fri Apr 05 14:19:48 ": "We'll be in Florida this weekend! Who's coming? http://t.co/BNmxTb7bmu", "Thu Feb 28 00:38:25 ": "RT @RileyAnn001: I kind of just want to stay home and listen to @iiirdtymeout 's new album I picked up at Cracker Barrel last night. #samjam", "Sat Jan 26 00:46:18 ": "“@RedistaNville: @CrackerBarrel @iiirdtymeout @billboard Of course it did! It's IIIrd Tyme Out!!! :)” Thanks, Shay!!", "Mon Mar 11 13:39:48 ": "RT @xoxosteph16: Roadtrip home from VA with @simeonjesse listening to @iiirdtymeout  #bluegrassed", "Thu Mar 28 13:59:37 ": "We're going to enjoy a weekend off and spend Easter with our families! Hoping for warm, sunny weather! What will you be doing??", "Wed Mar 20 19:50:32 ": "Join us on March 27th for Crazy Chucky's Classic Country Corner! Read all about it here! http://t.co/1jklqzg220", "Tue Jan 15 02:47:37 ": "@JessicaNorthey Thanks for the support-looking forward to seeing everyone in the new year! Don't forget to get our new CD at @CrackerBarrel", "Fri Mar 08 17:21:22 ": "#1 again! That's 7 out of 8 weeks!! So Excited! We've heard from several of you that the CD seems to be sold-out... http://t.co/HVQN7HFGoq", "Wed Apr 24 02:52:05 ": "Thanks!! “@inbodyd: @iiirdtymeout Great gospel show this morning on the Campground Stage @ Old Settler's Music Festival,  Driftwood, TX”", "Wed Feb 13 13:25:45 ": "Tune in to WAMU's Bluegrass Country at 9am ET to catch us as we perform a few and visit with Katy Daley!... http://t.co/ZbM8AImh", "Sun Apr 14 20:39:49 ": "“@juliaannband: @iiirdtymeout #JohnAndMary is now officially in my wedding plans! Tyler said that's the only thing he truly wants!\" Awesome!", "Fri Apr 19 16:25:25 ": "We're very happy to be playing Graves Mountain this year!! Today is the last day to get a significant discount on... http://t.co/HNE7hiv0bx", "Tue Apr 09 20:36:18 ": "“@bluegrassamanda: Me and @iiirdtymeout pretty awesome day yesterday. Sad to see it end. http://t.co/5bjnHs8Jwm” Love it-Thanks for sharing!", "Fri Mar 01 02:42:38 ": "RT @wamubluegrass: VIDEO: @iiirdtymeout perform \"Take Me Home, Country Roads\" in the studios of @wamubluegrass. @CrackerBarrel https://t ...", "Fri Feb 08 16:53:58 ": "Well folks! We are overwhelmed with our 4th week at #1 on Billboard with \"Timeless Hits From The Past... http://t.co/swnhtQaw", "Fri Apr 19 05:31:19 ": "RT @sallygapfest: Oh, and did we mention... @LonesomeRiverB and @iiirdtymeout on Saturday night? We hope to see lots of you at Sally Gap ...", "Wed Feb 27 15:09:20 ": "Here's a video performance from our recent visit to WAMU Bluegrass Country.... http://t.co/ySWJVzrlVI", "Wed Mar 06 18:25:19 ": "We think its a great day for some fiddle music!! Check out Justen Haynes from our recent visit to WAMU's... http://t.co/Bo8NlaBBEo", "Tue Feb 26 18:51:49 ": "Here's a little article written about a recent visit we made to Cracker Barrel Old Country Store. http://t.co/3HuPkVIJwk", "Mon Jan 28 17:38:04 ": "“@AaronMHolley: @iiirdtymeout Listening to \"Carolina's Arms\" as I sit here in snowy WV-One of my favorite bluegrass songs! Powerful! Thanks!", "Fri Mar 01 18:35:54 ": "Hey everybody!! Our show in Appomattox, VA that was rescheduled due to weather, is THIS SUNDAY!! Come be with... http://t.co/a6MMNrleFJ", "Mon Jan 28 17:39:24 ": "“@RobertGandy: Saw your show in Fort Payne last night, loved it. We always look forward to seeing you when we can. New CD is great.” Thanks!", "Thu Jan 24 19:34:47 ": "Thanks to Walter Tunis for this great review of our show in Kentucky last week! \"Russell Moore and IIIrd Tyme Out... http://t.co/Xg3KUrAZ", "Fri Feb 01 14:55:14 ": "\"Timeless Hits From The Past Bluegrassed\" is #1 for the 3rd week in a row on Billboard!! Thanks to everyone for... http://t.co/q2HcLaDJ", "Tue Feb 12 17:18:45 ": "We're going to be on The Katy Daley Show tomorrow at 9am EST - WAMU's Bluegrass Country. Read all about it here... http://t.co/oNxQVcEu", "Sun Feb 17 01:41:19 ": "“@_the_rock: Listening to @iiirdtymeout in class.” Is that allowed? Ha!", "Tue Mar 05 17:03:26 ": "Hey Everybody!! Here's a report on where we are right now. I've sure missed singing but I really do appreciate... http://t.co/4FDrFPoeA8", "Wed Jan 30 01:03:43 ": "Hey everybody!! The interview on WBRF with Judith Burnette has been rescheduled for Thursday night at 8:15pm EST.... http://t.co/0B0Amvjj", "Wed Jan 16 14:17:02 ": "RT @JessicaNorthey: Thank you so much to Russell Moore &amp; @iiirdtymeout for kicking serious #Bluegrass tonight AND making great music ...", "Tue Jan 15 02:45:17 ": "@JessicaNorthey Q11 Yes, hopefully we'll get back in the studio this Spring and we're touring a lot and playing new venues in 2013! #cmchat", "Fri Feb 08 02:36:37 ": "RT @CrackerBarrel: Check out the new @yallwire @stephnthecity interview w/\n@iiirdtymeout from their @crackerbarrel #stationinn #wsm show ...", "Wed Feb 20 18:43:29 ": "We're looking forward to being on the road this weekend with shows at Pennyroyal Opera House in OH, Mountaineer... http://t.co/iD7m9zZE", "Fri Feb 15 16:01:53 ": "Check out this review on CMT Edge:... http://t.co/ErNXYXS7", "Sun Feb 24 13:39:45 ": "We're at \"Years of Farming\" today in Flemingsburg, KY. Hope y'all can join us! http://t.co/yEph6vHH6x. http://t.co/VASF4zbCmZ", "Thu Feb 28 03:14:42 ": "We'll be at the Cracker Barrel Old Country Store in Gainesville, FL on Friday! Will you? http://t.co/zD2cwBmuov", "Tue Mar 12 18:37:20 ": "Our condolences to Edgar Loudermilk on the passing of his Papa. Please keep Edgar and his family in your prayers.", "Thu Mar 07 13:43:00 ": "Thanks to everyone for a wonderful day in Appomattox, VA last Sunday!!  Special thanks to Tony, Jay and all @ the boosters! GREAT TIME!!!", "Sun Jan 20 20:36:49 ": "We'll be performing at the Dekalb Theatre this coming Saturday! Hope you can join us!! http://t.co/OsxPLcoR", "Thu Jan 31 19:08:52 ": "RT @woubarts: Award winning group @iiirdtymeout joins Athens County's Hart Brothers for evening of bluegrass @stuartsoh http://t.co/ExUdRsCN", "Thu Mar 14 17:46:55 ": "Our Track By Track with Kyle Cantrell will re-air this week on SiriusXM Bluegrass Junction. Listen to \"Timeless... http://t.co/YecqrcLsgx", "Fri Mar 29 16:21:03 ": "Congratulations to Russell Moore &amp; IIIrd Tyme Out for their #1 Song - \"Gentle On My Mind\" - on Bluegrass Today!!... http://t.co/B1aYkZ52ff", "Wed Apr 24 02:52:34 ": "Lol!! We're already missing it! “@inbodyd: @iiirdtymeout and @whataburger what a team!”", "Wed Apr 10 01:33:22 ": "RT @Loxmama: Road trip with the sunroof open and music loud,@iiirdtymeout @merlehaggard @DwightYoakam and the late great Tammy Wynette.  ...", "Mon Apr 01 18:44:50 ": "Check out our feature Q&amp;A in this month's Central Texas Bluegrass Association newsletter! http://t.co/2O4EemsLzF"}