{"Sat Apr 20 11:04:37 ": "in Oslo this wednsday!! Going to be a big one!! http://t.co/UlluhynIg8", "Fri Apr 12 09:56:27 ": "Istanbulbound!!", "Wed Dec 05 15:34:54 ": "OK!! so finally! Here is the Footsteps EP on Supernature!!!! Check it here!! http://t.co/sZ1xDsD1", "Fri Jan 11 13:15:28 ": "Coming out on limited edition purple vinyl on Monday!\n\nhttp://t.co/o5fSEcOq http://t.co/YbaYs46I", "Mon Nov 19 22:47:56 ": "Change of plans! No rest tomorrow! feature night for osloklubbcast Turkish delight!! Stikk innom og ta en kald en... http://t.co/w6qk1NA9", "Mon Mar 04 02:13:58 ": "Bye Bye Mexico! Thats it for this time! I had an amazing time here and i REALLY hope i get to come back. Although... http://t.co/kPXYUbwdzs", "Sun Mar 10 15:27:45 ": "Bye Bye Scotland!! Had an amazing time! Even played the afterparty!! Thanks to Sandy an Chan for taking care of me!!", "Sat Mar 02 17:37:13 ": "Waaaaaow!! Mexico City! What a party!! One of the best! Can't wait to see What Playa Del Carmen Has to offer!!", "Fri Apr 05 21:18:07 ": "Thanks Pete Tong! http://t.co/0aUPw4TDTC", "Thu Dec 13 23:04:24 ": "New little mix... some deepnes and some down tempo.. http://t.co/S2DXgbaY", "Thu Mar 21 03:08:04 ": "Lots of options right now for the upcoming free track... you guys want to hear an edit or an original track?", "Sat Feb 16 12:27:10 ": "Really pleased to announce a summer residency Sankeys Ibiza this year!  Thanks to David Vincent for making it happen! http://t.co/IJtMtwEP", "Sat Mar 09 10:32:27 ": "Btw!! Free track in the pipeline! What i love about the free tracks is that i am free to whatever i want. So... http://t.co/mIGO1Oiqy0", "Tue Mar 26 13:42:07 ": "Out NOW on Underground Audio - \"Show Me How\" featuring vocals from Natalie Conway!... http://t.co/mtnSYRE9mT", "Tue Feb 26 21:57:31 ": "Sankeys Ibiza... http://t.co/lWZsmdmaPp", "Fri Dec 07 21:58:13 ": "Have you checked out the video for Footsteps? The track is out now too!\n\nhttp://t.co/g2ZKhFH7 http://t.co/kxazzt88", "Thu Feb 28 14:43:50 ": "\"Show me How\" is available to buy on vinyl now on Underground Audio! Grab your copies before they go!... http://t.co/denS27Vp5Q", "Sun Dec 09 20:51:33 ": "Thank you Bulgaria and Romania!! Amazing gigs both places! It got kinda hectic when i missed my flight from sofia... http://t.co/CMrhUset", "Sat Feb 16 12:09:09 ": "Ok Oslo Peeps! This is for my norwegian friends and fans so this one is going to be in norwegian.\n\nI dag spiller... http://t.co/h4Sx9Fo1", "Mon Dec 17 23:30:43 ": "Now up to #83\n\nhttp://t.co/2Lbh0D3k http://t.co/7HZUhKuq", "Fri Jan 18 22:20:17 ": "Now &gt;&gt;&gt; http://t.co/n4dRUVVQ", "Sun Apr 21 15:00:09 ": "Wow!!! Holland!! What country... Every gig i do there nowadays is just Amazing! Super proffesional and the crowds... http://t.co/qB0J15loIe", "Sat Dec 22 11:24:57 ": "Tonight im off to Hamburg and Mein Ego!! Im so excited about tonight and from what i hear hamburg really know... http://t.co/1705mMhe", "Sun Jan 13 15:33:00 ": "Takk til alle som var på the villa i går!! Noe av det feteste jeg har vært med på!! Var en ny låt inni der et... http://t.co/nieeZ4ht", "Thu Nov 22 16:22:29 ": "Last night of voting! Give me a vote and i'll love you forever! http://t.co/z2B52kNl http://t.co/deNJkuNO", "Tue Mar 19 20:44:28 ": "Win tickets to Love System Festival! http://t.co/ZbUdcjG0pA", "Wed Feb 27 02:01:17 ": "Goodnight people! In a few a hours im going to mexico for the first time which i am super excited about!! I have... http://t.co/IDGsCjaJgJ", "Thu Nov 22 10:40:33 ": "Some feedback on the upcoming release on Supernature:\n\nMihai Popoviciu – “Sweet Music”\n\nDen Ishu - “So pure - LOVE... http://t.co/cH8tOfyn", "Sat Mar 30 15:39:35 ": "Ok... due to some logisticks trouble i wont be able to play live today. Full dj set insted. My bag was sent... http://t.co/wejm7O5qLF", "Tue Apr 02 22:37:37 ": "My Remix for Sascha Breamer on Still Vor Talent is now out on Beatport!! http://t.co/wY24iD4cfE", "Sat Dec 29 15:30:07 ": "A little christmas edit coming up on soundcloud later!!", "Sat Jan 05 18:06:48 ": "Tonight its Hive Club in Zürich!! Heard so much about that place! Cant wait to go play there! Back to Oslo for SundayRoast@Jaeger on sunday!", "Thu Jan 17 01:24:49 ": "Original Track featuring the very talented Natalie Conway is finally done! Finally the guitar is back in the mix!... http://t.co/zbK3X37J", "Thu Mar 21 21:31:26 ": "Released on digital on Monday 25th March on Underground Audio!... http://t.co/7vDctREG5z", "Tue Nov 20 13:36:31 ": "Would mean the world to me if you gave me a vote! I couldnt think of a better way to finish the year than to be in... http://t.co/YKSaRWDH", "Mon Mar 25 15:23:55 ": "WAOW!! Just hit a million plays on Soundcloud. Thanks to everyone who has listened to a track or left a comment... http://t.co/OLZIJ6RDN5", "Sat Feb 16 12:23:29 ": "This summer I will be spending my time playing a 14 date residency in Sankeys Ibiza!!! http://t.co/fLVsuARg", "Fri Apr 19 21:23:26 ": "Show me how is on BBC Radio 1 now!... http://t.co/UqMHEBywG1", "Fri Feb 08 13:25:40 ": "Live recording from Amsterdam on 30th December:\n\nhttps://t.co/2QFiPjwF http://t.co/hN5uoKUg", "Mon Jan 14 11:51:26 ": "Latest remix for AFFKT is available on Beatport now!... http://t.co/KdwHa3h7", "Sat Apr 06 13:38:03 ": "Oh my... No words!! Sixx Club is by faaaaaar my favourite place to play in Greece. Thank you for an Amazing... http://t.co/NWMSRt1yLU", "Thu Dec 13 14:29:00 ": "For all those asking....You're not cool enough is out now on Beatport!... http://t.co/ekUSJFtV", "Sun Feb 03 13:48:19 ": "Coming soon on Underground Audio on wax!\n\nhttp://t.co/FlLEcaVx http://t.co/ywl03Fn1", "Tue Jan 01 20:47:18 ": "Utrecht tonight!!", "Thu Mar 28 19:15:10 ": "Limbo @ South, Manchester tonight!", "Sun Dec 30 17:37:17 ": "Cant to play tonight in Amsterdam! Amazing line up with many of my favourite artists!! Including to guys from... http://t.co/5XL6sNtg", "Wed Jan 02 09:16:04 ": "Latest Mix still at #10 on Beatport mixes\n\nGrab it here: http://t.co/UeKXCLj4 http://t.co/t6P7KGmO", "Tue Jan 22 21:55:30 ": "Love System Festival! http://t.co/WNjPLHQu", "Tue Apr 16 13:49:25 ": "On thursday you can find me playin in oslo with my boys Celius and Kåhå!! http://t.co/PtYUVujSFI", "Fri Nov 23 06:21:09 ": "Bye bye Cairo! Thank you for a wonderful party! Especially Joe and Tamer! Everyone was very friendly and very... http://t.co/ci0S5SXH", "Tue Mar 26 03:32:55 ": "Edit up any moment.", "Sat Apr 20 15:46:30 ": "Eric Prydz charting my remix of Sascha Braemer! http://t.co/7rm7g02D3x", "Thu Jan 31 21:26:40 ": "Tonight Im back in Leeds!! It ended up being one of the absolute best gigs for me last year, and i hope tonight... http://t.co/cj6QHKYS", "Wed Apr 10 08:41:34 ": "this i right on the money.... sooo good. norwegian comedy yo!! http://t.co/em2MabXuOn", "Tue Mar 26 06:12:02 ": "James Blake - Retrograde (Finn Pilly Edit) http://t.co/BUQZC1Tder", "Mon Apr 08 19:34:44 ": "Thanks Thess for an amazing night! Even though it was early and raining, i had lots of fun! Hopefully i'll be back later this summer!", "Tue Jan 29 14:20:52 ": "CITYLIGHTS!! Love this!! http://t.co/6RXRAy52", "Fri Dec 07 16:15:46 ": "Ok! After helping a friend 6 a clock this morning cause a pipe bursted from the cold in an apartment across from... http://t.co/EXbYkKOV", "Thu Jan 17 20:30:25 ": "Tonight im playing in oslo!! At BLÅ!! And btw.. here is a preview of my new track! http://t.co/ERVoSbE5", "Tue Feb 19 18:48:21 ": "Vinyl out next week on Underground Audio!... http://t.co/qemO7bW4", "Wed Mar 06 00:18:34 ": "Ableton 9!!!!!!", "Sun Dec 23 15:27:55 ": "Wåååå!! Hamburg was incredible! Exactly the kind of club i like! Small, intimate and a BANGIN soundsystem! Thanks... http://t.co/bhScvueX", "Tue Jan 29 14:10:54 ": "Check out my new deep house baby! Jungle grooves! http://t.co/mMJB6fWb", "Thu Apr 04 17:07:08 ": "Set from DGTL festival this saturday! My favourite gig so far this year! http://t.co/7K8IbYi6hf", "Sun Feb 03 09:40:18 ": "WOW!! Once again two of my favourite places to play is absolutly amazing!! Leeds; you are a propper music city and... http://t.co/DVHhs8i5", "Tue Apr 09 12:09:16 ": "WOW!! Sascha Braemer remix up to no. 14 in the deep house charts today!! Thank you all! if you havent heard it...... http://t.co/5uTpQI8jCh", "Fri Mar 22 18:15:37 ": "Something is happening on my soundcloud right now,.. might be a track... I might have upgraded my account so there... http://t.co/P0pSxWurs7", "Sat Feb 09 23:04:53 ": "Amsterdam tonight!!", "Mon Dec 03 18:07:35 ": "Set i did couple of weeks ago in oslo! Check it here: \n\nhttp://t.co/LfLLfq1H http://t.co/vwfaT80D", "Fri Jan 25 19:37:23 ": "Tonight i am playing at Dattera til Hagen in Oslo!!", "Sat Feb 02 04:35:37 ": "Bucharestbound!", "Tue Feb 12 13:33:59 ": "Thursday - Port, Klaipeda\n\nhttps://t.co/LZgRH8qa http://t.co/rmqLUv9L", "Fri Mar 01 15:43:49 ": "Thank you Merida! Great Time!  Mexico City Tonight!", "Thu Nov 29 11:27:48 ": "If you only knew is out on vinyl now! Grab your copy here:\n\nhttp://t.co/YIedzMGY http://t.co/WdqQLQmc", "Mon Mar 04 21:06:38 ": "New interview with Data Transmission!\n\nhttp://t.co/GcuhLIx7AA http://t.co/L895qgwQ9f", "Thu Apr 18 08:21:43 ": "Really excited to be a part of Croatia's Love System Festival next month - hope to see you there! Check it out... http://t.co/uwahdD3cmU", "Mon Dec 31 16:58:59 ": "Tonight im in Rotterdam with Adana Twins &amp; Doctor Dru!", "Fri Jan 18 16:44:59 ": "Cologne tonight! New tracks for those who show up!", "Fri Apr 05 07:53:52 ": "Dixon &lt;3 http://t.co/yhQePVdOfV", "Thu Mar 28 06:45:26 ": "Ok! So after a couple weeks in the studio im finally ready for some gigs! Today i am playing in Manchester! So if... http://t.co/MYUT1FrXWg", "Sun Apr 07 07:56:56 ": "Remix for sascha braemer is now at #36 in the deep house chart!... http://t.co/fuJLmKL3LI", "Sun Dec 16 22:19:48 ": "You're not cool enough already in the deep house top 100...... http://t.co/kxQd5q2T", "Thu Nov 22 03:19:37 ": "Ok.. so for personal reasons i have to stay in norway next week when i was supposed to go to mexico. I will... http://t.co/RmDnQ95v", "Fri Mar 01 21:45:45 ": "Daniel Bortz dropped this gem last time in oslo! Whos ready for it?? http://t.co/qsl5dWgk0P", "Fri Jan 18 05:30:44 ": "Free track for you guys! Thank you so much! 30 000!! im beyond words. Hope you like it! http://t.co/N1y1SvyP", "Tue Mar 05 20:36:36 ": "If you havent read it. here my interview with datatransmission. I talk about my inspirations (old and new),... http://t.co/1htHkuE60Y", "Fri Dec 28 10:37:58 ": "Today is my 25 birthday and i have just learned that i have a track in both Top 10 Nu Disco Tracks of the year an... http://t.co/l8PjHuUu", "Sun Apr 07 08:34:05 ": "Thank you Kozani!! Great night!! Last stop in greece today in Thess! OPA!!!!!!", "Fri Mar 22 18:22:11 ": "Here it is... new original... Edit to follow! Hope you like it. http://t.co/q92QbNvlin", "Fri Mar 01 16:14:44 ": "Just found out my new harddrive is fucked... awesome considering i have a gig tonight and tomorrow!! So.... i... http://t.co/sdK3eT8hfv", "Tue Dec 18 16:02:03 ": "Merry xmas Peeps!! http://t.co/kS3Rp4QL", "Fri Feb 01 06:40:55 ": "What a legend this guys is! The inspiration to the FANTISTIC track from Todd Terje, \"Inspector Norse\"..... Norway... http://t.co/pNgRm4aD", "Wed Jan 30 23:48:03 ": "Beatport mix is back up in the top 10!\n\nGrab it here:\n\nhttp://t.co/UeKXCLj4 http://t.co/SleR5DOr", "Sat Mar 30 12:58:12 ": "If you missed it - \"Show Me How\" is out now on Underground Audio - available on Beatport here:... http://t.co/CqGokOdr1i", "Thu Dec 20 15:19:14 ": "Do you think \"Touching Me\" was your track of the year? Vote here:... http://t.co/itZoY44E", "Mon Mar 04 02:28:47 ": "Some of you may have heard this tracks lately. Its a new production coming out later this year. http://t.co/wMsHHPzjWb", "Wed Nov 28 19:58:18 ": "Here is my edit of Blueboy's \"Remember Me\"! Coming on limited vinyl only on The House of Disco!! Check it here!... http://t.co/s0nCgTlP", "Sat Jan 26 15:10:23 ": "Due to health issues i wont be able to make it to Club Port today. I wish i could go, and this is the first time... http://t.co/HxtWLkwL", "Fri Mar 29 14:15:34 ": "Paris tonight. Le Batofar.", "Tue Mar 26 06:51:38 ": "Goodnight! http://t.co/zB3syO6av0"}