{"Tue Mar 05 15:44:00 ": "Tales of A GrassWidow out May 27 in Europe, May 28 in US! Pre-order info coming soon...in the meantime, here's... http://t.co/9Fhis8kNzU", "Wed Nov 14 20:02:02 ": "a picture from our recent NYC show http://t.co/pVwiVHc3", "Fri Jun 15 02:02:18 ": "It's called Daisy Chain\nat Cheim and Read. \nB http://t.co/233KZ9yD", "Sat Jan 19 03:25:25 ": "@JesseHazelip Hey Twin River, What are you making lately?", "Sat Jul 14 22:32:36 ": "just played Zurich. We swam in the lake. A lovely summer day.", "Mon Jan 21 04:08:51 ": "on another note, one more musical, can't wait to get out new record out!", "Sat Aug 18 21:45:21 ": "tour is over, starting to work on music for Peter Pan play, dreaming of new projects and adventures...", "Mon Jan 21 04:07:20 ": "i found this definition(http://t.co/uwRqPEkf )quite pleasing and can't imagine most people I know to not agree with every part of it.", "Sat Aug 18 21:55:31 ": "RT @FutureFeminists: FREE PUSSY RIOT http://t.co/voOJDqr4", "Sat Mar 23 10:41:41 ": "WHERE IS AMINA?!\n“quarantined” and stoned to death before she starts “an epidemic.", "Thu Nov 01 16:11:03 ": "check out this very timely PSA\nhttp://t.co/OMaZiswO!", "Tue Oct 09 15:30:55 ": "TONIGHT http://t.co/3yIShI0E", "Sat Jul 14 22:36:03 ": "http://t.co/GtCADUC9", "Thu Feb 07 23:49:09 ": "I feel very hopeful that Lama's story will create monumental change.", "Sat Aug 18 22:28:05 ": "http://t.co/VhTF9YtN", "Mon May 14 14:14:01 ": "Sunday poem by Bianca Casady for Jean-Marc Ruellan's show in Krems: http://t.co/Vkuf99l3 See the rest of the work here: http://t.co/yna634zu", "Mon May 14 14:15:41 ": "A poem I wrote for Jean-Marc Ruellan's photography show called \"Sunday\", in Krems\nps\nyou can see the photo... http://t.co/dtJJ0G1p", "Mon Oct 15 18:08:22 ": "hey, i said it before, but if you are not following futurefeminists, i would if i were you. its about to get really interesting", "Wed Nov 14 20:07:40 ": "working on our new record. Hope to be putting it out late spring.", "Tue Feb 05 17:14:56 ": "RT @FutureFeminists: \"every day in Saudi Arabia is a holocaust for women\"", "Sat Aug 18 21:55:03 ": "FREE PUSSY RIOT!!!!", "Tue Feb 05 01:17:53 ": "Have you heard the next Dalai Lama is a girl? #AnaLama", "Wed Jul 04 05:10:10 ": "packing up the wigs and hairnets", "Sat Nov 10 18:26:28 ": "CocoRosie headlines the Tinderbox Music Fest (NYC) tomorrow Sun 11/11 !! http://t.co/TkBoOnXD", "Fri Jun 15 14:32:47 ": "Here is a lil poem about Cinder-Ella by BC. This past years writing has been much about prison, servitude and solitude. http://t.co/S0NGIMz0", "Wed Jul 04 05:10:37 ": "victorian butch", "Fri Nov 02 15:13:06 ": "Philly (11/7), DC (11/8), NYC (11/11) shows next week will be the last US dates this year.  Hope you can make it out.", "Sat Aug 25 23:41:25 ": "http://t.co/f8YrGMA5.", "Sun Oct 14 23:27:31 ": "working on Peter Pan, a project with Robert Wilson. Also gonna play east coast soon.\nIf you are in europe, look out for Diane Cluck. My fave", "Tue Feb 05 15:50:30 ": "Come follow us on Twitter...we'll be announcing some exciting news very soon... http://t.co/4wyZFiTu", "Wed Jul 11 17:50:08 ": "about to rock rainy Tilburg", "Sat Mar 23 10:47:30 ": "just finished several long days of speaking with the press..it was great, challenging and invigorating. Discovered a new sense of compassion", "Wed Feb 13 14:54:57 ": "A song called Gravediggress from our new record is floating around online if you want to check it out.", "Thu Nov 08 14:11:15 ": "German TV program documents CocoRosie and will be streamable online worldwide for 7 days starting Friday. Here's a... http://t.co/grBTpCR2", "Tue Nov 06 15:52:32 ": "http://t.co/ARx91Ubj", "Tue Feb 05 17:39:59 ": "just came across this image of Leiomy and Rebecca from NightShift, the dance I directed last year. http://t.co/bG3grFTm", "Tue Oct 23 13:41:52 ": "One more last minute date: Philly on Nov 7th. http://t.co/va6SOTe4", "Sat Jan 19 03:08:53 ": "Long time no Tweet. We have been mud wrestling in Hawaii for our new video.", "Sat Mar 23 10:49:21 ": "this got me thinking..how can you separate femininity and feminism?", "Thu Jul 26 13:34:48 ": "here's a link to some stuff about my art show back in nyc if anyone is interested.\nhttp://t.co/GqgHVkEh", "Wed Feb 06 22:16:11 ": "RT @Farah_Khalil1: Crowds took to the streets in rage over the stupid film made and childishly produced about our Prophet (PBUH) but not ...", "Sat Jul 28 13:05:23 ": "this is our band http://t.co/YOjnSerw", "Sat Jun 09 22:04:23 ": "You can purchase \"We Are On Fire\" on iTunes and via Touch and Go / Quarterstick Records:... http://t.co/gjbCzhyk", "Sat Jul 28 12:54:26 ": "excited to be in Poland, still trying to work up the nerve to crowd surf", "Tue Feb 05 01:15:29 ": "have you heard the next Dalai Lama is a girl?", "Wed Jul 04 15:48:33 ": "a poem for the road.. http://t.co/QvUUAS0x", "Wed Dec 05 23:02:48 ": "PAPERMAG: Bianca Casady http://t.co/irdi9TMO", "Sat Jul 28 12:53:44 ": "3rd poem from old series http://t.co/IACgCOLK", "Tue Nov 06 15:52:21 ": "This event is now donating proceeds to New York Cares Hurricane Sandy Relief Efforts. http://t.co/YO7kOQZv", "Tue May 29 03:35:38 ": "Cinder Ella, a fragment from my upcoming show at Cheim and Read in NYC. http://t.co/3Yq7ZGqL", "Thu Nov 15 15:54:30 ": "Last day to stream this German Cultural program on CocoRosie (w/Rajasthan Roosts) online. http://t.co/nLXeh45B", "Tue Feb 05 17:14:22 ": "RT @FutureFeminists: murdering a girl child in Saudi Arabia cost 50K, if it were a boy it would have been 100K.", "Tue Feb 05 15:35:07 ": "going to hear my favorite singer Diane Cluck tonight at Joe's Pub.", "Mon Feb 04 15:23:31 ": "here is a link to a very disturbing article which has me in tears. We need to protect our women and children everywhere http://t.co/iDoeZbfK", "Fri Jul 27 21:56:41 ": "had an awesome show in Prague, some drunk fans are staggering about back stage. Feel bad for him...", "Fri Jun 15 03:51:23 ": "You're invited... http://t.co/VcfN5RVX", "Mon Jul 09 19:35:12 ": "last show in berlin tonight before we climb in the big red bus. love the road. love our new band. already having a blast.", "Tue Feb 05 05:16:43 ": "Cut diplomatic and economic ties with SaudiArabia until rape/murder victim Lama Al Ghamdi gets the justice she deserves http://t.co/3UtKaFvz", "Wed Feb 13 15:47:38 ": "Getting ready to play a show in Mexico in a couple of days. Drinking massive amounts of Oolong Tea.", "Sat Jul 07 19:39:25 ": "http://t.co/y6Gxnkw7", "Sat Mar 23 10:45:26 ": "\"unbalanced and psycho\"? seems like a good description of Patriarchy", "Thu Jul 26 13:36:58 ": "http://t.co/aqhL4TYY", "Tue Mar 19 19:10:05 ": "Just announced on this year's Latitude Festival line up for July 21st! http://t.co/FUbEzJ4a6b", "Sat Jul 07 19:38:13 ": "holler from Berlin! about to play our first show of our summer tour!", "Sat Mar 23 10:48:30 ": "one journalist said \"i prefer the femininity rather than the feminism in your album\"", "Thu Jul 12 16:52:21 ": "sleeping in my stage clothes, hair filled with glitter, dirt bags on the road", "Thu Feb 07 23:19:38 ": "Thinking a lot about the story of Lama al-Ghamdi. If you don't know her tragic story please look it up. The whole world needs to stand up!", "Fri Feb 08 00:19:40 ": "Actually our song R.I.P. Burn Face is a similar story to Lama's. http://t.co/WgHuPFY7", "Fri Jun 22 08:20:36 ": "just started posting @FutureFeminists. \nSearching for a way to start this daunting dialogue...exciting", "Wed Jul 04 05:12:38 ": "learning about the vagina at 30", "Mon Oct 22 14:03:49 ": "Last minute show in DC on Nov 8th http://t.co/nGZ1qain", "Tue Nov 06 15:52:44 ": "http://t.co/Z0lnUZMH", "Fri Jul 27 12:38:27 ": "2nd poem from old series 2001 http://t.co/ukXd6clh", "Sat Jun 09 22:10:54 ": "Purchase \"We Are On Fire\" from Amazon here:... http://t.co/XXYAvaTm", "Thu Jul 26 22:11:18 ": "what we are weary of is a blue eyed male god and politicians with drooping jowles", "Tue Jul 10 17:37:03 ": "on tour in europe with an amazing band from India called The Rajasthan Roots.", "Fri Nov 09 22:54:35 ": "You can now watch the German television documentary on CocoRosie online until 11/15!\nhttp://t.co/EA0K7IvU http://t.co/JzaxIgKd", "Thu Jul 12 16:51:23 ": "in paris, its sprinkling, lovely roof tops, back stage filled with lilies, beautiful old theater..", "Sun Aug 05 18:45:54 ": "At the meltdown festival in london, very inspiring. Follow our feminists group with Antony at FutureFeminists.", "Thu Jul 26 12:36:00 ": "hello out there, so hard to keep up cyberly on tour, got lost in the whirl and twirl, sound checking and skinny dipping, lucid dreaming!", "Fri Jun 15 01:50:32 ": "\"i'm am having in art show in NYC in a couple of weeks, come thru if you are in the area\" \"we're all doin' time on the inside of our mind\"", "Fri Jun 22 02:28:56 ": "getting ready to launch the \"future feminists\" twitter with partners Kembra Pfahler and Antony.Check it out if you care about humans.", "Fri Feb 01 15:18:05 ": "Having exciting meetings about Future Feminism... water memory and the correlation between the ill treatment of women and the earth...", "Fri Oct 19 18:35:07 ": "Headlining the Tinderbox Fest-NYC on Nov 11th http://t.co/pMMl4iPw", "Wed Oct 17 22:09:41 ": "recording a new single...got some hot ladies coming over to lay down tracks", "Sun Oct 14 23:39:28 ": "RT @FutureFeminists: Malala Yousufzai was shot along with two classmates while they were on their way home from school Tuesday. http://t ...", "Wed Feb 13 15:46:03 ": "Here is the link to the new song \"Gravediggress3. Love. https://t.co/d5O197KM", "Thu Jul 26 22:10:01 ": "also...talked to a fan who was kind of pissed that the Rajasthan Roots (playing with us) mentioned god....", "Thu Jul 12 16:53:02 ": "Antony is the voice of mother nature in our new song TEARZ FOR ANIMALS", "Wed Jul 04 05:02:11 ": "Getting ready for tour. Can't wait to hit the road. Wind in the hair. The night wizzing by.", "Sat Mar 23 11:24:55 ": "IS FEMINISM A DISEASE? \n“She is like someone suffering from a serious and contagious illness and she must be secluded and treated,”", "Sat Jan 19 03:05:44 ": "Finishing up the final details on our new record.", "Sat Mar 23 17:36:14 ": "http://t.co/8uLTUy94o0", "Sun Oct 14 23:34:29 ": "here's a photo of me writing Peter Pan by a lake. ( photo by JMR http://t.co/yna1vuqk) http://t.co/hl5nLBlQ", "Thu Jul 26 22:08:14 ": "when i was asked about the workers clothes we are wearing on stage, \"women at work\" is what comes to mind", "Fri Jun 22 03:06:41 ": "just started posting @FutureFeminists.\nSearching for a way to start this daunting dialogue...exciting", "Mon Feb 04 20:02:25 ": "We need to protect our women and children everywhere #AnaLama http://t.co/iDoeZbfK", "Wed Feb 20 23:03:11 ": "Have you heard our new single yet? You can here... http://t.co/aMmbH9mZyg", "Fri Mar 01 21:16:06 ": "New dates!! http://t.co/Dz38kg3DEC", "Thu Jul 26 13:43:32 ": "here is a poem from a series i wrote in 2001, more to come BC http://t.co/nBOKG5Qe"}