{"Sun Apr 14 02:06:26 ": "Maybe it wasn't poison. Is there a brand of whiskey with a skull and crossbones on the label?", "Thu Apr 18 20:08:29 ": "@avalunaband @celshore !!!!!!!! #D2D3", "Wed Apr 17 01:53:11 ": "So many of these titles for bad trips on erowid could be great band names. Acid rain, apocolyptic nightmare, the infinite reality layers.", "Fri Apr 12 01:49:43 ": "Now. 400 tweets: What a journey it's been. #milestone #400club #alldownhillfromhere", "Thu Apr 18 01:54:42 ": "So jazzed to play with @danielmoonking (fresh off a sold out bowery show) , @CagedAnimals and @sexmerlin  this Friday at @bigsnowbk", "Tue Apr 09 22:42:54 ": "RT @father_daughter: The bands who played Big Snow tonight inspire me to keep fighting the good fight. And they all shredded too. @leapl ...", "Wed Apr 17 00:13:34 ": "\"Daft Punk is playing at my house, also darkwing duck is here\" #LSDsoundsystem", "Sun Apr 14 01:55:48 ": "@avalunaband portishead - nearly every song on third.", "Fri Apr 19 00:22:37 ": "RT @mikelucianosup: Honored, psyched &amp; proud to have Animals. selected as a Comedy Central short pilot finalist http://t.co/OR83Kfvefd", "Sat Apr 20 21:45:09 ": "A truly wild night at @bigsnowbk yesterday. Thanks all for coming out and @CagedAnimals @sexmerlin and @danielmoonking .", "Sun Apr 07 00:55:40 ": "@avalunaband Julian fader is Dave Grohl in EVERLONG: THE DAVE GROHL STORY", "Tue Apr 16 03:47:46 ": "Then, after delving even deeper in 1975, Jah Jahley.", "Thu Apr 18 02:58:50 ": "#funyuns", "Sun Apr 07 04:20:26 ": "@avalunaband this new profile pic is really something", "Thu Apr 18 03:04:00 ": "RT @_FallenHero: My favorite snack #funyuns http://t.co/rlszjITYgH", "Sat Apr 20 06:02:59 ": "RT @bigsnowbk: Also take your vitamins before coming here and stay hydrated PLEASE.", "Fri Apr 12 01:44:54 ": "Woah, 400th tweet coming at cha right...", "Sun Apr 07 00:17:31 ": "@avalunaband @empressoff they're called \"Linkin Park\"", "Sat Apr 06 21:32:33 ": "@avalunaband nevermind I got one", "Sun Mar 31 20:27:41 ": "RT @DJJMMJAMC: Aw fuck. My 14-year-old niece is learning to play the ukulele. I gotta sit her down explain that we don't need another on ...", "Fri Apr 05 05:14:53 ": "RT @RedHiller: Can a brotha just eat some fucking israeli pickles in his bed with his cat?", "Sun Apr 07 02:28:32 ": "Sometimes I think about all the countless stars in the sky and the endless potential of the human mind, then I tweet about a bagel.", "Wed Apr 17 01:45:25 ": "@celshore can I have your test press with the wrong tracklisting so I can pretend in my mind yr record's out so I can finally be happy?", "Thu Apr 11 05:59:41 ": "twitter, for me, is about finding absolute truth.", "Fri Apr 19 22:13:53 ": "RT @danielmoonking: playin at Big Snow in brooklyn w/ @sexmerlin @leaplingband @cagedanimals tonight!!", "Sun Apr 07 00:41:32 ": "Kim Jung-un bought a vinyl of Losing Face. He apparently said after a listen \"I wouldn't nuke it\". I'm told this is his highest compliment.", "Sun Apr 07 00:45:37 ": "@empressoff @avalunaband then I asked him if he had heard of a band called nirvana who at the time needed a drummer. The rest is history.", "Mon Apr 08 18:21:18 ": "If you haven't seen the time in Paris Steven Hawking joined Daft Punk onstage for \"Harder, Better, Faster, Stronger\" you haven't lived.", "Sun Apr 07 04:01:38 ": "@leaplingband @avalunaband as I typed that I realized how insane that is.", "Fri Apr 19 19:34:05 ": "RT @father_daughter: Label lovelies @leaplingband play @bigsnowbk tonight with Moon King &amp; @CagedAnimals http://t.co/gmImqUDjCQ", "Thu Apr 11 06:01:05 ": "Plato believed that absolute truth existed, but that truth on earth was merely a shadow of great forms of absolute truth.", "Sun Apr 07 01:00:46 ": "Only a judge can judge me - Tupac Shakur", "Sun Apr 07 04:22:20 ": "I think I've gained my composure. Back to Stephen Hawking. He has a life size replica of Daft Punk (Homework era) in his study.", "Tue Apr 09 05:04:48 ": "I guess tipping is a cultural difference in France. Like slapping someone to show that you like them, which they did to me repeatedly.", "Sun Apr 07 04:00:50 ": "@avalunaband yeah. Mark Ibold and Steve Shelly are the rhythm section for Spectre Folk tonight.", "Sun Apr 14 02:09:07 ": "#noregrets", "Tue Apr 16 02:31:15 ": "@bigsnowbk it's a fine product.", "Wed Apr 17 18:26:24 ": "#TGIW", "Wed Apr 17 19:30:05 ": "@RedHiller make up your own routines. I trademarked TGIW.", "Sun Apr 14 04:18:32 ": "@Zulaband I think you just named the record. Leapling - En Fuego.", "Thu Apr 11 05:56:54 ": "RT @Oprah: If you really tell your truth, we are all needing and seeking  the same thing. So true @Janefonda . #NextChapter", "Thu Apr 18 20:03:51 ": "Tonight, @avalunaband at Brooklyn museum AND @celshore at silent barn. I'm told you can make both if you're so inclined. You can have it all", "Wed Apr 10 22:33:22 ": "\"It's comforting just to know that it's there, the ability to just walk out into the ocean\" - Tom Sharpling", "Thu Apr 18 21:40:10 ": "RT @ImagemMusicUS: Tomorrow night in Brooklyn, @CagedAnimals plays a hometown show at @bigsnowbk with @danielmoonking &amp; @leaplingban ...", "Sun Apr 07 04:50:54 ": "In college I took a course called viral marketing that introduced me to Twitter. Never did I think in a few short years I would MASTER it.", "Wed Apr 17 03:40:49 ": "I did that when I rode Nitro at six flags. Cept I knew I wasn't dead. Also it wasn't on purpose.", "Sun Apr 07 02:38:05 ": "Stephen Hawking had a great theory about a bagel shaped universe. Read up on it in his book \"Bagelverse: Seeing Beyond The Lox Dimension\"", "Tue Apr 09 22:45:33 ": "thanks to all who came out yesterday. what a good time. here's our next one, 4/19 with @danielmoonking @CagedAnimals https://t.co/iq7TZxs7ly", "Sun Apr 07 03:36:59 ": "I read Stephen Hawking is super excited about the new daft punk record. He said he was their biggest fan and listens to Discovery every day.", "Tue Apr 16 03:46:27 ": "I guess that's like when Bob Marley got deeper into rastafarianism in 1974 after Natty Dread and briefly changed his name to Jah Marley.", "Thu Apr 18 03:47:23 ": "@DJJMMJAMC don't you dare say either of those to slippy. Love that pooch.", "Sat Apr 13 01:16:03 ": "The kool aid man is going through a CGI makeover for 2013 apparently in an attempt to more accurately portray my reaccuring nightmares.", "Tue Apr 16 02:21:28 ": "Suprised to see this revitalized interest in Sean Paul. Shame his album was stolen/heard this way but who can complain about new Sean Paul.", "Mon Apr 22 22:04:54 ": "@avalunaband the best", "Fri Apr 05 01:51:39 ": "#outerspace #whatdoesitallmean #whyarewehere #howardstern", "Tue Apr 02 03:16:31 ": "Workin' hard or h@rdly workin. http://t.co/8FUe56mPum", "Tue Apr 23 04:11:35 ": "RT @Zulaband: our record is done and I feel really really good", "Wed Apr 10 19:43:42 ": "RT @avalunaband: 8 bands you need to hear: Bob Dylan, Led Zeppelin, Pink Floyd, Parquet Courts, KISS, Michael Jackson, Elvis Presley, an ...", "Thu Apr 18 22:58:04 ": "@AxJxP go hard or go home", "Tue Apr 16 02:17:51 ": "@Zulaband my bad. Its still a fun listen anyhow.", "Tue Apr 16 00:33:33 ": "@empressoff queen of komedy", "Sun Apr 14 02:29:59 ": "@DJJMMJAMC omg I h8 h8ers", "Fri Apr 19 23:27:55 ": "RT @bigsnowbk: #hotmagic @bigsnowbk tonite w/ @danielmoonking @CagedAnimals @leaplingband &amp; @sexymerlin\nDoors @ 8  !!  HOT HOT HOT \nhtt…", "Fri Apr 19 00:30:28 ": "@mikelucianosup !!!!!!!!", "Sat Apr 20 03:57:51 ": "@JerryPaperREAL thanks pal!", "Mon Apr 08 18:25:45 ": "Hawking later described it as \"the single greatest moment in his life (academic or otherwise)\"", "Wed Apr 17 03:38:48 ": "\"At one point I pissed my pants on purpose to try and convince myself I was still alive.\" Erowid bad acid trip accounts are NUTS.", "Sat Apr 06 20:36:46 ": "Someone tweet me a bagel", "Tue Apr 16 02:26:03 ": "RT @bigsnowbk: Seems like I can safely guess its s slow night judging by the amount of @leaplingband twitter activity.", "Sun Apr 07 02:26:35 ": "RT @jimmy_morris: Every time I go out and I end up meeting people I realize there are so many idiots and jerks out in the world", "Sun Apr 07 03:43:45 ": "Mark Ibold is just hanging in front of me and the more I drink the more I'm bugged out by that.", "Mon Apr 01 23:05:16 ": "\"Nature Must Not Win\" from our Losing Face release show at @bigsnowbk http://t.co/rW5WpeotuT", "Sun Apr 07 00:36:52 ": "@empressoff @avalunaband Julian Fader hacked my mind with his drum steeze. Saw him play in Evan Lava and was like \"WOW THIS GUY HAS GOT \"IT\"", "Fri Apr 19 04:44:33 ": "@Zulaband get yr vitamin C on so you can be around this weekend bra.", "Tue Apr 02 01:54:25 ": "@avalunaband 's new recordings were heavily influenced by Miami's signature cuban rhythms. - NME", "Sun Apr 14 01:45:37 ": "@Zulaband @avalunaband @SkeletonsTV so good", "Sun Apr 14 01:56:35 ": "RT @mikelucianosup: Photo: Tonight we are premiering ”Pigeons.”, the new pilot episode of ANIMALS., at Videology in... http://t.co/Kr09h ...", "Fri Apr 19 21:47:38 ": "RT @goldenxratio: Come to @bigsnowbk tonight for @CagedAnimals @danielmoonking @leaplingband and @sexmerlin . Just do it. Really.", "Tue Apr 16 02:02:17 ": "\"I want you (she's so heavy)\"cuts off abruptly at 7:47 #songspoileralert", "Sun Apr 14 02:12:07 ": "\"DANGER: POISON. NOT INTENDED FOR HUMAN CONSUMPTION.\" - label on the \"whiskey\" I just poured in rude dudes drink.", "Mon Apr 08 21:26:24 ": "RT @father_daughter: Tonight's agenda includes major good vibe hangs with the @bigsnowbk crew - FREE SHOW https://t.co/BUO2J2QNUq", "Wed Apr 17 22:30:16 ": "If only all wednesdays were this good", "Sat Apr 20 06:50:01 ": "An eventful night to say the least. Thanks for coming out and @danielmoonking , @CagedAnimals  and @sexmerlin 4 rockin in the free world.", "Sun Apr 14 02:02:58 ": "Guy at the bar laughed bc I ordered my drink in an awkward fashion. Jokes on him though. #poisonedhisdrink", "Fri Apr 05 00:46:37 ": "Forget to mention its freeee", "Sun Mar 31 23:52:22 ": "@Sidustratis @avalunaband @DaRealCarlosH  Carlos would be an excellent drug lord. Firm but fair.", "Thu Apr 18 02:58:12 ": "I wanna start treating Twitter seriously. With the respect it deserves.", "Sun Apr 07 00:22:17 ": "@avalunaband @empressoff and they're not from Chicago. U guys don't know anything about bamds.", "Mon Apr 08 17:24:30 ": "Srsly, I think their bros Daft Punk have less live tracks then they do. Not sure. Steven Hawking would know. He's seen them live 8 times.", "Sun Apr 07 01:09:33 ": "@empressoff bring me back some deep dish. Thanks in advance.", "Tue Apr 09 00:43:02 ": "I kid, Phoenix are good guys. We had escargot in Cannes once. Sounds like a stereotype but those dudes LOVE escargot. Horrible tippers tho.", "Tue Apr 16 23:41:40 ": "It's LSD's 70th birthday today. I'm gonna celebrate by reading horrible trip stories on erowid. They're my faves.", "Mon Apr 22 07:27:16 ": "RT @goldenxratio: @DJJMMJAMC idk, there were a decent # of ppl at the one where some1 passed out, some1 got kicked out, &amp; a mic stand g…", "Sun Apr 07 00:56:36 ": "The flood gates have opened.", "Fri Apr 05 00:30:57 ": "Last minute, super fun show this monday at big snow w. Space Beach, Star Rover and Baked.    http://t.co/83z5MEp7ZZ", "Thu Apr 11 06:01:39 ": "but plato didn't have a twitter so...", "Tue Apr 09 08:13:12 ": "RT @father_daughter: A little birdie is telling you that we're getting ready to announce something big tomorrow. Keep those peepers peeled!", "Mon Apr 08 17:19:36 ": "Love Phoenix, but that SNL performance, I thought I was watching top of the pops. Can you even call it backing tracks if its the entire mix?", "Thu Apr 18 18:48:03 ": "RT @nathanfielder: Nathan For You season finale airs tonight at 10:30/9:30c on Comedy Central. If you love the show, now's the time to s ...", "Tue Apr 16 02:32:39 ": "I'm being told I'm wrong and he now goes by Jah Paul (some kind of reggae thing?)."}