{"Mon Apr 01 18:20:46 ": "@robertsoucy hell yeah homie", "Thu Apr 18 17:14:48 ": "2 guestlist spots to our Anaheim HOB gig with Senses Fail/Real Friends/Major League for whoever can get 6 of us into Disneyland.   Help!", "Fri Apr 12 18:14:46 ": "New Designs added to our All In Merchandise webstore! http://t.co/A67Nl7uHGm http://t.co/Xj8CKE064L", "Thu Mar 28 12:53:05 ": "RT @JakeHasABeard: Just read someone referring to Such Gold as a metalcore band. I act like it dudn't bother me, but it dud.", "Mon Apr 01 18:17:04 ": "We're getting real excited to tour the US supporting our dudes @SensesFail this month!  for show info/tickets go to http://t.co/PlP7U1br9S", "Thu Apr 18 16:44:08 ": "RT @poopoohed69: Some girl is grinding on her boyfriend during @SuchGold's set right now like it's my 2004 High School Homecoming dance.", "Wed Apr 24 15:54:40 ": "Head over to our All In Merchandise webstore and get 10% off your order with the code KINGSPRING!... http://t.co/8l8RXHi5IS", "Fri Apr 12 16:43:07 ": "Hey @majorleaguenj how you boys feeling today?? 😎", "Sun Apr 14 22:01:08 ": "Great question. RT @ChrisYafchak: Do hardcore kids still like such gold? Or did the defend pop punk kids take them away?", "Fri Apr 05 19:59:22 ": "RT @TessaxMuch: Also, if you spray tan without some kind of base tan, we can't be friends.", "Thu Apr 18 20:15:32 ": "@JonnyxMOSHxcock yes we have it!", "Mon Apr 08 22:26:02 ": "@realfriendsband yo we accidentally packed up a box of your CD's", "Tue Mar 26 19:19:01 ": "RT @realfriendsband: New @SensesFail record is out today! Check it out along w/ the tour we're doing w/ them, @SuchGold &amp; @majorleag ...", "Sat Apr 06 16:54:47 ": "Baltimore, you rule.   Last night was so wild, great crowd surfing and stage dives.   Norfolk, VA tonight we want to see double!  Come hang!", "Mon Apr 22 02:06:40 ": "Hello boys now get in my van boys http://t.co/KjsEaqSJIZ http://t.co/y0ITR52gOO", "Mon Apr 22 20:11:29 ": "California we love you, thanks for the awesome shows San Diego, Anaheim, and Bakersfield.   Tomorrow is Frisco at Bottom of the Hill!", "Thu Apr 11 22:00:48 ": "@Silver_Snakes will take your word for it hahaha", "Fri Mar 29 03:40:10 ": "This is tomorrow! If you're in the area and don't go, you're a real asshole since it's a free show and we're making a 12hr round trip...", "Thu Apr 11 22:15:12 ": "Made a tour playlist today\n\nhttp://t.co/Ta6jHmO5Y1 http://t.co/jDjjML9QGz", "Tue Apr 16 20:01:26 ": "@Alberto_Alaska thanks! StB has the bus now...our new van is what is broken down! Sucks.", "Sat Apr 06 05:31:37 ": "We love Denny's “@jessicaannexxo: Like @SuchGold is sitting at the table next to us at Denny's right after they opened for @sensesfail”", "Sun Apr 21 19:23:34 ": "Great to see you homies! Happy #421 “@Transitma: Woke up in the same hotel as @SuchGold \n\n&lt;3333”", "Sun Apr 14 05:56:45 ": "RT @iHeart_Kittens: The singer for such gold holds the mic like a man with cerebral palsy having an epileptic fit #FinishTheSetAlready # ...", "Thu Apr 11 01:39:07 ": "WOW that was an amazing show Orlando.  Thanks for everyone coming out and having fun with us.", "Fri Apr 19 08:01:23 ": "Scottsdale AZ was sick.  Tomorrow we're playing Soma in San Diego.   Come rage with us, @SensesFail, @majorleaguenj and @realfriendsband !", "Fri Apr 05 18:47:51 ": "\"Oh, I don't have car radio, because I am just a boy!\"\n\nWe have no CD player or iPod hookup in our new van, so... http://t.co/DFhdolCnHb", "Sat Apr 06 05:32:01 ": "RT @jessicaannexxo: SUCH GOLD is at Denny's omg", "Sun Apr 14 20:06:36 ": "ATX! Come out to Red 7 tonight to see us with @sensesfail @realfriendsband and @majorleaguenj", "Sat Apr 06 17:25:40 ": "We've also got these dope hats thanks to Cold Cuts!  This will be up in our Cold cuts merch store soon. http://t.co/RcRvcAHQRB", "Mon Apr 01 21:46:00 ": "USA we're coming to your town or close to it.   Let's hang out!! http://t.co/AwUwTjNvVq", "Fri Mar 29 03:56:48 ": "RT @_jaybreezy: These hoes are such gold diggers. Bitch go make your own money", "Fri Apr 12 16:46:30 ": "@ZaneyZanaTFT come see us then!", "Thu Apr 11 14:43:32 ": "@mydemisee still figuring it out but we can probably get you in. Ill keep you posted", "Wed Apr 03 16:13:54 ": "Check out our video for 'Survival of the Fondest' over at CraveOnline Music!... http://t.co/vfRZsAviDL", "Wed Apr 17 19:40:14 ": "Congrats to Josh Byler for winning Misadventures on orange vinyl!", "Thu Apr 04 17:56:54 ": "If you missed the premiere yesterday, the \"Survival of the Fondest\" video is now up for viewing on VEVO/YouTube http://t.co/9hF0Vpbnpc", "Sat Mar 30 21:57:51 ": "Go to this tonight, Rochester! Mad good bands, 3 of them touring, 1 from the UK! Taking Meds' first real show! http://t.co/lvutH2Szqo", "Thu Apr 18 20:17:00 ": "@abrasumental thanks for da luv (:", "Thu Apr 18 16:48:34 ": "@my9rides5hotgun I'm stuck in texas with the van until it's fixed so Ben's taking on double duty", "Wed Apr 10 15:55:47 ": "@TLFYfrangi Thanks man!", "Mon Apr 22 20:38:44 ": "This release is going to rule “@rfcrecords: Citizen - Youth CD / LP out June 11th http://t.co/0hx3Kb1VDI”", "Thu Apr 04 03:13:23 ": "@doctordestroyer trying I got a new number I'll DM you", "Mon Apr 08 22:18:15 ": "Jacksonville FL friends come hang out with us at the Phoenix Taproom tonight!  retweet!", "Sun Apr 14 23:15:19 ": "@Nickhdrums apparently it still does. We don't necessary endorse its defence either.", "Thu Apr 18 16:43:53 ": "That ia dope RT @twerkmas: i was looking in some graphic design books and there was kid wearing a @SuchGold crewneck in it omg", "Wed Mar 27 20:10:52 ": "Quick reminder to check out Nate's recent playlist on Spotify! Subscribe and follow http://t.co/ce4ai4tHaj", "Wed Apr 10 16:13:19 ": "@LaurenGoeshard hola", "Thu Apr 04 03:09:00 ": "RT @Xmcbreisch93X: I'm going to have such a bang over in the morning from @SuchGold 's set tonight", "Sun Apr 14 05:54:36 ": "@andrewcayas it's at Red 7 tomorrow, we usually go on about 8:30pm", "Sun Apr 14 05:55:52 ": "RT @BASEDBIX666: Yo fuck a Such Gold who's tryna see the Deftones in Springfield on the 29th.  It's $38.50 which isn't bad if you want t ...", "Mon Apr 22 02:28:20 ": "RT @houdaphuck: Why was I following Such Gold on Instagram?", "Fri Apr 19 15:33:11 ": "@K_iLL yes lets hang!", "Thu Apr 18 20:14:34 ": "@BloodshotViking trying to find 2 people to let us use 3 passes.   Will also trade merch etc.", "Sat Mar 30 21:57:57 ": "Go to this tonight, Rochester! Mad good bands, 3 of them touring, 1 from the UK! Taking Meds' first real show!... http://t.co/taiXZc1FMi", "Fri Apr 12 16:46:05 ": "@majorleaguenj we made it to our hotel at 230 and crashed.   Glad you guys got to have the Bourbon St experience.", "Wed Apr 17 19:58:04 ": "Steel Wolf is shaving his beard on live Internet TV tonight at 10PM EST. Tune in to see the man behind the fur.... http://t.co/VcRy6keeOY", "Fri Apr 05 07:02:25 ": "@DekuSprout_ Do it, to be honest it will probably be going towards coffee and tattoos though -Devan", "Sat Apr 06 18:11:20 ": "Drew this at the Baltimore show yesterday!  Bring me drumheads and I will draw for you.  -@mike_venusaur http://t.co/QHGOH83g1N", "Thu Apr 11 22:19:56 ": "Made a tour playlist today ♫ SG Tour Playlist http://t.co/PZ7CKjSqHe #Spotify", "Sat Apr 13 00:21:17 ": "New tees for the spring! Check 'em out! http://t.co/b9OBEXcjrT. http://t.co/GpG7lSlgqA http://t.co/UFm8ro2unS", "Wed Apr 10 16:59:05 ": "RT @WellingtonGibs: Going to be at @SocialOrlando tonight to see @sensesfail, @SuchGold, @realfriendsband, and @majorleaguenj! http://t. ...", "Thu Apr 04 03:11:05 ": "Great first show in Lancaster PA tonight, thanks for hanging with us.  We're playin the Troc in Philly tomorrow, lets get wild.", "Sat Apr 06 18:57:58 ": "RT @kodyfayzzon: @suchgold are the chillest dudes, everyone go see them tonight at the norva!", "Wed Mar 20 16:10:01 ": "Thanks to Dave Graupman for finding an SG reference on the Huffington Post website! Funny stuff. http://t.co/xJrC0ueTWQ", "Thu Apr 04 03:11:33 ": "RT @devanbentley: So fucking nice to play my own @SJCdrums finally!  Tonight rocked.  Philly were playing Troc tomorrow who's trying to  ...", "Mon Apr 22 05:17:36 ": "RT @killyourstereo: KYS catches up with @natederbs of @SuchGold - http://t.co/tBjPUeNP3O", "Mon Mar 25 17:03:05 ": "Nice little interview from a German blog. It doesn’t say who did it, but I think it was Skylar. Really love this... http://t.co/SHUxINF7m2", "Fri Apr 19 07:57:39 ": "@TheKelvsters yes!  We actually only need to get in 4 of us now.   Help us find 2 more passes!  Will give merch!", "Thu Apr 11 15:34:23 ": "Today is a drive day.  We've decided to make our half way destination point New Orleans.   #bourbonstreet #partybeads", "Fri Mar 29 04:13:47 ": "Guaranteed Ben has NEVER said that onstage RT @meghanmccabe23:\"Let's get this shit moving!\" No. You sound like a shitty Such Gold cover band", "Tue Apr 16 01:57:07 ": "Looking for a place to stay along I-10w or in Midand or Odessa TX...hit us up if you can help out!", "Fri Mar 29 04:18:29 ": "RT @itschurch: @SuchGold @MeghanMcCabe23 what's a such gold?", "Sat Apr 13 00:26:47 ": "@secondtolast gigging rather hard for sure.", "Thu Apr 11 19:22:45 ": "Installed a skate rack in the trailer! @glmrklls http://t.co/KJlOI1dCb6 http://t.co/UpGHvHu81L", "Thu Apr 11 22:24:10 ": "http://t.co/Ta6jHmO5Y1 http://t.co/J4GZ7WSNya", "Wed Apr 24 21:13:15 ": "New Snapback up in our Cold Cuts Merch webstore!!\n\nhttp://t.co/jdzo4GK7Nt http://t.co/xSADQ2EGp7", "Mon Apr 08 18:26:56 ": "Tonight were playing a headline show at the Phoenix Taproom in Jacksonville, FL, sorry to those expecting us with Senses Fail in GA!", "Mon Apr 15 18:04:42 ": "#suchgold skate sesh at House Park Skatepark @ericxvii @skylarwhileyousleep @benkotin @devanbentley @aimeemac... http://t.co/l71S6h7p6w", "Wed Apr 17 20:27:53 ": "Doing an interview with our boy Garrett tomorrow for Bird Attack Punk Rock Radio out of Jacksonville, FL. Check... http://t.co/qyLAVACBmf", "Mon Apr 15 18:04:23 ": "#suchgold skate sesh at House Park Skatepark @ericxvii skylarwhileyousleep benkotin @mike_venusaur… http://t.co/wCRVEzzU3A", "Wed Apr 03 16:13:58 ": "Just in time for our spring tour dates, CraveOnline Music's got the premiere of our \"Survival of the Fondest\"... http://t.co/iRlEP9W6UF", "Sun Apr 14 21:58:34 ": "@danielrdrgz07 should be on about 8 tonight I think...earlier cerfew than normal.", "Fri Apr 05 20:01:51 ": "RT @ZarifMiah: DAMN, my boys in @nativeband absolutely killing this live session. http://t.co/wSOBomEc4s", "Mon Apr 15 09:40:21 ": "Thank you!  Tonight was fun! @ATXMusicExmnr: Dear @SuchGold, your drummer fucking rocks.”", "Mon Apr 08 22:19:00 ": "@majorleaguenj ha", "Mon Apr 22 02:26:50 ": "RT @kngdmz: Shoutout to the 50 year old chubby couple grinding to @SuchGold today.", "Fri Apr 19 07:57:49 ": "@TheKelvsters shoot me a dm with your number", "Thu Apr 18 20:20:35 ": "Disneyland employees, help us with 6 passes to Disneyland!  We'll give you merch and a guestlist spot. Help us experience the magic! #420", "Wed Apr 10 15:59:52 ": "Orlando, Florida friends, we're playing The Social with @SensesFail @majorleaguenj and @realfriendsband come hang out with us!", "Fri Mar 29 03:40:16 ": "This is tomorrow! If you're in the area and don't go, you're a real asshole since it's a free show and we're... http://t.co/QyPW6NEMbN", "Fri Apr 05 06:45:15 ": "WOW Philly!!  Tonight ruled.  Mad love for the Trocadero.   Tomorrow we're hitting the Otto Bar in Bmore.  Come start the circle pit.", "Fri Mar 29 04:20:25 ": "@viiviancha longer set tomorrowww...more old stuffff....", "Tue Mar 26 14:29:23 ": "Stoked to play a couple shows with Crime In Stereo in May!\n\n5/17 Buffalo, NY - Soundlab\n5/18 Sneaky Dee's Toronto, ON", "Thu Mar 21 02:22:44 ": "Yo, for reals, you need to go download the most recent Placeholder 7\"...this thing is the absolute jam. This band... http://t.co/nkbMNcNeOU", "Wed Mar 20 06:04:36 ": "girl you done fucked up RT @libby_robyn: why the fuck didn't i go ffaf, so gutted i missed out on such gold n major league", "Wed Apr 03 12:07:55 ": "@robertsoucy haha you actually moved there! It must be crazy. So stoked.", "Mon Apr 08 19:31:38 ": "@lilwiggy718 @majorleaguenj WHAT!!???  Are you going to be in Houston when the tour comes through?", "Sat Apr 06 17:24:02 ": "Got a few new designs in our merch spread for Senses Fail tour!   Top middle is a windbreaker, small… http://t.co/wgfPCyIxrZ", "Fri Apr 05 18:39:37 ": "BAL-TI-MOAH", "Sun Apr 14 06:10:31 ": "@randinesia haha thanks, we just think the shit is hilarious"}