{"Fri Apr 12 13:44:07 ": "@BlairFrayer Sorry to hear about your experience. We'd like to discuss this with you. Please contact us at social.media@pcbank.ca. Thanks!", "Tue Apr 16 20:13:09 ": "RT @LauraPInglis: I stand corrected, I do get 2.6% interest in new deposits until July! I love banking with @PCFinancial!", "Fri Apr 19 17:26:04 ": "@TishLeDish @sensibleapron Sounds like you're both savvy savers! Thanks for sharing.", "Wed Mar 27 23:18:36 ": "RT @AlisonIPR: Congrats @kathybuckworth  Seven books. Amazing. #pcfbosslaunch http://t.co/d2E9IH3nc3", "Mon Apr 01 18:27:04 ": "@alextroake Hi there, there is a 24 hour delay when transferring funds between your banking accounts. Thank you!", "Tue Apr 09 15:57:09 ": "@amazoe Glad to hear it. We'll forward your feedback along internally. Thank you!", "Tue Apr 16 13:54:04 ": "RT @KathyBuckworth: Meeting the great staff at @pcfinancial in Vancouver Superstore Left signed books behind at Grandview Hwy RCSS! http ...", "Mon Apr 01 15:30:21 ": "Savings tip: Shop seasonally! Mushrooms and asparagus are delicious additions to meals in April.  #PCpointer", "Fri Apr 19 13:48:07 ": "@RosalitaBadland Thank you for the shoutout. Happy saving!", "Fri Apr 19 13:51:02 ": "@richard_chiu @Sharkbait_SD Thanks for sharing some great tips! #PCpointer", "Mon Apr 15 13:28:09 ": "@KESteph12 Glad to hear we could help! Have an excellent Monday :)", "Thu Apr 18 17:15:03 ": "What's your philosophy on credit cards?", "Mon Apr 01 13:45:26 ": "@maggiemccaw No, this isn’t yet available through the mobile app. Customers can view their daily banking information only.", "Fri Apr 05 16:01:10 ": "RT if you host potlucks when entertaining on a budget! #PCpointer", "Fri Apr 19 14:04:08 ": "@dstamler Hi Dean, thanks for your suggestion. We will pass it on internally. Have a great Friday!", "Mon Apr 15 21:04:04 ": "@GTAmissions1 Both of those phone numbers will direct you to the core banking line. Thank you!", "Wed Mar 27 19:34:08 ": "@ReadConsulting Thanks! Could you please email us at social.media@pcbank.ca with more details on the error so we can escalate the issue?", "Wed Mar 27 23:17:56 ": "RT @AlisonIPR: 'Parents want a sense of humor' about @KathyBuckworth and her writing. So true. #pcfbosslaunch", "Thu Apr 11 19:00:31 ": "Saving tip: Avoid shelling out extra cash by having a clothing or toy swap with friends and family! #PCpointer", "Tue Apr 09 13:02:09 ": "@amazoe Sorry that you've had a bad experience. We're you able to get assistance? Thanks!", "Tue Apr 09 16:45:04 ": "My relationship with money is ______________.", "Wed Apr 10 14:08:13 ": "@JackDuduu You're welcome! What game are you going to buy first?", "Tue Apr 16 18:01:00 ": "RT @KathyBuckworth: Fun being Chief Family Advisor @PCFinancial &amp; celebrating their 15th year with this amazing rate-check it out! h ...", "Sun Apr 21 21:49:04 ": "@Darcy_Donelle The 2.6% rate is for new deposits until July 15. Check out regular rates for our no fee accounts here: http://t.co/og0h4iBj1J", "Mon Apr 08 20:48:08 ": "@GTAmissions1 Thank you for your feedback. We would like to discuss this further with you. Please email us at social.media@pcbank.ca.", "Wed Apr 03 13:48:09 ": "RT @KathyBuckworth: I'll be at the @PCFinancial at the Superstore on 100 Richmond Rd in Westboro (Ottawa) today at 3:00pm, signing books ...", "Mon Apr 01 13:45:25 ": "@kokosz Thanks for reaching out! We will forward your suggestion along internally.", "Wed Apr 03 20:47:06 ": "@MzJacquelineC That's great that he helps! Thanks for sharing with us.", "Wed Mar 27 23:17:48 ": "RT @greenwooddavis: Great turnout for #pcfbosslaunch Started reading my copy on way down. Great read and a ton of spreadsheets. ;) #congrats", "Fri Apr 12 13:44:09 ": "RT @KathyBuckworth: Hey #Calgary I'll be @PCFinancial pavilion at Superstore, 3575 20th Ave NE Tues Apr 16 at 3:30 with my book. Drop in!", "Tue Apr 09 17:46:08 ": "@pigeonflyer1 @KurtChilcott Thanks for sharing!", "Fri Apr 19 13:48:08 ": "@CanadianBudgetB You can open an account at any of our pavillions or online (http://t.co/4oOjMD6mSW) to take advantage of this great rate!", "Tue Apr 16 18:01:01 ": "@rdelorey Thanks for the suggestion. We will pass it along internally.", "Mon Apr 08 14:38:10 ": "@chladysh Is there something we can help with?", "Fri Mar 29 16:13:32 ": "RT @KathyBuckworth: Proud to be their Chief Family Advisor &amp; so appreciative of their support launching my new book.Great company,gr ...", "Wed Mar 27 17:30:02 ": "This isn't small potatoes! Until April 30th, earn 2% on new deposits to your TFSA and RRSP account: http://t.co/a3cxBsn2Ty", "Sun Apr 21 21:49:05 ": "@Apples1Oranges The 2.6% rate applies on no fee banking accounts &amp; our Interest savings accounts. Find out more here: http://t.co/pcdEVmces2", "Fri Apr 12 14:45:21 ": "Retweet if you cut costs by taking public transit around town.", "Mon Apr 08 15:15:12 ": "Share a tip: How do you budget for vacation expenses? #PCpointer", "Tue Apr 16 20:13:08 ": "@LauraPInglis Thanks for the shoutout! Will you be saving or spending that interest?", "Fri Apr 05 14:28:09 ": "@KKineshanko Thanks for the shout out! Have a happy Friday.", "Wed Apr 10 17:30:07 ": "@atanu4ever Glad to hear it!", "Wed Mar 27 23:49:01 ": "Our VP, Marketing and President with @tracycityline for launch of @KathyBuckworth #PCFBossLaunch  @RandomHouseCA http://t.co/Lvbyli1bNZ", "Fri Apr 12 13:44:08 ": "RT @KathyBuckworth: Hey #Vcr I'll be @PCFinancial pavilion at Superstore, 3185 Grandview Hwy on Mon Apr 15th 3:00, with my new book. Say hi!", "Wed Apr 17 18:01:31 ": "We can help you slice up to 9 years off your mortgage. What would you do with the extra money? http://t.co/jzE3vU5KJc", "Mon Apr 08 17:58:05 ": "@jenniferbatt Thanks for sharing your concerns. We'd like to help. Could you please email us at social.media@pcbank.ca? Thank you!", "Fri Apr 12 20:25:05 ": "@simontonekham Thanks for the #FF!", "Fri Apr 05 13:28:23 ": "@JasonH193 Sorry that you've had a bad experience. Please contact us at social.media@pcbank.ca so we can help! Thanks.", "Wed Apr 10 15:01:03 ": "Have you filed your taxes yet? Will you be getting a return or paying taxes?", "Fri Apr 12 13:44:03 ": "@Mohamme87813966 You can apply for a PC MasterCard online! SIN is not required, but we do need Canadian banking info: http://t.co/o5fTIVrLZg", "Mon Apr 15 13:28:10 ": "@jonomatchett Glad to hear you like the app! We don't have an eta for the BB Z10 at this time, but we'll forward your feedback along.", "Wed Apr 10 17:30:06 ": "@Rapscallion0 Smart thinking!", "Wed Apr 03 18:01:03 ": "What chores do your kids do to earn an allowance?", "Fri Apr 19 20:33:04 ": "@Darcy_Donelle Rates are subject to change; the best thing to do would be to check back with us or our website at the end of the promotion.", "Mon Apr 15 16:45:58 ": "We’ve got a juicy 2.6% interest rate on savings. Find out more at http://t.co/YuwcFttwGG #PCpointer", "Mon Apr 01 13:45:23 ": "@bthubbard Thanks for the feedback. We will forward your suggestion along internally.", "Tue Apr 09 13:35:05 ": "@CoreyVantilborg Thanks for connecting with us. Could you please email us at social.media@pcbank.ca so we can discuss this with you?", "Mon Apr 08 17:58:06 ": "@GTAmissions1 Hi there, thanks for reaching out. There is a 20,000 PC points minimum redemption when customers choose to redeem points.", "Mon Apr 01 20:38:04 ": "@saladforb Hi there, sorry to hear about your experience. Please contact us at 1-866-PC POINTS (727-6468) so we can look into this for you.", "Mon Apr 08 14:38:07 ": "@TheNetbug Thanks for your feedback. We do have a mobile web version works on the Windows 7.5 OS (https://t.co/bnE5YvDVSU). Hope that helps", "Fri Apr 19 20:36:04 ": "@EZuberi Thanks for your question! Rates are subject to change, so we encourage you to check with us or our website at the end of the promo.", "Thu Mar 28 15:48:36 ": "With tax time looming, @KathyBuckworth tells @savvymomdotca that families are cutting back expenses + saving more:  http://t.co/OxB3n51lUR", "Tue Apr 02 16:53:07 ": "RT @KathyBuckworth: Ok I love this Atlantic Superstore! Look what they made me at @pcfinancial pavilion! #IAmSoTheBoss http://t.co/f4bHx ...", "Wed Apr 03 13:48:11 ": "@JasmineFlower1 Glad to hear it!", "Fri Apr 19 15:45:05 ": "Would you rather: spend in the moment OR plan your financial future?", "Fri Apr 12 13:44:05 ": "@jkubis Thanks for your interest in a Windows 8 PC mobile app. We will forward your feedback along internally. Have a great weekend!", "Tue Apr 02 15:30:19 ": "___________ + _____________ = more savings! http://t.co/Pmp4LPBAc4", "Mon Apr 01 13:45:22 ": "@simontonekham Thanks for the #FF!", "Mon Apr 01 17:29:07 ": "RT @KathyBuckworth: As Chief Family Advisor @PCFinancial I'm signing new book I Am So The Boss Of You at Atlantic Wholesalers, 210 Chain ...", "Wed Apr 10 17:30:09 ": "@JackDuduu Sounds like a lot of fun!", "Thu Apr 11 19:02:03 ": "@colinlefevre Thanks for reaching out! We'd like to look into this. Could you email us at social.media@pcbank.ca describing the errors?", "Mon Apr 08 16:30:07 ": "@TheNetbug Not at this time, but we will certainly forward your suggestion along internally. Thank you!", "Fri Apr 19 13:56:28 ": "@Apples1Oranges Thank you for the question. You will automatically get our great 2.6% rate on new deposits from April 15 to July 15, 2013.", "Thu Apr 11 13:15:13 ": "@EMMINDUSTRIES Sorry to hear you feel this way. If you would like to discuss your matter with us, please email us at social.media@pcbank.ca.", "Fri Apr 19 13:48:04 ": "@mrobertsonca Thanks for your question! The 2.6% rate applies on new deposits to no fee banking and Interest savings accounts.", "Thu Apr 18 20:13:03 ": "@OurFamilyWorld Great advice! Thanks for sharing.", "Tue Apr 16 13:54:05 ": "@LauraPInglis Hi there, this offer is open to existing customers as well. You'll earn 2.6% interest on all new deposits until July 15th!", "Thu Apr 11 13:15:15 ": "@MatthewBroga Thanks for your patience. We will pass along your feedback as we're always looking for better ways to bank.", "Tue Apr 16 16:15:15 ": "Savings tip: Build your spring wardrobe with colourful basics that you can mix and match.", "Mon Apr 01 18:27:06 ": "@kaixy Hi there, if you are inquiring on the status of an existing application you can contact us 1-866-246-PCMC (7262). Thank you!", "Thu Mar 28 17:30:05 ": "Do you have our mobile banking app yet? You can check your bank account balance, transfer funds, pay bills, and more! http://t.co/2vsfL3d7J3", "Wed Apr 10 21:51:05 ": "@EMMINDUSTRIES Hi there, is there anything we can help with? Thank you!", "Tue Apr 09 15:57:07 ": "@jenniferbatt You're welcome! Thanks for giving us the opportunity to help.", "Thu Apr 18 17:09:23 ": "RT @rcarrick: Still looking for a replacement for your Ally savings account? PC Financial offering 2.6% until July 15.", "Tue Apr 02 14:06:06 ": "@saladforb Sorry to hear that. If you could please email us at social.media@pcbank.ca we can look into this for you. Thank you!", "Sun Apr 21 22:00:21 ": "@ItsaJOY Hi Joy, we apologize for the inconvenience caused. Please email us at social.media@pcbank.ca so that we can escalate your issue.", "Fri Apr 05 13:28:24 ": "@stzikos Thanks for reaching out. We will forward your feedback along internally.", "Fri Mar 29 15:01:09 ": "What are your last minute tax filing tips?", "Wed Apr 03 20:47:05 ": "@BB10VW Thanks for the suggestion! We'll pass your feedback along internally.", "Tue Apr 09 13:02:07 ": "@MrMcDowall Let us know if you have any questions :)", "Fri Apr 05 16:17:04 ": "@SeanJA Sorry to hear you are having issues. Could you please contact us at social.media@pcbank.ca so we can look into this for you? Thanks!", "Tue Apr 02 17:21:42 ": "RT @KathyBuckworth: Awesome reception @pcfinancial in Halifax. Cake, balloons, wow :) #IAmSoTheBoss http://t.co/FbOX29VgHV", "Wed Apr 10 21:51:04 ": "@ponymalta Hi there, we'd like to look into this for you. Please contact us at 1-888-723-8881. Thank you!", "Mon Apr 01 13:45:20 ": "@denzee_f Hope you enjoy your free groceries!", "Fri Apr 05 14:28:07 ": "@GrantHolbrook Thanks so much for sharing your experience. Hope you have a great weekend!", "Wed Apr 17 17:49:04 ": "@jah_irie_mon Thanks for the suggestion. We will pass your feedback along internally.", "Thu Apr 11 19:02:05 ": "RT @georgiasaurus: @donbrownrigg pc financial = free banking", "Mon Apr 08 14:38:08 ": "@jenniferbatt Hi there, thanks for reaching out. Is there something we can help with?", "Wed Apr 17 20:19:08 ": "@gillianwheatley Thanks for reaching out. We will pass your feedback along internally. Have a great afternoon!", "Thu Mar 28 14:08:04 ": "@bthubbard Which part of the site are you trying to access? We also have an iPhone app that you may find helpful: http://t.co/2vsfL3d7J3"}