{"Thu Sep 27 23:14:35 ": "Well!!! Tweets I need y'all to email Sirius radio @ heart and soul let them know u like my new single what if and to keep playing it", "Mon Sep 17 02:16:15 ": "Well!!! Are the republicans really trying get rid of the middle class the back bone of America.. They want us poor with no hope no future??", "Tue Jan 15 16:05:29 ": "@Koopman_J yes it does all over the world", "Mon Dec 10 15:23:26 ": "Well!! This is Eddie getting ready for Cerritos on sat. The 15th of December  the OJAYS BE THERE", "Mon Dec 31 21:48:30 ": "I'm closing in on 10,000 followers on twitter lets do the dam thing show me some love", "Wed Oct 31 19:45:04 ": "Well!!!NYC,NJ,OUR RAYERS ARE WITH U... Know this we are our brothers keeper.. I AM AMAZED AT THE AFTER EFFECT... GOD IS GREAT!!!!", "Mon Oct 22 06:50:28 ": "Well!!!! A big shout to the REV. JESSE JACKSON ON HIS 71st  BIRTHDAY WAS A GUEST..HAPPY BIRTHDAY TO U", "Wed Mar 27 16:08:23 ": "@BriBaby64 you don't have to call me father just call me BIG DADDY!!!!", "Mon Apr 01 19:29:51 ": "@ElysaSmith well!! He had a heart attack so unexpected .", "Tue Nov 20 21:38:03 ": "@BriBaby64 Come on this is what I do NOV 25,2012 this Sunday the 12th is gone bye bye", "Tue Feb 26 19:49:16 ": "Well!!! LET US ALL SAY A PRAYER FOR MY FRIEND JO JO", "Mon Mar 18 18:19:09 ": "@BriBaby64 it's  @BriBaby64 @Eddie_Levert I'm always there when u need me!!!!!", "Mon Nov 26 15:58:10 ": "Well!!! Pacton Baker great job SOULTRAIN AWARDS. Great seeing KENARD,MICHAEL,TONY, all the guys. Had a good time with CEDRIC.STAY IN TOUCH", "Sat Mar 23 18:29:19 ": "Well!! Today is the Bday of one off music's great ladies @PrettyMill1 love you woman and you know that HAPPY BDAY STEPHANIE MILL MANY MORE", "Sat Nov 24 22:33:55 ": "Well!!! This Sunday B.E.T and CENTRIC, TIME LIFE, keeping the SOUL TRAIN AWARDS KEEPING THE TRAIN ON TRACK 11/25/2012 CEDDIE,EDDIE CASANOVA", "Sun Sep 16 20:32:32 ": "@Racquelnicole3 @Eddie_Levert @SamuelLJackson that's cold", "Thu Nov 01 16:23:31 ": "Well!! Just watched Mississippi Burning  and to think there are a lot of people out there still feel and act this way!!SHAME ON U,HATERS", "Mon Apr 15 19:56:13 ": "@Eddie_Levert @SnopppDogg @SnoopDogghad a good time with u on the cruise you rocked it", "Thu Feb 21 21:38:55 ": "Well!! We lost another great actor today mr Lou Myers. All I can say is let's keep in touch so we will know how we are doing. May god bless", "Thu Nov 15 00:50:23 ": "@BriBaby64 well!!!! U have a great thanksgiving u and your hubby enjoy and may god bless", "Tue Nov 20 21:34:48 ": "Well!!! New edition, Fantasia,Anthony Hamilton , The show is hot from top to bottom.. BET,CENTRIC KEEPING THE MUSIC ALIVE THE S,L AWARDS", "Mon Oct 15 18:13:10 ": "hey man I love it hope there's some way I can be involved $$$$$$LOL", "Fri Jan 11 16:31:18 ": "Well!!! Eddie Levert radio coming soon105.7 oasis in the middle of GOD'S PARADISE", "Sun Oct 07 16:31:44 ": "Well!!! The cold,wind,rain,snow,can't stop nothing if its GOD'S WILL.. Thank y'all for coming out OKC LOVE Y'ALL !!!!! See u again real soon", "Tue Apr 09 05:16:50 ": "Well!!! REST IN PEACE DONELLE CLARKE", "Tue Nov 06 17:25:33 ": "WELL!!!!!!! GIVE THE PEOPLE WHAT!!!GIVE THE PEOPLE WHAT!!!GIVE ,EM WHAT THEY WANT OOOOBBBBAAAAMMMMAAAA WELL,WELL,WELL,WELL OBAMA", "Mon Apr 15 18:29:14 ": "Well!!!! Do my man know how to do the dam thing what a party!!!! Me and Tyler Perry throwing down on the beach party. Tyler he sings too", "Wed Nov 21 14:30:22 ": "@RandyB_Me got a cd out called I STILL HAVE IT !!! The single is called WHAT IF!!!   father and son Go to LEVERTFATHERANDSON11@gmail. Com.", "Wed Jan 09 15:50:48 ": "Well!!! SAT.1/26/2013 SOUTH POINTE HOTEL + CASINO 10-6pm over 3,000 women,hundreds of vendor and me and the DIVAS LAS VEGAS COME JOIN US", "Mon Apr 15 18:30:53 ": "@TieshaTalk my bad doing to much HAPPY LATE BIRTHDAY", "Mon Dec 17 20:31:34 ": "@DTopCatBlu hey lady wishing u the same. Coming to atl soon much love and GOD'S BLESSING", "Mon Apr 15 18:22:02 ": "RT @2050Media: @tylerperry @TJMShow @eddie_levert on the #tomjoynercruise beach party http://t.co/KJcqWeiLoP", "Fri Sep 28 00:10:19 ": "Well!!!! The  song is called WHAT IF... The cd is called I still have it", "Mon Mar 18 22:24:53 ": "@JJH_London @Eddie_Levert waiting to hear songs from G&amp;H BUT CAN'T WAIT!!", "Mon Dec 24 08:19:14 ": "Well!!! Merry Christmas to all of my followers on twitter. I would love to have more than 8000 followers for christmas come on y'all", "Sat Apr 20 13:35:12 ": "Well!!!@KingJames @DwyaneWade @Eddie_Levert @pat_riley THE HEAT IS ON LET'S DO IT AGAIN", "Mon Oct 15 19:38:53 ": "@BriBaby64 we parteeeeed off the chain ask anybody!!!!! I was the $hit lol", "Sun Apr 21 22:16:10 ": "@BriBaby64 well!!!!flying all day", "Sun Mar 31 21:27:07 ": "Well!!!@ChakaKhan How old are u????  But being close to old as dirt and looking that good you should be shame. Happy B day CHAKA love you", "Fri Sep 28 16:49:14 ": "Well!!!! HAPPY BIRTHDAY SEAN LEVERT I REALLY MISS U MAN", "Tue Nov 06 15:21:45 ": "Well!!!' OHIO,OJAYS,OBAMA  TIME TO MAKE A STAND AND LET THE WORLD FEEL U !!!'OBAMA TODAY TOMORROW IS TO LATE", "Thu Nov 15 00:38:54 ": "@BriBaby64 well!!!! I'm on my way to Louisiana for the holidays", "Thu Feb 21 19:58:41 ": "Well!!! Just got off the soul train cruise had a great time we rocked the boat. Thanks to time life, centric, KENARD, tony,mike,micheal", "Tue Nov 13 01:27:35 ": "RT @idrisjacara: @Eddie_Levert Say it ain't so! Poor still WITHOUT POWER AFTER 3 WEEKS from HURRICANE SANDY!!!! - ABC World News Pls Ret ...", "Tue Apr 23 16:11:19 ": "@lostsessions well!!! No I'm not", "Tue Nov 20 17:40:07 ": "Well!!!! Down in Louisiana for thanksgiving gonna meet family of my family.....hope the food is good !! They supposed to know how to cook", "Tue Nov 06 04:10:15 ": "Well!!!! NOT BECAUSE HE'S BLACK AND WHITE VOTE BECAUSE HE'S RIGHT!!!!!!! OBAMA BRINGING US ALL TOGETHER!!!", "Mon Mar 18 21:12:05 ": "Well!!! The time is now we are the studio cutting some music I'm so excited Ojays fan get ready for the music and scholarship weekend in oct", "Sat Nov 03 01:41:21 ": "Well!!!! Time to pick your man.,,,, VOTE OBAMA !!!!!!!!!", "Fri Sep 28 00:26:14 ": "Well!! The email address for Sirius is http://t.co/TsljQsM9 heartandsoul let do the dam thing", "Sat Apr 20 12:46:12 ": "Well!!!JACKSONVILLE FL!!!!' Are u ready for us we are on our way come get your Ojays fix its good for u", "Fri Nov 16 00:21:19 ": "Well!!!!! The jays in New Orleans on Friday 11/16/2012 be there I'll be there", "Fri Nov 02 01:48:16 ": "@BriBaby64 what's up bribabbbiiiiieeeeeeeeyyyuuuuuuuui", "Mon Apr 22 21:13:00 ": "Well!!! Awwwwwwhhhhhaaa I BET THE HEAT SWEEP THESE BOYS", "Thu Oct 11 00:08:23 ": "Well!!!! In each day there are 24 hours to do with as you see fit. If you don't like how your life is, change it.why keep doing yourself?", "Thu Oct 11 15:14:24 ": "Well!!!! Two of the finest women in the world with brains are THE FIRST LADY MICHELLE OBAMA AND GABRIELLE UNION!!!! I'm just saying", "Thu Nov 15 00:40:43 ": "@BriBaby64 yes in laws", "Sun Sep 16 20:28:15 ": "@rolandsmartin @Eddie_Levert anything not to pay me ROL u need to speak to them lol", "Thu Oct 04 03:55:01 ": "Well!!!! I'm still down Barack Obama !!!!!!! Stay up they are out to get u", "Mon Mar 18 18:26:01 ": "@Ebeyccfc @Eddie_Levert  MEMBA WE ARE AND STILL IS!!!!!!THE BEST NUMBER UNO!!!!!!", "Fri Jan 04 19:25:06 ": "@TheRealMikeEpps when are u in vegas@TheRealMikeEpps @Eddie_Levert lets do the thing", "Wed Mar 27 20:36:23 ": "@BriBaby64 you changed your hair style what u going thru a change. The family is good how yours is too", "Wed Oct 10 06:02:00 ": "@BriBaby64 well!!!' Where u been", "Fri Oct 05 14:53:13 ": "Well!!!!! The greatest lesson of them all is honesty! The dark side wants to control and is pumping out fear and unhappiness", "Wed Jan 23 15:34:06 ": "Saw u on CNN. From musician pov there I no way Beyonce and orchestra could have gals that", "Sun Dec 16 02:48:05 ": "Well!!! NEWTON CONN. may GOD BLESS AND GET U ALL THRU THIS MY HEART AND PRAYS ARE WITH U", "Fri Nov 23 20:23:57 ": "Well!!!! Me,Cedric,Charlie Wilson FANTASTIA and more B,E,T CENTRIC,TIME LIFE KEEPING THE TRAIN ON TRACK HONORING DON CORNELIUS.ITS ON SUNDAY", "Sat Oct 13 16:55:49 ": "Well!!! Had them jumping @ YOSHI'S last nite. Gonna do it again tonite two shows. Get your tickets now.  I'm just a bad man I'm not kidding", "Thu Oct 11 17:27:14 ": "Well!! Tomorrow !!!! YOSHI'S!!!!! San Francisco , Oakland, Bay Area , EDDIE LEVERT,2 nites 4 shows. Lets do the dam thing still got tix.", "Sat Oct 20 19:05:41 ": "Well!!! The world won't get no better if we just let it be we got to change it y'all.. thank u gamble and huff. LET'S GO BIG O!!!!!!!", "Sun Apr 21 20:30:16 ": "@BriBaby64 well!! What's up queen u get to church today", "Sun Oct 07 21:43:04 ": "Well!!! COME ON BAY AREA ME EDDIE @ YOSHI'S 10/12+13/2012.. FOUR SHOWS STILL GOT TICKETS SO DON'T ASK FOR NONE. IF I CAN'T SALE THIS OUT LOL", "Tue Jan 01 05:19:17 ": "Well!!!! It's starting to get to the new year so before I get to far into it I want say happy new year to all", "Mon Nov 26 17:30:50 ": "@AmpsDallas well!!! Off the chain!!!", "Wed Nov 07 04:44:06 ": "Well!!!' I'm still a winner me and the PRESIDENT OBAMA !!!!we still have it !!!!!", "Tue Feb 12 00:29:25 ": "Well!!! If each of us greets others with friendship and love,then they will most likely respond in kind.until the whole world works together", "Mon Jan 07 18:09:26 ": "Well!!!! EDDIE LEVERT WILL BE SHOOTING IT WIT THE BREEZE CHECK US OUT ALL U DIVAS", "Tue Nov 20 22:53:27 ": "Well!!! Made a boo boo SOUL TRAIN AWARDS NOV 25th 2012 THIS SUNDAY B.E.T, CENTRIC, KEEPING THE MUSIC ALIVE GO CEDRIC,GO CEDRIC!!!!!!!!!!!!!!", "Wed Nov 28 20:12:43 ": "RT @LuvMeMoreLuv: @Eddie_Levert Need and deserves more followers #SoulTrainAwards", "Mon Feb 11 15:41:19 ": "Well!!! Thanks to all the fans that came out in St. Louis and the ATL I had a great time even with the sound problems thank y'all so much", "Mon Jan 21 04:11:14 ": "Well!!!! Two more days before Eddie Levert radio in the middle of gods paradise 105.7 oasis starting Tuesday while the cats away EDDIE PLAYS", "Fri Mar 01 18:34:18 ": "Well!! We have lost one of our bro mr JO JO TYNEs  love you man gonna miss u very much may GOD bless", "Fri Apr 19 03:23:17 ": "Well!!!@IAmSteveHarvey hey Steve loving every minute of the family feud  I just got say pork-cue-pine LMAO LOVE U MAN", "Mon Jan 14 02:00:22 ": "Well!!! Check out this website http://t.co/ypXuxUOG Let me know what u think", "Mon Mar 18 18:21:48 ": "@ravenryandancer @Eddie_Levert  Cause we are that special kind so!!!! HOLD ON!!'nnnn", "Wed Nov 21 03:16:55 ": "@RandyB_Me well!!! If it ain't the one man band what's going on heard u were out with WILL??? Tell him I said hello.", "Fri Apr 19 16:12:11 ": "Well!!!! What's up with these women with these false eyelashes wearing them like they everyday wear? Some so big looks like CATERPILLARS", "Wed Oct 10 06:03:19 ": "@MarquezG well!!!! What up boy", "Wed Nov 28 20:20:41 ": "Well!!!! What you gonna do CONGRESS ABOUT THOSE TAXES GONNA DO THE SAME SHIT U DID LAST TIME AIN'T GONNA WORK GOTTA SHIT OR GET OFF THE POT", "Mon Oct 22 18:47:24 ": "Well!!! Small world isn't it. Second Day in a row ran into Larry Flynn pub.of hustler magazine?????", "Tue Jan 15 16:04:07 ": "Well!!! It's 7or 8 more days before Eddie Levert radio 105.7OASIS IN THE MIDDLE OF GODS PARADISE MAKE IT A DATE", "Thu Oct 04 18:00:39 ": "Well!! Free yourself from petty thinking. Don't gossip. Don't waste time holding old grudges. Think of good,love,a better self. For MITT", "Tue Nov 20 21:28:13 ": "Well!! I'm in Lafayette... Where the soul train awards are on this Sunday also your city Sunday nov 12th 2012 CEDRIC,CHARLIE,TYRESE,EDDIE", "Wed Oct 10 04:19:07 ": "Well!!! It is not Thursday + Friday it's Friday + Saturday four shows over two days the 12th and 13th two shows a nite. Got more tix", "Thu Oct 04 18:00:41 ": "Well!!! On my way to harrah's tunica miss. Tonite the Ojays one nite only let get it on!!!!'", "Sat Oct 06 18:07:02 ": "Well!!! I'm freezing my a$$ off in Oklahoma.... It is cold as hell!!!", "Sun Oct 21 20:38:12 ": "@MotownPride love the heat and south beach but wasn't me. Love GABRIELLE  but I'm married so Dwayne u r cool I wasn't there", "Wed Apr 10 18:20:18 ": "Well!HEY TOM JOYNER WHERE U AT! In PUERTO RICO WAITING ON U MAN GOTTA GET MY VOYAGES ON!!!!", "Mon Nov 26 02:08:25 ": "Well!!!! I'll be tweeting #Soultrain awards", "Sun Apr 21 04:27:25 ": "Well!!!Jacksonville FL LOVE Y'ALL what a great crowd what a great time y'all make it so much for us to do what we do GOD BLESS Y'ALL"}