{"Thu Jan 10 16:32:04 ": "Piratas, o resultado da promoção: QUERO IR PRO KART COM LU &amp; CRU já saiu lá no face. Corre lá pra ver se vc foi um dos sortudos!!", "Mon Feb 04 19:27:43 ": "PIRATAS! VAMOS BOMBAR DE VOTAR NISSO! A MISTURA VENCEDORA TOCA NO CIRCO VOADOR! Rio Maracatu+Bloco Cru=Maracacru https://t.co/6U2CE7H8", "Fri Mar 29 16:12:15 ": "Coelhinhos Piratas, já encontraram seus ovinhos de Páscoa? Não esqueçam do show do CRU, dia 06/04, no Studio Rj. http://t.co/zIsQbcuKVX", "Wed Mar 07 15:19:43 ": "O Cru visitou os bastidores do @Camiseteria e mostra pra vocês como foi! =D http://t.co/LzxJkXn6", "Thu Mar 14 19:07:06 ": "SHOW À VISTA! O rock tropical Lu&amp; CRU de volta aos palcos do Rio. :)\nLink: http://t.co/zIsQbcuKVX", "Thu Jan 03 20:05:02 ": "Início das comemorações de 5 ano do CRU, na Casa Rosa!!! http://t.co/WV712DLV", "Mon Mar 12 20:43:12 ": "E hoje tem Oficina de Rock Batuk na Casa da Matriz. Venha fazer uma aula experimental grátis, a partir de 20h!!! =D", "Thu Feb 21 01:54:46 ": "ISSO É BLOCO CRU! http://t.co/hrWCxQK2cC", "Tue Apr 09 19:06:09 ": "CD à venda no I tunes:https://t.co/0i8GBCinzV — com SONY MUSIC B2B.", "Fri Dec 28 15:01:57 ": "Valendo par de VIPS! Curta a Pág CRU, compartilhe o evento e concorra a um par de convites do show HOJE, na Casa Rosa \nhttp://t.co/pxP8Lm9J", "Wed Feb 13 17:22:12 ": "Piratas, muita emoção no CarnaRock Lu &amp; CRU 2013! Agradecemos a presença de todos vocês. Viva nosso rock batuque!", "Wed Apr 04 19:34:25 ": "Sexta-Feira tem show do @BlocoCru no Parada da Lapa. Tributando a rádio Maldita. Quem vamos???", "Fri Dec 21 14:56:00 ": "21/12/12 Dia do fim ou recomeço? Mais importante: PRIMEIRO DIA DO VERÃO! Fato é que em 2013 o CRU faz 5 anos e o bolo já está pronto!", "Thu Mar 28 20:53:39 ": "Lembrando do próximo show Lu &amp; Cru: Studio Rj, dia 06/04. Às 21h. Vamos galera!! http://t.co/qSyYBP6qVi", "Mon Dec 17 17:48:37 ": "VOLTAMOSSS!!\nO extinto twitter \"Bloco Cru\" agora é \"Lu &amp; Cru\". E já vamos chegar cheios de novidades.\nAguardemm...", "Wed Mar 21 14:20:13 ": "@thalitacajueiro Uhul! Sábado tem show da gente na Casa Rosa, bora reviver esse carnaval ai.", "Thu Dec 27 18:15:11 ": "Amanhã a Piratada desvairada inicia suas comemorações de 5 anos! Vamos invadir a Casa Rosa pra galera se acabaar!!! Pré-reveillon open bar!", "Mon Feb 18 21:28:34 ": "Já viu as nossas camisas? E não tem a sua? Então pode falar conosco! atendimentocru@gmail.com Fazemos a entrega. http://t.co/L01Q59Xx", "Tue Dec 18 17:09:55 ": "Hoje é aniversário do lendário #Keith Richard. Tá no “Olimpo” dos rockeiros sagrados! Homenagem dos CarnaRockeirosCRUS! http://t.co/NtSaKhPQ", "Thu Apr 26 19:02:01 ": "CRU BAILE - SWING, SAMBA N’ ROLL no Rival + Tarde, nesse sábado. Quem vamos???", "Thu Jan 10 11:09:02 ": "RT @millarocha: Creep versão @luecruu &lt;3", "Fri Apr 05 19:12:29 ": "AMANHÃ É DIA DE PIRATA SER FELIZ! Show ‘Rock Tropical’ da banda Lu&amp; CRU no Studio RJ. Depois festa RITZ com DJ Edinho: Rock e pop pra dançar", "Tue Feb 19 15:42:14 ": "Confira nosso novo set, com fotos da gravação do Estúdio I: http://t.co/zeui7jSE", "Fri Jan 25 17:12:46 ": "Ontem foi dia da nossa oficina dar um show de rock batucada no Teatro Odisséia! Piratas, ARRASARAM! http://t.co/pblrZ8Ka", "Fri Mar 01 16:20:36 ": "Dia 3 de Março, Bazar Noir especial Rockabilly. Prêmios para os\nmelhores looks. VEJA MAIS: http://t.co/pqTQWSYrVz", "Mon Mar 12 20:48:33 ": "Opaaa! A aula de hoje foi cancelada devido ao dilúvio que está havendo em algumas partes da cidade!!!", "Fri Apr 27 14:38:32 ": "Colocou seu nome na lista para o show amanha? Não! OMG, depois não diz que eu não avisei...https://www.facebook.com/events/291009347640144/", "Mon Apr 08 20:41:01 ": "Quer tocar no CRU? Vagas abertas para a oficina. Segunda às 20h e Terça às 19h30h- Casa da Matriz Botafogo. Mais infos: oficinacru@gmail.com", "Fri Jan 18 16:13:44 ": "http://t.co/g7NrWIqI Show no Calouste Hojee!!!!", "Sun Jan 13 16:24:08 ": "Matéria do cultura.rj: http://t.co/1vryvmIQ", "Wed Dec 26 16:24:08 ": "Como foram de Natal Piratas?? O do Cru foi lindo! Agora só esperando 2013 para MUITAS NOVIDADES!!", "Fri Feb 22 19:40:26 ": "SEXTA! Vamos sacudir o esqueleto.\nhttp://t.co/6rIn3Gz2YB põe a gente pra tocar que é só alegria.", "Tue Apr 02 18:05:15 ": "Matéria do casamento de Gabi e Leo, que fizemos show. O casamento foi mágico! Os noivos deram até uma canja. http://t.co/7qSAT9TOz4", "Wed Jan 02 18:04:04 ": "Nosso votos de feliz ano novo estão um pouco atrasados mas são de coração, okkk", "Fri Dec 21 00:35:01 ": "Fim do mundo se aproximando... SERÁ??? Nãoooo, espera o lançamento do CD Lu &amp; Cru, galera aí dos céus!!", "Tue Apr 10 16:23:58 ": "Quem não chora não mama – Por Lu Baratz http://t.co/ixGubfEL", "Sat Mar 24 17:50:40 ": "Hoje tem CLIMINHA de CARNAVAL na Casa Rosa com o Bloco Cru. Chega mais piratada!", "Thu Dec 20 18:54:53 ": "Próxima parada: Lançamento do CD digital no Studio RJ, dia 11/01!  http://t.co/hO1NGhBU http://t.co/UtJCSBnB", "Tue Feb 19 16:42:55 ": "Quer ser um Pirata Cru e batucar o ano inteiro? oficinacru@gmail.com e descubra como.", "Wed Jan 02 18:03:22 ": "FELIZ ANO NOVO PIRATADA!!!", "Fri Dec 28 14:59:21 ": "Tá rolando promoção do show de hoje no Faceee!!!", "Fri Mar 30 16:43:34 ": "@Cassia_FAndrade No RESERVA+, na galeria River ali no Arpex. ;) Conhece?", "Thu Dec 13 17:03:30 ": "Atenção Piratas seguidores!!!\nNosso novo twitter é https://t.co/MT9oi0jn\nSegue a gente lááá.. muitas novidades rolando!", "Mon Apr 08 18:17:04 ": "Valeu, lindezas e ‘lindezos’ que estiverem junto comigo e com a banda CRU Sábado no Studio RJ. Kiss me, I’m a Pirate! (Lulu Baratz)", "Mon Dec 17 23:58:23 ": "Oficina de #rock batuqueiro é aqui!!!!! http://t.co/2QOWHAZX", "Thu Mar 22 15:06:40 ": "Aos desavidados, ta rolando promoção na nossa FanPag no Facebook. Para os mais desavidados ainda, tem show do Bloco Cru na Casa Rosa sábado!", "Thu Mar 29 16:27:05 ": "Quer batukar? Quer desestreçar? Quer conhecer gente legal? Quer mudar de vida? Vem pra Escola de Rock Batuque, bebê. Inscrições AQUI!", "Tue Jan 08 23:37:49 ": "http://t.co/kXY8vcQu … Já botaram o nome na lista amiga para o Super Show de Lançamento do CD, na sexta?", "Fri Mar 23 18:33:00 ": "\" Não me envergonho de mudar de ideia, porque não me envergonho de pensar!\"\nChico Anysio", "Wed Mar 21 21:50:24 ": "Quer concorrer a 2 pares de ingresso para o show do Bloco Cru na Casa Rosa? Curta a nossa fanpage e saiba como. http://t.co/pxPdiWiT", "Wed Mar 13 17:30:29 ": "Sente só essa tatoo cobrindo as costas todinhas com o tema Pirata!\nfonte: http://t.co/yAyAMYDGJi", "Mon Feb 04 14:37:08 ": "PIRATAS! VOTAÇÃO ABERTA: PRA VC QUAL O MELHOR BLOCO DO CARNAVAL CARIOCA?http://t.co/7ChK80DY", "Thu Jan 24 01:10:08 ": "Show amanhã no Teatro Odisseia!!!!!! A partir das 21h, queremos ver todossss lá!!\nhttp://t.co/uZqFFLsB", "Wed Dec 19 20:39:44 ": "É isso aí, galeraaaaa! Lançamento do primeiro CD Lu &amp; CRU CarnaRock Vol. 1. Quero ver todo mundo lá! http://t.co/cMrOqqze", "Fri Apr 27 18:19:51 ": "Gravação do Cd AO VIVO do Lu Baratz &amp; Bloco Cru no Rival. Vamos? https://t.co/D0tTF6C7", "Fri Dec 28 15:29:58 ": "Resultado da promoção do show de hoje saiu lá no face!!", "Mon Jan 28 15:19:39 ": "Guia dos bloco da Veja Rio.. Olha a gente aiii!! http://t.co/xukOhfOb", "Fri Apr 05 19:13:58 ": "Lista amiga Show de amanhã no Studio Rj: atendimentocru@gmail.com", "Wed Apr 04 16:51:08 ": "Quem por aqui ouvia a rádio maldita???", "Wed Mar 21 14:19:17 ": "RT @carolrodrigues: Sabe o q eu queria hoje? @blococru em mp3 pra ouvir no trampo. Saudade daquela alucinação coletiva.", "Wed Apr 04 16:24:38 ": "Pra quem foi e quem não foi tem fotos do Lu & Cru no Reserva +. Olha aê! https://t.co/Tc8HuyMj", "Fri Feb 15 17:05:32 ": "Galeraaa, hoje tem Casa Rosa!! Ressaca de Carnaval com cerveja, água e refri liberados até as 2h!!!!!! http://t.co/lH0uSrwh", "Thu Apr 05 13:12:33 ": "Ta rolando promoção na nossa fanpag. Crurta e participe! https://t.co/v8fY06hW", "Wed Mar 21 14:23:52 ": "Aviso aos piratas do twitter: Hoje tem promoção na nossa fanpage, da um CRUtir ai e fica ligado! https://t.co/v8fY06hW", "Fri Jan 11 16:58:49 ": "Sony Music Arrebenta!!!\nhttp://t.co/Pqo59ftv", "Tue Apr 09 20:30:13 ": "PROMOÇÃO: no mês de abril, aluno do CRU ganha uma Heineken long necks de graça ao pedir um petisco no bar Salvação.http://t.co/zxy480RUcS", "Fri Dec 28 15:03:16 ": "http://t.co/iTGWgSXj\nShow de HOJE!!!!!", "Mon Mar 12 16:42:34 ": "@giuliazobaran Aqui tem algumas fotos bem bacanas. https://t.co/YbtNyMzZ", "Sun Apr 01 16:25:17 ": "Vou dar o papo para a alegria do domingão. Bloco Cru 18:00 na Reserva +, ali na Galeria River no Arpex. Quero ver todo mundo lá, tenho dito.", "Thu Feb 21 01:37:09 ": "2º Super aulão ao ar livre da Oficina Cru. VEM, GENTE! Dia 03/03, às 16:00. http://t.co/iGliaYXBRo", "Fri Mar 09 19:36:55 ": "Isto era uma verdadeira piratada! http://t.co/60CPT3WL", "Tue Feb 19 16:06:12 ": "@olivia_colares Deve! Hehehehe", "Sat Dec 29 01:18:49 ": "Ja já, CRU no palco da Casa Rosa! Quem ainda tá em casa? Corre pra lá, o open bar é até as 2h!!!", "Tue Mar 06 21:28:14 ": "O Cru quer saber: que música você gostaria MUUUUITO que a gente tocasse?", "Tue Jan 15 14:28:29 ": "Links do Itunes: https://t.co/GrYDO0KD\nhttps://t.co/8V7gYjNl", "Fri Dec 28 15:02:18 ": "Últimos minutos para participar da promoçãoo!!", "Wed Dec 26 19:28:45 ": "Próxima parada: 28/12/2012 - Casa Rosa, RJ, evento: http://t.co/iTGWgSXj", "Tue Mar 06 18:54:55 ": "RT @silvioafonso: Bloco Cru! (@ Circo Voador) http://t.co/KiEocr7F", "Thu Mar 22 17:30:25 ": "Corre Lola, corre. Nossa oficina está com as inscrições abertas e batukar é o melhor remédio para animar qualquer segunda-feria.", "Thu Jan 10 16:32:21 ": "Matéria Nova!!\nBlah Cultural:\nhttp://t.co/P6AY2Xhr", "Thu Mar 28 20:08:54 ": "EXTRA EXTRA: confiram o ELIZA'S TABLOID, blog da nossa insuperável baixista ELIZA SCHINNER:http://t.co/pQa9N5rDQJ", "Fri Dec 21 14:57:46 ": "O mundo continua, a gente se diverte e prepara uma invasão intergaláctica de rock e batuque diretamente do planeta CRU! http://t.co/8Ko7HiW6", "Mon Apr 15 20:30:28 ": "Niterói, São Gonçalo e arredores: estamos chegando! Lu &amp; CRU, dia 18/04, na boate WAXY em Icaraí. Todos lá! Evento:http://t.co/hvOD9ESG2p", "Wed Feb 13 17:35:36 ": "Galera! Sexta tem show! 15/02 na CASA ROSA. Vai ter Lu &amp; CRU e a Orquestra Popular Céu na Terra! Imperdível! :)\nhttp://t.co/hhBCJwOf", "Thu Mar 29 16:56:56 ": "RT @CoqueiroVerde: Amanhã tem @autoramas lançando o álbum \"Música Crocante\" no @studio_rj !!!", "Thu Mar 21 17:03:22 ": "Valendo 1 convite pro show + Camisa CRU pra qm curtir a fanpage e compartilhar o post\nLink show:http://t.co/zIsQbcuKVX\nResultado dia 27/03", "Wed Mar 13 17:32:56 ": "Galera, dia 06/04 tem Lu &amp; Cru, no Studio Rj!!! http://t.co/zIsQbcuKVX", "Thu Dec 20 13:27:36 ": "Matéria que saiu ontem no Boa gente.\nLu &amp; Cru, rumo ao lançamento do CD!!! http://t.co/KN48ioe5", "Tue Jan 08 23:38:24 ": "Lu &amp; Cru hoje na Globo News, no Estudio I !!  Viram Piratas?? Foi DEMAIS!!!!!!!!!!!!!!", "Tue Feb 05 12:54:10 ": "Bom dia rock batuqueiros! Estamos ansiosos pelo nosso encontro no carnaval! Não consigo dormir direito! Bjs Lu Baratz http://t.co/2GqNdxpI", "Wed Jan 02 18:06:29 ": "E simbora, rumo a próxima parada: Dia 11 de Janeiro, sexta-feira, Lu &amp; Cru no Studio RJ!!! Lançamento do nosso, tão esperado, CD Digital!!", "Mon Feb 04 19:33:56 ": "http://t.co/UHEQjEt3 Sexta foi dia de #BailedaSebastiana. A pirata #LuBaratz experimentou a folia mais tradicional do Rio", "Mon Jan 14 19:15:36 ": "Sexta tem show no Calouste. Vamos todos!! É de GRAÇA galera!!!\nhttp://t.co/XK7Mmm7y", "Fri Mar 30 16:37:21 ": "Chegou a sexta, e vou deixando claro que nesse domingo tem Bloco Cru, para Para noooooossa alegria!!!", "Fri Mar 22 19:10:14 ": "PRÓXIMO SHOW: Lu &amp; Cru no Studio RJ Dia 06/04, às 21h. E ai galera, vamos dançar muito ao som do nosso Rock Tropical. http://t.co/zIsQbcuKVX", "Fri Dec 28 15:30:02 ": "E pra quem não foi sorteado, não chora não!! Hoje tem Open bar e a lista amiga vcs já colocaram os nominhos? http://t.co/iTGWgSXj", "Sat Mar 31 20:13:03 ": "Domingo morto? Não mesmo! Amanha Bloco Cru na Reserva + no Arpoador.  Bora Piratada!", "Wed Jan 09 11:42:26 ": "Link do CD no Itunes: https://t.co/j09jWAJN\nARRASAMOS!!!", "Wed Dec 26 19:36:37 ": "Matéria do O Globo:  http://t.co/ML0vt5ft", "Wed Apr 18 15:21:59 ": "Ta afim de mais uma dose? http://t.co/KVJK2GFn"}