{"Thu Apr 11 04:36:06 ": "@haleyeaura my bad.  sorry about that.", "Tue Apr 09 23:19:40 ": "Glee Preview: 10 Scoopy Tidbits From This Week's Harrowing 'Shooting Star' Episode http://t.co/cBTMKpUSVV via @TVLine", "Thu Apr 11 04:23:58 ": "@druidDUDE please take the pins out of your sweater vest.", "Tue Apr 16 18:02:24 ": "@sawahcate ...  @peterstaunton5 is itchin' for you to be his prom date.  @chordoverstreet thinks it's a good idea &amp; so do I.  How about it?", "Thu Apr 04 02:09:07 ": "I love this behind-the-scenes look at Guilty Pleasures w/ Lea, Chris, Kevin, Jenna, Chord, Blake, and Becca: http://t.co/YV3EPFms4g #Glee", "Sun Apr 21 06:50:58 ": "@JennroseLucas awwww... I'm glad you liked it!  :)", "Thu Apr 04 01:57:24 ": "@ikebarinholtz Calzone.  Didn't the Latin School teach you anything, you stupid shit?", "Thu Apr 11 23:16:16 ": "Congratulations to the cast, crew, and Lord Tubbington on tonight's episode.  #ShootingStar  #Glee", "Wed Apr 10 04:34:03 ": "RT @GLEETV: we've got more stories to tell on The New Normal. Help us make sure the marriage lasts until next season http://t.co/D1W3DZidu3", "Fri Apr 19 21:44:20 ": "HEALTH TIP: If you brush your teeth at least once a day you feel slightly better about yourself.", "Fri Apr 12 17:40:19 ": "RT @thesulk: Hey, high school girls, be nicer to the boys or they'll turn out like me.", "Wed Apr 10 00:16:51 ": "@ichadlowe But freeways are the only place with good reception.", "Thu Apr 11 23:31:10 ": "@ohmyblainers I don't think so.  Chord is afraid of cats.", "Wed Apr 03 01:56:35 ": "@_hummelanderson Monty dumped him... after stealing Gary's wallet.", "Thu Apr 11 04:01:09 ": "@damianmcginty remember to drive on the right side of the road and you'll be (mostly) okay.", "Fri Apr 05 19:45:21 ": "@TroutyMouthBlog It's one of those episodes that could and should be nominated for acting and directing Emmys.  I hope you like it.", "Fri Apr 12 01:03:57 ": "Get ready for #Glee #ShootingStar.  Excellent performances by our very talented cast.", "Tue Apr 09 18:46:53 ": "Kim Jong-un Starred in ‘Grease’? http://t.co/jaRSI82dsb via @thedailybeast", "Mon Apr 08 17:14:14 ": "@ClaireMilne I apologize.", "Tue Apr 09 17:02:06 ": "Glee Spoiler: 5 Things to Know About \"Shooting Star\" http://t.co/xS60446wsR via @eonline", "Sun Apr 14 02:17:16 ": "WARNING: My cousin Jasmine paid $200.00 to a \"tattoo artist\" at Coachella who drew a shark on her arm with a magic marker, then ran away.", "Thu Apr 11 04:05:24 ": "RT @All4Naya: @hitchmichael Hey! Can we get some help with this poll for Santana!? http://t.co/xzlsrkYi4i", "Tue Apr 02 18:48:53 ": "Tonight it's 'The New Normal'finale as @AndrewRannells &amp; #JustinBartha  prepare for 'The Big Day' http://t.co/pZesZ8PWMt via @HuffPostTV", "Fri Apr 05 19:40:44 ": "@falsegrant Yes you will.", "Wed Apr 03 01:59:25 ": "@AndrewRannells you would be GREAT as Blaine's father.  Or older uncle.  Or grandfather.", "Thu Apr 11 20:07:02 ": "RT @ETonlineAlert: #Glee star @dotmariejones previews tonight's emotional and eventful episode, 'Shooting Star' http://t.co/nTE2LNKkXc @ ...", "Wed Apr 10 17:07:48 ": "@A_song_for_you_ the ice cream that was included with the meal.  :)", "Thu Apr 11 02:56:26 ": "@JOAQUINSEDILLO I would feel sorry for her if she didn't complain all the time about no orange juice at craft service.", "Mon Apr 08 05:31:15 ": "Movies and fellowship.  Good times.", "Fri Apr 12 17:02:20 ": "#FF funnybones edition:  @Therealjimwise @EddieAlfano  @McBrewster @Jeremy_Rowley @thesulk @katiedippold @ArdenMyrin @RealAdamRose", "Mon Apr 15 05:56:44 ": "@jessewoodrow and you as well. :)", "Thu Apr 04 03:24:06 ": "RT @EddieAlfano: I thought the deal was, you don't make any kids and then you don't grow any hair in your ears?\n\nTHIS IS BULLSHIT.", "Thu Apr 18 17:18:46 ": "The O.G.'s are back tonight.... http://t.co/OrWxGIGP6Z via @youtube #Glee #SweetDreams", "Wed Apr 10 17:06:58 ": "@dapperlylauren Breadstix is always better, in spite of the cockroaches and numerous health code violations.", "Thu Apr 11 23:28:41 ": "@keepentertainin i've seen the episode.  the cast and crew did amazing work.", "Thu Apr 11 04:16:24 ": "@TroutyMouthBlog no time for bookies.. too busy playing the slots.", "Sun Apr 14 15:27:39 ": "WARNING: My cousin Jasmine got into a slap fight at Coachella with a girl in a Jonas Brothers tube top.", "Thu Apr 11 03:57:28 ": "'Glee' preview: 10 things to know about 'Shooting Star' http://t.co/9zz4Z5Ora4 via @zap2it", "Fri Apr 05 19:42:37 ": "@Nayaismyidol25 i don't know if you will cry, but I did.", "Wed Apr 03 18:16:35 ": "On location with  #TheNewNormal with the talented trio @Georgia_MayKing @AndrewRannells &amp; @Jayson_Blair http://t.co/keVPYtPIN2", "Mon Apr 08 17:19:11 ": "Just saw this outside my bathroom window.  My neighbor's petting zoo is getting out of hand. http://t.co/XwtWe3SJM0", "Sat Apr 20 01:53:23 ": "RT @colestratton: PORTLAND!  Theme Park Improv @bridgetown w/ @janetvarney @hitchmichael @natashaleggero Oscar Nunez &amp; Ian Brennan! htt…", "Sun Apr 14 15:31:00 ": "@jl_goodman no, but we're often mistaken for twins.", "Fri Apr 19 19:07:45 ": "“@THR: Fox Renews #Glee for Fifth and Sixth Seasons http://t.co/UoXcqIIe4J”", "Fri Apr 05 19:39:07 ": "Saw a sneak screening of \"Shooting Star.\"  One of the most emotional episodes Glee has ever done.  Incredible work by cast &amp; crew.", "Sun Apr 14 15:31:32 ": "@MWilson01566 no, but we're often mistaken as twins.", "Sat Apr 13 19:02:10 ": "WARNING: My cousin Jasmine is at Coachella and somebody threw gum in her hair.", "Sun Apr 14 00:54:57 ": "WARNING:  My cousin Jasmine had her lucky charm bracelet stolen at Coachella when she made out with a guy who said he was Anthony Kiedes.", "Thu Apr 04 03:24:54 ": "@Jayson_Blair You're welcome.", "Thu Apr 11 23:20:16 ": "@Cory59290921 i've seen it... and the cast did an amazing job.", "Thu Apr 11 04:07:18 ": "@Profitina wow.  you've got a lot of ships going on.  :)", "Wed Apr 10 16:51:18 ": "Fondly nostalgic for Hollywood's \"Old Spaghetti Factory,\" where you could get really cheap, shitty spaghetti.", "Wed Apr 03 05:10:50 ": "@Jayson_Blair You were hilarious tonight!", "Thu Apr 11 04:13:13 ": "Hey all @NayaRivera fans: get out and vote!: http://t.co/KpC34GCoFH", "Tue Apr 16 18:03:31 ": "@peterstaunton5 I hope @sawahcate says yes.", "Thu Apr 11 04:30:23 ": "@druidDUDE or i'll just wear a backpack.", "Sun Apr 21 17:09:01 ": "Good news: did a show last night w/ @colestratton @janetvarney @natashaleggero Ian Brennan  Oscar Nunez. Bad news: my feet hurt @bridgetown", "Wed Apr 03 05:15:02 ": "Much love to @MrRPMurphy @AliAdler @AndrewRannells #JustinBartha @Georgia_MayKing @NeNeLeakes @Jayson_Blair @JohnStamos for everything.", "Thu Apr 11 23:54:29 ": "@AhmedAlJaber12 everyone has an opinon, and they're all valid.  i'm cool with any opinion as long as its not disrespectful or hateful.", "Mon Apr 15 17:10:54 ": "WARNING: My cousin Jasmine had her ears pierced with a rusty staple gun outside of Coachella at an Indio garage sale.", "Fri Apr 12 17:17:41 ": "FYI, @Therealjimwise wants potential #FF followers to know that he played Coach Tugnut in \"Even Stevens.\"", "Thu Apr 11 04:29:11 ": "@druidDUDE i'm going to use the safety pin trick.  I will just have to walk very fast so no one sees my back.", "Fri Apr 05 19:49:37 ": "@burtcarole I did.", "Wed Apr 03 19:15:22 ": "Had my Britta water pitcher for 8 years now.  Might be time to change the filter.", "Fri Apr 12 18:47:55 ": "Sneak Peek: Glee Recreates Its Biggest Hit as Rachel Goes Broadway http://t.co/Y0nEu3OK3A via @TVLine", "Thu Apr 11 04:04:48 ": "@damianmcginty one way streets get the best of all of us!", "Wed Apr 03 23:26:32 ": "RT @MrRPMurphy: Just saw the rough cut of next week's \"Shooting Star\". It is the most powerful emotional Glee ever. So proud of the cast ...", "Tue Apr 09 18:55:49 ": "Who is the greatest TV couple of all time? The Final Four http://t.co/YLbpP0lDlz via @EW", "Fri Apr 19 23:58:03 ": "@mi_r_a_n_d_a that's so nice. :$", "Fri Apr 05 19:49:24 ": "@DaNcErLuVn She is incredible.  :)", "Thu Apr 18 21:56:58 ": "RT @MarkSalling: Gleeks, tune into glee tonight for a bromantic evening brought to u by myself and the magnificent @corymonteith", "Sun Apr 14 00:59:04 ": "@FoxieLoxie I wouldn't be the least bit surprised.", "Thu Apr 11 17:05:55 ": "Tonight!  \"Glee Gets Serious\" - http://t.co/yEms2CqRwJ http://t.co/NcQQQhw7D6 via @SeattlePI", "Thu Apr 04 02:29:42 ": "RT @LouisPeitzman: God bless Google. All I had to type in was \"how scared should we be\" and it added \"of North Korea.\"", "Thu Apr 11 04:02:01 ": "RT @kurt_co_blaine: @hitchmichael We've made it to the final two! Care to RT for Klaine as fave couple of all time? :) http://t.co/05muG ...", "Fri Apr 19 20:35:03 ": "Looking forward to seeing all your Portlandiers at #Bridgetown!", "Thu Apr 11 04:27:53 ": "@druidDUDE i think katie segal does a great job, but the pins are a step overboard.", "Thu Apr 11 04:02:54 ": "Love is on the air: Who is the Greatest TV Couple of All Time? http://t.co/w2CfXdsq8L via @EW", "Fri Apr 12 22:29:07 ": "@iharryshum Thank you.", "Wed Apr 17 22:33:23 ": "“@bazecraze: There should be a background check before the NRA is allowed to buy a senator.”", "Thu Apr 11 23:42:51 ": "@TheJohnLock just don't bump into door jams like i do when i'm looking up.", "Mon Apr 22 13:47:19 ": "Had a amazing time at @bridgetown comedy festival.  Quite possibly the friendliest city in the world, besides Austin, TX  and Van Nuys, CA.", "Thu Apr 11 03:58:56 ": "@brendatass tomorrow.  :)", "Thu Apr 11 23:19:58 ": "@NayaSnixMorris you heard wrong.", "Thu Apr 11 23:29:05 ": "@Cory59290921 sure.  :)", "Fri Apr 05 22:00:58 ": "Unbelievable.  There's still a county in Georgia with segregated high school proms... http://t.co/UaSbBfQtN6 via @USATODAY", "Fri Apr 05 19:41:39 ": "@heyamorrivera me, too but she's amazing in upcoming ep's.", "Thu Apr 11 04:19:36 ": "@dapperlylauren Yes, but only if they're fresh.", "Mon Apr 08 18:56:52 ": "@SaraIsaacson I LOVE BATES MOTEL!  Congratulations on that amazing cast!", "Fri Apr 12 03:37:04 ": "Glee Recap: Fear and Bonding at McKinley High http://t.co/KRLRSGPidq via @TVLine", "Fri Apr 12 22:36:43 ": "WARNING: My cousin Jasmine is at Coachella.  She danced barefoot, and now her legs are riddled with ringworm.", "Thu Apr 18 01:51:57 ": "Just met Oscar, Tony, and Emmy winner @pattyduke_id.   Who knew a legend could be so cool and funny?", "Wed Apr 03 23:20:05 ": "@Profitina Part of it was a Hare Krishna outfit and part of it was a kimono.  The wardrobe people are talented.  :)", "Thu Apr 18 19:00:59 ": "Glee Revisits \"Don't Stop Believin'\" - http://t.co/yEms2CqRwJ http://t.co/ugEvz6OtAl via @SeattlePI", "Mon Apr 22 16:16:01 ": "@chordoverstreet please remember to smile and move your mouth when you're supposed to be singing.", "Wed Apr 03 01:54:47 ": "Thank you for all the nice comments about @NBCTheNewNormal.  You made my day.  :)", "Thu Apr 11 04:04:06 ": "@DapperSteve watch it and let me know what you think.", "Fri Apr 12 21:20:28 ": "“@Ctrlofwhatido: @MrRPMurphy @hitchmichael Kurt and Blaine won Entertainment Weekly's Greatest TV Couple of all Time http://t.co/DXgduDbGGM”", "Thu Apr 11 23:25:23 ": "@NayaSnixMorris Fair enough. :)", "Thu Apr 04 15:15:04 ": "One week from tonight...."}