{"Thu Mar 21 08:44:25 ": "It's ok April @RhiannonMFish I'll be with you, Your too good for Dex anyway @HomeAndAway_", "Wed Sep 05 14:14:58 ": "Well done Cotchy thoroughly deserved!! Congrats to @BrettDeledio03 @ShaunGrigg6 mullet and horse also on their achievements! #superstars", "Mon Sep 10 04:55:51 ": "Devastating news, thoughts and prayers are out to the @PAFC, family and friends. #Takenwaytooyoung", "Thu Aug 09 22:16:27 ": "Cops pull someone over, start taking firearms outta his car #onlyincoburg", "Fri Nov 30 10:56:36 ": "@Functionforce c'mon now no need for that, 3 time royal park golf champ back in the day #13yearsyoung", "Fri Feb 08 00:13:34 ": "RT @Ashsamps28: What is Australian sport coming to, I used to take hangers with a belly full of Emu and Turtle #nodrugs", "Tue Jul 31 12:29:38 ": "@tomgoulio come on mate, I was a wiz at school, surely you could reminisce something better from all those good times", "Wed Oct 31 05:36:58 ": "RT @dylgrimes2: Thoughts on the RFC draw? Bit better than last years! #thanksAFL #gotiges", "Fri Sep 07 00:52:19 ": "RT @Hails1987: @brandonjellis Please RT. Fun Run in Mornington to remember 21 year old melanoma victim! Please watch this video!   http: ...", "Fri Aug 10 09:06:48 ": "Will never get sick of watching @usainbolt Absolute champion #newfavorite \n#lovehim", "Sun Mar 24 05:35:35 ": "@tommybugg we'll be back there soon buggy #skygarden #bounty", "Fri Nov 23 04:24:03 ": "@sarzbell @liammcbean I see how it is leesh, I've been talking you up to the boys today, looks like I'll have to get them to dislike you now", "Sun Aug 12 10:26:07 ": "RT @BrettDeledio03: Great win by the boys today. Had front row tickets to the Trent Cotchin show. Does some freakish things. #gotiges", "Fri Aug 24 13:20:22 ": "Well done boys great win!! Pleasure to watch! @stevemorris38 #smotheroftheyear? #jet", "Tue Jan 15 06:06:10 ": "RT @mattricho0: Just drove down Chapel St, havnt for a while. Ed Hardy has closed down. #gutted #whatwilljakekingwearnow", "Tue Jan 08 02:04:30 ": "@sarzbell ha ha... Good joke, your allergic to exercise 👸", "Wed Nov 21 22:12:50 ": "Goodluck to the Cannon's boys in the draft tonight! @jono_orourke @liammcbean @CalderCannonsFC #plowman #saad", "Sun Nov 25 21:56:08 ": "RT @jedlambb: Great to see the new draftees Tim membrey and Matt dick rocking there swans polo at dinner #stitchup #noidea http://t.co/v ...", "Thu Nov 22 20:10:06 ": "RT @JakeMelksham_17: Well done to @CalderCannonsFC boys drafted, footy factory churning them out again. Look forward to meeting new bomb ...", "Mon Mar 18 22:13:20 ": "@ciamps just keep working on those kettle bell swings mate and you'll be right", "Fri Nov 23 08:13:44 ": "Congrats to Cotchy for getting named skipper and to  @BrettDeledio03 to be his right hand man, very exciting times ahead #bothdeserveit", "Tue Mar 26 10:58:52 ": "RT @stephenconiglio: Outstanding Autumn collection from @_Nadaigual_ everyone have a look at http://t.co/NmBo47AvYc autumn and winter fa ...", "Mon Aug 20 10:21:11 ": "@Seb_ross6 haha not really a fan, may tape underbelly though", "Thu Aug 30 09:55:50 ": "Congrats fish lips on making your debut this weekend! Would hate to get sick again and not play... @tommysheridan11 #proudofyamate", "Mon Sep 03 09:25:28 ": "@HaydenCrozier17 @domtyson29 did someone say boards?", "Sat Jan 12 11:13:24 ": "@mattmcdonough28 @cadeynwilliams @mcintosh9182 thanks for the Invite appreciate it boys..", "Mon Aug 20 09:50:34 ": "Bit of fiddy cent get rich or die trying'\n#mondaynighttvisnogood", "Fri Dec 14 22:50:50 ": "@liammcbean you better 💤with food In your mouth #timetostartbulkingsticksmcbean", "Tue Jul 24 11:08:57 ": "@tayadams30 cheers mate, bloody spewing about that, definitely will be running to the bench next time there's a mele... #sentmebroke", "Thu Feb 14 04:51:36 ": "@liammcbean @sarzbell don't hate mcbeany", "Thu Nov 01 05:20:50 ": "RT @BradHelbig32: 1st day of pre season done and dusted.... 1-3 year boys looking the goods ! also the start of Mo-vember! Time to turn  ...", "Sun Dec 09 06:06:25 ": "RT @cooke_natasha: Hey @brandonjellis it's my 22nd birthday today ! It would make my day if    I could get a rt from you!! #massivefan # ...", "Fri Sep 07 22:06:21 ": "@BrettOHanlon keep ya eyes on the ball bretta! #10goalwinners #champions http://t.co/TZErJDco", "Thu Aug 16 03:29:37 ": "RT @BradMilzy: Great to say thank you to such a great club today! I am truly grateful for my time as a Tiger. Can't wait to see what is  ...", "Sun Mar 24 05:14:41 ": "@stevemorris38 told you to back it!! #omen", "Fri Jan 18 06:35:37 ": "@matt_white35 haha good point, at least you now know your not the only who's copped it", "Thu Oct 04 02:19:56 ": "Bali with the fellas! 10 days of madness! #likeaboss #lovingit", "Fri Nov 30 08:20:17 ": "@Richmond_FC tries? DID!", "Tue Jul 31 09:22:19 ": "Wish I was dex off home and away so I could kiss April @RhiannonMFish", "Fri Nov 02 08:43:28 ": "@sarzbell shut up your at the solarium as we speak", "Fri Nov 02 07:33:44 ": "Thoughts on the new summer gear and the handsome man promoting it? @stevemorris38 #stiffmate #suckedin http://t.co/CGZ66pOo", "Tue Nov 27 04:53:00 ": "RT @robbieball: How does Clarke get 268 runs in a test match and not be awarded man of the match!!", "Sun Jan 13 10:53:53 ": "@bgriffo24 I think so! Pretty sure I've found your twin also http://t.co/1TdX7VXG", "Tue Aug 14 08:32:24 ": "RT @Sarahhayesss14: @brandonjellis can you wish Me happy birthday of rt? Please", "Tue Jul 31 23:40:01 ": "@tayadams30 ocean grove gives it a good run for its money! #hititupintheoffseason", "Sat Dec 15 02:15:25 ": "Thanks to @_Nadaigual_ for the gear, great summer stuff get on board and have a look http://t.co/XjLEQIlt", "Sun Jan 06 21:04:57 ": "@sarzbell dim sims, hash browns now dunkaroos, some sort of diet your on 😉", "Sun Mar 24 05:34:25 ": "India need to stop appealing for everything, give it a spell #doingheadsin   #shitpitch #mayaswellplayinmybackyard", "Wed Oct 03 03:17:50 ": "RT @AFL_Shifter: Adam Saad sizzles with 2.81 seconds for 20 meters to be the quickest as we near the end of the session ; impressive pro ...", "Wed Sep 12 05:22:55 ": "RT @jagrlin: Guest lecture next Weds featuring... wait for it...  the great man Ivan Maric! Fuck yes La Trobe! #goodform #themullet #car ...", "Fri Mar 08 01:10:36 ": "#welcometotassy http://t.co/ILEKdDsPUg", "Tue Jul 24 11:03:16 ": "@sarzbell you said you wanted a good drug movie to watch... So I suggested one for you princess..", "Tue Jul 31 23:17:46 ": "So bloody cold, leaving bed is not an option today! \n#lookslikegeordieshoremarathon", "Fri Jan 18 06:31:19 ": "http://t.co/QM5sKSZu\n\n@matt_white35 are you two related or something?", "Fri Aug 03 11:48:36 ": "Thanks for the birthday wishes everyone appreciate it #gotiges", "Fri Aug 10 09:44:06 ": "@tommybugg he's a jet, reminds me of the way you play #whatbuggsme ;)", "Thu Feb 07 12:54:39 ": "@liammcbean how are you winning? You still have to pay the fine... #airisprettythickupthereisntit", "Wed Oct 31 21:29:27 ": "Those vodka jelly shots did those little tackers well last night, found 2 of them passed out in my front yard this  morning #oops #gotya", "Fri Sep 28 10:27:00 ": "RT @stevemorris38: @Richmond_FC @JackRiewoldt08 soooo you might have kicked 65 snags this year but it only took me one to kick one bette ...", "Wed Dec 05 03:58:10 ": "Echuca bound! @sarzbell #hopefullycanfindsomecairnsweather", "Wed Feb 13 00:49:47 ": "RT @JackRiewoldt08: Just because you heard it, doesn't make it gospel.... #dontbeasheep", "Wed Dec 12 23:17:12 ": "@bridgetttx @sarzbell that explains everything 😉", "Tue Jul 24 11:11:27 ": "@tommybugg cheers buggsy ;) well played on the weekend, catch up over the break when you come home", "Wed Dec 19 21:27:28 ": "RT @JackRiewoldt08: If your struggling for presents have a look @_Nadaigual_ on http://t.co/yQkrYF1h some sweet threads that might just  ...", "Sat Nov 03 09:36:37 ": "@seanyhetho you love running at night, early morning sessions heaps better", "Tue Dec 18 00:20:26 ": "RT @_melon22: @brandonjellis It's @sarah4nkotb birthday today &amp; she is a huge tiger fan can she please get a RT or shout out for her ...", "Fri Sep 21 04:32:34 ": "Thanks to tommy Langford @amukclothing for some beaut clothes great bloke! #checkitout http://t.co/vdqRTN28", "Fri Sep 07 12:13:52 ": "Lollies, chocolate, icy poles, and footy, could get used to hospital food/life \n#toobsdnoseisamess", "Sun Feb 03 07:02:49 ": "Bailey putting on a clinic!! #AusVsWindies", "Tue Nov 27 11:50:47 ": "@sarzbell @bridgetttx you just have to listen to me Next time Sarah #toldyouso", "Tue Nov 13 01:20:43 ": "@liammcbean @sarzbell she's as soft as butter, cheap shots all the time and sooks when she loses #baby #alltalk", "Fri Dec 21 12:22:39 ": "@JackRiewoldt08 @brettdeledio03 @lukem1980 all good he's been replaced by an even better man! #pillows", "Mon Jan 07 01:50:28 ": "RT @BrettDeledio03: Dear everyone, stay on holidays. It is so easy to get around without the roads being clogged. Thanks in advance \nLids", "Fri Apr 05 13:53:57 ": "RT @Jakeking28: #ThingPushUpHates dropping mark of the year......", "Wed Oct 31 07:08:16 ": "RT @JackRiewoldt08: Will Hoskin-Elliot is down the hall from me. Gonna pop in and see how the young fella is traveling post op! #younggun", "Wed Oct 31 07:07:37 ": "@sarzbell It'll melt before I even get it to you! I'll bring you Chinese whiskers though 😉 #itscalledacatfish", "Wed Oct 31 21:29:41 ": "RT @SamanthaRuffo: @brandonjellis Hey! :) Its @Magster1987 's birthday today....would totally make her day if you tweeted her :-)", "Mon Aug 20 11:00:59 ": "@ShaunGrigg6 on record will watch later! This movie is too good", "Tue Nov 27 11:48:36 ": "RT @BrettDeledio03: Just listened to big wave surfer Mark Visser speak and watched his doco 'night rider'. The bloke is mad", "Tue Aug 28 03:33:40 ": "When are we bring the helmet back @tommybugg #suitsyou #looksmint http://t.co/74qtADcV", "Sun Sep 16 04:19:53 ": "@jagrlin too bad I was all ass in the handball competition! #letgriggdown #lostfriendship", "Sun Feb 03 00:23:15 ": "RT @_melon23: @brandonjellis Hey it's my sisters @kittybubblez13  birthday today :) she is a huge tiger fan can I get a RT or shout out  ...", "Sun Jan 13 11:11:43 ": "@bgriffo24 met him through snap chat, you'd think by not getting a response back he'd stop but no keeps on persisting, takes after you", "Mon Jan 28 03:14:45 ": "Get around the Aussie day online sale \nUp to 50% of http://t.co/XjLEQIlt @_Nadaigual_ http://t.co/g1kc2cmn", "Tue Dec 25 05:55:01 ": "RT @lukem1980: I'm so close to decking my taxi driver", "Fri Sep 07 01:05:46 ": "@Mario_Diab sure am mate, see you there!!", "Wed Aug 22 10:25:17 ": "@sarzbell seriously?", "Sun Jan 06 10:53:46 ": "@BrettDeledio03 @bradhelbig32 cheap shot! You should grow your hair again, looks pretty good http://t.co/17GugdPv", "Fri Oct 05 11:26:43 ": "RT @stevemorris38: @AFL @Richmond_FC Great to have Gideon Simon on board as an international rookie #greatkid #lovesithereinoz #nohomesi ...", "Wed Jul 25 02:30:41 ": "RT @stevemorris38: Apologies to all parents and kids out there #gameintodisrepute #poorrolemodel", "Thu Oct 25 05:30:15 ": "Mike Tyson documentary, get around it! #animal #freak", "Thu Mar 28 05:47:18 ": "@tommybugg thanks buggy #gotiges", "Fri Dec 14 22:56:59 ": "My heart goes out to those in America, unbelievable news. #whatstheworldcomingto", "Wed Mar 27 04:22:05 ": "Thanks to peopleaustralia for the gear, get online and check out their stuff http://t.co/w0pZBGLqNp http://t.co/QViUtIIpU3", "Fri Aug 03 11:48:11 ": "RT @coulwhite: Happy birthday @brandonjellis, hope you have a shit day as karma for @LucieKervin's mushroom incident. #doyoulikethat #ca ...", "Tue Jul 31 23:33:08 ": "@tayadams30 tough one, haven't spent enough time up there to decide, but I can say your beaches shit on ours #wegotnowavesdownhere", "Sat Nov 03 10:53:42 ": "@MattyDick24 @seanyhetho early morning sessions from the 24th onwards boys ;)", "Mon Jan 07 01:50:18 ": "@sarzbell I'm starting to get a little worried actually 🐷", "Thu Mar 21 08:58:35 ": "@JackRiewoldt08 an hour and a half special tonight, can't get any better", "Fri Mar 22 22:08:13 ": "RT @maddyfinn23: @brandonjellis Can you please RT this for my 15th birthday? It would mean the world!"}