{"Thu Mar 28 15:21:38 ": "As @jonathanchait predicted (http://t.co/3KrJFKrSra), conservatives continue to reassess Obama with praise: http://t.co/3Jd7EAUZqS", "Wed Apr 10 20:55:46 ": "Don Draper would never get on the therapist's couch, so we put him there anyway: http://t.co/zJscc4VTP9", "Thu Mar 28 12:29:16 ": "RT @gabrielroth: Derrida’s college exams: “This text is quite simple—you’ve just made it more complicated by adding ideas of your own” h ...", "Thu Mar 28 13:11:30 ": "@gabrielsherman \"unauthorized\"=\"sexy\"", "Thu Apr 04 16:34:25 ": "Pretty cool: Pages from Sheila Heti's 90s Riot Grrrl zine: http://t.co/dnmScghLZo", "Tue Apr 09 14:51:31 ": "The death of celeb sex tapes. http://t.co/8YqxcuXKzP", "Thu Mar 28 15:49:09 ": "RT @kevinroose: At Liberty University, ground zero of the culture wars, the gay marriage debate has gone quiet. My story:  http://t.co/D ...", "Fri Apr 12 15:08:43 ": "@morningmoneyben Bitcoin Zero will be a milestone people have to write about, tho.", "Thu Mar 28 18:52:30 ": "@AlyssaRosenberg Client has been hooking him up for years, never thinks about it.", "Thu Mar 28 15:22:55 ": "And the same process is now underway with gay marriage: http://t.co/V4RdJaYYD9", "Mon Apr 22 13:32:32 ": "@emilynussbaum @loganhill33 @kentucker I did enjoy Pete offering Don the use of his bachelor pad. Shades of the Apartment.", "Fri Mar 29 02:03:56 ": "@irincarmon shakespeare is life", "Mon Apr 22 17:57:52 ": "@emilynussbaum @markharrisnyc @fimoculous Of course, obvious may be better at getting people to buy things.", "Thu Mar 28 13:22:39 ": "@rafat how many apps like that have there been? I can only think of one or two.", "Thu Apr 11 17:38:32 ": "North Korean lady soldiers wear 4-inch heels. http://t.co/oQcgE0yqC6", "Wed Apr 10 17:41:02 ": "Can you bully a celebrity? http://t.co/QAwc4H5E01", "Thu Apr 11 16:56:02 ": "Hipster Tom Cruise. http://t.co/OzfsYBByVa", "Sat Apr 06 18:47:52 ": "RT @vulture: Found! Deleted footage of Roger Sterling tripping on LSD in #MadMen, but w @julieklausner.  http://t.co/gIite5x7Ry", "Thu Apr 18 14:11:28 ": "RT @maureenoco: Now that Peter Dinklage has discussed being a DwILF, we must ban all terms that end in -ILF forever. http://t.co/BnQGNLv ...", "Tue Apr 09 23:54:23 ": "People are moaning about the heat already. New York is turning into Britain re: the weather.", "Thu Apr 11 19:41:42 ": "So ratchet. http://t.co/Q8Z7zclsNk", "Tue Apr 09 17:18:07 ": "Secrets of Jurassic Park: \"when the raptors bark at each other to communicate, it's a tortoise having sex\" http://t.co/mS6dO1Ejzw", "Sat Apr 20 15:10:46 ": "@emilynussbaum but there was a robbery at the 7/11! Lot of crime in Boston apparently. Easy to mix up stickups and carjackings.", "Wed Apr 17 22:40:41 ": "Maybe the GOP's new Buzzfeed strategy isn't such a great idea. http://t.co/uTFZ0aWSM1", "Tue Apr 16 17:20:00 ": "\"not quite the culinary equivalent of the Beatles breaking up, but close.\" http://t.co/cRw1w4brGI", "Thu Apr 18 21:02:01 ": "Important: 9 reasons the cupcake boom went bust. http://t.co/0dTb0PianY", "Fri Mar 29 21:29:23 ": "RT @JesseDavidFox: CYMI: Here's my stalkery yet sweet history of Megan Mullally and @Nick_Offerman's lovely marriage. http://t.co/GLsus5racR", "Wed Apr 10 00:51:28 ": "Presumably the first album @Slate: If you like good music, you should listen to our ultimate Stone Roses playlist: http://t.co/iQW4qlgMoi", "Fri Mar 29 21:08:37 ": "\"It became clear that Sandra Day O’Connor was both for having it all and for having no more.\" http://t.co/ajyiN9DoMr", "Mon Apr 08 16:23:41 ": "@ftrain dude, where's the slideshow?", "Tue Apr 09 15:00:16 ": "RT @jodyrosen: Hey, has everyone seen the Paisley-LL video? Clears things up a bit, I think. http://t.co/mrJMxURa06", "Thu Apr 04 22:39:46 ": "10 great Roger Ebert clips: http://t.co/wGDi4qunbs", "Fri Apr 19 03:00:59 ": "RT @JeffreyGoldberg: Incredible. Boston victim remembers the man who dropped the bag: http://t.co/mc6qoTpm6v", "Thu Apr 11 19:03:34 ": "Only 7% of New Yorkers have sent a picture of their crotch via electronic communication. http://t.co/PWU3z04lfB #marginoferror", "Mon Apr 22 13:19:24 ": "@kentucker it's not about him being dumb, it's about him being controlling.", "Sat Apr 20 00:51:08 ": "RT @JDavidsonNYC: Me, on Consensual lockdown\nhttp://t.co/1uDJXmgJjU", "Wed Apr 10 11:58:44 ": "Weiner's self-analysis is a contrast to Spitzer, who resists talking about why he did what he did and can't even admit to being in therapy.", "Wed Apr 10 14:11:26 ": "@jayrosen_nyu @felixsalmon Native is about the placement and framing of ads, not their quality.", "Wed Apr 10 13:13:20 ": "@jayrosen_nyu @felixsalmon Vogue ads are not native advertising. If they are, then apparently 95% of print ads have been native for decades.", "Thu Apr 04 13:34:41 ": "Wonder what kind of grisly death Lena Dunham will come up with for Christopher Abbott: http://t.co/twOftT0iua", "Thu Mar 28 13:24:42 ": "@rafat actually, n/m. I misinterpreted what you meant.", "Mon Apr 22 14:49:31 ": "Lots of people still reading this @kevinroose interview with the grad student who found Reinhardt and Rogoff's error: http://t.co/3E0dTnIpn3", "Wed Apr 10 14:10:16 ": "@jayrosen_nyu @felixsalmon I don't think 'better than edit' is a relevant definition. Any ad can potentially be 'better than edit.'", "Sat Apr 20 00:51:16 ": "RT @cthon1c: @JDavidsonNYC You were right earlier about eyes on the street. Thing didn't break until they lifted the lockdown.", "Tue Apr 09 17:43:22 ": "Why ABC is the most likely (not very) network to go cable. http://t.co/WJIuZNFHsK", "Thu Mar 28 13:13:34 ": "@rafat http://t.co/7OIAnJRf1y portion of iPad app is free and constantly updated. Print stories are subscription.", "Wed Apr 10 21:26:27 ": "RT @stellabugbee: My Coachella care package just arrived from Urban Outfitters. #YOLObitches! http://t.co/dQoNNjqysI", "Wed Apr 10 12:21:17 ": "RT @ftrain: Snapchat could have saved Anthony Weiner's career.", "Fri Apr 05 00:18:09 ": "Edelstein makes the case for Ebert as a great talking critic. http://t.co/gKr6uwByY0", "Thu Mar 28 15:48:35 ": "RT @maureenoco: THEY HAVE SO MUCH IN COMMON. Like pole-dancing! And my love. RT @TheCut An Ode to LiLo and K.Stew’s New Friendship http: ...", "Mon Apr 22 16:02:52 ": "RT @mattzollerseitz: MAD MEN recap: Do we care anymore whether Don finds \"peace\"? http://t.co/Ck5QN6WwoM", "Mon Apr 22 17:46:08 ": "@emilynussbaum @fimoculous No, and Don's.", "Wed Apr 10 21:05:33 ": "@ForecasterEnten Just say he's the dodgy mayor from the Wire, played by an Irish dude.", "Sat Apr 13 14:00:31 ": "@jbarro @joshgreenman @NYMag Close the app down, restart, it should work forevermore. Annoying bug that is being fixed.", "Wed Apr 10 11:10:47 ": "The NYT mag's Weiner/Abedin tell-all is pretty great and seems honest: http://t.co/eikWqn1oNG", "Thu Apr 04 01:21:17 ": "@KateAurthur @poniewozik @emilynussbaum I always find this useful to refer to... http://t.co/7EpoKUBzQC", "Mon Apr 22 17:57:32 ": "@emilynussbaum @markharrisnyc @fimoculous I just thought Don's was a lot more clever, and the 60s are when ads started getting conceptual.", "Thu Apr 04 01:24:08 ": "@emilynussbaum @kateaurthur @poniewozik Nope, Christie and Dahl plot-twisters in there too.", "Sat Apr 20 00:15:20 ": "@sethmnookin http://t.co/bs5Fvr2B5g", "Tue Apr 16 17:20:42 ": "New Yorkers root for Boston. http://t.co/ZI5bvrS8Vx", "Fri Apr 19 23:40:56 ": "Most amazing detail yet: The Boston suspects just happened to be at the 7/11 when it was robbed. They didn't rob it. http://t.co/sPo4U3lqfZ", "Tue Apr 16 15:22:19 ": "The freedom of running. http://t.co/wLG1h6F1Sl", "Thu Mar 28 18:53:47 ": "@MarkZinni @nymag @joecoscarelli Ah, the old 'I didn't really mean it' line. Never convincing.", "Sat Apr 20 01:03:10 ": "Time for a celebratory pickleback.", "Thu Mar 28 19:45:14 ": "Kurt Eichenwald on...... Justin Bieber. http://t.co/uLBf1UdLoe", "Fri Apr 19 23:43:33 ": "RT @stefanjbecket: Boat on land in Watertown. Weird day.", "Tue Apr 09 17:24:25 ": "\"He may urge Republicans to stop being the stupid party, but the biggest fool is Jindal himself.\" http://t.co/pZsuNxBHxs", "Thu Apr 04 01:27:03 ": "@emilynussbaum @kateaurthur @poniewozik I hate spoilerphobes, so I'm just happy to be able to refute them with SCIENCE, however shaky.", "Fri Mar 29 21:12:25 ": "RT @TheCut: ICYMI: Ugly Is the New Pretty. How unattractive #selfies took over the Internet. http://t.co/vEzCSZzZlZ", "Sat Apr 13 14:13:54 ": "@jbarro @joshgreenman @NYMag Good. Proper fix for this is pending Apple review.", "Thu Apr 18 13:23:20 ": "\"The only serious legal threat we had was from Gore Vidal, who sued us for claiming he was litigious.\" http://t.co/G5UjUaUFas", "Mon Apr 08 15:55:12 ": "@emilynussbaum I think Mad Men's real danger is overly self-conscious attempts to be literary.", "Wed Apr 17 22:23:32 ": "Of 125 scripted dramas currently on air, 109 have depicted rape or murder in detail: http://t.co/i5fkMcRzwb", "Fri Mar 29 02:04:24 ": "@irincarmon short is good. i tend to prefer more modern operas.", "Thu Mar 28 18:51:21 ": "JR Smith gets hot for a few games, supposedly he's a new man. Let's see if it lasts longer than Melo's early season D http://t.co/5ceiZT7EOJ", "Thu Mar 28 15:08:41 ": "RT @joehagansays: A lawyerly reading of NBC statement that network is \"not considering replacing\" Matt Lauer is they're past considering ...", "Fri Apr 05 11:28:51 ": "Charlie Watts is the best. http://t.co/eqQIja5nsl", "Fri Apr 12 21:31:26 ": "@dankois @LRB Brits.", "Mon Apr 22 13:25:30 ": "@kentucker Heh. 'Twas ever thus... http://t.co/Hfi0lE24fC", "Fri Mar 29 22:05:35 ": "Princeton mom speaks out. http://t.co/jpdFoOFUEG", "Sat Apr 20 15:07:12 ": "@emilynussbaum looks like they were never at 7/11. Caught on nearby gas station video after carjacking at same time. http://t.co/3Fpmxjicgt", "Wed Apr 10 12:08:36 ": "3 new Arrested Development teaser posters: http://t.co/gSrEVnUSpy", "Thu Apr 18 21:09:49 ": "\"the academic equivalent of a D-league basketball player dunking on LeBron James.\" http://t.co/3E0dTnIpn3", "Sat Apr 20 15:13:19 ": "@emilynussbaum yeah that was what the police made it sound like last night", "Fri Mar 29 02:11:19 ": "RT @annfriedman: I asked @ChrisLHayes how he got those great diversity numbers on his show. Answer? Quotas. http://t.co/7wdH0MpPvl #uppers", "Sun Mar 31 22:42:09 ": "RT @kevinroose: Oh look, it's our top domestic envoy to North Korea, sitting next to me at JFK!  http://t.co/ZwWHh0fGvB", "Mon Apr 22 12:24:41 ": "RT @stefanjbecket: “At least Wall Street bankers have the decency and self-awareness to hate themselves.” http://t.co/A7g05QddK6", "Thu Mar 28 16:06:56 ": "@williamfleitch Even if he wins five more majors, he's never going to be treated with the reverence he was before.", "Thu Apr 11 18:39:26 ": ".@jonathanchait explains why Obama is so obsessed with the Grand Bargain. http://t.co/24hLcMUQ7r", "Fri Mar 29 01:57:38 ": "@irincarmon Not good? Going on Saturday.", "Wed Apr 10 21:02:28 ": ". @kevinroose unpacks the internal contradictions of the Bitcoin economy. http://t.co/MW3xo17tll", "Wed Apr 10 21:38:48 ": "This particular genre of Onion critique is rather superficial and self-righteous in my opinion: http://t.co/L5caEpPt2O", "Wed Apr 10 21:08:29 ": ". @Gawker has a nice take on @justinrocket's SWUG piece: http://t.co/MyYY9tua4G, http://t.co/XwbylF7SvL", "Thu Mar 28 22:20:39 ": "@badler rockist.", "Wed Apr 10 14:42:01 ": "@jayrosen_nyu @felixsalmon Not much more to it! If your definition of \"native ads\" is \"good ads\" then how do you distinguish them as a form?", "Mon Apr 08 03:18:21 ": "This must be the most erudite Mad Men recap you'll read, by @mattzollerseitz http://t.co/0Y5fL4UVyR", "Mon Apr 22 12:22:05 ": "RT @mlcalderone: \"The craving for information leads to behaviors that are alternately rewarded and punished.\" http://t.co/HPMCDAnKBR", "Fri Mar 29 12:59:56 ": "\"Cohen will need two of those bedrooms to hold his massive cojones.\" http://t.co/yKPngNy6Pe", "Wed Apr 10 21:21:20 ": "@keithgessen power move, typical of Stalin.", "Thu Mar 28 19:07:24 ": "An Observer reader speaks out. @realDonaldTrump: @NYMag has become so boring and so irrelevant."}