{"Tue Apr 16 21:40:30 ": "Malware was dormant on CenHud's servers for 6 mo before activating &amp; compromising customer info: http://t.co/EUdyTAR5Za #newsdayny", "Tue Apr 16 21:06:13 ": "RT @WFANAudio: R.I.P. Pat Summerall", "Mon Apr 01 00:41:14 ": "@BaldMove Are you guys doing GoT cast this week too?", "Mon Apr 22 04:11:37 ": "Lord Varys scenes are always on point. #gameofthrones", "Tue Apr 09 19:40:26 ": "RT @SaskNews: Circus elephant shot in drive-by in U.S. http://t.co/8kKyW9fdNj via @leaderpost #yqr", "Fri Apr 12 00:18:19 ": "@rzaft @MoreFemshep They should do a Blood and Chrome style prequel, with Young Shep as a hotshot new recruit. Cameo by baby Mordin.", "Fri Apr 19 20:46:25 ": "RT @yonkersoem40: YONKERS OEM =#SKYWARN #WESTCHESTER ==SPOTTER ACTIVATION MAY BE NEEDED LATER THIS EVENING FOR THUNDERSTORMS AND STRONG WIN…", "Mon Apr 01 02:19:52 ": "Awesome first episode. Ser Barristan Selmy in the house!", "Mon Apr 15 22:19:40 ": "RT @Slate: RT @bostondotcom: Boston hospitals report 107 people brought to seven institutions for blast injuries -- in addition to 2 killed.", "Sat Apr 20 22:35:59 ": "Crazy that Knicks only had 13 assists in the W...but a win is a win.", "Fri Apr 19 00:48:47 ": "NY pol on wiretap: \"You can't do anything without the @#$%-ing money.\" http://t.co/oTwOcbLNSp", "Sat Apr 06 17:43:53 ": "Didn't realize @bearmccreary composed the music for Defiance...just when you think you're out, the MMOs pull you back in.", "Fri Apr 05 17:40:00 ": "HUD says #Westchester violated housing agreement: http://t.co/4RV6DMRloj #newsdayny", "Fri Apr 12 17:39:44 ": "@MattSampson12 Why did the chicken cross the road? To step out of range of North Korea's missiles. BOOM-CRASH!", "Thu Apr 18 20:30:31 ": "@nyknicks I'm glad he's still with the Knicks organization doing community relations. He's one of those guys who should be a Knick for life.", "Fri Apr 19 20:14:51 ": "\"So I said to myself, Kyle...\" http://t.co/0bSZKWKCxr", "Sat Apr 13 22:11:46 ": "ESPN sourcing latest story to unnamed investigators citing an unnamed former clinic employee who says ARod might have purchased steroid docs", "Sat Mar 30 17:51:23 ": "Yankees/Army about to start.", "Wed Apr 17 19:24:15 ": "67 degrees in the YO!", "Tue Apr 09 21:15:11 ": "@DFNDYRSLF Thanks good sir. When are you coming to NY?", "Fri Apr 19 23:37:43 ": "RT @romenesko: Brian Williams cuts to reporter who's heard by viewers saying, \"We don't know shit.\" Apology followed. http://t.co/pyCMy5lETM", "Thu Apr 18 01:21:35 ": "\"Victory by a hair...\" Hudson Valley's gun owners on Wednesday's vote: http://t.co/nRI7QR5Q1E #newsdayny", "Sat Apr 20 00:27:12 ": "RT @wolchyr: @pattonoswalt in Russia, boat hides on you", "Fri Apr 19 20:44:51 ": "Efforting is a nails on the chalkboard word for me. Drives me crazy.", "Thu Apr 18 01:12:51 ": "RT @io9: Disney plans a new Star Wars movie EVERY SINGLE YEAR http://t.co/ibNOgUHMiB", "Fri Apr 19 23:39:36 ": "There have been about two dozen tweets in my feed in the last 30 sec informing me the bombing suspect is not moving. Thanks, internet.", "Sat Apr 13 22:59:12 ": "Westchester + parts of Putnam and Rockland should be able to see aurora borealis. Look 4 good spots away from light pollution.", "Fri Apr 19 20:49:46 ": "RT @TheOnion: Study: Majority Of Americans Not Informed Enough To Stereotype Chechens http://t.co/rycRO4oePq", "Sat Mar 30 18:54:58 ": "\"They have relationships on the street...that's what makes them credible.\" Yonkers excons as peacekeepers: http://t.co/163Rg5aFtI #newsdayny", "Fri Mar 29 23:49:49 ": "RT @yonkersoem40: Pay back is a........great news team =  thank you guys = =#FF @NikBonopartis @MarioPIX11 @gregmocker  @WPIX", "Fri Apr 19 01:57:42 ": "Tappan Zee Bridge dangler says he wanted media coverage: http://t.co/1AGj5dQDWR #newsdayny", "Fri Apr 19 21:19:57 ": "RT @jackshafer: MT @pourmecoffee Situation Room shld just be Blitzer suspended in precog pool like in Minority Report, keeping eye on drama…", "Fri Apr 12 00:13:45 ": "@MoreFemshep As far as I'm concerned, @jhaletweets IS Shepard. (With apologies to the Canadian dude who voices BroShep.) Sign me up!", "Sun Apr 21 23:01:04 ": "@KrisLigman when I first started MMOs I wondered why forums were so toxic. Time on vent and raid guilds answered that question", "Fri Apr 19 17:23:40 ": "RT @Slate: Dear morons, \n\nDo not create fake Twitter accounts for the Boston suspects,\n\nSincerely,\nSlate \nhttp://t.co/QCfEss5OhV", "Sat Apr 20 00:11:33 ": "What are the chances that this is a homeless guy just trying to catch a few Z's in a comfortable boat?", "Sat Apr 13 22:09:54 ": "Not a fan of ARod, but does anyone believe ESPN's \"sources\"? Or that ESPN writers have sources that spout anything but absurd trade rumors?", "Fri Apr 19 20:15:53 ": "RT @RamFire55: @yonkersoem40 @spacecadet0512 @tboom618 @cycle201 @nikbonopartis @newsfromitaly @felixnater @itsadisaster @ravindiren #FF", "Mon Apr 01 00:36:04 ": "T-minus 25 minutes and counting...", "Mon Apr 01 20:33:50 ": "@BaldMove glad to hear it, welcome back Madbrew. You and Aron did a great job last year, looking fwd to the new casts.", "Tue Apr 02 22:16:54 ": "@GameOfThrones sets record for most-pirated episode ever, even though a subscription costs less than a movie ticket: http://t.co/UMLmjR0wQv", "Sun Apr 14 01:03:19 ": "@yonkersoem40 The earliest was 8 p.m., but they could appear late into the night: http://t.co/Obdf94z6aw", "Sat Apr 13 23:11:41 ": "Would we have all these corruption scandals if pols were forced to disclose interests? http://t.co/xPSmRqXY7S via @cwadenewsday", "Fri Mar 29 23:59:07 ": "RT @Timothy_OConnor: KIds, this is journalism: via @gcmcinstry McKinstry: Politics in Putnam test voter patience http://t.co/XzoEn0sPMc  ...", "Fri Apr 12 00:08:01 ": "@MoreFemshep @jhaletweets I thought BioWare said the next installment will not feature Cmdr. Shephard. Has that changed?", "Mon Apr 15 22:18:48 ": "RT @Slate: RT @emmaroller: Obama took no questions as press corps members echoed, \"Terrorism?\"", "Sat Mar 30 18:31:34 ": "15 great lists that the top 30 marketers can link at least 50 times on Twitter: http://face.palm/l7u82l2z", "Fri Apr 12 02:36:51 ": "@bandwagonknick @_jay_hernandez_ Exactly. 1 PPS isn't a very good scoring night, especially with Nate burning them for 25 on 8-12", "Sat Apr 20 20:01:45 ": "RT @ShelleyA: NY state senator advocates torture for Marathon bombings suspect http://t.co/969QpIuPQI via @NewsdayNY", "Fri Apr 05 20:03:18 ": "@JillianSed That's the first time I've ever seen the term \"benevolent sexism.\"", "Sun Mar 31 20:21:18 ": "RT @Liam_J_McIntyre: Easteros #chocolateiscoming @GameOfThrones #whitechocolatewalkers", "Thu Apr 18 01:25:57 ": "Fmr Yonkers mayor called Sam Zherka a mobster. Now Yonkers could pay Zherka $100k to settle defamation suit: http://t.co/ddrpY4s2cg", "Fri Apr 19 00:49:55 ": "Among the details in the indictment: NYC GOP bosses frisked undercovers for wire taps and missed them.", "Fri Apr 05 18:08:25 ": "RT @Slate: BioShock Infinite wants to be deep and philosophical, but it's just one big hail of bullets: http://t.co/Gcjo6FANwo #gaming", "Fri Apr 05 17:40:34 ": "Considering Westchester's wealthy towns just zoned to put affordable housing practically in places like Port Chester and Sleepy Hollow...", "Sat Apr 13 02:53:57 ": "Awesome bday gift from my mom, framed Bladerunner style scifi print. Thanks mom! http://t.co/ekBPQGkdpY", "Wed Apr 17 21:11:31 ": "\"Not now chief, I'm in the zone!\" http://t.co/WE1ZxcpIto", "Sat Mar 30 20:26:21 ": "RT @Newsday: A fox. In a box. On Long Island. http://t.co/LkW2VIn7L0", "Thu Apr 04 01:07:32 ": "One of the politicians arrested by FBI Tuesday is mentor to former Sopranos actor: http://t.co/cXC6au26Ct", "Tue Apr 02 20:42:12 ": "Feds say they posed as real estate devs, and local pols fixed vote on property deal in exchange for cash bribes: http://t.co/1Y1d7AR1Lg", "Fri Apr 05 18:51:43 ": "Michael Jackson vs Elvis freestyle rap battle: http://t.co/jO2tNMpeLb", "Thu Apr 18 23:47:37 ": "Cops won't interview Ava Sangavaram, who was stabbed 31 times by her mom, saying it would just add to trauma: http://t.co/Ujty8iQU4l", "Tue Apr 02 20:39:21 ": "The full story on today's FBI crackdown and public corruption craziness: http://t.co/1Y1d7AR1Lg #newsdayny", "Sat Apr 06 19:42:38 ": "RT @Gawker: Want to report on that oil spill in Arkansas? You're going to have to ask ExxonMobil for permission first. http://t.co/Wc7Xk ...", "Sat Apr 13 23:57:41 ": "RT @BettyMingLiu: A ghost, a Superfund toxic cleanup &amp; @Ford Motor, all in one story: http://t.co/PAQ2r4Wsg9  #NewsdayNY", "Sat Apr 06 17:49:33 ": "RT @autohomeros: αἶψα δ᾽ Ὀδυσσῆα προσεφώνεεν ἐγγὺς ἐόντα:", "Sat Apr 13 03:24:34 ": "RT @SETIInstitute: A SETI Institute discussion on the origin of life in hydrothermal vents and the implications for life of Mars.Enjoy!\n ...", "Wed Apr 17 00:40:14 ": "Runners from Hudson Valley talk about witnessing Boston bombing: http://t.co/wIOpSHTKYp #newsdayny", "Sat Mar 30 18:19:01 ": "RT @garyrosenWSJ: Lawyers &amp; technologists have created much of our crisis of complexity, but there's a solution: simplicity. http:// ...", "Fri Apr 12 02:18:48 ": "@hdsncty @TheHudsonValley Experts are predicting a huge brood in the Hudson Valley this year: http://t.co/cWHOwtfCg7", "Fri Apr 05 17:41:24 ": "...not surprising that the spirit of the settlement was not honored. Settlement language is very specific about monochrome neighborhoods", "Mon Apr 01 20:35:11 ": "RT @RyanRuocco: That Joba Mustache is truly frightening.", "Sun Mar 31 21:41:47 ": "RT @Deadspin: VIDEO: Vanilla Ice performed \"Ice Ice Baby\" at a Milwaukee Bucks game http://t.co/t1n7erideM", "Fri Apr 19 02:19:46 ": "@realdirtdig Then his next move will be to get into a car accident in Yonkers, preferably somewhere close like Nepperhan lol", "Sat Apr 20 22:39:57 ": "RT @NBAGuru: Welcome treats for Brooklyn's first ever Playoff game. http://t.co/5eezFtIujC", "Tue Apr 02 21:10:11 ": "Rockland County DA is in newsroom to talk about FBI probe and today's arrests. He's live on News12 in another minute or two.", "Sat Apr 06 00:41:08 ": "Hard to believe @PhillyMag was fooled by fake Marine who claimed he killed 2,200 in Iraq.", "Sat Apr 13 22:58:10 ": "Northern lights in the Hudson Valley? Check out the skies around 8 p.m.: http://t.co/Obdf94z6aw #newsdayny", "Fri Apr 12 00:11:13 ": "The soundtrack of summer 2013: The resonant, booming whisper of cicadas: http://t.co/cWHOwtfCg7 #newsdayny", "Tue Apr 09 23:06:03 ": "RT @io9: Want to live in a spaceship? These houses are for you. http://t.co/WfO5RyngJP", "Tue Apr 02 20:43:21 ": "Other interesting details: SV mayor allegedly gave undercover FBI agent a cell to use only for vote-fix/bribe talk: http://t.co/1Y1d7AR1Lg", "Sun Apr 21 23:06:48 ": "RT @Deadspin: VIDEO: Mike D'Antoni's eyes almost roll out of his head when asked about Kobe live-tweeting the game http://t.co/XJTDsXCK8k", "Sat Apr 06 18:42:04 ": "Dad threatens son's school with \"violence worse than Sandy Hook\": http://t.co/S02nF4kp3T #newsdayny", "Thu Apr 11 19:22:13 ": "RT @romenesko: Film organization seeks experienced writer published in prestigious publications who will work for free. http://t.co/CQY6 ...", "Sat Apr 20 20:14:50 ": "State Sen. @ball4ny on bombing suspect: \"Who wouldn't use torture on this punk to save more lives?\" http://t.co/UG1GUXrMZT #newsdayny", "Mon Apr 15 22:19:49 ": "RT @yonkersoem40: UPDATE: Cellphone companies say service is operating in the #Boston area but with heavy traffic- @AP http://t.co/dx5mP ...", "Fri Apr 19 17:52:03 ": "RT @SPACEdotcom: Most #Earth like #alien planet discovered by @NasaKepler to date. Good for life @NASAAmes?   http://t.co/a4UUc6Y343 http:/…", "Sat Mar 30 17:38:21 ": "@AquilaRift If you write something dark like Nightengale, I shall hire a mariachi band to parade around your hometown, singing your praises.", "Wed Apr 10 21:56:31 ": "RT @yonkersoem40: #YonkersPD continues to search for Darrel Brown, missing autistic man. May be in area of 354 Nepperhan Ave. Call YPD a ...", "Thu Apr 11 01:19:27 ": "RT @exploreplanets: We're live! Go to http://t.co/7V9ii4Bdso to see analysis on the budget #fundNASA", "Thu Apr 04 19:55:51 ": "Another state lawmaker accused of taking bribes: http://t.co/pguaKoRxw3 #newsdayny", "Sat Apr 06 17:42:02 ": "RT @RamFire55: @yonkersoem40 @spacecadet0512 @tboom618 @cycle201 @nikbonopartis @newsfromitaly @felixnater @itsadisaster @ravindiren #FF", "Sun Apr 14 01:04:22 ": "@yonkersoem40 I'm leaving work soon, if I see anything from the Rye area I'll send updates", "Tue Apr 09 19:19:33 ": "My brother got tickets to #UFC 159 for my birthday. I have an awesome brother.", "Tue Apr 16 21:10:23 ": "@PokJournal @PoJoWilliamShan Good luck Billy, night cops is a fun beat!", "Tue Apr 09 21:12:51 ": "That was a costly Dunkin Donuts run. Dude pulling out of a parking space near News12 didn't look and hit my car.", "Thu Apr 04 22:54:38 ": "To mark 45 yrs since MLK's death, Shelby County released restored footage of James Earl Ray's arrest and trial: http://t.co/ZgpIdsviXU", "Sun Mar 31 23:32:50 ": "Game of Thrones season premiere and Walking Dead season finale...it's like Christmas tonight!", "Sun Apr 14 00:37:02 ": "No #northernlights visible yet in light-polluted Yonkers, but the good news is there's not a cloud in the sky.", "Fri Apr 19 02:01:49 ": "@ZedalzaNewYork Hey fellas, things are great here. How goes the show? Have you made it to the Cap yet since it reopened?"}