{"Wed Oct 17 23:59:20 ": "For the Mountain Nation from the Mountain Nation. A beautiful fall morning http://t.co/o79wrTyT", "Sat Oct 06 12:02:39 ": "Playing a show in Manteo, NC at 2:00 PM today at Roanoke Island Park http://t.co/Dh7D9yQh", "Sat Jan 05 19:14:02 ": "Justified on FX - Raise: http://t.co/b246q1AQ via @youtube", "Mon Feb 04 14:54:47 ": "We would like to wish a very HAPPY BIRTHDAY to our banjo player Jamie Dean!!!", "Tue Aug 21 02:15:32 ": "Looking forward to seeing all of friends in Minnesota and Illinois this weekend", "Sun Sep 23 14:51:36 ": "Cumberland River talks Justified on KET Kentucky Life TV @JustifiedFX @justifiedfans @JustifiedTVF http://t.co/YN7clUUY", "Thu Sep 20 15:41:49 ": "Who has the best hair in bluegrass? Why Jamie Dean of course - VOTE NOW http://t.co/7dHmvlyc via @sharethis", "Fri Mar 01 18:00:24 ": "Playing a show in Charleston, SC at 7:30 PM today at Charleston Music Hall http://t.co/EIQqvZ5Uod", "Mon Nov 19 20:24:54 ": "@TheMusicFest would love to be there!", "Thu Aug 23 16:00:03 ": "Playing a show in Pine River, MN at 5:50 PM today at Cass County Fairgrounds http://t.co/oJQYbYmt", "Sun Dec 02 19:02:02 ": "Playing a show in Online, VA at 8:30 PM today at http://t.co/76hwM5rx http://t.co/raIjQFLW", "Sat Feb 23 19:01:19 ": "Playing a show in Pennington Gap, VA at 8:00 PM today at Legends 2 http://t.co/dDCinofHUn", "Fri Aug 31 14:00:10 ": "Playing a show in Pennington Gap, VA at 4:00 PM today at Lee County Fairgrounds http://t.co/PIeCc52R", "Thu Apr 04 19:00:25 ": "New shows announced in Benham, KY - Lexington, KY http://t.co/MpK05mpRee", "Tue Aug 28 19:57:34 ": "Our friends #TheRoysonline have new album New Day Dawning that hits stores today.  Check’em out on http://t.co/g0UywOhx http://t.co/kyb1XCEc", "Sat Oct 06 20:05:12 ": "Playing a show in Kill Devil Hills, NC at 10:00 PM today at Outer Banks Brewing Station http://t.co/6zwDuDSA", "Sat Nov 24 20:06:32 ": "Thank you @RhondaVincent13 !!", "Sun Sep 30 00:24:55 ": "Had a great time playing IBMA Fanfest, visiting with old friends and making new ones. Wishin our other two band brothers had been with us.", "Sun Aug 26 16:08:54 ": "Home sweet home.  It's good to be back home in good ole Harlan.", "Mon Dec 24 05:07:00 ": "Merry Christmas to all of the Mountain Nation!!", "Wed Oct 10 14:56:44 ": "@mountaineeropry We'd love to play there!", "Fri Aug 24 21:47:39 ": "Having a wonderful time at the Lakes Bluegrass Festival in Pine River, MN", "Sat Nov 03 15:01:24 ": "Playing a show in Middlesboro, KY at 5:00 PM today at Middlesboro Mall http://t.co/cBhTcz3w", "Sun Nov 04 00:24:14 ": "Middlesboro mall in the books on the road to the Bell Theater!!", "Sat Mar 02 18:49:58 ": "RT @ghsstrings: We just updated the artist profile for @ghsstrings artist @Harlan_music, check it out! http://t.co/hVvsI9kY0r", "Mon Nov 19 20:53:39 ": "RT @BristolRhythm: CONGRATULATIONS to our friends at @BluegrassUnderg for 5 EMMY NODS!  Incredible work, y'all! http://t.co/DYwN6wV7", "Mon Nov 26 15:15:39 ": "So excited that Christmas the Mountain Way album is posted on @Miranda_Lambert forum!  whoo hoo", "Sat Oct 13 12:35:45 ": "Having a great time and meeting lots great people here in Atlanta.", "Sat Sep 08 16:11:40 ": "Jamie Dean is all hiped up on energy shots, and has got the Golden Cobra screaming through the VA country side", "Tue Nov 20 18:47:22 ": "@festivalfarm Happy Thanksgiving!", "Tue Apr 16 20:38:08 ": "Our Official CR website is http://t.co/pEEz6eRdk8", "Sat Nov 24 16:46:28 ": "new Cumberland River t-shirts!", "Sun Aug 26 11:51:33 ": "Just dropped Brad off in Lawrenceburg, KY. Next stop is to drop of Gary and then put this in to Harlan town.", "Sat Aug 25 10:29:34 ": "Headed toward chicago for a show. In  wisconsin right now, we are bearing down on the windy city.", "Sat Aug 25 19:03:33 ": "Now this is what happens when you travel with Cumberland River and are the first to fall asleep. http://t.co/jv9dejdU", "Wed Nov 28 18:00:03 ": "Christmas the Mountain Way CD/DVD now released", "Wed Nov 28 17:32:46 ": "Posted a new song: \"Harlan Man\" http://t.co/sQjbu4px #music", "Thu Aug 23 07:01:04 ": "3:00 am rolling through the windy city. Good morning Chicago from the MOUNTAIN NATION.", "Sat Oct 27 17:58:32 ": "Show tonight at Legends 2!  Show starts at 8:00 doors open at 6:00. $10.00 cover.", "Fri Sep 28 17:02:17 ": "Playing a show in London, KY at 7:30 PM today at Downtown London Kentucky http://t.co/FBAMmdKV", "Sat Nov 17 13:05:07 ": "A heavy frost across the Mountain Nation, makes me want to listen to CHRISTMAS (The Mountain Way)  from @RuralRhythm #Christmas in the M ...", "Sat Aug 25 10:15:20 ": "We have got the hammer down heading for Chicago", "Tue Nov 27 17:20:19 ": "Coal Miner's Christmas Concert Pineville, Kentucky - Dale Ann Bradley, Steve Gulley, Cumberland River http://t.co/oL1uMGGg via @RuralRhythm", "Tue Oct 23 23:52:43 ": "Gearing up for Christmas the Mountain Way CD and DVD release!", "Wed Sep 12 01:14:18 ": "Cumberland River - Justified http://t.co/dwNeJZeS via @CMT", "Tue Oct 23 01:19:18 ": "This Saturday we'll be at Legends 2 in VA showtime 8:00pm.", "Fri Dec 07 09:00:14 ": "Playing a show in New York, NY at 10:00 AM today at WFDU/  WAMU Radio - Lonesome Pine RFD http://t.co/cvhdIPvS", "Tue Oct 09 18:24:58 ": "Got some big news coming!  Hmm a hint is \"Justified\"", "Sat Apr 06 10:00:24 ": "Playing a show in Knoxville, TN at 12:00 PM today at Blue Plate Special WDVX http://t.co/XPXxKtATEm", "Thu Aug 23 15:42:26 ": "What do you think about syncing our twitter and facebook? Good idea or bad?", "Sat Aug 25 18:05:24 ": "Playing a show in Evanston, IL at 7:00 PM today at American Legion Hall http://t.co/7pYsK31W", "Thu Oct 11 12:00:51 ": "It's a beautiful and cool morning here in the mountains oh Harlan, KY.", "Sat Sep 29 15:01:48 ": "Playing a show in Nashville, TN at 4:00 PM today at Nashville Convention Center http://t.co/f6hRupWd", "Sat Sep 08 17:04:42 ": "Playing a show in Hedgesville, WV at 6:00 PM today at Lazy A Campground in Back Creek Valley http://t.co/vhEdUR6Q", "Tue Sep 11 22:46:13 ": "Cumberland River talks JUSTIFIED http://t.co/6a6RUVM8 via @sharethis", "Sun Sep 30 00:57:42 ": "Please pray for our bass player and dobro play there grandfather passed thrus. Keep them in your prayers.", "Wed Sep 12 03:32:26 ": "Cumberland River Adds Gary Robinson, Jr. to the Band http://t.co/Ixu8i9uz via @wordpressdotcom", "Tue Nov 27 15:43:42 ": "#CMT 12 Country Christmas Albums for 2012 includes Christmas the Mountain Way!  http://t.co/NRzFyFkv", "Thu Nov 01 02:09:22 ": "RT @daleannbradley: CHRISTMAS: THE MOUNTAIN WAY is a live performance musical show that showcases Christmas and its traditions in the... ...", "Fri Oct 12 00:04:23 ": "New shirts are available at our online store.   http://t.co/pcxOUQ5j http://t.co/xbR10HBx", "Thu Aug 23 15:05:49 ": "Hello St. Paul MN. nice to see ya.", "Sat Sep 08 13:50:17 ": "We are on the road on our way to pickin in the panhandle in Hedgesville, WV.", "Sat Nov 24 18:02:29 ": "We need your votes for National Bluegrass B.O.R.N. Award http://t.co/sfR5SZVX", "Wed Aug 22 16:59:33 ": "Cumberland River to perform at Lee County Fair - Virginia Is For Lovers http://t.co/dJ1H0xSQ via @sharethis", "Wed Oct 31 01:19:07 ": "This Saturday we will be at the Middlesboro Mall at 5:00 &amp; 7:00 pm.", "Thu Nov 01 02:08:51 ": "RT @daleannbradley: This Saturday we are at the Bell Theater, Pineville, KY\n\n\"Cumberland Mountain Music Show\" @ 7:00 PM\nfeaturing... htt ...", "Sun Nov 25 21:34:26 ": "@Harlan_music Hope #Justified fans will vote for Cumberland River for National Bluegrass B.O.R.N. Award http://t.co/sfR5SZVX", "Sat Apr 20 20:00:18 ": "Playing a show in Huntington, WV at 10:00 PM today at V-Club http://t.co/hk3J6oUX5c", "Sat Nov 24 19:14:02 ": "RT @leeroy615: “@Harlan_music: We need your votes for National Bluegrass B.O.R.N. Award http://t.co/ZznqtQGA” go vote for my buds!!! The ...", "Mon Jan 28 01:10:51 ": "RT @mountaineeropry: @Harlan_music look forward to March 9th when Cumberland River Band comes to the Mountaineer Opry", "Sat Nov 24 18:03:08 ": "@RhondaVincent13 Maybe Rhonda will vote for us? http://t.co/sfR5SZVX", "Sun Dec 30 03:53:54 ": "Great day in the recording studio #NewAlbum#OnitsWay:-)", "Sun Aug 26 05:32:23 ": "Leaving Chicago headed for that Harlan county line. Great weekend ful Awesome shows.", "Wed Aug 22 20:38:19 ": "We just rolled out of Harlan headed for Pine River, MN as fast as we can go.", "Thu Jan 10 22:41:39 ": "Very honored to have our song on the album Justified Music From the Original Television Show! #Justified", "Sun Sep 09 01:26:46 ": "Two great sets to a great crowd at pickin in the panhandle!!", "Fri Oct 12 00:13:23 ": "@rlsmoore thanks!!", "Fri Oct 05 21:39:32 ": "On the road heading for the Outer Banks Bluegrass Festival on Roanoke Island, NC.", "Thu Aug 30 13:58:33 ": "@chicagograss A great time was had by all - we loved it - Thanks so much!", "Sun Aug 26 01:01:34 ": "Packed house in Chicago. http://t.co/yybzN1SV", "Wed Oct 31 01:31:53 ": "Immediately following our show at the mall we will be at the Bell Theater # Cumberland Mountain Music Show", "Sat Oct 06 02:39:34 ": "Got the hammer down in Mount Airy, NC. I wonder if Rodney Dillard is here?!?!", "Wed Mar 20 23:00:21 ": "New shows announced in Cumberland, KY - Burlington, WI http://t.co/MpK05mpRee", "Thu Nov 22 14:16:03 ": "Happy Thanksgiving to everyone in the Mountain Nation! We hope you have a blessed day full of good food and good fellowship!", "Tue Dec 25 01:30:55 ": "Hope everyone is having a great Christmas Eve!!!", "Sat Oct 13 07:00:04 ": "Playing a show in Atlanta, GA at 9:45 AM today at Corporate Event http://t.co/mhiPp2zt", "Sat Dec 15 18:00:20 ": "Playing a show in Pineville, KY at 7:30 PM today at Bell Theater http://t.co/38lb51Yl", "Sat Nov 03 19:07:42 ": "Playing a show in Pineville, KY at 9:00 PM today at Bell Theater http://t.co/BjbS16Oc", "Fri Aug 24 13:00:09 ": "Playing a show in Pine River, MN at 2:30 PM today at Cass County Fairgrounds http://t.co/oVwiCEwJ", "Sat Nov 24 19:15:32 ": "RT @daleannbradley: Christmas the Mountain Way is available on Amazon! http://t.co/C1MybUbW", "Sat Mar 09 19:02:50 ": "Playing a show in Milton, WV at 7:30 PM today at Mountaineer Opry House http://t.co/FOm6jVD1Lz", "Sat Nov 24 19:14:23 ": "@leeroy615 Thank you!!", "Mon Feb 11 14:21:57 ": "RT @Mr_Mando19: I wear a star on my chest and a 6 gun on my side...I can help you close your eyes, and I think that's justified @Harlan_ ...", "Thu Apr 18 13:00:22 ": "New show announced in Pennington Gap, VA at Legends 2 on April 27, 2013 http://t.co/oFJZds8Z6S", "Wed Nov 21 01:18:32 ": "RT @SammyIII: Many have asked for the direct link to CHRISTMAS THE MOUNTAIN WAY on itunes - here ya go! Thanks so much for... http://t.c ...", "Sat Oct 13 06:50:45 ": "TN Hwy patrol does not like you doing 85 in a 70. Got the ticket to prove it..", "Sat Aug 25 01:17:38 ": "Getting ready to hit the stage at the Lakes Bluegrass Festival. In Pine River, MN. To a packed house.", "Sun Dec 16 00:44:05 ": "It's not too late to make out to the Bell. A lot of good music left in the night.", "Mon Feb 11 14:25:00 ": "Today is Dustin Middleton's BIRTHDAY. Look him up on Facebook and wish him a Happy Birthday!!!!", "Sat Nov 24 19:15:03 ": "RT @HopeRiverENT: I just voted for Cumberland River - will you take 2 secs to vote? http://t.co/fqQar0j6"}