{"Mon Oct 29 03:37:46 ": "God damn storm is making me miss being with Joe Madison and Bill Wax at Sirius tomorrow.", "Sun Jul 08 16:47:31 ": "I understand that we have to get the views and opinions of the other side, but do we have to LOOK at Mitch McConnell?!", "Tue Sep 18 22:34:05 ": "Oh, and me and my guys are going to be on Jay Leno on Sept. 25. AND, my record is also released that day. I'm a happy old broad.", "Thu Sep 13 23:45:11 ": "Here's a question for you. Why does every music fan think that every artist is, too?", "Sun Jul 29 23:26:36 ": "i wonder what Romney or his donors would think or do if they saw the piece that just aired on 60 minutes about the homeless in FL.", "Mon Aug 13 17:23:22 ": "Why is it that I never see Tony Bennett referred to as a \"cover artist\"????", "Sat Aug 04 01:52:34 ": "finally in the hotel. 8000 ft above sea level. can hardly breath. can't even talk to Kevin. It's scary. I don't know why i agreed to do this", "Wed Nov 07 04:15:03 ": "I love my president!", "Tue Sep 25 18:42:20 ": "Rehearsal went great. Now, LUNCH with my friend, the red lipped wonder. lol", "Thu Oct 04 22:44:37 ": "AND, our President DOES have a day gig, and Mitt Romney doesn't. lol", "Thu Sep 13 23:52:43 ": "I still can't believe that with all of Paul Ryan's statements that have been proven untrue, none of the press have called him \"Lyin' Ryan\".", "Sat Aug 11 18:04:36 ": "I wish Romney would quit taking those 2 black cut outs and putting them behind him at every speech.", "Thu Aug 23 22:24:16 ": "Or you can hear it HERE. http://t.co/fuhsGUxL", "Mon Aug 06 14:34:58 ": "home. bed good night!", "Thu Aug 02 23:37:07 ": "I don't usually tweet my itinerary, but we are doing a FREE concert @ Madison Sq Park @25th st in NYC @7PM on Wed. Aug. 8.", "Sun Aug 05 17:28:04 ": "There is only ONE plane that leaves here on Sun. and it's a 530 flight to LA. Then 5 hour layover, then to Atlanta then to home at 10AM!", "Thu Aug 16 17:23:07 ": "Soledad tells Sununu. I can't stand to even LOOK at him! http://t.co/6T6k9PU9", "Wed Sep 19 21:11:34 ": "Home from Detroit and I find out there is a free download preview of  my upcoming book in the app store. Check it out. http://t.co/Wz2wCP85", "Sat Oct 13 21:15:16 ": "Storm Large IS Storm Large. I love her!", "Fri Aug 03 21:29:02 ": "This is the third airport today. one to go. I want to SCREAM!!!!!!!!!!!!!!", "Sun Jul 29 16:34:44 ": "I HATE three hour lay-overs. Thank God I can get a drink.", "Mon Jul 16 17:48:55 ": "Canada went well, anti spasmodics sorta worked. on the plane to home and Kevin to celebrate our 9 year anniversary. i'm quite pleased.", "Sun Aug 05 23:32:21 ": "so we check out at 12. Get to the airport and it doesn't open until near departure time 530. we went to eat at Nat'l Park &amp; were told to go", "Tue Oct 16 06:31:29 ": "Well, I just got a message that I have won 500 games of Solitaire. \nEverybody seems to wonde,r what is it like out here...", "Sun Aug 05 17:22:46 ": "Ann Coulter, so glad she's beginning to LOOK like the shrew she really is. Can't look 25 forever.", "Wed Aug 22 00:01:42 ": "Oh, and my finished copy of my BOOK arrived today! It is so strange to see MY name and MY picture on a BOOK. Thankful N' Thoughtful, indeed.", "Mon Oct 29 03:36:03 ": "Packed house at the Rams Head. I told them they were crazy! lol\nRobert and I driving back to NJ now. Home, here I come.", "Fri Aug 03 22:23:08 ": "Do you know what priority means? It means do your job, fix your hair later.", "Sat Oct 06 16:05:46 ": "West Coast, here I come. Check my schedule and come see me if you can.\nTell all your tweetin friends, too! lol\nhttp://t.co/Lp4cy8Ep", "Sun Oct 14 15:22:42 ": "Oh, and my manager is now twittering. follow him and he will probably be twitting useful things about me sometimes. @EricAtPanacea", "Fri Sep 28 03:00:40 ": "What a wonderful night at B&amp;N. Talking, singing, signing, seeing friends.\nHome now and I am VERY pleased.", "Sun Sep 30 20:07:06 ": "Philly was great. band played great. sound was great. slept in my own bed again. watched politics and cooking Sunday dinner. TNT indeed.", "Tue Sep 18 22:32:36 ": "Rehearsals went great, Romney put his foot in his big mouth, and my entire new album is streaming on Paste Magazine:http://t.co/UGzLM7rp", "Thu Aug 23 22:22:32 ": "Busy day. Interviews with Rita Houston at WFUV and with Dave Marsh at Sirius.\nAND, my new single dropped today. http://t.co/85zpoTcx indeed.", "Sun Aug 05 17:20:37 ": "Well, caught my breath, did an hour of my show, then the rain cut it short. Sorry, Mammoth. Hope you enjoyed the bit you saw.", "Sun Dec 23 17:58:46 ": "Home, and rested. Thanks to all of my European fans for your wonderful receptions. See you next year. Happy Holidays everybody. Love, B.", "Sat Dec 01 19:19:08 ": "However, the 3 Texas gigs went well. It's always nice to see more than 6 black faces in the audience.", "Wed Aug 15 19:52:52 ": "50 years ago today I stepped into a recording studio for the very first time and recorded My Man.", "Thu Oct 04 22:43:57 ": "Am I the only one who thought our President looked tired and not bored?", "Mon Oct 01 22:00:45 ": "Today, rest. ahhhh. Come see me tomorrow night at 7PM. I'll be talking with Harry Weinger at The Apple Store 103 Prince Street NYC.", "Sun Sep 16 14:35:45 ": "Autographed copies of my new CD/LP are available for pre-order. Ships Sept. 25. Soundbites of all tracks here. \nhttp://t.co/3CaXcmbm", "Sat Nov 10 19:41:39 ": "OK, so when do I get my stuff? lol", "Sun Sep 16 14:39:26 ": "Have I told you? I have a BOOK, about ME, and autographed copies are available for pre-order, too! Will ship Sept. 27. http://t.co/3CaXcmbm", "Thu Nov 29 22:09:56 ": "Kevin just informed me that ya'll should watch Scandal this evening. I'll have to see it on the website. Kessler Theatre, see ya soon.", "Wed Aug 08 14:28:44 ": "It is official. Noble Press will be handling my European publicity. Welcome to the team, Peter! http://t.co/ijgyQUNG", "Thu Aug 02 16:50:44 ": "I HATE doing Q&amp;As in print! Pick up the phone and ask me!!!", "Mon Sep 24 19:41:46 ": "Of course for my flight to LA I am next to a mother and her three little children.\nChildren under 12 should sit in the back of the plane.", "Sun Jul 08 15:42:53 ": "Waterfront show/talk went well Chatted with Bobby Rush Joined Galactic onstage Drank champagne Watching politics now  Waiting for breakfast", "Sat Aug 04 18:11:49 ": "Well, sleep and my body seems to have adjusted. At least I can BREATHE! Now let's see how I do my show.", "Fri Aug 31 23:37:52 ": "Clint Eastwood. A testament to the antiquity of the GOP.", "Tue Sep 25 15:46:10 ": "So Ann Romney will be on Jay Leno too. Should I wear my Obama shirt? lol", "Sun Aug 05 23:33:24 ": "so we've been sitting in the airport parking lot for hours....WAITING FOR IT TO OPEN!!!!!!!!!", "Thu Sep 27 17:41:02 ": "My Jay Leno performance can be viewed here http://t.co/ew4H94F0", "Sun Aug 05 17:28:42 ": "Welcome to the good times honey.", "Sun Jul 08 21:51:39 ": "Hey record collectors and soul music lovers I love you &amp; appreciate the support all these years but STOP ADDING ME TO YOUR FUCKING GROUPS", "Sun Nov 11 17:03:19 ": "I would like to thank all of our veterans who have served our country in every war. They have allowed us the freedom to be who we are.", "Thu Sep 27 17:43:56 ": "And then tomorrow night at The Highline I will be debuting the new CD! I am so excited.", "Sat Aug 04 18:15:48 ": "RT @RecCollMag: Upcoming Q&amp;As for the mag and Newsletter inc. Bettye LaVette. Sign up via http://t.co/ntNwbhPD.", "Tue Oct 09 22:01:28 ": "2 down. stuck in traffic on way to LA. BUT, it's a day off!", "Sat Dec 01 19:17:40 ": "On my way to Europe with this cold. Muthafucka.", "Tue Sep 25 16:36:46 ": "Waiting for my car to Jay Leno show. My old friend David Nathan has posted an audio interview with me. Listen here.\nhttp://t.co/DdH1BeQZ", "Sun Sep 23 16:33:18 ": "Kevin sent me this link. I'm on the frontpage of my hometown paper! I am, indeed, thankful and thoughtful.\nhttp://t.co/2utdG38d", "Tue Sep 25 16:40:51 ": "Don't forget to check my fan page for the latest news, reviews, and what have you. https://t.co/A0g1qTYg", "Mon Sep 17 14:46:07 ": "In Detroit, rehearsing the new CD. Look forward to doing the songs in my show. I hate recording &amp; rehearsals, but somebody's gotta do it.lol", "Fri Aug 24 17:05:06 ": "I will be on Rita Houston's show tonight at around 9PM EST. It's 90.7FM or http://t.co/H294nVQB. Interview and 3 songs with my MD Alan Hill.", "Wed Aug 22 20:40:23 ": "Way to go Twisted Sister.", "Sun Aug 05 17:47:05 ": "If I were the president I wouldn't even mention the other guy's name. I would just say what I'M gonna do.", "Sat Nov 03 20:41:04 ": "Safe, no power, no phone, but neighbor has generator and we charged our cells and my iPad. Thank you to all who were concerned.", "Thu Oct 04 22:47:01 ": "AND, I'd like to have Bill O'Reily, Rush Limbaugh, and NOW, John Sinunu, on the North end of Detroit. LAZY?! Ohhhhhh...", "Tue Nov 27 19:34:02 ": "Just taped Tavis Smiley yesterday. Had a large time. It airs this Thursday 11/29 and will be available online here http://t.co/YcMS7GfI", "Thu Dec 06 04:20:47 ": "oops.I forgot some of the people in the book are Grammy voters. lol", "Wed Oct 17 00:25:44 ": "Last show tonight at Triple Door. Sorry I have to miss the debate. Home tomorrow for 5 days. I am so fucking tired...", "Fri Jul 27 01:06:44 ": "Getting pissed trying to post a link here", "Sun Sep 16 14:31:37 ": "Liz Cheney: \"The Romney campaign doesn't always get it right.\" I love it.", "Fri Aug 10 18:23:16 ": "For the record, I LOVE New York. The other night, I merely stated that it's taken New York 50 years to love ME.", "Sun Nov 11 07:42:08 ": "@billmaher Bill, I hope that you enjoy this, if you don't already know it. It's a great read.\nhttp://t.co/ILLUa3WV", "Fri Aug 03 22:53:43 ": "The last comment was to the people bad mouthing Gabby's hair, even though she won the gold.", "Wed Aug 22 00:00:22 ": "Fourteen hours travel home yesterday. God, I HATE the airports. However, my grand daughter arrived today for a visit and all is well.", "Tue Nov 27 19:35:51 ": "My apologies for my lack of tweets lately. I have been so muthafuckin busy, I just don't have the time or inclination. But I love you all.", "Sun Sep 23 16:30:44 ": "Flight delayed in Atlanta. Like my home time won't be short enough, leaving for LA to do Leno tomorrow.", "Sun Sep 30 20:15:36 ": "To all asking where I will be performing, sign up for my gig alerts, and you'll know when I am close to you. http://t.co/Lp4cy8Ep", "Sun Oct 14 15:20:37 ": "12 hour day at Wordstock. Now off to airport &amp; Yoshi's. Show tonight. and tomorrow night. and the next. Be careful what you ask for, indeed.", "Thu Dec 06 04:15:25 ": "I didn't get shit, again...muthafuckas.", "Sun Nov 18 16:56:39 ": "Please share this petition requiring digital credits be available so downloaders can see who's who. http://t.co/RNyq57Vy", "Thu Jan 03 23:32:06 ": "Happy New Year to all. Just found out that both of my NY shows are sold out. Happy New year indeed.", "Fri Nov 30 06:45:56 ": "So the cold I thought I was catching yesterday has been caught. Muthafucka.", "Thu Aug 30 19:26:56 ": "jason chaffetz \"with the Romney's we will have a family in the White House we can be proud of\". Can't be proud of the first BLACK family?!", "Thu Aug 30 01:39:39 ": "My very first book review! I still can't believe that \"I\" have a book...about ME!!!!\nhttp://t.co/ZNNYonQc", "Fri Aug 03 00:33:22 ": "so a young man is dead in arkansas, stemming from an arrest for TEN DOLLARS worth of marijuanna. Washington, change those laws!", "Tue Sep 25 16:42:03 ": "RT @BlueRiderPress: RT and Follow @BettyeLaVette and @BlueRiderPress to win a copy of her new @AntiRecords album “Thankful N’ Thoughtful ...", "Wed Aug 22 20:48:15 ": "Hank, Baby Boy, Junior. As hard as we and your father worked, so that you could PRETEND to be a Country &amp; Western singer, I'm hurt.", "Fri Jul 27 01:07:26 ": "George Carlin telling it like it T I is.\nhttp://t.co/HOidcfLQ", "Sun Jul 08 21:54:20 ": "Groups I don't have the time to invest. I had over 200 emails in my inbox in a day. Please tell your friends. No group adds. ever. thank you", "Tue Aug 28 03:34:09 ": "Go Charlie!\nhttp://t.co/vHRfbaYi", "Wed Oct 03 16:32:56 ": "The video for Everything Is Broken debuts today at American Songwriter.\nhttp://t.co/fAazOP4p", "Thu Sep 27 17:43:05 ": "Excited about my first ever BOOK SIGNING! Tonight! Barnes &amp; Noble, Union Square,NY 7pm.Q&amp;A, couple of songs,signing. I am a lucky old broad.", "Mon Jul 30 22:58:24 ": "just saw the black couple denied being married in a church because they were black. Mississippi is STILL Mississippi. Mississippi Goddam.", "Tue Jul 31 03:07:44 ": "For those too young to get my reference, here it is.\nhttp://t.co/3El8OcQY", "Sun Jul 29 22:24:21 ": "Home again, home again, jigidy jig.", "Mon Jul 30 22:33:58 ": "I don't think I'd like Mitt Romney even if I knew him."}