{"Sat Apr 20 22:04:08 ": "Much love! I appreciate the kind words! @BrotherBerg1", "Wed Mar 06 05:53:47 ": "And I'm not talking about money, that's shallow. I'm talking about freedom, be free from all limitations. Be the best you! Put that work in!", "Sat Apr 20 21:47:56 ": "Believe me when I say, your worst day doing something you love is still greatly better than your best day doing something you hate!", "Mon Feb 25 20:08:01 ": "My wish for your bday bro! @9021Beau, May all the love, loyalty, support and positivity you give everyone...come back to you abundantly!", "Wed Mar 06 05:56:52 ": "You can't get full time results from part time effort, who are you kidding?...Be honest with your mirror!", "Fri Apr 19 00:32:49 ": "Take a leap of faith. Fear not. Living with Courage is the ultimate life changing move.", "Fri Apr 19 00:26:45 ": "When it comes to ambition, success, dream catching, I'm pretty convinced that the meek will not inherit the earth. You have to go get it!", "Sat Apr 20 21:48:56 ": "And if you don't know what you love, spend some serious time soul searching, for this answer will have the biggest impact on your life.", "Wed Mar 13 21:32:42 ": "RT @GloverQuin29 Also want to thank the Texans fans for all their support over my 4 yrs there! It was fun..", "Wed Mar 13 21:32:35 ": "RT @GloverQuin29 Thank you to the Texans for giving me an a opportunity to start my career in the NFL and have 4 goods years with them!!", "Fri Apr 19 01:54:40 ": "True and sincere generosity is when you can give your all and I mean your ALL...and always feel like it costs you nothing.", "Mon Mar 04 03:29:02 ": "RT @ArianFoster Mom, you never have to work again! I said that to you when I was 8 years old! You might not have believed me, but we did it!", "Sun Mar 03 01:31:33 ": "DMX was a rare talent. He never really got the respect he deserves as an artist.", "Sun Mar 17 00:29:04 ": "Great day at the office. Now headed to get a workout in. I promised @h2heidi I would never get that business man gut. Haha", "Wed Apr 03 05:03:07 ": "Yessir! I'm talking life...never politics. RT @abrazomack @H2Humble I dig that. You're talking disposition...not necessarily politics.", "Mon Mar 04 23:09:31 ": "No Franchise Tag...great news...now back to taxes!", "Sun Apr 21 19:29:29 ": "Last year I said, \"Paul George is rare. He'll be a perennial all-star in his career!\" &amp; I got a lot of flack...you critics are forgiven!", "Tue Apr 02 01:41:48 ": "What do we live for for, if it is not to make life less difficult for each other?", "Sat Apr 20 22:05:09 ": "I'm always a phone call way my friend! @BenWaivol", "Fri Mar 15 17:36:34 ": "Haha Rumor has it, I'm the coolest Financial Mgr on twitter! RT @MrFunkVolume @H2Humble Lol...you are on Twi… http://t.co/S5WL6WgnUo", "Fri Apr 19 00:55:48 ": "Hahahaha RT @DuaneBrown76 Every time I walk into the barbershop I feel like I'm stepping into ESPN headquarters. So many experts lol", "Sat Apr 20 02:00:46 ": "You can avoid literally 90% of all problems &amp; worries if you perfect the art of compromising. It's a simple, \"Hey I got you and you got me!\"", "Thu Apr 18 22:08:39 ": "Public Apology to my family &amp; friends, I know I've been MIA...tax season is a monster. Thank you for your patience, I'll make it up to you!", "Wed Apr 17 03:23:29 ": "Hey, you know you don't have to wait until someone dies to tell them how much they mean to you...right?!", "Sat Apr 20 15:21:05 ": "I am witnessing a dream manifest...one of the most powerful and meaningful days of my life.", "Wed Mar 13 21:32:53 ": "RT @GloverQuin29 Detroit fans, lets get it started!!!", "Sat Mar 16 02:23:30 ": "There is a false invisibility that comes from success that has to be checked at the door or eventually it will kill you.", "Sun Feb 24 05:39:33 ": "I love seeing people happy! All the things we worry about really don't matter! This is our only chance at life, let's make the most of it!!", "Sun Apr 21 20:27:44 ": "Who has been the best player of this generation? Kobe or Tim Duncan? And why?", "Fri Apr 05 05:32:23 ": "Every day above ground is a good day my brother...Today must've been a great day?! RT @Nick_Groff Today was a good day!!!", "Wed Mar 06 06:07:36 ": "Stop chasing your dreams, they'll just keep running from you! Start Hunting your dreams down with a purpose! Hunt them down!", "Sun Feb 24 05:47:49 ": "I grew up in the slums of Uganda. I was happy then, I'm Happy now! For all I have ever cared about was being a noble human spirit.", "Thu Apr 18 20:20:09 ": "Anyone can make a dollar, it takes much more to make a difference!", "Sat Mar 30 19:18:14 ": "However I remember vividly where our UNM basketball  was with Ritchie McKay &amp; how dismal the program was, UNM basketball was falling apart!", "Mon Feb 25 20:43:09 ": "…cont) http://t.co/bcjEN4EJJD", "Sat Apr 20 21:41:17 ": "I had a chance to speak to a small group of recent graduates of Florida St. It was incredible to be around t… http://t.co/YoKFgzs5Zt", "Sat Apr 20 21:35:49 ": "Everyday, what I believe most about people gets confirmed...\"If you take care of good people...good people will take care of you!\"", "Fri Apr 19 00:43:20 ": "Give me one person full of passion over forty people who are merely interested.", "Mon Mar 11 20:56:24 ": "I won't die to get to mine, I'll bask in this place alive, I'll take my paradise on earth...", "Wed Apr 03 04:55:42 ": "I say take all the risks while you're young...be bold &amp; by the fall/winter of your life, you just relax...@abrazomack", "Wed Apr 03 02:06:40 ": "I've never understood bike riders in the midst of car traffic. There's a perfectly open sidewalk...what are you trying to prove?!", "Sat Mar 30 19:26:21 ": "So I wish Alford well...his time is served &amp; he changed the culture for UNM, I'll always respect him for that! We had a great 6 yr run!", "Sat Apr 20 01:38:18 ": "!!! RT @jerreau You don't even know why you believe, what you believe", "Sat Mar 30 19:13:33 ": "As a die hard Lobo, I do think Alford could've handled his departure with more class, I really do even though there's no right way to leave!", "Sat Apr 20 21:23:15 ": "And once you do become successful than only real advantage there is a bigger responsibility to do more good.", "Sat Apr 20 01:36:48 ": "Whatever we accomplish belongs to our entire group, a tribute to our combined commitment and effort.\n-Dream Builders", "Fri Mar 15 03:52:34 ": "So you can hide behind how many years you've been existing, but how many years you've been thriving is the only thing that counts!", "Sun Feb 24 05:53:40 ": "True words spoken! RT @EFFINGGill @H2Humble you have quite possibly the best avi on Earth", "Mon Feb 25 19:59:32 ": "Happy birthday to my little brother @9021Beau. One of the greatest human spirits that's ever lived! It's an honor to walk life with you bro!", "Wed Mar 06 05:49:47 ": "I've seen ppl who come from so much accomplish so little and ppl who come from so little accomplish so much! The world is your stage...", "Sat Mar 23 19:04:28 ": "Iron sharpens Iron bro! its an honor! RT @NUEmattadler Great lunch with @H2Humble. We are going to take over! #hardwork. Always inspiring.", "Sat Apr 20 21:26:28 ": "Chase money if you want but you'll never see a Uhaul behind a hearse...that's because your name is all that you take to your grave.", "Fri Apr 19 00:53:22 ": "RT @jeffvietri @H2Humble love when you take a moment to jump on and preach to those of us also looking to ma… http://t.co/B2WH3h0Ukx", "Fri Apr 19 12:42:01 ": "I used to be driven to be the best of the best...now, I'm committed to being the only one that truly does what I do. #CommittedToExcellence", "Sat Apr 20 21:54:45 ": "You forever have a friend in me! Shake Dallas up!! @bigdogjj2", "Sat Mar 30 19:19:13 ": "Over the past 6 yrs, Alford &amp; his staff brought back the PIT, they brought back that pride and prominence to that program! He delivered!!", "Fri Apr 19 00:28:35 ": "As you cook up your own life, never let anyone else's recipe for success intimidate you or get in your way.Know your own truth &amp; live by it!", "Fri Mar 15 03:50:17 ": "More years rarely bring greater insight, wisdom and greatness, it usually bring just more years. Intangibles… http://t.co/iNnNZofnst", "Fri Apr 19 00:53:42 ": "Light attracts light! Much love! @jeffvietri", "Thu Apr 18 22:05:05 ": "I'm just a kid from a hut...making good on each promise...", "Sat Mar 02 21:32:00 ": "Much love to my bro @TeamVic. Happy to see him having his way with the world! A great human spirit!!", "Fri Apr 19 12:48:19 ": "By the way, if you know that it's going to happen and you believe it in your soul...there's no need to call it a dream. It's your destiny!", "Sat Mar 30 07:21:17 ": "I have loved, I have lived. All that's missing is some little ones running around &amp; I hope they grow to be as kind &amp; noble as their mother.", "Sat Apr 20 22:04:44 ": "RT @BenWaivol @H2Humble chatting today gave me a greater appreciation for everything in my life and inspirat… http://t.co/5gdIR2GWjS", "Sun Feb 24 06:14:49 ": "We're all connected! Positive Energy is boundless!! RT @DugyFresh @H2Humble Man, I don't even know you but your tweets encourage me so.", "Thu Apr 18 20:54:24 ": "Haha RT @BrotherBerg1 “@H2Humble: Anyone can make a dollar, it takes much more to make a difference!” My man you got that blue checkmark!!!!", "Sat Apr 20 21:46:22 ": "But as cliche as it sounds, you have to start with something you love. Find what makes your heart race and dedicate the next 10 yrs to it!!", "Mon Feb 25 20:43:11 ": "RT @9021Beau @H2Humble that's what I've learned best from you, big bro! To give love and get love, unconditionally!... (cont…", "Wed Apr 03 03:10:21 ": "I hear you bro..You'll win the war, you always do!RT @jcraw55 @H2Humble blessed this way to bro..Treatin me good.. Been thru a lot this year", "Sat Apr 20 21:53:57 ": "RT @bigdogjj2 Met a very inspirational individual today that really opened my eyes to the spectrum of my future endeavors @H2Humble", "Mon Mar 18 00:55:06 ": "These Lobos are making us proud!!", "Wed Apr 03 04:42:39 ": "Being conservative in your 20's is cowardly...and being liberal in your 60's is foolish.", "Sat Apr 20 22:22:52 ": "And if you are the wisest person in your circle, you need a new circle.", "Sat Mar 30 19:20:30 ": "Alford is leaving the UNM basketball program alot better than he found it, and I mean a complete 180 degree turnaround. I appreciate that!", "Mon Apr 22 04:52:05 ": "Great weekend...grateful for this moment in time. Looking forward to a big week. May life   always be kind to all of you guys...good night!", "Thu Apr 11 18:51:31 ": "Your welcome! Same things I dream for me, I want for my brothers! RT @_chea My book readings have been courtesy of @H2Humble. Thank you!!!", "Mon Mar 04 03:29:21 ": "RT @ArianFoster To the youngins, GO GET IT! It's out there for you, along with a million excuses. Choose your fate!", "Wed Mar 06 05:45:24 ": "You can't teach, \"want to\"!...You are either driven or you're not. Ambition is a verb. If you are who you say you are...show us something!", "Fri Apr 05 02:46:30 ": "Vision without action is a daydream....Action without vision is a nightmare...", "Sun Feb 24 05:37:41 ": "A smart man! RT @AirJordan_73 @H2Humble my athletic trainer Dr. Yeo preaches that to our class", "Sat Apr 20 21:21:52 ": "To be successful you have to ONLY promise what you can deliver and then deliver MORE than you promised.", "Sat Apr 20 22:08:00 ": "Yessir! I got you! RT @bigdogjj2 @H2Humble thanks bud and likewise u know where ill be if I ever make it to LA be ready #inspiringflow", "Sun Mar 31 22:46:51 ": "Russ Smith from Louisville is my favorite player in the tourney. He has so much heart...a killer. He reminds me alot of @jcraw55. A killer!!", "Sat Apr 20 22:02:28 ": "RT @BrotherBerg1 Hands down the 2 best people I follow are @H2Humble and @LeftSentThis! Follow if you enjoy … http://t.co/LBu7XprLtA", "Sun Feb 24 05:56:10 ": "Fortunately, I represent people who achieve the unattainable everyday! RT @CLSportsNation @H2Humble admirable, but unattainable.", "Wed Mar 06 06:00:52 ": "Human spirits literally change the world, day in &amp; day out! Look around you, it all started in the minds of ppl who wouldn't stop pushing!", "Sat Apr 20 21:43:19 ": "Our education system does a great job teaching but not inspiring. There's a major difference between filling a bucket and lighting a fire.", "Wed Mar 13 21:32:10 ": "RT @GloverQuin29 Just want to say thank you to the Detroit Lions organization &amp; coaches for giving me an opportunity to continue my career!!", "Sat Mar 30 19:23:15 ": "1 thing ppl need to accept is no one owes you anything! At the end of the day, ppl WILL always do what's best for their family, every time!!", "Sun Apr 21 03:52:41 ": "Landed back in L.A, Headed straight to dinner &amp; a movie w/@h2heidi. Never miss date night w/your wife, no matter how far you are from home!!", "Sun Feb 24 05:43:36 ": "At my funeral, I hope everyone says the same thing, \"He was a great human spirit with a kind &amp; compassionate heart &amp; he never let me down!\"", "Sat Apr 20 01:38:02 ": "!!! RT @jerreau It perplexes me what you all choose to believe, verses what you question", "Sat Apr 20 22:22:09 ": "You are never too old to learn or too young to teach. The wisest person is the person that knows he doesn't know it all.", "Fri Apr 19 00:31:27 ": "The secret of life is to NEVER BE AFRAID....Fear will stunt your growth, narrow your ambition and kill your dreams.", "Sun Apr 21 19:45:22 ": "I love Tony Parker's game. He's one of the most underrated super stars of all time.", "Wed Mar 06 05:59:05 ": "There is nothing on Earth more powerful than a human spirit on fire! Everything you have or enjoy comes from a human spirit that was driven!", "Sat Apr 20 22:19:13 ": "If you have knowledge, allow others to light their candles on it. We are then all enlightened. I've been lig… http://t.co/528zyU1OUj", "Sun Mar 03 01:37:04 ": "Two Classic, Number 1 Albums in the same year...in the P.Diddy shiny suit era...smh. DMX was special.", "Sun Feb 24 06:12:44 ": "Thanks! very kind of you! RT @JenipherSierra @H2Humble nice comment", "Wed Apr 03 02:12:15 ": "Great bro! Truly blessed! how's the bean treating you?RT @jcraw55 @H2Humble how u been?"}