{"Mon Apr 22 16:40:51 ": "@HaitianRemo @Fabrizio @atmybest197 @eshowstv lol I see your from my country Haiti . Nice !", "Mon Jan 21 20:42:39 ": "First lady starts 2nd term style in Thom Browne: WASHINGTON (AP) — The first family headed out to Monday's inaug... http://t.co/n7Bn7xLO", "Tue Jan 22 15:16:41 ": "Bond's license to kill curtailed in China: In the latest Bond movie \"Skyfall,\" Daniel Craig's 007 pursues an ass... http://t.co/NqTsfL1Q", "Tue Jan 22 02:31:10 ": "Michelle Obama wears Wu to the balls again: WASHINGTON (AP) — Michelle Obama made it a fashion tradition Monday ... http://t.co/1SM1zrRb", "Tue Jan 22 06:21:30 ": "Alicia Keys, Fun., And The Dance You Won't Forget:  Your 2013 Inaugural Recap: \nPerformances, celebratio... http://t.co/Pq1DIkIq", "Tue Jan 22 13:42:56 ": "Justin Bieber Laps Lady Gaga For Twitter Crown: \nBieber bests Gaga on Monday night by passing her 33.3 m... http://t.co/7f325mwL", "Tue Jan 22 16:22:15 ": "Paramore Stream Thumping New Single, 'Now': \nDriving song mixes touches of No Doubt-like vocals with bom... http://t.co/jpK1OohW", "Sat Apr 20 22:20:00 ": "@ChelleGotti whatever ideas u may have im sure we can build from there :)", "Thu Apr 18 15:59:47 ": "RT @Fabrizio: Amazing day fam @nixongotswag and now is sound like a \"tweet\" lets put some music on @EShowsTV @IamRonnyLehmann", "Tue Jan 22 16:25:45 ": "Gallery: Sundance Film Festival 2013: \n    \n http://t.co/zeRMycM7", "Tue Jan 22 04:01:22 ": "Michelle Obama again picks designer Wu for inaugural gown: WASHINGTON (Reuters) - It was one of the biggest ques... http://t.co/WJc35pP8", "Mon Apr 22 16:37:37 ": "RT @Fabrizio: I dont know what @sourandmoscato @HaitianRemo or @djwats01 have in their hands but i will call their \"King Midas\" all they tw…", "Tue Jan 22 04:03:44 ": "Exclusive: Donna Tei Calls 'Catfish' Star About Manti Te'o Hoax: \n'I don't know how I fit into this stor... http://t.co/50CnmwMB", "Tue Jan 22 04:42:09 ": "2013 Presidential Inaugural Ball Gets Fun.: Watch Here!: \nThe Grammy-nominated band took the stage to we... http://t.co/MDAE7OR9", "Wed Apr 17 00:54:56 ": "RT @atmybest197: @Fabrizio @BofA_Help please man this has gone on long enough. How could @BofA_Help ask me to prove my innocence? I owe  ...", "Mon Jan 21 22:08:16 ": "Man cited for riding camel during Sundance fest: PARK CITY, Utah (AP) — Police cited a man for riding a camel an... http://t.co/6CiHgCoy", "Tue Jan 22 12:25:05 ": "Dalai Lama to headline Indian literature festival: JAIPUR, India (AP) — The Dalai Lama is set to headline India'... http://t.co/vLMAWLLY", "Fri Apr 19 14:22:06 ": "In life what u put out is what u get back. Lying about who u are and your $ and power eventually puts u in a place where u have 2 prove it", "Tue Apr 16 23:40:05 ": "RT @atmybest197: @Fabrizio @BofA_Help has reached out to other banks department illegally to get personal info. I WANT TO BE LEFT ALONE. ...", "Tue Jan 22 05:46:28 ": "Sirius XM Radio creating Comedy Central channel: NEW YORK (AP) — Sirius XM Radio and Comedy Central are teaming ... http://t.co/EPH6kYZt", "Wed Apr 17 19:47:57 ": "@billiemitchel let's promote it to the world", "Sun Apr 21 14:26:52 ": "RT @atmybest197: SLEEP IS SO OVERATED ESPECIALLY WHEN THERES ALWAYS SO MUCH TO DO. while your resting my team is awake. When your awake we …", "Sat Apr 20 00:07:42 ": "@Ftsnation I have no doubt we will. Good people together usually can do great things", "Tue Apr 16 23:39:06 ": "RT @Fabrizio: my brother @atmybest197 he need help Im pretty sure You can do it better @ChaseSupport @ChaseNews im 100% sure of that let ...", "Mon Jan 21 23:50:42 ": "Rolling Stones nominated for four NME music awards: LONDON (Reuters) - Veteran British rockers The Rolling Stone... http://t.co/KLluhZCP", "Tue Jan 22 13:48:42 ": "'Girl Rising' spotlights need for girls' education: PARK CITY, Utah (AP) — Just because a film isn't finished do... http://t.co/tbnsxdkM", "Tue Jan 22 06:08:30 ": "Beyonce, Hudson do star turns at inauguration: WASHINGTON (AP) — Beyonce drew a loud cheer at the inauguration M... http://t.co/F5VJBM3v", "Mon Apr 22 14:53:58 ": "RT @Fabrizio: So Funny @thewanted @JayTheWanted but extremely Good #SocialMedia Practice... lets Fans define #JaysTwitterBioShouldSay", "Tue Apr 16 16:03:06 ": "RT @atmybest197: @Fabrizio whats good bro aint it good to be back ????? These kids cant stop us @EShowsTV", "Tue Jan 22 03:46:30 ": "'Avenue Q,' Logo Partner on HIV-Awareness PSAs: LOS ANGELES (http://t.co/ag4Aajmv) - \"Avenue Q\" is partnering wit... http://t.co/wYZ7GKR1", "Sat Apr 20 22:16:23 ": "RT @Fabrizio: Make a RT if you a positive six figures in your bank account! If is not what you are waiting for put ur hands and legs to work", "Tue Apr 16 23:40:12 ": "RT @Fabrizio: @atmybest197 @BofA_Help i got a saving account bloc and also close because was not ID there, (but my business account is f ...", "Sun Apr 21 01:35:18 ": "@Ftsnation definitely!", "Wed Apr 17 22:20:20 ": "Hey Zee party boy we expect hear from you back", "Mon Jan 21 22:11:59 ": "Politics Makes Justin Bieber Uncomfortable: As previously reported, Justin Bieber’s Mom, Pattie Mallete, has bee... http://t.co/bNtGS53u", "Sun Apr 21 02:49:20 ": "RT @DJSHEDEVIL: What a positive, productive, fun day I had with @sSaRpOnG the only problem is, catch up takes about 15 hours! Haha! #Millio…", "Sun Apr 21 01:33:01 ": "@Ftsnation dam I thank u. Whatever me and @Fabrizio have in the works want to share in our sucess with u @ChelleGotti  @billiemitchel  etc..", "Tue Jan 22 14:21:33 ": "Why Shia LaBeouf Dropped Acid For Sundance Flick 'Charlie Countryman': \n'You don't show up completely tr... http://t.co/If37ldNs", "Tue Jan 22 16:03:28 ": "Lagerfeld supports gay marriage in lesbian couture: PARIS (AP) — Karl Lagerfeld, Chanel's veteran couturier, has... http://t.co/9g1N917F", "Tue Apr 16 23:39:29 ": "RT @Fabrizio: hey @BofA_Help im find my Business account is fine... who have issues is my brother @atmybest197", "Fri Apr 19 11:35:59 ": "@DJSHEDEVIL good morning my love. Your always on your grind. Your artist are lucky to have u", "Sun Apr 21 00:31:18 ": "@Ftsnation doing big things with live nation http://t.co/LNXWlc1SP4\n\nDino\nFTS NATION", "Tue Jan 22 12:26:46 ": "Inside The 'Jersey Shore' Connection To Joseph Gordon-Levitt's 'Don Jon': \nAt Sundance, the actor admits... http://t.co/fZqFujsV", "Mon Jan 21 21:47:50 ": "Jessica Chastain takes top box office: Jessica Chastain is having a moment.\n    \n http://t.co/QLgbugtM", "Mon Jan 21 19:41:52 ": "Rob Lowe wants to be president someday (on film): It's been a busy month for Rob Lowe.\n    \n http://t.co/R61al5Qg", "Tue Apr 16 23:25:44 ": "\"@Fabrizio: @M2thakSODMG you check @EShowsTV\" whats good?", "Tue Jan 22 04:22:16 ": "Michelle Obama again picks designer Wu for inaugural gown: WASHINGTON (Reuters) - It was one of the biggest ques... http://t.co/dxfuC0T9", "Tue Jan 22 09:40:08 ": "Report: Schwarzenegger says he still loves Shriver: BERLIN (AP) — Arnold Schwarzenegger is quoted in an intervie... http://t.co/KFipmPxB", "Mon Jan 21 20:06:35 ": "Inauguration offers brief pause from TV bickering: NEW YORK (AP) — The second inauguration of President Barack O... http://t.co/DFwHycGV", "Tue Jan 22 07:40:12 ": "Ke$ha: The all-American girl at charity concert: WASHINGTON (AP) — Ke$ha is an all-American girl — or at least s... http://t.co/99WhVGqh", "Tue Jan 22 10:03:10 ": "Report: Schwarzenegger says he still loves Shriver: BERLIN (AP) — Arnold Schwarzenegger is quoted in an intervie... http://t.co/DujSt1AO", "Tue Apr 16 16:24:02 ": "@Fabrizio hay there is repercussion when people do wrong.  Time tells all. Thank god we blessed with real money to handle minor issues lol", "Tue Jan 22 15:45:00 ": "'Divergent' Casting: 'No Feminine Actors' For Four: \nStar Shailene Woodley doesn't want a 'pretend' man ... http://t.co/B5AS9juz", "Mon Jan 21 23:02:55 ": "The inaugural do-over: chomping gum, savoring view: WASHINGTON (AP) — Let's hear it for the do-over. http://t.co/8E2tjfN7", "Mon Jan 21 21:53:58 ": "UK's Prince Harry returns from Afghanistan: LONDON (AP) — Capt. Wales is coming home to be Prince Harry once again. http://t.co/uoQcJI9a", "Mon Jan 21 23:37:01 ": "'Restrepo' director has sorrowful Sundance return: PARK CITY, Utah (AP) — Sebastian Junger wishes his latest Sun... http://t.co/rYjJMe69", "Wed Apr 17 00:53:54 ": "RT @Fabrizio: Dont worry i already get in touch with U.S. Securities and Exchange Commission @atmybest197 @BofA_Help", "Thu Apr 18 12:45:14 ": "Morning twitter family.  Remember wasted time is something u cant ever recover so lets make it a productive day.S/o @Fabrizio @EShowsTV", "Tue Jan 22 15:07:55 ": "One Direction Tourmate Camryn Know She Has To Win Fans Over: \n'Oh man, I'm a girl on their favorite boy ... http://t.co/2yP2pegm", "Tue Jan 22 16:49:38 ": "Lindsay Lohan Turns Down Dancing With The Stars (Report): Lindsay Lohan strutting it across the \"Dancing with Th... http://t.co/or7Ut5Xc", "Wed Apr 17 19:02:12 ": "RT @Fabrizio: Nice call with @Cassandrapedia from @GMPent all our Team and also the owners of @EshowsTV are happy to have you Guys on Board", "Thu Apr 18 17:04:37 ": "RT @Fabrizio: @AMoney_69 Give me a phone number where i can reach you! I will love to have a short conversation with you over the phone  ...", "Sun Apr 21 00:57:24 ": "RT @Ftsnation: @Fabrizio thank you and I hope to do things with u also.", "Sun Apr 21 02:49:26 ": "RT @Fabrizio: definitely this is nice Getting Good assistance from @pheed loving it, thanks @HausofPheed", "Sat Apr 20 02:11:27 ": "@streets2starz s/o to Dino Gotti. Appreciate the opportunity", "Tue Jan 22 12:58:40 ": "Police sent to Chris Brown home in latest hoax: LOS ANGELES (AP) — Police have responded to Chris Brown's home a... http://t.co/pmAeJfHG", "Tue Jan 22 00:47:10 ": "Man cited for riding camel during Sundance fest: PARK CITY, Utah (AP) — Police cited a man for riding a camel an... http://t.co/woO7wH5c", "Mon Jan 21 20:08:36 ": "Sundance 2013 Reviews: James Franco's Porn-Soaked 'Interior.' And More: \nOur friends at Film.... http://t.co/1Q8C86Q2", "Tue Jan 22 02:50:33 ": "Martin Luther King Jr.'s Legacy Pushes Sandy Volunteers To Rebuild: \nDo-gooders dedicated Inauguration D... http://t.co/WInUbaKQ", "Sun Apr 21 01:30:52 ": "RT @Ftsnation: @atmybest197  my man is at his best, pushing out important things for us over Twitter.  Better recognize as my man its worki…", "Mon Apr 22 18:31:24 ": "RT @Fabrizio: Great Call conference with @rtranchina hope me and @EShowsTV can be the vehicle he is looking for... to drive his business to…", "Mon Jan 21 20:47:01 ": "Obama's Inauguration, Instagram-ed: Beyonce, Katy Perry Show All: \nInaugural guests like 2 Chainz and Al... http://t.co/SlEC32Tx", "Tue Jan 22 14:04:31 ": "Women, docs top Sundance: Zoraida Sambolin reports from Park City, Utah, with a look at the hot movies at this y... http://t.co/7O8Urm08", "Sat Apr 20 00:48:56 ": "@Fabrizio @djwats01 much love. @EShowsTV  is here to help in anyway we can", "Mon Jan 21 23:17:39 ": "The inaugural do-over: chomping gum, savoring view: WASHINGTON (AP) — Let's hear it for the do-over. http://t.co/bVbtg6qa", "Mon Jan 21 20:21:32 ": "A day pulsing with history follows very old script: WASHINGTON (AP) — It was altogether a more intimate affair t... http://t.co/qbQbxyB1", "Tue Jan 22 10:39:09 ": "London Olympic Park to host 2013 rock concerts: LONDON (AP) — London's Olympic Park will partly reopen to the pu... http://t.co/M6aL0dwM", "Sat Apr 20 05:19:48 ": "RT @Fabrizio: Much respect men @souljaboy you are huge and im learning from you with all my respect from one who is growing in the world u …", "Tue Jan 22 13:52:08 ": "McConaughey on Armstrong: Matthew McConaughey talks about his friend Lance Armstrong's doping confession. HLN's ... http://t.co/C2Ios4uf", "Mon Apr 22 11:42:01 ": "Lets have a productive day @billiemitchel @Ftsnation @ChelleGotti @Ftsnation", "Sat Apr 20 22:14:47 ": "@Fabrizio @rtranchina @EshowsTV I would love to be of assistance", "Mon Jan 21 23:51:40 ": "'Restrepo' director has sorrowful Sundance return: PARK CITY, Utah (AP) — Sebastian Junger wishes his latest Sun... http://t.co/lhmrMu9Q", "Sat Apr 20 22:17:19 ": "@Ftsnation @Fabrizio god put us all together for a good reason. I truly belive that.", "Sun Apr 21 01:30:25 ": "@Ftsnation awesome!  We would love to be of help in anyway u need", "Tue Apr 16 23:40:16 ": "RT @atmybest197: @Fabrizio @BofA_Help I dont know. They have nothing. They want me to give up and lay down and pin something on me. 4 yr ...", "Tue Jan 22 00:12:00 ": "Billboard begins magazine, website revamp: NEW YORK (AP) — Billboard is undergoing a revamp with the help of its... http://t.co/lLbCmqyp", "Tue Jan 22 01:03:55 ": "Inauguration 2013, Instagrammed: Barack, Beyonce And ... Dikembe?: \nMTV News has been all over Inaugurat... http://t.co/tCaYqWmm", "Mon Jan 21 22:34:41 ": "Thom Browne, J. Crew among Michelle Obama's inaugural fashion picks: WASHINGTON (Reuters) - It was one of the bi... http://t.co/s8H0CZW3", "Tue Jan 22 16:41:47 ": "Lagerfeld backs French gay marriage with Chanel catwalk finale: PARIS (Reuters) - Fashion designer Karl Lagerfel... http://t.co/dLdm2iWm", "Tue Jan 22 09:28:20 ": "Smaller crowd, but still excitement this time: WASHINGTON (AP) — Schoolteacher Patricia Cooper gazed out at the ... http://t.co/67VMwoJF", "Mon Jan 21 19:32:10 ": "'Mama' And Jessica Chastain Rule Weekend Box Office: \nBoth Mark Wahlberg and Arnold Schwarzenegger see t... http://t.co/H49RZfq1", "Sun Apr 21 02:41:29 ": "RT @Fabrizio: @pheed let see what you can do for me https://t.co/388zyrLdn5", "Mon Jan 21 19:32:45 ": "Stars rub shoulders with politicos at inauguration: WASHINGTON (AP) — Beyonce drew a loud cheer from the audienc... http://t.co/tf94Kc4Q", "Tue Jan 22 14:44:41 ": "'Girl Rising' spotlights need for girls' education: PARK CITY, Utah (AP) — Just because a film isn't finished do... http://t.co/UcBapVpu", "Thu Apr 18 03:35:41 ": "Many awesome things in the works. Little kids can try but wont stop our plans. Lets get it !", "Tue Jan 22 02:36:26 ": "Dish Closing 300 More Blockbuster Stores: NEW YORK (http://t.co/ag4Aajmv) - Dish Network is closing another 300 B... http://t.co/iDm1aTxP", "Mon Jan 21 22:02:06 ": "Inauguration 2013: On The Ground, With Beyonce And Michelle Obama For All: \nAs Barack Obama was sworn in... http://t.co/wP2Bwaih", "Tue Jan 22 13:34:05 ": "Prince Harry's wartime role draws reprisal fears: LONDON (AP) — Prince Harry's assertion that he has killed Tali... http://t.co/TCEQ0w9w", "Wed Apr 17 00:36:21 ": "@M2thakSODMG @IamRicoLaw thanks for the RT"}