{"Mon Apr 15 10:43:30 ": "The 12 year old girl I gave my @JustinBieber ticket to started crying when she got it. Sooo cute! Hope she get's the best concert ever!", "Thu Apr 18 11:34:05 ": "New icon! What do you guys think about it? :)", "Sun Apr 21 19:35:48 ": "Okay bedtime.. Goodnight friends!", "Wed Apr 17 17:42:19 ": "I have the coolest followers! No really!", "Sat Apr 20 22:09:59 ": "What's up? http://t.co/Z634adv4ua", "Wed Apr 17 10:48:00 ": "Working on a new blog design, what colors do you guys like?", "Mon Apr 15 20:00:29 ": "#PrayingForBoston ...", "Fri Apr 19 08:08:05 ": "Got my VIP tickets for the @Selenagomez concert! Yay!", "Tue Apr 16 16:59:12 ": "On my way home after a long but really blessed day! #AmazingLife", "Wed Apr 17 11:01:12 ": "Now @ShaneDawson has made 4 amazing singles, when do we get the album? #PrettyPlease #GoodMusic", "Sat Apr 20 17:02:18 ": "Love yourself today, cause baby you were born this way ❤", "Mon Apr 15 11:55:28 ": "Got these new beautiful beats made by 50cent! Review on the blog later this week! http://t.co/FdmyPlk26E", "Fri Apr 19 08:40:08 ": "RT @littlelinek: I CAN'T BELIEVE IT!!!! I HAVE M&amp;G TO SELENA GOMEZ CONCERT IN DENMARK!!!!!! :D :D", "Mon Apr 15 12:05:06 ": "RT @littlelinek: I can't believe it!!! @selenagomez comes to Denmark my sweet friend @CamillaStormont has made my day so much better, th ...", "Thu Apr 18 09:59:24 ": "Because it's fucking true! lol! http://t.co/fdu9itaL4c", "Mon Apr 15 11:57:51 ": "@NoniZipZap love your twitter name! Christian Grey as king please! #peace @E_L_James", "Sun Apr 14 10:18:15 ": "Don't lose hope... It's just a had day, nota bad life ❤", "Wed Apr 17 18:47:38 ": "Take a moment to be thankful.", "Sun Apr 21 18:32:50 ": "So so sooo tired...", "Fri Apr 19 21:45:08 ": "I love my life ❤... Gonna enjoy it while\nI can!", "Wed Apr 17 09:54:13 ": "RT @amypaffrath: This is my dad.  Before and after his diagnosis of #als #LouGehrigs The disease took him to heaven on… http://t.co/bgAB ...", "Sat Apr 13 18:52:27 ": "@FredoMyFlow aw thanks! That's so sweet of you!", "Mon Apr 15 21:11:37 ": "\"If you wanna make the world a better place, take a look at yourself and then make the change\"... http://t.co/E6IShsl3eu", "Wed Apr 24 10:34:57 ": "\"Just because I cannot see it, doesn’t mean I can’t believe it.\" - Nightmare Before Christmas", "Sun Apr 14 18:09:57 ": "Should get some dinner, but don't know what to make.. Hmm. What's your favorite dish?", "Sun Apr 21 05:38:04 ": "RT @ddlovato: Respect your mind, body, and soul. You are WORTH it!!!! 😊 #RiseAbove", "Sun Apr 14 22:31:05 ": "Do you guys have instagram? Then go follow me! @ CamillaStormont &lt;- I'll follow back! :)", "Mon Apr 22 20:27:02 ": "Me when people talk shit about me... http://t.co/qe5mT5wh9s", "Thu Apr 18 13:22:40 ": "Working on a new blog design! Not that much into the one I have now... Can't wait to share it with you guys!", "Tue Apr 16 09:55:10 ": "Love listening to the Moulin Rouge soundtrack... Some of the best songs ever made together in one musical! Love it!", "Mon Apr 22 16:42:11 ": "To be the best, you have to beat the best!", "Sun Apr 14 15:09:18 ": "On my way home, feeling better today but I'm still a bit sick :/. Damn...", "Sat Apr 13 16:06:06 ": "I'm on follow limit, damn! Sorry guys, can't follow back anymore of you right now...", "Wed Apr 17 21:19:56 ": "Goodnight guys ❤", "Thu Apr 18 09:25:27 ": "RT @Pontifex: Please join me in praying for the victims of the explosion in Texas and their families.", "Thu Apr 18 10:36:02 ": "Really hope I'll be able to get VIP tickets for @SelenaGomez' Danish concert! She is such a great entertainer, don't you think?", "Wed Apr 17 09:49:58 ": "Goodmorning friends! How are you all feeling?", "Thu Apr 18 09:57:51 ": "I may not be perfect, but at least I know who I am.", "Sat Apr 20 20:13:48 ": "In need of new songs for my ipod! Any recommendations?", "Thu Apr 18 12:56:34 ": "Lipstick 💩 http://t.co/NOAXHboP16", "Sat Apr 13 19:40:58 ": "Feeling so blessed ❤", "Sat Apr 20 12:08:32 ": "Dream until your dreams come true ❤", "Sun Apr 21 21:06:06 ": "Beauty And The Beast is really the sweetest Disney movie ever made!", "Mon Apr 15 18:54:31 ": "I'm sorry I'm a fuck-up, I can't do nothing right... @ShaneDawson.. http://t.co/gsrMphnBt6", "Mon Apr 15 19:41:24 ": "Wow, my DM's are all spam these days! Anybody wanna change that? lol #PrayingForDMs", "Sun Apr 14 15:44:01 ": "Did you guys know that you're AWESOME?! #MuchLove", "Mon Apr 15 10:13:46 ": "Don't leave your kid alone with a \"dangerous dog\"... You never know what's gonna happen! http://t.co/7HI1qvOGAp", "Sun Apr 21 07:30:38 ": "@iBieberChamp ❤", "Wed Apr 17 11:36:31 ": "Arthur is a music lover you know... http://t.co/1ycARe9r1p", "Tue Apr 23 18:47:03 ": "Oh. My... God...", "Sat Apr 13 21:10:30 ": "You can't go back and make a whole new beginning, but you can start right now and make a whole new ending...", "Fri Apr 19 20:41:03 ": "RT @OfficialCANCER: Be yourself", "Sun Apr 14 09:22:10 ": "Wow @PSY's new song got more than 13 million views in just 24 hours! http://t.co/mttiZkoxo9", "Tue Apr 16 16:52:55 ": "RT @OfficialCANCER: Dear God, today I woke up, I am alive, I am healthy. Can't ask for more. Thank you.", "Wed Apr 17 18:11:41 ": "Still working on @DrewSeeley's birthday present with Nadia! It might be a bit late, but it takes time, lol!! #LoveYourIdols #SpreadLove", "Wed Apr 17 12:54:01 ": "I'm not gonna spend my life being a color ❤ #BlackOrWhite #MJ", "Wed Apr 17 18:45:47 ": "@drewseeley Well we're doing our very best, Mr. Seeley ;)", "Tue Apr 16 14:05:08 ": "You gotta get up and try..", "Sun Apr 14 08:41:49 ": "Good morning guys! Damn I feel lazy today! How are you all doing?", "Wed Apr 17 17:32:34 ": "@SelGisMyWorld Aw thanks,sweety!", "Thu Apr 18 08:55:28 ": "This day started of really bad..", "Mon Apr 15 11:57:00 ": "@avon_dreams @justinbieber thanks! Making people happy is an amazing feeling! #blessed", "Sun Apr 14 09:15:46 ": "If you like quotes and stand up against bullying, I will suggest you follow @BullyingStory ... It's a lovely account!", "Wed Apr 17 10:12:07 ": "Can't imagine what life would be like without music...", "Tue Apr 16 08:39:44 ": "What a morning! Really don't feel like getting out of bed...", "Fri Apr 19 19:32:19 ": "Spending my weekend at a friends house! What about you guys? What are you gonna do this weekend?", "Sun Apr 21 05:01:21 ": "#dreamer http://t.co/8D3HISlBG8", "Mon Apr 15 10:30:00 ": "Wauw @Selenagomez giving a concert in Copenhagen on August 30th.... I so gotta get tickets! :)", "Thu Apr 18 11:39:36 ": "RT @BullyingStory: Life is better when you’re laughing.", "Sat Apr 20 19:34:41 ": "Can't even count how many times I've watched \"The 40 Year Old Virgin\".. That movie just never gets old or boring! Steve Carell FTW!", "Sat Apr 13 22:03:37 ": "Should be sleeping, but can't... Know that feeling? #StoryOfMyLife", "Tue Apr 16 20:14:43 ": "Most beautiful instrumental ever... http://t.co/UWApXS5S0F", "Fri Apr 19 20:58:18 ": "Over-thinking often creates a problem that wasn't even there in the first place.", "Tue Apr 23 15:03:11 ": "These days are so long... Working hard! But I really love it!", "Sat Apr 20 12:05:39 ": "Wow girls looking forward to the Danish @justinbieber concert is all over my timeline! #dedication", "Wed Apr 17 10:54:25 ": "I choose to be happy! #MuchLove http://t.co/xYM3kImRIb", "Sat Apr 20 21:52:13 ": "Goodnight guys❤", "Sat Apr 20 12:07:02 ": "@SelinaDenmark you look amazing sweety! Have a great concert! :)", "Tue Apr 23 21:27:18 ": "New blog design! Tell me what you think! http://t.co/vuDw7hH9J9", "Fri Apr 19 19:31:43 ": "@Misz_Special aw thanks!", "Tue Apr 16 08:39:18 ": "Getting high doesn't make you cool... #justsaying", "Sat Apr 13 18:25:42 ": "Nomatter what, you're beautiful - everyday ❤ http://t.co/zUyPHZSrLi", "Mon Apr 15 21:44:12 ": "Tonight it's 101 years ago that Titanic sank. It's still tragic  still sad... May they all rest in peace.", "Sun Apr 21 06:45:05 ": "Really can't believe that some people actually judge because of skin color! It's like judging people by their shoes, hair or eyes! #STUPID", "Fri Apr 19 07:37:30 ": "Goodmorning beautiful people!", "Wed Apr 17 10:44:41 ": "Photo shoot in half'n hour, and I'm still not dressed... Just kill me now!", "Sat Apr 20 18:23:45 ": "RT @BullyingStory: Be happy in front of people who hate you, it'll kills them..", "Mon Apr 15 19:45:11 ": "New blog entry: I'm A Fuck Up!\nhttp://t.co/GIJEJW5wpv", "Sun Apr 21 05:05:30 ": "6 hours of sleep and I'm off to work! Love it! #DreamBig", "Tue Apr 16 22:53:46 ": "Soo over tired! I just feel like jumping around!", "Sun Apr 14 16:53:15 ": "\"Being in love is like having a birthday party in your stomach\" - Lauren, 7 years old... Aww! #GottaLoveKids", "Wed Apr 24 10:23:44 ": "I just love my new blog design!! Like really! http://t.co/vuDw7hH9J9", "Sun Apr 14 22:33:08 ": "Sometimes the wrong choices bring us to the right places...", "Wed Apr 17 20:12:25 ": "Check out my new awesome @SMSAudio headphones! http://t.co/FzStws6n7W", "Mon Apr 22 16:35:17 ": "I wish I could just lay in your arms forever...", "Mon Apr 22 18:55:54 ": "There's a dream in my soul... A Fire that's deep inside me..", "Mon Apr 15 18:30:57 ": "Stop wasting your time worrying, it ruins your happiness.", "Sat Apr 20 16:33:13 ": "So tired! Really just need to go back to bed :)", "Sat Apr 20 12:10:42 ": "Cause when you're done with this world, you know the rest is up to you ❤ #GreatLyrics", "Sun Apr 14 16:02:28 ": "RT @BullyingStory: Tomorrow is a new chance..."}