{"Wed Apr 17 21:02:39 ": "@BofA_Help thank you today for all your help. I finally got headway with this problem ive been dealing with for more than 5yrs. Thanks again", "Tue Jan 22 08:04:33 ": "Pusha T Gets At Consequence For His Breakfast Club Rant! (Blog): \n\nhttp://t.co/mZbmFDut #RapBreak\n   http://t.co/hUcrWA3M", "Thu Apr 18 23:56:35 ": "@PrestonMillion long time no speak . Hope all is well with u brother", "Tue Apr 16 21:02:57 ": "@Fabrizio so far im not getting any help", "Wed Apr 17 13:34:51 ": "@ChaseSupport I need a chase bank with a notary so I can get a letter to give to @BofA_Help for a serious situation needing to be fixed", "Mon Apr 22 16:10:12 ": "Good afternoon @billiemitchel  hope all is well", "Tue Apr 16 19:23:17 ": "@ChaseSupport I tried sending a dm but cant. Can you please send me a dm ?", "Thu Apr 18 23:50:40 ": "@davepeck myself and @EShowsTV would love to see if we can do some business together", "Tue Jan 22 00:24:39 ": "Plan B calls on Britain's youngsters to use the power of music: Award-winning rapper Plan B today joined the hun... http://t.co/XBH3IZ8R", "Tue Jan 22 08:41:35 ": "Smack Of The Week: Off The Cafeteria Table!: \n\nSubmitted by Jonesy72\n   http://t.co/US4s499o", "Sun Apr 21 14:22:45 ": "@billiemitchel im so sorry YES FOR US!", "Mon Apr 22 19:17:51 ": "@billiemitchel oh ohhhhhh sorry to hear that. Feel better soon", "Tue Jan 22 01:01:29 ": "Wilko Johnson sells out Koko in an hour and adds new date: Tickets for the newly announced London Koko concert o... http://t.co/pl3IeVEj", "Tue Apr 16 20:43:44 ": "@ChaseSupport I sent another dm ty", "Fri Apr 19 14:23:18 ": "RT @EShowsTV: In life what u put out is what u get back. Lying about who u are and your $ and power eventually puts u in a place where u ha…", "Sat Apr 20 01:08:11 ": "@ChelleGotti @Fabrizio of course we will. Lets set something up immediately please", "Tue Jan 22 08:40:34 ": "Taylor Swift \u0091jets to UK to see Styles\u0092: Taylor Swift has traveled to the UK on her private jet reportedly so sh... http://t.co/igqtOg7E", "Fri Apr 19 20:02:58 ": "3/3 @BofA_Help which is a credit acct showing me u are only willing to fix your issue affecting me because some1 did something illegal", "Wed Apr 17 15:27:21 ": "@BofA_Help I sent you my number thank you", "Tue Apr 16 16:02:38 ": "@Fabrizio whats good bro aint it good to be back ????? These kids cant stop us @EShowsTV", "Wed Apr 17 12:09:53 ": "@Fabrizio @BofA_Help continually sends me to different depts and each dept sends me to another.", "Tue Jan 22 01:42:37 ": "SMH: Reporter Mistakes Bill Russell For Morgan Freeman At The President Inauguration: \n\nPosted By Persist\nSh... http://t.co/SPWXURvI", "Tue Apr 16 18:00:23 ": "@DJSHEDEVIL my friend I miss u so", "Wed Apr 17 15:36:59 ": "@ChaseSupport is anybody going to help me with this serious matter im having with @BofA_Help ?", "Tue Apr 16 23:16:29 ": "@BofA_Help @Fabrizio they have been harassing for years about funds I have no knowledge of. I heard that they been doing this 4 years", "Tue Apr 16 23:22:28 ": "@Fabrizio @BofA_Help I dont know. They have nothing. They want me to give up and lay down and pin something on me. 4 yrs of harassment", "Tue Jan 22 00:38:55 ": "[News] Tres Records Enlists Blu, Houses For \"Nueve\" Beat Tape: The Los Angeles-based label is releasing a new mi... http://t.co/hIx1kY55", "Mon Apr 22 11:40:52 ": "@Fabrizio it will be an awesome day good morning @EShowsTV @ChelleGotti @Ftsnation @billiemitchel", "Sat Apr 20 16:05:03 ": "RT @ChelleGotti: Good morning twitter buddie let s make dreams come true FTS Nation @atmybest197 @billiemitchel@Fabrizio @EShowsT @JamalVaz…", "Wed Apr 17 18:13:24 ": "@ChaseSupport im following you now. Thank u", "Fri Apr 19 20:00:40 ": "2/3 @BofA_Help  and your people from IDENTIFICATION THEFT dept are willing to investigate 3 of these accounts but qre not willing the 4th", "Sun Apr 21 14:20:23 ": "@billiemitchel awesome I pray its a productive meeting for u", "Sun Apr 21 14:20:51 ": "@ChelleGotti @BackwardsLA @billiemitchel @EShowsTV @Fabrizio @JamalVazquezBSF @Jayecane good morning all", "Sat Apr 20 16:06:17 ": "Twitter family hello.  Lets get this money and good contacts", "Thu Apr 18 23:51:46 ": "@ZillaKingOfPorn lets work together seriously check me @EShowsTV  as well", "Tue Jan 22 02:52:27 ": "Dumbest Tweets Of 2012 Part 2!: \n\nby @alonzolerone\n   http://t.co/9zv8q2zH", "Tue Jan 22 06:53:31 ": "Ouch: J.R. Smith Takes Shots At Kris Humphries Reminding Him That Kanyes Been Tearin It Down! (Blog): \n\nGoss... http://t.co/djCcLonv", "Tue Apr 16 23:17:44 ": "@Fabrizio @BofA_Help has reached out to other banks department illegally to get personal info. I WANT TO BE LEFT ALONE. ITS BEEN 4 YRS", "Sun Apr 21 19:01:19 ": "@ChelleGotti @Fabrizio awesome talk with @Ftsnation thanks Dino for the opportunity.  U wont regret it", "Tue Jan 22 02:13:58 ": "Stereophonics  official 'Indian Summer' video: Purveyors of classic British songwriting, Stereophonics, cement t... http://t.co/zaLgvGUq", "Fri Apr 19 21:12:31 ": "@Ftsnation thank u so much u guys are awesome. Lets get things together asap", "Wed Apr 17 00:02:55 ": "@BofA_Help I don't trust your organization. Your attorney did sneaky underhanded things.Im warning the public to becareful", "Wed Apr 17 14:59:42 ": "@ChaseSupport tells me to go to a brach to get a much needed letter to give to the courts &amp; I walked out empty handed", "Fri Apr 19 21:23:51 ": "@billiemitchel our meeting was awwsome with my partner @Fabrizio and @EShowsTV", "Tue Jan 22 04:37:07 ": "Pulled Apart By Horses &amp; Blood Red Shoes release split covers 7'': Blood Red Shoes and Pulled Apart By Horses ha... http://t.co/whHJMqPB", "Tue Jan 22 07:29:02 ": "Droop-E Ft. J-Stalin &amp; Nite Jewel - N' The Traffic [Sick Wid It Submitted]: \n\nDirector: Joslyn Rose Lyons\n... http://t.co/vRbmWITG", "Fri Apr 19 19:52:16 ": "1/3 @BofA_Help what is the difference if u open a checking,  savings , or credit account and all the accounts (4) are opened fraudulently...", "Sun Apr 21 00:32:47 ": "@Ftsnation partnership with live nation http://t.co/ejlbHsArDr proud of my man Dino Gotti", "Tue Jan 22 16:11:54 ": "[News] ?uestlove Says D'Angelo's New Album Is \"99 Percent\" Done: ?uestlove says that he and D'Angelo are in the ... http://t.co/vtWLKzVp", "Tue Jan 22 15:23:04 ": "Ke$ha looking for love: Ke$ha has revealed she wants to be in a relationship. http://t.co/8OZc7lmI", "Sun Apr 21 14:22:14 ": "SLEEP IS SO OVERATED ESPECIALLY WHEN THERES ALWAYS SO MUCH TO DO. while your resting my team is awake. When your awake we just turn it up !!", "Thu Apr 18 19:52:36 ": "@Fabrizio @Standish913 @IamRonnyLehmann @YoungJody lets all get together and work with my company @EShowsTV", "Tue Jan 22 06:16:09 ": "Dog Is Dead reshedule dates and announce Two Door Cinema Club support: Dog Is Dead are very pleased to announce ... http://t.co/x0Jmyy2B", "Tue Jan 22 16:01:05 ": "Jennifer Lopez: Statham is the best: Jennifer Lopez has heralded Jason Statham as one of the best leading male a... http://t.co/PuK7jjUy", "Tue Jan 22 11:06:05 ": "Katy Perry turns party \u0091judge\u0092: Katy Perry will \u0093judge\u0094 all other parties now she has experienced a ball at the ... http://t.co/oa87tTRg", "Tue Apr 16 17:58:56 ": "@chasesupport I need serious help.  Unauthorized wire transfers and accounts have been open in my name and need a letter to fix this", "Wed Apr 17 15:18:04 ": "@ChaseSupport I was informed by your fraud dept its in your policy that if there is a claim its suppose to be made within 2yrs. Its 5yrs now", "Tue Apr 16 23:50:25 ": "@Fabrizio @BofA_Help please man this has gone on long enough. How could @BofA_Help ask me to prove my innocence? I owe u guys nothing", "Tue Jan 22 01:38:02 ": "[News] Nickelus F \"Vices\" Mixtape Download &amp; Artwork: Nickelus F enlists Drake, Jake One and others for his late... http://t.co/jIzwxt9L", "Tue Jan 22 16:41:15 ": "[News] Kanye West To Headline New York City's Governors Ball: Kanye West joins a lineup that includes Azealia Ba... http://t.co/UERwD0XT", "Tue Jan 22 15:57:07 ": "18-Year-Old Model Face Slashed By 2 Girls Over Date Inside Kentucky Mall!: \n\n\"A model had her face slashed w... http://t.co/8nKA8EIL", "Sat Apr 20 21:40:27 ": "@billiemitchel @ChelleGotti thanks 4 the compliment. We need to get things going asap", "Tue Jan 22 16:31:58 ": "Plies All Bronze 68 Pontiac Le Mans!: \n\nvia http://t.co/83MwyJSh\n   http://t.co/gR1oAcW5", "Wed Apr 17 18:10:22 ": "@BofA_Help  thank u for calling me.  Can I please have the legal depts phone number?", "Tue Jan 22 14:03:41 ": "Olympic Park to host Wireless and Hard Rock Calling: Live Nation Entertainment has secured exclusive rights to h... http://t.co/aBDbi5bj", "Wed Apr 17 00:45:28 ": "@BofA_Help  i intend to make more official complaints with the help from @Fabrizio . This has gone on way to long", "Sun Apr 21 01:34:21 ": "RT @Ftsnation: @atmybest197 \n\nhttp://t.co/s7TWC7Lw4k", "Tue Jan 22 05:29:39 ": "Air Fizzo - Amsterdam (Lil Fizz Formally From B2K): \n\nOfficial Video From AirFizzo \"Amsterdam\" off the \"GAME1\" \n   http://t.co/8CjW2Ttd", "Wed Apr 17 15:03:10 ": "@ChaseSupport  http://t.co/MqxL6yE1PY", "Tue Jan 22 03:08:36 ": "[News] Dr. Dre Picks Baltimore Ravens To Win The Super Bowl: Dr. Dre chooses the Baltimore Ravens over his home ... http://t.co/ARNioNBD", "Wed Apr 17 12:08:49 ": "@Fabrizio @BofA_Help wants me to do their work for them. They claim im guilty and want me to prove my innocence.  Does that seem right ?", "Tue Apr 16 20:06:34 ": "@ChaseSupport I sent the dm as requested but im still not getting a response. Please help", "Wed Apr 17 13:13:28 ": "@BofA_Help I sent you my name", "Wed Apr 17 00:00:49 ": "@BofA_Help will I get a call now ?", "Tue Jan 22 09:17:19 ": "Guns N' Roses release 'Paradise City' from upcoming 3D film: Guns N' Roses are the latest group to try out the n... http://t.co/ntwCKWjJ", "Wed Apr 17 13:26:06 ": "@BofA_Help can someone contact me to help me witb this serious problem ? @Fabrizio  I hope they can help", "Wed Apr 17 12:13:51 ": "@Fabrizio @BofA_Help all I want is real help not the run around. I believe bank of America will do the right thing but ive waitwd 4 yrs", "Tue Jan 22 11:42:49 ": "Andrea Bocelli attends world premiere of 'Love In Portofino': Andrea Bocelli's new film ' Love In Portofino' had... http://t.co/A2fqZnW5", "Sat Apr 20 00:04:26 ": "@ChelleGotti thank u so much. Hope we get together very soon and pray 4 a wonderful business relationship with u guys", "Fri Apr 19 14:25:09 ": "Much love to @support for doing the right thing always", "Tue Apr 16 23:51:05 ": "@Fabrizio @BofA_Help they have a high powerwd attorney threatening me", "Sun Apr 21 19:56:32 ": "@ChelleGotti @EShowsTV @Fabrizio I like that. No doubt", "Tue Apr 16 18:59:58 ": "@DJSHEDEVIL nothing I couldnt handle. Little kids thinking they can stop my flow but I BACKKKKKKK with fire. How u beem mama ?", "Wed Apr 17 12:07:08 ": "@Fabrizio @BofA_Help will not help me.For 4 years they have accused me of owing $.They dont care who they attach it to so long they get paid", "Fri Apr 19 14:22:41 ": "RT @Fabrizio: Im not biggest Im just a son of God... and i love to do everything right... if in the past i make any mistake... I already le…", "Tue Jan 22 08:40:39 ": "Toy announce new single: TOY have announced details of the release of a new single.  My Heart Skips A Beat will ... http://t.co/sJIa8OQ2", "Tue Jan 22 02:08:25 ": "[Singles] A$AP Rocky - \"Who's Gonna Save My Soul\": Before spitting a freestyle, A$AP Rocky gives Gnarls Barkley'... http://t.co/rtkUNmkj", "Wed Apr 17 15:35:56 ": "@BofA_Help I hope someone can really help me resolve this serious matter. I have faith u guys will do the right thing", "Tue Jan 22 01:36:48 ": "Jonas brothers mean to fans?: Joe and Nick Jonas were reportedly scathingly mean to fans that approached them wh... http://t.co/rtOBJnA5", "Wed Apr 17 14:19:42 ": "@ChaseSupport I need a letter from your company to give to @BofA_Help. I need help so they can leave me alone", "Tue Jan 22 06:17:53 ": "Wiz Khalifa \"DayToday Vlog\" 2050 Tour Part 5: \n\n@RealWizKhalifa\nPosted by @Worldstarvids\n   http://t.co/D06nlHcF", "Sun Apr 21 01:08:01 ": "RT @Fabrizio: Mr Gotti @Ftsnation anything you need will be here to help, im working to improve you Social Media presence expecting get som…", "Tue Jan 22 05:09:31 ": "[News] Casey Veggies \"Life Changes\" Mixtape Tracklist &amp; Cover Art: UPDATE #2: Casey Veggies preps the release of... http://t.co/Hcbec3hV", "Tue Jan 22 14:09:18 ": "[News] Rap Release Dates: Lupe Fiasco, Swollen Members, DJ Khaled, Planet Asia and Gensu Dean: Lupe Fiasco cans ... http://t.co/xy2W4M5n", "Tue Jan 22 03:25:37 ": "Charlie Brown to release 'On My Way': Charlie Brown is kicking the New Year off with the release of his new sing... http://t.co/GNrc4OOh", "Tue Jan 22 15:20:38 ": "Binky Bandz Feat. OGrand &amp; Ez Scarz - DOPEMAN [UMC Submitted]: \n\n@BinkyBandz new mixtape Stamper Of The Year... http://t.co/PfFpp4pw", "Sat Apr 20 02:14:44 ": "RT @Fabrizio: This woman @billiemitchel is not jus huge and smart she is beautiful as well a good convention for any kind of business #SODM…", "Sun Apr 21 14:25:26 ": "@billiemitchel when would u like to talk ?", "Wed Apr 17 15:16:29 ": "@ChaseSupport an unauthorized transfer was made 5 yrs ago. I need an official letter stating u dont investigate claims past 2yrs", "Fri Apr 19 21:11:48 ": "@ChelleGotti @billiemitchel much love to all u guys . Pray for big things in the near furture for all of us"}