{"Thu Jan 24 16:41:29 ": "Also tickets for my show tomorrow night at @TheMediaClub in Vancouver are still available! Grab them here --&gt; http://t.co/6o7mxfy8", "Wed Jan 23 17:41:18 ": "I'm giving away a free pair of tickets to my show at @TheMediaClub in Vancouver Friday night on my Facebook page! --&gt; http://t.co/ZwxcVYgB", "Wed Nov 28 18:35:25 ": "Happy to say I’ll be putting out a new EP – Don’t Stop Now – on January 14th in the US.\n http://t.co/RkmNQHOl", "Thu Mar 21 20:42:11 ": "RT @PepperApp: @LatitudeFest have announced the first flurry of acts @ohdaughter @foalsfoalsfoals @alt_J @Wjjmason @lauramvula... http:/ ...", "Tue Dec 18 11:32:25 ": "I was trying to remember everyone I've toured with over the years and made a playlist with some of my favourite songs: http://t.co/mSmZst0D", "Mon Feb 11 16:40:26 ": "Hey Boston, just a reminder you can win a free pair of tickets to my show at Cafe 939 Wednesday night! Enter here --&gt; http://t.co/IiKd03AZ", "Sat Apr 06 08:17:50 ": "Ben Howard Melbourne show tonight has been postponed till Monday - sorry for any trouble. So what's going on in Melbourne tonight?", "Tue Nov 20 22:34:33 ": "@MFoxx it's still there, had to get a new furnace though the old one shat the bed. Were you looking for some tunes then?", "Sat Nov 24 18:12:24 ": "RT @BBCRadio4: Up next:.. #BBCLooseEnds :… #CliveAnderson  @RealBobbyWomack @Wjjmason http://t.co/0JIV6826", "Thu Feb 07 14:05:07 ": "UK tour starts in 3 weeks! Today we're very pleased to announce supports @themarinerschildren + @siobhanwilson http://t.co/ZgPWRw0v", "Wed Jan 16 18:01:39 ": "I will be in Chicago at @OldTownSchool Thursday night with Paul Kelly. Tickets still available - http://t.co/KMpHSbLU", "Tue Dec 04 15:35:23 ": "If you want to check out the new album, you can listen to it here:\nhttp://t.co/p7SV5Uwb", "Tue Dec 04 13:22:33 ": "Here's a live video of Restless Fugitive from earlier this year. Shot at @80hertz studios in Manchester with @wearevc http://t.co/w8bCGkPB", "Thu Dec 20 10:50:23 ": "Well if its the end of the world, maybe they meant that heavy and imaginary world that's been sitting on everyone's shoulders.", "Mon Jan 21 10:57:24 ": "RT @MumfordSonsBlog: Click to stream/download Mumford &amp; Sons performing Fleetwood Mac's \"The Chain\" w/ @edwardsharpe and @wjjmason h ...", "Sun Dec 02 12:24:05 ": "RT @TheIndyArts: IoS album review: Willy Mason, Carry On (Fiction) http://t.co/ncr6lIOd", "Fri Nov 30 12:15:50 ": "Last night of tour with @Benhowardmusic in Brixton.Party poppers and all! Thx to them all for an amazing few weeks http://t.co/D3SkKJ0N", "Mon Nov 05 16:17:45 ": "RT @FictionRecords: Willy Mason 2013 tour now on general sale, plus last few tickets for Dec 2012: http://t.co/R7VT8bE5 @Wjjmason", "Fri Nov 09 18:45:58 ": "The video for I Got Gold goes live on Monday morning! Tune in then.. http://t.co/McEVnq3r", "Tue Nov 27 19:32:09 ": "RT @danocdj: Tonight on the show @wjjmason talks about his new album and @PARTYinSOHO on the phone for their track of the week. All good ...", "Mon Nov 05 16:22:21 ": "Willy is putting on a free show at The Living Room in Cambridge on the 19th Nov for 50 people.. Enter for tickets here:\nhttp://t.co/mBjh0i0C", "Tue Feb 12 14:07:13 ": "Keep your eyes peeled for a brand new video first thing tomorrow.. http://t.co/MgtNWJng", "Wed Jan 30 18:28:21 ": "Hitting @TheHotelCafe stage @ 8 PM tonight. LA friends, I hope to see you there! PS - Tix are still available here --&gt; http://t.co/nUAYHjSG", "Tue Jan 15 18:19:02 ": "US, I'm sorry for putting out my record in the UK first..I'm starting things off here with an EP, DON'T STOP NOW avail from @CommunionMusic", "Sun Jan 13 00:35:15 ": "RT @DivanOrange: C'est Landon Coleman qui assurera la première partie du concert de @wjjmason ce dimanche 13 janvier !", "Mon Nov 19 13:39:44 ": "I'll be making a sneaky appearance at @roughtrade east on Dec 5th at 1pm: http://t.co/s6bJCUrM come down!", "Mon Jan 28 19:17:16 ": "Also, you can still grab tickets for my show in San Francisco tomorrow night at The Chapel! --&gt; http://t.co/rF6ddaqG", "Tue Mar 05 17:54:03 ": "Willy and @_brendanbenson got together in Nashville last month + recorded an EP live to tape upstairs at United Vinyl http://t.co/sVpWtz8joa", "Thu Mar 21 20:41:53 ": "RT @BodyandSoulIrl: BRING ON JUNE - @ncandtbs @solangeknowles @pilofficial \n@therealkurtvile @Charles_Bradley  @bretonLABS @MMOTHS \n@Wjj ...", "Fri Dec 14 16:54:51 ": "Here's a live recording of Oxygen from London last week:http://t.co/n2BvgsdT", "Sat Apr 06 08:42:39 ": "@AnneDenissen the dude lost his voice. The doctors been called in for support... Sounds like he'll be good for tomorrow.", "Fri Jan 04 14:33:07 ": "Here's a little acoustic version of Pickup Truck filmed whilst over in London in December..\nhttp://t.co/7uPeDSY6", "Tue Nov 20 15:35:55 ": "RT @QMagazine: Track of the day is Willy Mason's (@Wjjmason) new single I Got Gold: http://t.co/x8zbRHe8", "Thu Nov 15 12:04:24 ": "Friends in London, Willy's headline show at Scala next month has now sold out but keep your eyes peeled for exciting news early next week!", "Wed Nov 07 23:38:39 ": "@melaniegabor @pixiefauxpas hey there, a friend of Melanie's is a friend of mine. Got a couple hrs before load out...", "Wed Feb 06 17:21:47 ": "Mumford &amp; Sons have just announced a number of GOTR festivals.\nWilly will be performing at all the N.American dates: http://t.co/B9ngiWjx", "Wed Nov 07 12:01:44 ": "Good to be back in the UK. Kind @Benhowardmusic has let us hitch a ride on his bus so we're riding in style-No more all day drives Uh huh!", "Thu Jan 24 16:37:53 ": "I'm going to be at the @ColumbiaCityTheater in Seattle on Saturday!  Win a free pair of tickets on my Facebook page --&gt; http://t.co/OYySO0u3", "Tue Nov 27 12:33:28 ": "Everything starts somewhere..here's where I learned my animal dance from. We'll trace this story back as far as we can. http://t.co/xJhsdLtu", "Thu Dec 06 20:03:11 ": "@teamloverecords you too!! Hey, what time does it say to the right of 'willy check'?", "Mon Dec 10 20:16:07 ": "RT @jowhiley: @BBCRadio2: Tonight we review new albums from @officialtulisa @joolsband &amp; @wjjmason. Have you bought any yet? What do ...", "Thu Mar 28 12:00:06 ": "Following on from a sold out show at Koko, Willy returns to London for 2 dates at the start of summer: http://t.co/xoAShFZ97l", "Tue Nov 13 12:44:49 ": "Some photos from Belfast: http://t.co/eeGfwVt4", "Wed Feb 13 14:51:45 ": "When do you get to dress up like an Ewok Druid and play around in the forest with a giant white horse? http://t.co/OoyFNHi3", "Wed Nov 28 18:38:12 ": "@Communionmusic will be pressing 500 10” vinyl. It'll also be available digitally for those without access to a round-and-a-round", "Wed Mar 27 17:05:18 ": "RT @thisisfakediy: Regina Spektor, Youth Lagoon and Willy Mason added to Secret Garden Party, set to join Bastille, Dan Croll &amp; more ...", "Thu Nov 29 15:19:42 ": "Introducing Stanley Hicks - The originator; taught by the animals and the hills: \nhttp://t.co/2PggH9wl", "Tue Nov 13 14:28:15 ": "There's gonna be another similar event in Cambridge on the 19th.. Details here: http://t.co/mBjh0i0C", "Mon Dec 03 13:20:48 ": "The day has finally come! Carry on is out today. Thanks to everyone who has come out and helped make these shows so good..", "Fri Nov 30 08:25:13 ": "For those of you in Australia, Carry On is available as of today! https://t.co/91hdtOMU", "Fri Jan 25 16:45:38 ": "Portland, I'm playing at @DougFirLounge on Sunday night!  Win a free pair of tickets on my Facebook page --&gt; http://t.co/kck7ppq4", "Tue Jan 15 18:46:36 ": "RT @wheretoronto: Check out Willy Mason play @TheRivoli 334 Queen St West tongiht!! $12 – all ages http://t.co/8A6O9ROk", "Tue Feb 12 15:37:42 ": "RT @JuliaVarlamova: @Wjjmason @ Terminal 5 http://t.co/vhsy5aEX", "Mon Nov 12 18:25:38 ": "Ahoy, I am very happy to announce the unveiling of a new video for the first single from Carry On.. 'I GOT GOLD'\nhttp://t.co/GHoaND2f", "Thu Feb 07 10:26:01 ": "RT @CamFolkFest: We are delighted to announce @lucyrosemusic, @Wjjmason and Kathyrn Roberts &amp; Sean Lakeman for the Thurs night of th ...", "Sat Nov 24 16:05:33 ": "Tune in to @bbcradio4 at 18.15 to hear Willy performing. Other guests inc. Bobby Womack,Sir David Frost + @dannywallace\nhttp://t.co/BxLdvKxV", "Tue Nov 20 23:28:53 ": "@MFoxx yeah that's the only one right now, by my cousin Jesse James!", "Mon Nov 12 21:04:00 ": "@soulmanbrown nice work.", "Mon Jan 21 14:06:11 ": "I'll be playing at Isle of Wight on the 15th June.. my first UK festival of the year! http://t.co/Qi11JdY1", "Sat Nov 10 09:48:15 ": "@sebastiankeefe @familyoftheyear where to captain?", "Wed Nov 07 12:55:42 ": "In Dublin tonight at one of the coolest venues I've seen - small but with 3 stories of balcony and muppet theater style box seats. W.", "Mon Feb 11 14:07:23 ": "RT @Oceanfest: For those that missed it yesterday, we've announced Xavier Rudd @xavierrudd &amp; Willy Mason @Wjjmason for Friday at Gol ...", "Tue Jan 15 18:20:35 ": "It's at the presses and will be out on 10\" vinyl and CDs soon. Hopefully I will have them for sale at some of my Jan/Feb N.American dates. W", "Mon Nov 26 13:39:46 ": "RTE. 13.00, 5.12.12 http://t.co/SRahoijT", "Fri Nov 30 08:26:53 ": "RT @RoughTrade: We regret to announce that the WILLY MASON @WJJMason instore has been cancelled. Apologies to those that were looking fo ...", "Tue Nov 20 16:15:18 ": "I've added a show at KOKO in London to my schedule for the 7th of March. You can get pre-sale tickets tomorrow from: http://t.co/mvML0QP6", "Mon Nov 19 12:51:09 ": "Willy is playing an intimate show at the Living Room in Cambridge at 3 this afternoon. First 5 to retweet will be added to the guestlist + 1", "Mon Jan 28 19:12:18 ": "Win two tickets to my show at @thehotelcafe in LA from my Facebook page! --&gt; http://t.co/ArmbtTmy", "Tue Jan 15 20:08:16 ": "My new EP \"Don't Stop Now\" on Communion Records is out today! Download it at iTunes - http://t.co/p3I5FfdW", "Sun Mar 10 21:04:43 ": "RT @CommunionMusic: Tonight on @Xfm  - Maz speaks to @Wjjmason about his new record. Tune in at 10pm! #xfmcommunion http://t.co/i0CtJiYJil", "Fri Nov 30 09:28:16 ": "Willy will be selling a very limited number of these amazing screen prints on his UK tour which starts tomorrow!  http://t.co/i3r0ISKn", "Thu Jan 17 19:01:33 ": "I'm coming to Minneapolis! @turf_club Saturday night. Tickets still available - http://t.co/osB2LULH", "Sat Mar 23 14:45:33 ": "RT @radioleary: Excited about show today. Willy Mason and newbee Daniel Bettridge.  Plus good, 'Stay under the covers' type tunes.", "Fri Jan 25 16:48:59 ": "Vancouver, if you haven't yet, tickets for tonight's show at @TheMediaClub are still available  Hope to see you there! http://t.co/VTY7yzM6", "Fri Nov 23 10:48:16 ": "Tickets for the Koko show in London on the 7th March are now available here: http://t.co/9TGs5T98", "Mon Dec 03 13:21:38 ": ".. and everyone back home who lent some of their spirit for this record.", "Thu Dec 20 10:50:30 ": "Time to shrug and shake and get down to business.\nhttp://t.co/a3PxNrZR", "Thu Mar 28 17:53:57 ": "RT @CommunionMusic: LINE-UP! We're excited to announce @Wjjmason @ThemeParkBand and lots more http://t.co/C6LHiwhoEl! #Bushstock2013 htt ...", "Fri Nov 09 13:29:39 ": "Looking fwd to getting back to Glasgow tomorrow..Gonna do an afternoon stop at Mono to play some tunes around 3pm if anyone wants to stop by", "Tue Nov 13 00:28:30 ": "@ElleNewsome would a cupcake kill ya", "Fri Jan 18 18:06:17 ": "Tune in to @daytrotter later today at 9pm GMT / 4pm EST - Willy will be performing an Encore session live..\nhttp://t.co/cNejzMNK", "Mon Mar 11 18:37:04 ": "7 shows into our UK tour and it's been a real hoot. Last Thurs was Koko, London and we pulled out most of the stops;\nhttp://t.co/wQlNSkd67V", "Tue Dec 04 22:28:04 ": "RT @BBCR1: Here til Midnight @philytaggart has his @WJJMason session on the show and loads of great new tunessss http://t.co/kX7dZuGP", "Sun Mar 03 17:17:35 ": "A few songs and some fine food down at @pieandvinyl in Portsmouth.. Thanks to those guys. Wedgewood rooms next. http://t.co/Cm1mOfAwp2", "Tue Mar 19 22:18:42 ": "http://t.co/l0R9Sz0mvk", "Wed Nov 28 12:04:45 ": "Tune in to @BBC6Music right now. Willy is live on air with @nemonemetaxas playing a few songs and having a chat...", "Tue Jan 15 18:19:26 ": "You can listen to it here: http://t.co/IpbaocSJ\n\n... And if you like it, download it here:\nhttps://t.co/l9g57XGp", "Tue Feb 19 16:32:31 ": "RT @MoneyMikeBoone: I just got some free music from @Wjjmason on @noisetrade. Download it here: http://t.co/Y3aK8MU8", "Thu Dec 06 13:50:51 ": "We were selling a ltd run of letterpress posters on tour. We have a handful left which can be ordered online from here:\nhttp://t.co/eyt3UwHa", "Fri Apr 05 10:17:00 ": "RT @TheEdenSessions: Special guests for the @sigurros Session will be @ohdaughter @wjjmason Dawn Chorus Ignites and @mwahahamusic ! http ...", "Tue Nov 13 14:26:43 ": "Thanks to everyone who came out to Mono on Saturday. I did not expect such a crowd! Good times.  http://t.co/yU0og9LT", "Tue Mar 19 12:40:29 ": "Some photos from London by the great Mikael Gregorsky: http://t.co/yhZX1k3Xa6", "Sat Mar 23 18:25:33 ": "@radioleary thanks for having me back on the show!", "Mon Mar 04 17:27:07 ": "Willy was recording an EP down in Nashville last month, NBC news happened to be passing through that day!\nhttp://t.co/SyGmsYTJKl", "Mon Jan 28 14:37:36 ": "A little something from Australia, a new tour film ‘A Far Horizon’\nhttp://t.co/m93wjbgr", "Wed Feb 06 18:07:08 ": "New York, I'm playing at @RockwoodNYC tomorrow night.  You can win a pair of tickets on my Facebook page! --&gt; http://t.co/VB5IJqdx", "Fri Mar 22 17:43:08 ": "Tune in to @BBCRadio2 tomorrow at 3pm GMT where I'll be in session with @radioleary \nhttp://t.co/L1mjbdszJA", "Mon Dec 03 13:22:07 ": "It's been a grand and difficult year. Here's to the next and to whatever may come with it.", "Mon Nov 19 10:34:12 ": "Still trucking on the @benhowardmusic tour. Cambridge tonight. A snap from our crazy golf tournament. Tour demons. http://t.co/VRBW5jV8", "Mon Nov 12 10:35:05 ": "@soulmanbrown let me get a fine ale cap - looking forward to it"}