{"Wed Mar 27 13:26:53 ": "RT @Szetela89: Heard @TheBlackLillies for the 1st time today. Went on YouTube to listen to their other songs &amp; Im officially obsesse ...", "Fri Mar 29 11:10:51 ": "Thanks for coming! RT @hbc72: @TheBlackLillies thanks for a great show at rosemary beach! You are amazingly talented! http://t.co/AiF0uMf8tD", "Wed Apr 10 03:17:30 ": "RT @TheCorduroyRoad: New Photo: @theblacklillies and James Justin &amp;co at the Melting Point, Athens GA. Tuesday night tunes in good.. ...", "Wed Apr 24 14:55:33 ": "Tune into WNCW this Thursday night! http://t.co/wKeEgwDBBA", "Sun Mar 31 18:11:04 ": "Nashville, we can't thank you enough for a truly exceptional weekend!", "Sun Mar 31 18:10:15 ": "@bishop_tina Thanks Tina!", "Sun Apr 14 18:48:19 ": "@BackBoothOrl Thanks for having us!", "Sat Apr 13 20:52:20 ": "RT @BackBoothOrl: Looking forward to seeing you at @TheBlackLillies tonight! http://t.co/soWH3Bz6oV", "Fri Apr 05 03:32:27 ": "Tickets are moving fast for tomorrow's big throwdown in Madison, IN! Help us kick off RiverRoots Music &amp; Folk Arts... http://t.co/jZdK8MxM4R", "Mon Apr 15 18:00:20 ": "\"Listening to someone like Trisha Gene Brady or Cruz Contreras sing, it’s easy to assume that there’s a higher... http://t.co/1fnywr7A0b", "Mon Apr 15 22:35:19 ": "Our thoughts are with everyone in Boston today.", "Sun Mar 31 08:29:45 ": "RT @chavighurst: A rare Sat nite out at 3rd &amp; Lindsley w @TheBlackLillies. Makes the ACM Awards ad on tv look absurd. http://t.co/vh ...", "Sat Mar 30 14:52:06 ": "Hey Knoxville people - this Wednesday around 8 pm, we'll be doing a free short performance and television taping... http://t.co/57MC3sKDlB", "Thu Apr 11 16:41:10 ": "Looking forward to a week in the Florida sunshine and hoping to see some familiar faces! Today and tomorrow, we're... http://t.co/x99qwxSpQH", "Thu Mar 28 14:46:42 ": "Happy to help! RT @nyarger1411:  thank you For making such great music to come home to &amp; relieve stress of a workday! http://t.co/eYrSUI640z", "Tue Apr 09 20:56:33 ": "RT @FollywoodRocks: Athens, GA Tonight: @jjandco open for @TheBlackLillies @meltingpointath. Early Show. 7 pm! @FlagpoleMusic @wuog @red ...", "Wed Apr 03 19:51:53 ": "Excited to announce that we debuted at #43 on the Billboard Top 200 Country Albums chart!", "Sat Apr 20 15:13:42 ": "Happy Record Store Day! Please support your local independent music store by paying them a visit today. And many... http://t.co/XY795G5JXz", "Sun Mar 31 19:18:03 ": "RT @CMT: Get to know @TheBlackLillies. Read front man's Cruz Contreras' exclusive Q&amp;A about the band on #CMTedge: http://t.co/O3DGXUugO6", "Sat Apr 13 00:10:09 ": "RT @BackBoothOrl: Looking forward to @TheBlackLillies tomorrow. http://t.co/soWH3Bz6oV", "Sun Mar 31 00:37:32 ": "Great review of the new album from The Daily Oklahoman. \"The Black Lillies are fronted by the best-matched... http://t.co/hMdDoBS6nP", "Tue Apr 02 15:28:13 ": "A review from across the pond (England!). http://t.co/50iEvRDAW5", "Tue Apr 09 18:20:12 ": "Georgia bound! We'll be at The Melting Point tonight with James Justin &amp; Co. tonight and at Eddie's Attic in... http://t.co/I8mFQLrlhL", "Fri Apr 12 02:14:09 ": "@kukkurovaca Cruz is Hispanic, actually, but we are pretty white ... and that picture certainly makes it look that way!", "Fri Mar 29 11:13:12 ": "RT @Carlton129: 'Smokestack Lady' by the Black Lillies is my favorite new track of the week.", "Thu Apr 04 12:12:15 ": "RT @Hobetnvarsity: Covering @TheBlackLillies CMT filming in Knox. Was not familiar with them, I am now a fan! http://t.co/oyfVAqbKzX", "Tue Mar 26 15:24:24 ": "RT @granddelusion: If you only buy one record this week, make it @TheBlackLillies #RunawayFreewayBlues #Americana at its finest.", "Wed Mar 27 18:31:16 ": "You can vote for Cruz once per day! And, Billy Contreras is up for violin/fiddle player as well. Let's take both... http://t.co/BQP8ChS9gY", "Tue Mar 26 19:23:19 ": "A review of the new album! http://t.co/4tj1GY9hfY", "Sat Apr 13 18:24:35 ": "Orlando! We'll be at the Backbooth tonight. Doors at 7:30, we're on at 9.", "Fri Apr 05 01:40:25 ": "@laphant Tom Pryor. You can send a message through our mgmt - Chyna at attackmonkey dot net. Or via our Facebook page.", "Wed Apr 03 13:22:54 ": "Good question! RT @BrookeM225: Anyone ever heard of The Black Lillies?", "Thu Apr 04 13:12:59 ": "CMT Comes to Knoxville to Film the Black Lillies http://t.co/bOY4dv9r20", "Fri Mar 29 11:12:23 ": "Thanks lady! RT @katieontheair: FInally listening to the new @TheBlackLillies record. I'm real happy about it. #RunawayFreewayBlues", "Fri Mar 29 23:22:21 ": "Sun Studio Sessions is also airing in primetime in Los Angeles tonight - KCLS at 8 pm! Then stick around to see... http://t.co/TbDkFNW49T", "Thu Apr 04 21:57:58 ": "Lexington, KY! We will be in your town tonight along with Coralee and The Townies and Music by Betse Ellis. We're... http://t.co/omoOfjAfhj", "Sat Mar 30 16:18:54 ": "Also, tonight we will be in Nashville at 3rd &amp; Lindsley with our good friend Scott Miller. There's sure to be... http://t.co/SAZNvb1rL7", "Fri Apr 19 05:05:54 ": "@OrlandoNoise We just played there Saturday! It will probably be a while before we are back.", "Sat Apr 20 19:49:39 ": "Linda Relli ... here's one for you! http://t.co/iEKlXhD6VJ", "Tue Apr 02 04:09:39 ": "RT @cdbaby: Grab @TheBlackLillies excellent new alt-country album \"Runaway Freeway Blues\" here: http://t.co/QRfQkCLnbn", "Thu Mar 28 16:46:07 ": "Back on the road!  Free show in Rosemary Beach, FL tonight, Grand Ole Opry performance and post-show CD signing... http://t.co/drOZhcGFIq", "Fri Apr 05 01:39:34 ": "RT @RiverRootsFest: @TheBlackLillies in Madison tomorrow, 4/5/13 at The Livery Stable for The RiverRoots Kickoff!.Follow the link:   htt ...", "Mon Apr 01 12:43:00 ": "RT @shaynirae: I'm really diggin the @TheBlackLillies.  Why haven't I heard them before. #doiknowyou", "Sat Apr 06 08:07:36 ": "Happy birthday to the one and only Bobby Dix, bass player (and guitar, and just about everything else) extraordinaire. We love you, Bobby!", "Sun Mar 31 01:44:19 ": "@CosmicAmericana DM your address!", "Wed Apr 17 19:29:11 ": "RUNAWAY FREEWAY BLUES is featured on the latest Freight Train Boogie podcast.  Check it out below! They always... http://t.co/fqeTrXqXyv", "Mon Apr 01 21:28:14 ": "Made our debut on the Americana Music Association radio charts today ... we're the highest debuting artists of... http://t.co/cKKLYUFZvd", "Thu Apr 04 00:00:09 ": "Getting ready! There's still time to come down for #cmt! http://t.co/87Q6EsoMvC", "Sat Apr 13 00:08:52 ": "You've got good taste in music and stores! RT @MayorRogero: Buying local! @TheBlackLillies @DiscExchange #SouthFest http://t.co/47375djYCx", "Sat Apr 13 00:10:30 ": "@EventsHiveOWP Show is tomorrow. But thank you!", "Wed Apr 03 03:37:56 ": "@RoadKingMN Thank you!", "Tue Mar 26 15:24:28 ": "RT @Sephora_F: Happy country CD release day. Here are today's albums you NEED: @blakeshelton @IAmMaggieRose @TheBlackLillies @thompsonsquare", "Thu Apr 11 03:22:41 ": "What a blast! RT @meltingpointath: Beautiful Terrapin Tuesday last night, much love to @TheBlackLillies  and @jjandco ! #athensga", "Mon Apr 22 20:24:04 ": "Check out this week's Americana Music Association's top 10! http://t.co/b185hwht6G", "Sat Mar 30 06:02:12 ": "What a great night at the Grand Ole Opry! Got to hang out backstage with some fans (who are now friends!), had a... http://t.co/J93N3dkLtW", "Fri Apr 12 15:20:57 ": "@JennaSchnuer We'd love to make that trip!", "Wed Apr 10 22:24:57 ": "One more for today - Runaway Freeway Blues \"hits like an electrified back porch lullabye.\" Yeah! http://t.co/nDvXhpMCTM", "Fri Mar 29 21:03:48 ": "Tune into WSM right now to hear us live on the air! Thanks to everyone at WSM for playing a track off of the new... http://t.co/SQQxzwMyfr", "Wed Apr 10 03:23:24 ": "RT @eddiesattic: We're feeling generous today... Win tickets to see The Black Lillies Tomorrow! http://t.co/vxgvpLdfmv Purchase here: ht ...", "Thu Apr 18 16:35:14 ": "A little something from Montgomey, AL, where we'll play on Sunday. Today we're at  The Green Parrot in Key West... http://t.co/1s0DuHmflb", "Sat Apr 13 20:53:17 ": "Thank you! RT @DucatiBMW: Listening to Black Lillies on XM Outlaw Country right now. Damn, that's good stuff.", "Mon Apr 15 21:01:17 ": "More good news today ... jumped from #24 to #18 this week on the Americana Music Association's radio charts.... http://t.co/c9sTaYEZbu", "Sun Apr 07 22:35:33 ": "Bowling Green! Looking forward to seeing you at the Warehouse at Mt Victor tonight!", "Mon Apr 15 14:53:09 ": "Over 50,000 votes cast ... and now the winners have been announced! We're proud to say that the Alternate Root's... http://t.co/QQllhLZKpC", "Fri Mar 29 12:19:38 ": "Hey hey , Mississippi! Our episode of \"Sun Studio Sessions\" airs statewide tonight on Mississippi Public... http://t.co/EXhesiRRZk", "Sat Apr 20 20:03:09 ": "Our last Florida show for a while ... tonight in St. Augustine at Cafe 11. Let's make it a great one!", "Sat Mar 30 16:39:15 ": "@SeanMPhipps Not sure ... Will certainly be in Chattanooga soon, either way!", "Sun Apr 14 18:50:05 ": "RT @JonathansOgt: Great news!! The Black Lillies are coming to Jonathan's on Fourth Of July Weekend! What a great way to celebrate... ht ...", "Thu Apr 04 17:52:22 ": "RT @BeOutLexington: The Black Lillies Coralee And The Townies: Thu, Apr 04 2013 9:30 PM Willie's Locally Known in... http://t.co/lzAMNTG ...", "Tue Apr 09 20:07:16 ": "A preview of tonight's show! http://t.co/sEDMZtQ1Mz", "Sun Apr 07 06:09:38 ": "We're in a dead heat!  Remember that you can vote once per day per device! http://t.co/ynbqUOtYmu", "Sat Mar 30 15:17:23 ": "RT @SeanMPhipps: Let's talk music!: albums from @Wavves, @MilkCartonKids, @TheBlackLillies http://t.co/a1jFE34NX3 via @NoogaNews #CHAnews", "Thu Apr 04 12:12:19 ": "RT @Hobetnvarsity: One more for now.  Smokestack Lady by @TheBlackLillies Live from Knoxville #CMT filming #BlackLillies http://t.co/tpo ...", "Wed Apr 10 18:00:31 ": "Another review! http://t.co/bwmJH7ye1N", "Fri Mar 29 11:13:02 ": "RT @WritingScott: Loving The Black Lillies' song \"The Fall\" this morning. Want to write a book by it.http://t.co/IfoxgwKru2 #BlackLillie ...", "Sun Mar 31 01:22:00 ": "Don't forget, Nashville! 3rd &amp; Lindsley Nashville tonight with Scott Miller and The Commonwealth/ Rayna Gellert.... http://t.co/6z8wTELsAW", "Fri Apr 19 19:24:43 ": "@CosmicAmericana We are slow and lame but cd is finally on the way!", "Sat Apr 20 02:46:47 ": "@CosmicAmericana Great to hear! Hopefully the new tracks will be popular, too!", "Thu Apr 11 16:49:38 ": "Thanks, WUTK The Rock! We love you! http://t.co/xa2ahKrsvx", "Tue Mar 26 20:13:34 ": "Cruz is nominated for Best Americana Male Vocalist in The Alternate Root Magazine's reader's poll.  You can vote... http://t.co/SOeOt614nw", "Tue Apr 16 00:30:27 ": "@NikkyTylerHS Thank you, Nikky! We appreciate your kind words.", "Wed Apr 03 12:24:54 ": "RT @erronious: Who's heading out to see @TheBlackLillies tonight in the Old City for the @CMT taping? #knoxville #music  http://t.co/SOl ...", "Tue Mar 26 13:47:27 ": "Links, to make it easier to find:\n\nCDBaby: http://t.co/nTKMouyUWN\n\niTunes:... http://t.co/XwRcJReBBr", "Tue Apr 23 01:58:45 ": "RT @TheAltRootMag: Our dear friends and immensely talented band The Black Lillies have come up with one of the early gems of 2013!... http:…", "Sun Mar 31 08:42:22 ": "@chavighurst High praise, coming from you. Thank you, sir!", "Tue Apr 23 15:31:03 ": "Cruz has a rare solo performance this Thursday at High Rock Outfitters in Lexington, NC on Songcraft Live. Blake... http://t.co/QgtD4i6LeX", "Tue Mar 26 13:39:01 ": "@tweetaround Weird. We will look into it! Thanks for the heads up.", "Wed Apr 03 12:26:31 ": "@RushaSams Get there on time, it's a short one!", "Fri Mar 29 14:21:20 ": "Jewly Hight weighs in on \"Runaway Freeway Blues\" and catches up with Cruz:... http://t.co/ove31JjcwT", "Fri Mar 29 11:11:45 ": "We can't wait! RT @amberhoneycutt_: excited to see @TheBlackLillies @shovelsandrope @this_mountain @heyheydellamae in Sept @BristolRhythm", "Tue Apr 16 00:30:55 ": "@quilter927 Thank you! Hope to be back in Nashville soon.", "Tue Apr 16 19:39:25 ": "After a couple of days at the beach, we're headed to a house concert in West Palm Beach tonight. Then, we'll be in... http://t.co/WTDEnbutDV", "Thu Mar 28 14:07:52 ": "Join us at the Grand Ole Opry tomorrow night! http://t.co/iy44wc4ylm", "Wed Apr 03 19:33:52 ": "Tonight, Knoxville!  We'll be at the corner of Central and Willow across from Crown &amp; Goose.  It's free but get... http://t.co/g5C2NWMacW", "Sat Apr 20 20:22:33 ": "The Alternate Root Magazine says that \"Goodbye Charlie\" is \"one of the most starkly beautiful songs ever... http://t.co/0i5flkEd4k", "Wed Apr 03 22:18:57 ": "AND #21 on the BIllboard Heatseekers chart!", "Sun Apr 14 18:49:42 ": "RT @NikkyTylerHS: I love the Outlaw Country station on SiriusXM. Heard a killer new song by Black Lillies- Gold and Roses. Check it.  #s ...", "Wed Apr 10 15:41:15 ": "Atlanta area! We'll be returning to Eddie's Attic tonight at 7:30 pm. Hope to see you there!", "Fri Mar 29 13:35:06 ": "Congratulations to Lauren McMillan, who just won two tickets and a backstage meet &amp; greet for tonight's... http://t.co/7a6LQc7iDH"}