{"Sun Jun 10 21:28:40 ": "This Thai restaurant ain't messin around http://t.co/oamXOq28 http://t.co/7qPFDWMK", "Tue Aug 07 01:45:00 ": "Would you like to book a last minute river rafting adventure with Bearfoot?? Book last minute and save $300 if... http://t.co/GhCblkai", "Wed Aug 22 00:13:58 ": "Some great photos of us from La Roche, France http://t.co/lGzXG4CP", "Thu Jun 14 20:50:04 ": "Bumping the Steeldrivers in Bearforce One almost to the Alberqueque Zoo!", "Wed Nov 21 18:41:15 ": "Getting super excited to go to Germany next Monday!!!!! But first, mow down on some yummy Thanksgiving food : )", "Wed Aug 22 00:13:19 ": "Another great photo from La Roche http://t.co/ck7GTm44", "Sat Feb 16 17:40:11 ": "Our latest album \"American Story\" is the #7 most aired bluegrass album of 2012 says the Roots Music Report!!... http://t.co/ZVxY60ta", "Tue Jan 08 20:28:10 ": "New Bearfoot website is up as of today! And we're really looking forward to our upcoming tour in Feb to the West!... http://t.co/aDVGu0eb", "Wed Jul 25 20:45:49 ": "This last tour was sooo awesome! Especially Grey Fox! Fav acts include David Grisman Quintet, Del McCoury, Frank... http://t.co/w2Pwgguv", "Wed May 23 14:08:26 ": "5 Days Left...it's not too late! Become a part of making Nora Jane's new solo studio album!   \n($20,394 donated... http://t.co/9I0s16SU", "Mon Nov 12 21:54:29 ": "Mark your calendars for this Wednesday at the Station Inn with Bearfoot. Megan McCormick and Mike Bub will be... http://t.co/JOdbNWBN", "Thu May 10 04:49:52 ": "Guess what! We're coming back to Alaska in August. Here's the schedule. May add a Sunday something too. AND we're... http://t.co/q4QboHHI", "Tue Jul 03 22:42:25 ": "Some pics of us from ROMP. Kinda sweaty. : ) http://t.co/BNh8FYl7", "Wed Aug 08 07:02:44 ": "France was basically super awesome!", "Tue Aug 07 00:55:40 ": "https://t.co/3RtqrHMB\nMore pics of us and other bands from France http://t.co/Y3sSdLO9", "Thu Nov 15 01:12:05 ": "Bearfoot tonight at the Station Inn at 9pm. With Megan McCormick and Mike Bub. Come check it out!", "Fri Jul 13 23:21:38 ": "Did we mention we're going river rafting this Aug 22-27 on the Salmon river in Idaho! And you can come with us!... http://t.co/Qjo0zT7I", "Tue Nov 06 02:49:26 ": "Just added 3 new dates!! Jan 31st at Avogadro's Number in Fort Collins CO, Feb 1st at Swallow Hill in Denver CO,... http://t.co/VlGm1Qnd", "Sat Jul 28 19:49:47 ": "Hey y'all Anchorage folks. Are you coming to our show at the Taproot? We're bringing a drummer, and hoping for... http://t.co/jhogOYh9", "Tue Aug 14 21:37:50 ": "Well.... we have some bummer news. Our raft trip in Idaho has been cancelled due to a Forest Fire! We are soooo... http://t.co/wnNplzI0", "Tue Jan 29 05:36:37 ": "Dude, we just ate at this place in St. Louis. Bison, Duck, Lamb and Chicken burgers. What! Now, the drive through... http://t.co/LotDJGby", "Thu May 03 03:08:17 ": "OMG! Just watched the new Midnight in Montana video and it's awesome!!!! I can't wait for everyone to see it. ; )  -Ang", "Thu Aug 16 23:52:32 ": "Come see us tonight at the Taproot in Anchorage. Nate May opens at 9pm. Tickets for sale starting now at the... http://t.co/k4UX9OUv", "Thu May 10 04:54:15 ": "Come join us at the ROMP fest in KY and support our friends at the Bluegrass Music Museum!\n\nWe want to extend an... http://t.co/OLIFhh2o", "Wed Jan 23 21:24:52 ": "Heading out next Monday for Denver CO! It'll be great to be out west again! We'll be sure to bring our winter gear : )", "Tue Apr 09 06:14:21 ": "Hey there friends, Me (Angela) and Todd will be spending the summer in Alaska and will be playing a bunch of... http://t.co/i4l4sMH6BN", "Wed Sep 19 20:24:46 ": "Coming up this weekend... Thurs. in Raleigh at The Berkeley Cafe, Friday in Charlotte at the Double Door, and... http://t.co/GqLv43Cs", "Sun Jun 10 18:09:45 ": "Pagosa really knows how to do it up right! http://t.co/JOzTiGNw http://t.co/i4cl9aSm", "Mon Aug 27 21:11:04 ": "I'm working on a new newsletter to send out folks. If you're not already on our mailing list, and you want to... http://t.co/FzhvVaCi", "Fri Jun 08 21:20:57 ": "We're headed to Brownville, NE soon. Check out the news. http://t.co/qBcuuJHy", "Thu Mar 14 14:56:39 ": "We're in Wilmington NC! Just got some coffee at Grinders and now we're headed over to UNCW amphitheater to play some tunes!", "Thu May 31 04:18:56 ": "http://t.co/vJvY4diU talks about new Bearfoot video! http://t.co/gZgaGl1F", "Mon Dec 03 23:55:58 ": "Germany has really taken sparkling water to a new level.", "Thu Oct 04 20:48:46 ": "We're on vacation for October folks! Angela's going to New Orleans and Florida beach and Willie Nelson show in... http://t.co/ZHDiYAv1", "Wed Jun 27 15:31:55 ": "Ann Arbor Summer Festival was awesome! Now we're headed to Evanston North of Chicago. I head SPACE has great pizza!", "Thu Jun 14 18:13:00 ": "Drew's a workin hard! New duty?  http://t.co/EPEv2ZP8 http://t.co/L7rsIzk5", "Wed Jul 25 20:39:35 ": "http://t.co/cbuk2jWE", "Tue Jun 19 21:49:31 ": "Where do want to see Bearfoot play in Portland OR??", "Fri Jul 27 17:42:42 ": "Our video for Todd Grebe original \"Midnight in Montana\" is being featured as a No Depression \"favorite!\" Yay! So... http://t.co/SZxkN9fK", "Mon May 21 22:57:28 ": "Bearfoot will be featured on Alaska Live TV tonight at 9pm on KUAC's AlaskaOne Public Television. Check out this... http://t.co/cf6T2aVW", "Tue Aug 07 00:46:14 ": "Our first gig in La Roche at a cafe downtown. http://t.co/GzitzBbW", "Sun Sep 09 19:29:48 ": "Hey y'all, \nNora Jane is going to be working on her solo CD project, so we have the wonderful Megan McCormick... http://t.co/czowrU4u", "Tue Jul 03 22:35:10 ": "Did we mention we're going river rafting this Aug 22-27 on the Salmon river in Idaho! And you can come with us!... http://t.co/fRsvCNTW", "Mon Jan 28 16:57:22 ": "Bearforce One rides again starting TODAY on our long journey out WEST!!", "Tue Jun 19 23:27:53 ": "Washington State, here we come. Kinda by Spokane. http://t.co/5VuQmnyT", "Mon May 21 21:30:11 ": "Guess what Y'all! Just found out we'll be at Riverhawk this November. Also featuring our buddies Frank Solivan... http://t.co/Y7JgBDO6", "Sun Jul 01 17:17:27 ": "Bearfoot tour went out with a fiery bang at ROMP. 100+ heat for our show. Thanks to the troopers who were up... http://t.co/1cavANWS", "Thu Jun 14 00:02:01 ": "PJ showing Jason how to swing a golf club on the Navajo in Colorado! Or New Mexico?  http://t.co/wsLgKGRe http://t.co/NM15uHvR", "Fri Nov 30 17:17:22 ": "The welcome dinner our first day in Germany with Audie Blaylock and Redline and Caleb and Reeb. Heffeweisen,... http://t.co/6eU8ZOQN", "Tue Aug 21 01:53:24 ": "Our Tour of Alaska is officially over. It was Epic!!! Soon we will post pictures of bears and moose from our trip... http://t.co/EeW5c7ZW", "Wed Jun 27 15:33:31 ": "Ann Arbor summer festival was awesome! Now we're headed over to SPACE in Evanston, north of Chicago. I heard they have great pizza!", "Sat Jun 09 07:08:17 ": "Thank you Pagosa Springs, CO for an unforgettable night! See you next time!  http://t.co/MJeMIujY http://t.co/kHlJ9MCu", "Wed May 16 21:27:32 ": "Hey ya'll up in Anchorage, AK. We'll be playing at the Tap Root this August. We're bringing our drummer back up... http://t.co/uuu8F45t", "Sun Jan 06 00:31:22 ": "Check out Angela's pics from the Bluegrass Jamboree in Germany! Featuring Bearfoot, Caleb Klauder and Reeb... http://t.co/kF0hwqk5", "Tue Sep 25 19:30:31 ": "This is our only Bearfoot showcase for IBMA, so if you want to see Bearfoot with Megan McCormick and Mike Bub,... http://t.co/FTMxSZk0", "Sun Jun 10 17:57:00 ": "Smartphone party in Bearforce on the way to Fort Collins! http://t.co/Z883rD4H http://t.co/5f4XvbT4", "Fri Feb 08 20:48:18 ": "Thanks to everyone who came to our show in Pullman last night. Great venue, great people!! See ya next time!", "Wed Jul 25 20:38:39 ": "http://t.co/j01sU4Rn", "Thu Sep 20 19:04:02 ": "Come out and see us tonight in Raleigh at the Berkeley Cafe. Old Man Whickutt opens at 7:30pm.", "Fri Jun 08 23:29:31 ": "Jason and Nora Jane dancing backstage http://t.co/EahCT7mt http://t.co/4wH3gXHA", "Tue Jun 12 04:00:58 ": "Green dinosaur. Altitude: 9,000 ft. Somewhere in Colorado. http://t.co/fIf9Y8ld http://t.co/RAMdmUop", "Tue Jul 03 22:36:51 ": "New Bearfoot video for Midnight in Montana featured on http://t.co/wCn2UI9q http://t.co/9TlDIBqK", "Tue Oct 23 20:30:04 ": "Listen to our 3rd Mountain Stage appearance from Fairbanks AK. One of Nora Jane and PJ's last shows with the band. http://t.co/qtfu4KQe", "Sat Aug 18 23:58:21 ": "Come see us in Fairbanks tonight for \"Mountain Stage\" at Davis Concert Hall. Also featuring Pat and Robin, Steve... http://t.co/SkU0SuB8", "Wed Jan 23 23:54:39 ": "Another video for you to peruse. \nhttp://t.co/ZwTtazWb http://t.co/YBYbczoM", "Tue Aug 07 01:05:37 ": "More pics of us and other bands in La Roche France this last week!! It was sooo awesome!... http://t.co/j070Rs5s", "Tue May 22 14:37:04 ": "If you're on our mailing list, then you would've gotten an email this morning telling you about this.....our new... http://t.co/Ke3z8Ygs", "Mon Jul 23 22:00:29 ": "Singing \"Billy\" mainstage at Grey Fox!! http://t.co/ruOk4NyP", "Sun Jun 10 15:18:11 ": "Fort Collins here we come ... hope we can make it through wolf creek pass with our trailer!  - nj", "Thu Jan 31 20:03:53 ": "Show dates start tonight at Avogadros in Fort Collins. Local Mike Finders will open the show, starting at 7:30pm.... http://t.co/nCM5B5W7", "Tue Jun 19 23:26:48 ": "New gig date Raleigh! http://t.co/MiSlEbR0", "Tue Nov 06 00:12:33 ": "Working on a new website for Bearfoot tonight!!", "Wed Jul 25 20:37:12 ": "Cute Todd at Grey Fox. http://t.co/QaeowRiC", "Wed May 16 20:52:17 ": "Just added this date to the schedule! Our first time in Fort Collins folks. We'll be playing at Avogadro's Number... http://t.co/3B5up4zN", "Wed Jan 23 23:41:09 ": "Check out some LIVE footage from Riverhawk featuring Megan McCormick and Mike Bub. \nhttp://t.co/5u563ktl http://t.co/BI2aWS0s", "Tue Jun 19 23:26:26 ": "Just added this date! http://t.co/WeWwoj1g", "Thu Jul 19 17:03:19 ": "What a fun show last night at Watermelon Wednesdays in Whately, MA!  It was sold out!! Sorry we had to turn so... http://t.co/s5WKV8ZN", "Wed Jun 13 23:35:06 ": "Worked up some new songs today at the ranch here in beautiful Colorado!", "Wed Jul 25 20:36:35 ": "Grey Fox from Mainstage http://t.co/7Fw25ybA", "Tue Aug 07 00:49:59 ": "On the main Stage at the La Roche Bluegrass Festival in France! http://t.co/b3yi7J3l", "Mon Aug 13 22:03:03 ": "Come out and see us at the Fairview in Talkeetna this Wednesday! http://t.co/1GVfmd0z", "Mon Jun 11 22:21:06 ": "So we got our first suggestion for naming the new Bearfoot trailer: Bearstream. I kinda like it. Any other ideas... http://t.co/AFKepN8N", "Sat Jun 09 18:32:08 ": "We had a blast pickin at the Pagosa Folk and Bluegrass festy last night. Catch us tomorrow night (Sunday) in Fort Collins at Avogadros!", "Tue Sep 11 22:36:17 ": "Getting excited for our AMA showcase tomorrow at The Rutledge at 11pm...", "Mon Sep 17 21:34:14 ": "We had soooo much fun at Bristol Rhythm and Roots. Totally one of our Favorite festy's. Cahalen Morrison and Eli... http://t.co/wMDwfr3S", "Wed Nov 07 20:16:50 ": "getting together with Bub and Megan to jam on some music today! getting excited for Riverhawk and The Station Inn!", "Sat Jun 09 07:13:03 ": "We signed arms tonight!  http://t.co/QXSVbuV3 http://t.co/liSvfIZx", "Sat Feb 16 17:37:14 ": "We're excited to be playing at The Ellen Theater tonight in Bozeman! We'd love to see all of you Bozemanites... http://t.co/rzUuybMs", "Tue Jun 19 23:27:11 ": "We're coming back to Charlotte! http://t.co/LVYLpRxV", "Wed Jan 30 20:01:08 ": "We made it to CO yesterday, took a nap after our 20 hour drive, got some Mexican food plus green chile, and we're... http://t.co/xESCMovM", "Tue Jun 19 23:27:29 ": "We're coming back to Staunton! http://t.co/I5o92OU0", "Fri Aug 24 23:03:15 ": "I posted 12 photos on Facebook in the album \"\" http://t.co/tbTFveNx", "Fri Aug 31 22:24:04 ": "We just added three new gigs. Our AMA showcase at the Rutledge in Nashville (sept. 12 11pm), Crested Butte Center... http://t.co/hJlI2vQS", "Mon Aug 13 22:05:02 ": "Come out and see us at the Taproot this Thursday! We'll have our drummer and be ready to rock out!! http://t.co/tXWHbEK3", "Tue May 22 16:31:56 ": "New Bearfoot Music Video!!!!  Big Thanks to Dycee Wildman for her editing expertise! http://t.co/1jphnmZj", "Sat Feb 02 23:44:35 ": "The drive to Crested Butte was lovely and refreshing.", "Sat Jun 09 17:25:54 ": "Nora Jane and Ang performing \"Romance\" in Pagosa Springs, CO http://t.co/ViyD3BW9 http://t.co/bax3A8sH", "Tue Sep 25 19:48:06 ": "Get some insights into the life of times of Angela Oudean and Bearfoot by reading this exclusive interview with her. http://t.co/BGKwu3Pq", "Mon Jun 11 22:35:11 ": "Bearfoot at Red Rocks! Where's Jason? http://t.co/Dw2lO82v http://t.co/LmV4aMX8", "Tue May 29 22:26:13 ": "Getting excited to head out to beautiful Colorado next week!!!"}