{"Sat Jan 19 13:28:47 ": "A few more days work and then a quick vacation with the family.Been too long without them.", "Sun Mar 10 08:24:32 ": "see some of you in Biloxi next week for the con. Hopefully it's not to cold. Again ,as some of you may see I am flash fire tweeting again:-)", "Mon Dec 31 20:21:37 ": "COTA are the charity of the mth on Peace Fund Radio in Jan. Listn every Wed 2 hear what they do, how they do it, n what they r faced with", "Sat Jan 19 13:39:45 ": "FYI C Rica is beautiful. Bugs r only in the jungle...mainly; amazed so many of u follow my projects; Sci Fi needs reruns 2 fill time slots.", "Wed Mar 20 13:58:23 ": "I sometimes forget the lessons of my past. We all have them. But don't worry they come back to remind you that your journey isn't over.", "Wed Apr 17 04:23:02 ": "went to the Getty center yesterday. beautiful views, today the griffith observatory. Have ot show my mother the sites b4 she goes back to UK", "Fri Jan 11 00:03:57 ": "A big shout out to \nhttp://t.co/o1CBjFzH   #LEEEGGGOOTEAM\n\ncheck em out.", "Mon Dec 31 20:33:16 ": "Peace Fund Radio now accepting calls Go to http://t.co/qQ4zCkj2 and find the number. You can like us there too while ur at it.:-)", "Wed Apr 17 04:21:47 ": "r poor dog. His absess turned out 2 b a flesh eatin spidr bite. He has a hole in his face n the skin is still dyin, Antibiotics for a while", "Mon Feb 18 23:30:59 ": "Tweet tweet just spoiling the family with a box of sprinkles cup cakes . I can afford a lil indulgence. Lost weight in Costa Rica", "Wed Feb 06 00:37:57 ": "Met with producers on\"RITA\" new series, didn't get it, ah well,didnt think I was the type for the role. But it was a fun to play with.", "Wed Apr 17 17:15:45 ": "Just completed a 4.52 km run with @RunKeeper. Check it out! http://t.co/pL4L69AIau #RunKeeper", "Wed Mar 06 06:56:37 ": "Dreams never happen the way we think. They come true in other ways as we move forward through life, choosing the paths we want to tread.", "Sun Jan 13 11:32:10 ": "one bite and this little fella would cause you a few problems http://t.co/vswLxDcR", "Thu Feb 21 22:13:27 ": "Me n a highlander director. Armand Mastroianni http://t.co/JpTHXuqscq", "Tue Jan 01 01:11:55 ": "Happy New Year to you all. here's wishing you all a happy and especially a Prosperous New year .", "Sun Mar 24 02:38:03 ": "The girl boys are in the house http://t.co/QJcPGHSV90", "Mon Feb 25 19:42:12 ": "thx to all of your messages on facebk. No another Highlander is probably not going 2 happen; Bond wood hav been fun;at coastcon 3 days", "Thu Feb 21 22:46:08 ": "Mario Della Casa http://t.co/oiq5AFn6w6. Painter/artist  has a one of kinda painting that we may auction http://t.co/dlj92qyhDE", "Sun Feb 10 07:59:52 ": "Got a new iphone today, especially since my old one was falling apart. Thrown it too many time..LOL", "Mon Feb 25 19:40:03 ": "RT @aaronsapple: Thank you for the honour! @PeaceFundRadio @dollyslibrary @kidsneedtoread @adrianpaul1 @combatradio", "Mon Feb 11 00:08:04 ": "Just finished presentations for my partner Zoltan 2 take 2 Berlinal. Met with jim Donovan(dir) yesterday on one project we r funding", "Fri Mar 15 17:08:44 ": "Mating seagulls, or whatever they were doing, was my Bilox wake up 2day. Leaving for the con soon, after  quick workout n finishn some work", "Sun Mar 03 21:00:01 ": "At the Bicycle Casino for the Annual Meir Panim Charity poker event", "Sat Jan 19 13:20:33 ": "Incy wincy spider crawled down the stalagmite, icy wincy spider gave some a nasty fright http://t.co/qySV5l18", "Wed Mar 27 01:28:19 ": "Listen tomorrow for the winner of the photo caption comments on PFR http://t.co/kLwhcFL9jQ", "Thu Apr 18 04:59:22 ": "Playing cards. Worst hands ever but having an eventful evening", "Wed Feb 06 18:47:10 ": "AT la talkradio this morning, Talking with Kevin Sorbo about his connection with Fit For Kids. Check it out http://t.co/x57hV3eO", "Fri Jan 04 16:20:04 ": "in CR it's hot n humid. Havn trouble w the internet and no cell phone.  Been here for a day and no one has contacted me from prod. ???odd", "Mon Jan 07 00:52:57 ": "2day we ran into hornets, snakes, flies , mosquitos, scorpions n frogs. Lucky we have bug wranglers to ward em off. http://t.co/q0Uz4i1S", "Thu Feb 21 21:55:34 ": "http://t.co/Ft9cWw6MjV", "Mon Feb 25 05:44:34 ": "Meeting up with Lou Gossett Junior again http://t.co/DVS1K1XrKt", "Sun Jan 06 02:14:53 ": "lots of wild life here in CR http://t.co/sFbhBRaX", "Wed Feb 27 04:43:11 ": "some of my friends have created this to raise money for breast cancer, Lots of celebrities involved. Beautiful book. http://t.co/R6lpJkJNYH", "Sat Jan 05 00:33:02 ": "Beautiful day in CR. Met the director, producer n DP. None of the actors yet, but who needs em? The lighting n the shots will b beautiful:-)", "Tue Jan 08 19:24:13 ": "in the jungle on set...got some connection so I think I am going to be able  to do Peace Fund Radio tomorrow. 11am PST http://t.co/x57hV3eO", "Sat Mar 23 02:18:10 ": "Jason Ashley performing . http://t.co/X2tmlCE3nu", "Tue Jan 08 05:08:49 ": "Even a young deer came to see what we were shooting today. Got him on a long lens http://t.co/jQFgy4vQ", "Sun Mar 10 08:10:46 ": "Met with Luke Goss friday to discuss the Peace Fund Paintball extravaganza. More to come", "Sat Feb 23 01:04:33 ": "new con in March http://t.co/kSyxWfIjkY. So they said I never wet to the south. Well now I am.:-)", "Thu Feb 21 21:43:54 ": "Check the chambers out twitter/idrinkchambord http://t.co/15HfuSJjx4", "Thu Jan 17 03:59:04 ": "Missed the PFR show today&gt; Storm came in and reception int he jungle wasn;t great. But I'll be there next week.", "Sun Feb 10 08:02:57 ": "Heard that the film AE will b locked in a coupl a weeks Wow that was fast. Then there is looping n whatever other VFX there are.", "Mon Feb 25 19:44:18 ": "Stephen Macht my beloved adversary on Sea Witch will b on PeaceFundRadio this wk. C u all there, We may take calls 2.\nhttp://t.co/kLwhcFL9jQ", "Thu Jan 03 07:19:00 ": "Thanks today to Peace Fund Radio guest Kimberly Moore https://t.co/Hiu5Pxch", "Mon Feb 25 19:41:00 ": "RT @MikaylaShayna: @adrianpaul1 Thank you for stopping by for a chat with Mikayla and Shayna it was an honor! http://t.co/b977Orkqm9 @IM ...", "Sun Mar 10 05:31:28 ": "What started the day with, 'lets put this baby gate up' ended with the entire day re arranging the house.", "Wed Jan 23 15:16:12 ": "Listen in to PFR 2day. http://t.co/x57hV3eO 11am PST. Listen the shows in r archives.  I will be there live, not in the jungle this time.LOL", "Tue Jan 08 05:09:30 ": "BTW. New film is called AE a sci Fi channel movie", "Wed Mar 20 13:59:36 ": "good morning all......up bright n early working out and ready for another Peace Fund Radio show 2day. This wk's guest is Lysa Heslov.", "Thu Apr 18 05:04:44 ": "@ImVictoriaPratt stop blushing n play cards", "Sun Mar 24 01:11:03 ": "DIFFA DALLAS event to bring awareness and raise funds for Aids is a huuuuge event. More to. come http://t.co/jVq2n3GuLP", "Mon Apr 01 03:31:46 ": "4 those of you who celebrate it, I hope you all had a happy easter. 4 those of you who don't I still hope you had a  good weekend.", "Tue Jan 08 05:07:43 ": "Today it was monkeys, snakes, grasshoppers, Geicos's Ants n Bambi who paid the set a visit. But the view was worth it http://t.co/zNsBEYVL", "Fri Feb 08 07:03:40 ": "Varied day. WIth my publicist Michelle Brainstorming onPEace Fund,  Finished two presentations for Berlin festival. n changed poopy diapers", "Thu Jan 31 02:34:37 ": "Bk in LA, Bk on PFR 2day. What a different pace..LOL Kevin Sorbo coming on PFR Feb6 to talk about http://t.co/Hr4u1ziq", "Tue Mar 26 22:49:19 ": "I hate not workn,reality shows,n dbl choc cookies, alright maybe not choco cookies. Listn 2 PFR 2morrow n hear how lemonade has freed slaves", "Thu Feb 21 21:55:09 ": "MuchMalo underwear  now you know 😜pic with Shirley Schoonebeek and Jeff fressco", "Sun Mar 17 15:14:11 ": "Sunday morning.....sitting here at the con. Veeeeeerrrry slooooooooow zzzzzzzzzz. Wake me up when someone arrives", "Sat Mar 02 15:29:43 ": "roger neal OScar suites last week Interview with two young upcoming actresses, ck it out http://t.co/uAAi1sPo1E", "Thu Feb 21 22:25:38 ": "Lorimar vineard  Temecula Bordeaux blend. Nice wine http://t.co/Pm1Pmsu4Ie", "Tue Mar 12 23:49:14 ": "What is fear? Fear is what we do not know. What is hate? Hate is what we fear.\nWhat is love? Love  is the innocence in the eyes of a child.", "Sun Mar 17 19:03:17 ": "Con over. time to play some cards. Met some interesting people. Ck out Diana Rowland White Trash Zombie Writer", "Sun Mar 10 08:14:08 ": "Met w Kimberly Moore, Kimberly Moore Foundtn,Thurs 2 discuss her amazn Adopt a letter program n more co operation tween her n the Peace Fund", "Mon Jan 07 01:57:11 ": "Here's scorpion with a nasty bite. Just another on set visitor today http://t.co/7PDEV4Db", "Sun Jan 06 02:16:06 ": "as you can see the hotel accepts all types of guests http://t.co/jFBNBy4g", "Sat Jan 26 14:24:02 ": "In Tamarindo CR. great beaches, great food so far. bk home in 3 days.  Tryn to get some Pura Vida. but work still makes me use the internet", "Sun Mar 17 17:05:56 ": "some interviews at the Biloxi con  include http://t.co/B3wqTEbp7f( live now) and http://t.co/vtZibTllRR (coming soon)", "Fri Mar 15 20:17:18 ": "Biloxi con a little slow. Met http://t.co/VimfpWzjXl charity for children with Down's syndrome. Ck them out", "Sat Jan 05 00:28:33 ": "@TheCarlWeathers @MichelleCvCM happy new year to you to. Lets chat when I am back in town", "Mon Apr 22 00:27:10 ": "New Peace fund fundraiser with the David Frey Memorial fund. Ck it out if u r a golfer n on the east coast http://t.co/d8HXR0WBQt", "Mon Feb 11 21:43:16 ": "Great peacefundradio last week with Kevin Sorbo.This week Luke Goss, Hellboy, Death Race, Blade. Wed 11am PST.http://t.co/x57hV3eO", "Sun Jan 13 11:26:17 ": "a venomous snake extra we did have to pay for http://t.co/XsKGoRcx", "Fri Jan 11 02:28:29 ": "@JoshEstrin hey jah happy new yr to u too. Saw you retweeted some posts. Been busy working In Costs Rica n airing Peace Fund Radio", "Mon Feb 11 21:25:21 ": "Looks like I might be going to Biloxi March 14 for convention details to follow soon", "Sun Dec 30 01:40:08 ": "BTW for those of you who don't know I twitter much more than facebook and so my text is abbreviated to get the message across in one shot", "Mon Apr 01 03:33:47 ": "Come listen to my friend Amanda Tapping On Peace Fund Radio this week.\n&lt;http://t.co/kLwhcFL9jQ&gt;", "Mon Feb 11 21:24:35 ": "Good morning all hope you're having a lovely day", "Tue Apr 09 21:51:24 ": "Poor Dino after removing an infected abscess . A possible spider bite that got infected n grew in four days http://t.co/MTovWZHpnf", "Sat Mar 23 02:07:31 ": "In DalasS for the DIFFA event. Tonight at Cowboys Red River Saloon. Real Honky Tonk saloon .. Coool yee haaaa", "Fri Mar 29 17:05:06 ": "Sitting in on combat radio this morning. Ethan D just can't get enough of me", "Wed Feb 06 00:53:22 ": "In a coffee shop in tryn to get ATT 2 tell me how much to terminate my phones. They r  trying to ask why... Need a new phone", "Sun Mar 31 05:46:37 ": "so far 4 me the  Easter quote came from my 3 yr old Asked who taught her how 2 do a hand stand against the wall , she replied \"On Facebook\"", "Wed Jan 23 15:14:10 ": "The film is a wrap. A tuff shoot but with beauty all around. more pics soon. Had a  good time, now off to enjoy Costa Rica with the family.", "Mon Feb 18 23:27:24 ": "Los Angeles is amazing. just passed a coyote trotting down the street plane as day. No fear", "Thu Jan 10 01:45:50 ": "Monkey see .. monkey do , about 30 of them crossed over us http://t.co/E3KoozUl", "Mon Feb 25 01:45:02 ": "Me n Steven Macht walking down highlander memory lane http://t.co/122g3HAHZN", "Sun Mar 24 03:09:07 ": "18th century meets modern chic . Who comes up with this stuff? http://t.co/nzMMlVJYIG", "Wed Mar 06 06:46:00 ": "Bin a crazy few days. 2morrow we have Doctr Sharon Fried Buchalter on PFR, Physchologist, author of \"Children r People too\" plus a lot more", "Thu Feb 14 17:28:46 ": "happy valentines Day to you all", "Sat Mar 23 02:22:04 ": "Two stepping around the bar http://t.co/9Bx6lQe1AP", "Sun Jan 06 02:12:55 ": "View form my spot in CR http://t.co/zsBgsmTQ", "Mon Dec 31 20:16:37 ": "On PF Radio this Jan 2,Kimberly Moore from the Kimberly Moore Foundation. Hear how brains and passion helped her help thousands of kids.", "Sat Jan 05 15:19:28 ": "Shooting delayd cuz make up for the actress ( a three hour job) came into complications. I was up at 5, ready at 7, now bein picked up at 11", "Wed Mar 06 06:48:05 ": "Check out PFR tomorrow.I know, I say this every wk, but the show is really picking up. Listen to us at http://t.co/kLwhcFL9jQ.", "Sat Mar 16 17:01:10 ": "Billy and Andrea just married at the con here. http://t.co/QS2YSHTIIJ", "Sat Mar 23 02:26:40 ": "Jason ashley Performing http://t.co/fdMMUWDeWB", "Sat Mar 23 21:59:38 ": "Too much time on my hands before the DIFFA event http://t.co/RErccaqWP7", "Mon Feb 25 01:20:29 ": "At Night of 100 stars Oscar party.I think we're drunk already.... On water http://t.co/7UPbYkCkr0", "Mon Feb 25 01:53:07 ": "Okay so a nice pic at the Hollywood poker booth http://t.co/K2NoLuOD3v"}