{"Sat Nov 26 06:33:51 ": "Him: \"No, I know I seent u b4\" me: \"where?\" Him: \"the food court\" me: \"um nah, I don't even live here\"", "Wed Nov 16 05:58:53 ": "@scottpfit right, right...true, true", "Tue Jan 17 00:49:11 ": "RT @XSTROLOGY: #Leo is interested in more than just sex. They want love too.", "Tue Jan 17 00:54:14 ": "RT @TajTashombe: Love is the only force capable of transforming an enemy into friend. #MLK", "Thu Jan 19 19:39:53 ": "“@XSTROLOGY #Leo remember, there is no reward giving loyalty to those who do not deserve it.”", "Fri Dec 16 15:48:35 ": "“@TheDailyLove Today's Quotes: Never Hope More Than You Work! http://t.co/GuCCIMmn #TDL”", "Wed Jan 18 15:13:07 ": "“@SLIMPHATTY “@realplanetkway Trying to forget someone you love is like trying to remember someone you never knew.””", "Wed Nov 16 05:57:59 ": "NEVER LET A FRESHMA TAKE UR SPOT! #Sidra #LoveAndBasketball", "Tue Jan 17 23:55:12 ": "“@GirlDictionary I'm not even going to get mad anymore. I just have to learn to expect the lowest (cont) http://t.co/x6LlXhjK", "Thu Jan 19 19:40:05 ": "RT @TheDailyLove: The only thing that stops u from succeeding r the limiting beliefs u've bought into. Change your beliefs, take new act ...", "Tue Jan 17 23:52:42 ": "“@TheDailyLove The good news about the past is that it's over! To great news about the futre is that you can CREATE it! #TDL”", "Sun Jan 15 00:46:18 ": "“@Emeril Let's kick it up a notch @Official_Saints #whodat”", "Fri Dec 16 15:47:30 ": "“@VeldaDelavinaCa RT @BombShel Friday Follow @jasonader @juniorstrous @GigabytesOfLove (cont) http://t.co/ogo00q7D", "Tue Jan 17 00:50:05 ": "@scottpfit Awwwww Pretty Boy!!", "Sat Nov 26 06:26:14 ": "Random old guys with gold teefus trying to holla! #getthefuccouttahere", "Sun Jan 15 00:29:26 ": "@ErikaRingor I miss u", "Wed Jan 18 17:56:06 ": "“@girlposts “@GirlConfession_ i don't want to forget you.. but remembering what used to be is killing me.””", "Mon Nov 28 00:20:01 ": "@christinam5177 its ok girl, I'm still getting the gist of it as well!", "Wed Jan 18 15:02:38 ": "“@Tweet_Me2x ♥ GoodMorning, have a Blessed Day! ♥ -  @xCHILLxWILLx @BPeeda @BombShel @STRONGPACKHENRY @King_Ivey u too!", "Mon Jan 16 02:28:48 ": "“@LindsayFultz Great practices ------&gt; #HowTo Set Healthy Boundaries: 3 Crucial First Steps http://t.co/5nNGaKXW” so true!", "Sat Nov 26 06:25:31 ": "Beat boxing patients!", "Tue Jan 17 00:52:48 ": "RT @TheDailyLove: It's never to late to live, to love to or start over. All it takes is one committed decision to pick yourself up & sta ...", "Sat Nov 26 06:41:48 ": "Him: I don't know where, but I've seent u b4...but u didn't pay me any attn. Me: Hmmm, now THAT sounds like me!", "Thu Jan 19 19:37:45 ": "“@TheDailyLove Tell yourself an empowering story about what's possible for you and take action over & over again. #YoullRise #TDL”", "Wed Jan 18 15:17:00 ": "“@TheDailyLove When you take something personally you are giving a person, event or statement (cont) http://t.co/a4A46K8O", "Sun Jan 15 01:02:19 ": "@LindsayFultz Boooooooooo!", "Sat Nov 26 06:27:57 ": "“@XSTROLOGY “@FRIENDSHlP Trust takes years to build, seconds to break, and forever to repair.””", "Wed Dec 14 04:48:10 ": "@ErikaRingor Noooooo sushi! Chicken noodle soup! And Cesar!!! Yay!", "Thu Jan 19 19:36:08 ": "“@actorbrianwhite Our greatness lies not so much in being able to remake the world -- as in being (cont) http://t.co/b4sagvd1", "Tue Jan 17 23:59:42 ": "“@TheDailyLove U are not a victim of your circumstances! NO! You are a powerful creator! Choose (cont) http://t.co/gixwFfgr", "Sun Jan 15 16:28:46 ": "“@TheDailyLove If you want your life to change you are the one who has to make up your mind and do it! #TDL”", "Tue Jan 17 00:47:29 ": "RT @RelatableQuote: A good relationship doesn't need any promises, terms or conditions, just two people who can trust and understand.", "Tue Jan 17 01:02:19 ": "@ErikaRingor Or a random video they took of you at breakfast after bottomless mimosas....", "Mon Nov 28 00:38:51 ": "@christinam5177 if u got questions ask @ErikaRingor she knows this thing well....me? Not so much, lol", "Sun Jan 15 03:22:09 ": "“@girlposts “@EpicTweets_ Being ignored by the person you love is hard. But what hurts the most is how they make it look so easy.””", "Thu Nov 24 02:56:57 ": "@ErikaRingor TURKEY!!!!", "Tue Jan 17 23:51:23 ": "#RelationshipTips: Don't go lookin for the NEXT, if you still have feelings for your EX!””", "Wed Mar 07 05:19:11 ": "RT @ErikaRingor: My first lead role in a feature film that I'm producing & wrote! Follow us @TroySpeaksMovie #appreciateYOU @icedreamedfilms", "Tue Jan 17 23:55:30 ": "RT @TheDailyLove: Once you decide you want a better life the next step is to get busy becoming a more loving, open & willing person. #TDL", "Wed Nov 16 05:46:04 ": "Watching my girl @ErikaRingor do her thang on #BET #LoveAndBasketball &lt;-- favorite movie!!! Love it!!", "Sat Jan 28 04:19:48 ": "“@belleINbrooklyn “@ErikaRingor: Drinking a bomb bloody mary that @BombShel made (cont) http://t.co/fcolbgWM", "Wed Nov 28 07:27:14 ": "http://t.co/fcCu5plp There's no \"creative\" way to arrange 29 sponsor logos. Let it go, walkathon t-shirt designer.", "Wed Nov 16 05:43:57 ": "Wishing my dog wouldn't wait soooo long to eat her food! I'm soooo NOT taking her out again! Note to self...pick up food prior to 930pm!", "Sun Jan 15 18:58:17 ": "“@girlposts The cruelest thing you can do to a person, is pretend they mean more to you than they actually do.””", "Sat Nov 26 06:32:20 ": "\"Don't I know u?\" &lt;-- how's about no #sucka you wish u did!", "Tue Jan 17 23:52:00 ": "“@Tweet_Me2x “@iPinkyyyPromise #Relationshiptips; Don't let your relationship ruin your (cont) http://t.co/t2F4Kc7G", "Sat Nov 19 03:09:01 ": "@alexjreyes @Leo_Tweets soooooo true! #Leo", "Wed Jan 18 15:12:50 ": "“@ThefoodFriends \"If you want others to be happy, practice compassion. If you want to be happy, practice compassion.\" - Dalai Lama”", "Wed Nov 16 05:56:12 ": "You made a fool of me, tell me why?  #loveandbasketball", "Wed Nov 16 21:09:04 ": "@ErikaRingor @Mizter_Al can't effin wait either!", "Thu Nov 24 04:15:49 ": "@christinam5177 Girl please! I was at work till 6pm!!!!! UGH!!! Hello....a holiday!?!? WTH?", "Wed Jan 18 00:23:45 ": "RT @TheDailyLove: When someone sends hate your way, know that it has nothing to do with you & send love in return. #TDL", "Tue Jan 17 23:54:12 ": "“@girlposts When you give someone advice, they don't listen to you, and then you sit back and (cont) http://t.co/i4JUKvgi", "Wed Nov 23 05:35:52 ": "@phaester which shit hit which fan?!?", "Thu Jan 19 21:07:20 ": "@The_A_Prentice duh!", "Mon Nov 28 00:12:49 ": "@ErikaRingor I think I like tweeting now....it feels like no one is listening and I can say anything! Strange? #empowering", "Fri Feb 24 23:25:41 ": "@ErikaRingor Hi Babu!", "Sat Nov 26 06:30:03 ": "@ErikaRingor Thanksgiving Gooooooooood!", "Sat Jan 28 04:34:09 ": "“@Al_Rulez \"@ErikaRingor: Drinking a bomb bloody mary that @BombShel made me...wooweee...SPICY!\"&lt;~ watch out now!” and u know this man!", "Mon Nov 28 00:17:59 ": "Dear airport bartender, your bloody mary is good but it ain't THAT good. Close me out please, thx.", "Thu Jan 19 21:31:37 ": "@The_A_Prentice ahahahaaa! I know u do Lil, I know!", "Sun Jan 15 14:39:58 ": "“@RelatableQuote Life doesn’t change, but people do. So learn to accept that not everybody is who you thought you knew.”", "Sat Jan 28 04:19:05 ": "“@ErikaRingor Drinking a bomb bloody mary that @BombShel made me...wooweee...SPICY!” You're welcome!!!", "Sun Jan 15 00:31:02 ": "“ It isn't holding back the tears that makes you strong It's fighting back even though it hurts enough to cry.”", "Wed Mar 21 03:55:23 ": "“@ErikaRingor @TroySpeaksMovie is live! Go to http://t.co/xmJhQmT3 &amp; support any way you can.\nhttp://t.co/YJDdjYKu”", "Wed Mar 21 19:30:15 ": "“@SLIMPHATTY What happens in a relationship should stay in the relationship. Everyone doesn't (cont) http://t.co/u3dNrDHc", "Sun Dec 18 04:42:31 ": "@ErikaRingor @icedreamedfilms Get ta werk!", "Sun Jan 15 03:38:03 ": "@LindsayFultz miss you too! Yes, still playing...Sunday is on hiatus until next season. Monday just started back! Come watch or play!", "Tue Jan 17 00:55:19 ": "RT @GirlDictionary: Apologizing doesn't always mean you're wrong and the other person is right. It means you value your relationship mor ...", "Sat Dec 01 11:45:15 ": "The cops found pot on Willie Nelson's tour bus. In other news, water is wet. http://t.co/ThUWr9RA", "Sun Jan 15 16:30:59 ": "“@RelatableQuote The sad moment when you find an old conversation between you and someone you don't talk to anymore.”", "Sun Jan 15 01:05:17 ": "@serenawilliams Yesssssssss!", "Thu Jan 19 19:39:11 ": "@The_A_Prentice a woman is fertile for much less than a week, its morelike 48 hours.", "Mon Jul 30 12:46:41 ": "Best work ever!        cnbc10home . com", "Fri Dec 16 15:47:03 ": "@ErikaRingor Good morning Babu! Just sending you some morning luv...xoxoxo", "Tue Dec 11 18:14:07 ": "Started a game of hide and seek with my dad 20 years ago haha he's the best where are you man http://t.co/RUQZ4lCq", "Wed Nov 16 05:47:23 ": "@Mizter_Al eeeewwwwww! Gag me with a spoon!! Remind me to toss the pump when ur around! Lmao!", "Sun Jan 15 00:45:58 ": "“@LindsayFultz Sad stat ----&gt; More ppl in the U.S. use Facebook than voted in the last U.S. presidential election&lt;crazy!", "Tue Jan 17 00:49:36 ": "RT @TheDailyLove: \"Our sorrows & wounds are healed only when we touch them with compassion.\" - Buddha #TDL", "Sun Jan 15 03:13:55 ": "“@TheDailyLove People may not see the good in you, be good anyway. #TDL”", "Tue Oct 16 13:43:04 ": "http://t.co/THiSWFcU Marriage means always wanting to scream \"Shut the fuck up\" but instead saying \"OK honey\".", "Sat Nov 26 06:28:57 ": "HELP!!!!", "Thu Nov 24 02:58:10 ": "“@TheDailyLove When you get a NO that means there is a greater YES waiting to happen. #TDL”", "Wed Nov 16 05:49:34 ": "“@ErikaRingor “@RelateablePosts Retweet if you love the movie Love & Basketball.””", "Wed Mar 21 19:27:22 ": "“@TheDailyLove Celebrate when someone pushes your buttons for they are teaching you even more about yourself. #TDL”", "Sun Jan 15 03:09:20 ": "@LindsayFultz that it was.... :/ lol", "Wed Jan 18 15:23:07 ": "“@XSTROLOGY If you want to know a #Leo, take your time and be patient because they are selective (cont) http://t.co/r50H5PiY", "Tue Jan 17 01:18:43 ": "“@ErikaRingor “ sad moment when you find an old conversation between you and someone you don't talk to anymore.” This is what I was tombout", "Wed Nov 16 05:56:50 ": "All is fair in #LoveandBasketball right?", "Thu Jan 19 20:04:21 ": "@The_A_Prentice lol guess u could say that but, b4 u do...ask urself hv u ever been with 2 diff wmn (cont) http://t.co/dfTnJx3J", "Mon Nov 21 07:29:30 ": "“@Leo_Tweets #Leo is a driven and pOwErfuL personality not to be Fucked with”", "Sat Nov 26 06:24:53 ": "Richmond, CA Kaiser ER has to be the most interesting place in the world!", "Thu Jan 19 21:07:48 ": "@The_A_Prentice its official you r not a slut!", "Sun Jan 15 18:56:58 ": "“@Musicnerd87 its crazy, ppl really look for you to fail...when asked &quot;how's it going?&quot; (cont) http://t.co/A9ba5Qes", "Sat Nov 19 00:52:07 ": "“@ErikaRingor @BombShel FEET PAJAMA'S!!!!” &lt;--- PRETTY PLEASE? That would make me sooooooo happy! :-)", "Tue Jan 17 00:48:35 ": "@MastinKipp And I'm one of them! Can't wait!!", "Wed Jan 18 17:31:22 ": "Sometimes, you just want someone to say \"You're right\"", "Wed Nov 23 05:37:02 ": "“@phaester “@GirlDictionary Never apologize for what you feel. It's like saying sorry for being real.””", "Wed Mar 07 05:29:19 ": "Dammit! What happened to ALL MY FOLLOWERS!!!", "Thu May 24 05:09:43 ": "@ErikaRingor I &lt;3 Gabriel!"}