{"Wed Apr 10 10:09:57 ": "@usibenn We'll provide further updates as soon as we can. You can keep updated and find info and FAQ answers here: http://t.co/odch4d8ucd", "Tue Apr 16 14:35:46 ": "Test results of EU-wide beef product survey published http://t.co/vQRf2miWkg …", "Mon Apr 22 12:53:28 ": "RT @BrDieteticAssoc: Allergy Awareness Week: Find out the difference between a food allergy and food intolerance at http://t.co/HYMs2tL7Xy …", "Mon Apr 22 18:00:22 ": "RT @cumbriats: Allergy Awareness Week - we will be reminding food businesses of their responsibilities . For food allergy alerts follow @fo…", "Wed Mar 27 10:01:06 ": "@dumbledood No problem Alistair. Glad we could help! Yeah, they can take a bit of upkeep. Enjoyed reading though. All the best!", "Mon Apr 08 14:28:52 ": "Asda Tomato and Onion Dip withdrawn. Some packs may contain a Raita product - milk and egg not declared on the label http://t.co/KJ0rUtMjNT", "Fri Apr 12 15:58:28 ": "TRS recalls all 400g and 1kg bags of its Pure Milk Powder as the product was repackaged in an unapproved premises http://t.co/RHqxg1NOzA", "Thu Apr 18 13:54:09 ": "RT @supportcornwall: Get the app for checking #FHRS ratings from @foodgov before eating out this weekend or go online http://t.co/U9VAc7Xx32", "Wed Apr 17 14:20:25 ": "FSA Board agrees review into the Agency's response to the horse meat incident: \nhttp://t.co/VmonniHykN", "Tue Apr 16 16:35:20 ": "@elfiem Sorry we can't help further on this.Do get in touch if you have any more Q's. If we can't answer we'll try and find someone who can!", "Mon Apr 08 11:11:51 ": "@epeleshok @BettyKnowsYork For info, Cafe DeClare has a 5. So a thumbs up from us.", "Wed Mar 27 19:10:49 ": "@GBMofficial.  Loving the show tonight.  Good to see that the final chefs rate well on #FHRS Well done all! http://t.co/TSOxkkWM2O #GBM", "Fri Apr 12 11:36:51 ": "@spartacus303 GM foods and feed that have been authorised in the EU are as safe as their non-GM counterparts.", "Thu Mar 28 12:54:34 ": "@farnazkhan @M1LA_11 You could complain to the business or talk to local trading standards. Thanks again for your messages (2of2)", "Thu Mar 28 12:54:58 ": "@mandaemily @WharfeValleyOil Congrats!", "Wed Apr 10 10:24:48 ": "@mcewenb Hi Mike: You can keep updated on our investigations, and find more info from the Chief Medical Officer here: http://t.co/vExRMykHq4", "Fri Apr 12 11:21:16 ": "RT @ClubGolfScot: Find out how our work with the @foodgov HHEAPS programme is delivering a healthy message in Scottish Primary schools.  ...", "Mon Apr 08 12:01:19 ": "RT @MikeGalloway: @foodgov @puffles2010 @jessbrammar Some places have more proactive info - eg @EatSafeWalsall  &amp; based on that by m ...", "Mon Apr 15 11:14:18 ": "@AberdeenButcher Thanks for getting in touch and for the suggestions Andrew!", "Thu Apr 11 15:16:10 ": "@ighliverpool Hi! Yes! #FSW2013 is 10th to 16th June. There is going to be lots of good stuff to get involved with too. More info soon!", "Wed Apr 10 08:32:52 ": "@slickwend Hi Wendy, It's been found in 340g tins of Asda Smart Price Corned Beef. More info here: http://t.co/QslCzwbQWx", "Mon Apr 22 17:02:01 ": "It’s Allergy Awareness Week. Sign up to our Allergy Alerts to find out when a food is withdrawn or recalled http://t.co/WuKaGCJTBy", "Mon Apr 15 08:47:53 ": "@scotwalker40 Hi Tracy. Thanks for sharing the link.", "Fri Mar 29 21:45:40 ": "McCoy's multi bag crisps recalled due to possible contamination with small pieces of plastic. http://t.co/nrsFOUtQBX", "Mon Apr 08 11:08:47 ": "@epeleshok @BettyKnowsYork Here's a link to our handy web tool and app! Hope you have a nice lunch :-) http://t.co/B8aLzY4MrJ #FHRS", "Thu Mar 28 09:47:05 ": "@responsibletw Hi there.Thanks for the message. More info on the #horsemeat investigation &amp; how to keep updated here: http://t.co/l0CficsYM8", "Thu Mar 28 12:51:35 ": "@farnazkhan @M1LA_11 Hi there. We do understand your concerns but can’t give personal legal advice. (1of2)", "Tue Apr 23 15:00:58 ": "The FSA also funds a programme of research looking at how you buy food when avoiding #allergies and #intolerances http://t.co/yirlSh1A9S", "Wed Mar 27 16:25:44 ": "Planning an #Easter eggstravaganza with friends or family? Set a great eggsample  with these tips from @nhschoices http://t.co/AqAFNqvijN", "Tue Apr 02 16:20:03 ": "Next FSA open Board meeting is Wed 17 April, in Cardiff. You can attend in person or watch it live online http://t.co/arFDr0hC7w", "Tue Apr 09 15:09:25 ": "The FSA confirms results of 4 of the remaining 5 samples under Agency’s UK-wide sampling programme of beef products http://t.co/xPImcIFqDA", "Mon Apr 22 12:18:28 ": "It's Allergy Awareness Week this week. Have you seen our interactive training tool for local authorities? http://t.co/eqsku7Ymn1", "Tue Apr 23 15:41:55 ": "Allergy alert as EH Booths withdraws some batches of roasted monkey nuts, because peanuts aren't declared on label: http://t.co/ViCaiyw7Od", "Sat Apr 13 11:52:47 ": "Three varieties of Thorntons Smiles Glass Jars recalled due to possible contamination with small pieces of glass http://t.co/Wcdva8VzBi", "Thu Mar 28 15:42:29 ": "We'll be away for the Easter break after today. However you plan to celebrate, Happy Easter to all :-)", "Fri Apr 12 11:21:43 ": "Asda recalls its Deli Pork And Egg Slices with an incorrect 'use by' date of 17 August 2013 http://t.co/r8zuhYLT0H", "Fri Apr 12 11:05:01 ": "Views wanted on use of two algal oils as novel food ingredients http://t.co/WFadFmIWdS", "Wed Apr 10 10:07:18 ": "@usibenn Thanks for your qs. We are continuing with our investigations alongside the relevant authorities and other governments depts.", "Wed Mar 27 18:01:57 ": "Eating out this Easter Sunday but not booked anything? Hop to it ;-) Check the hygiene rating http://t.co/lmelaQtqAq #FHRS", "Wed Apr 10 08:36:29 ": "@brianne_r Hi Brianne. You can find more advice for consumers and links to info on bute and FAQs here:", "Wed Mar 27 17:13:56 ": "Hi Rich - hear you're joining #GBM tonight. Wishing you (and everyone else taking part of course) all the best of luck :-)", "Mon Apr 15 15:17:01 ": "RT @ACO_BD: For an introduction to HACCP read this handy guide on the Food Standards Agency website @foodgov http://t.co/0azPCb0dYe", "Thu Apr 04 12:16:21 ": "@dobowet Hi there. Well spotted. We nearly missed the caveat on the 'controls' too. It's noted at the bottom of the article... (1of2)", "Mon Apr 22 15:30:28 ": "Think you might have a food #allergy? If so, check out this list of symptoms on @NHSchoices  http://t.co/k4MSmaAwCa", "Wed Apr 10 08:30:48 ": "@bobski_official Hi Bobski. You can keep updated, find out more about the investigation &amp; the work we're doing here: http://t.co/OkUDp3a9oa", "Fri Apr 05 12:09:28 ": "FSA Board meeting papers published. You can attend the meeting on Wed 17 April in person or watch it live online http://t.co/pOWj7ATqcS", "Fri Apr 19 11:05:49 ": "Asda Chosen by You Chicken &amp; Mushroom Noodle Pouch withdrawn. Contains prawns not declared on the label. http://t.co/Cbh2T8zSar", "Wed Apr 10 10:03:53 ": "@bobski_official Our advice page: http://t.co/0Nj9LICEYv lists the Bute testing status of all products found to contain over 1% horse meat,", "Tue Apr 09 13:00:34 ": "@divinefoodco Hey guys! Congrats on your 5. Great stuff! #FHRS", "Fri Apr 12 12:51:10 ": "@judicature Keep track of results and testing status here: http://t.co/hvr84GYdwK", "Thu Mar 28 12:54:44 ": "RT @MandaEmily: @WharfeValleyOil You're listed on here and you are rated 5! The highest food hygiene rating you can get! http://t.co/Dpv ...", "Tue Apr 09 10:20:56 ": "A great campaign. Check it out! RT @suffolkts: #CheckItTuesday our campaign raising awareness of recalled products http://t.co/IIId0w8pnK", "Fri Apr 12 11:20:51 ": "@lathamhelen Hi Helen.Sorry for the delay. You need to contact your LA first. More info and a handy finder tool here: http://t.co/41PDE9bxiP", "Wed Apr 10 08:22:49 ": "@dsbachas Hi Darshan. You can find out more about testing and get alerts and updates via our website here: http://t.co/gEdWgtQc6V", "Wed Apr 10 10:04:13 ": "@bobski_official We update the page as soon as results are confirmed. Most have come back negative, but we're still waiting for a few.", "Tue Apr 23 10:47:44 ": "Views wanted on chia seeds. We've had two applications for them to be approved for use in EU as novel food ingredient http://t.co/FfmriJQMOX", "Wed Apr 10 10:19:32 ": "@slickwend No problem. You can check the products found to contain horse meat and the Bute testing status here: http://t.co/cKmPx05Czo", "Fri Apr 12 11:35:31 ": "@spartacus303 However, there are no techniques currently available to consistently detect the presence of DNA fragments (1of2)", "Thu Apr 11 15:38:25 ": "@spartacus303 For more info please see: http://t.co/QrKgyHfZif", "Tue Apr 16 16:36:04 ": "RT @TheVeganSociety: Free vegan food giveaways? Make sure every visitor leaves happy: Do HACCP! Handy  @foodgov guide here: http://t.co/ ...", "Mon Apr 22 13:48:33 ": "RT @Anaphylaxiscoms: Great interview with @Jo_Frost talking about life with severe allergies. Such an inspirational outlook...go Jo! http:/…", "Tue Apr 23 08:50:16 ": "@judicature That's why we asked industry to test for horse DNA and tell us if results show 1%. Results published here http://t.co/zJKcL5k5en", "Fri Apr 12 12:47:57 ": "@judicature Following agreement of our investigation plan, we have always published results as 'above 1%' More info: http://t.co/q0HUA97LgT", "Mon Apr 15 11:45:04 ": "@elfiem This is likely to some extent, but exposure would be more than 100,000 times lower than if mum took this or other #NSAID as medicine", "Mon Apr 22 13:41:18 ": "RT @AllergyUK1: Don’t forget to tune into @Daybreak every morning this week for the allergy special! #LetsFightAllergies together!", "Tue Apr 23 08:47:30 ": "@judicature We identified 1% as a pragmatic level above which we think contamination would be due to gross incompetence or deliberate fraud.", "Tue Apr 09 17:48:06 ": "Food Standards Agency - Very low levels of bute found in Asda ‘Smart Price Corned Beef’ http://t.co/b2MUJy1Y29", "Tue Apr 09 10:18:48 ": "RT @SerenaBroadway: Lots of funding partners for Nutrition for Life 2013: including @innovate_uk @scotent @epsrc @esrc @MRCcomms @foodgo ...", "Sun Mar 31 09:20:10 ": "However you are celebrating Easter, have a great day! :-)", "Fri Apr 12 11:14:05 ": "@thebeardedllama Hi Steven - sorry for the delay. Just checking with policy teams - back shortly ;-)", "Fri Apr 12 16:09:21 ": "For those of you in Northern Ireland, Kingshill Bakery products recalled due to possible rodent infestation http://t.co/2smdwpJQKk", "Mon Apr 08 11:02:24 ": "@puffles2010 @jessbrammar Good advice from Puffles! You can also check the hygiene ratings of restaurants here: http://t.co/B8aLzY4MrJ #FHRS", "Mon Apr 15 09:58:01 ": "RT @ScampaignShrops: Make sure you check all the latest #Food alerts from @foodgov  http://t.co/ySRxFlKWbg. #foodsafety", "Mon Apr 22 12:16:55 ": "RT @hstofficial: New to food catering? Download the @foodgov Safer Food, Better Business info pack to get you started http://t.co/xWf9r24w4H", "Wed Apr 10 08:27:16 ": "@teesfire Hi there. You can find more info about Bute and answers to some FAQ's on our site here:  http://t.co/NuatR4rO1z", "Fri Apr 12 11:36:03 ": "@spartacus303  in animal products, such as meat, milk, eggs, where these animals have been fed GM feed. (2of2)", "Thu Apr 04 12:19:08 ": "@dobowet It says the experiment carried out  was more extensive than shown and included controls which the results were compared with (2of2)", "Sat Apr 20 09:27:03 ": "Iceland recalls Chicken Shack - Half Chicken Chinese Five Spice 500g as best before date on it is too far in future: http://t.co/spoFgb8vIy", "Mon Apr 22 13:45:24 ": "This Allergy Awareness Week make sure you're following our friends over at @NHSChoices @AllergyUK1 @Anaphylaxiscoms @Coeliac_UK @asthmauk", "Tue Apr 23 12:40:42 ": "Here's another research project we're funding to see if the things you eat as a child influence food #allergies later http://t.co/KHM8e4ofz4", "Fri Apr 12 11:34:45 ": "@spartacus303 Improvements in detection means that tiny amounts of GM plant DNA could be detected in products from animals fed on GM crops.", "Thu Mar 28 11:20:56 ": "Have you checked out our eggsellent #FHRS website yet? It's better than our #Easter puns...promise! http://t.co/B8aLzY4MrJ", "Tue Apr 23 13:35:12 ": "@Shukorama Hey Steve, all our info is here http://t.co/q8OiERtXAZ Nutrition no more our remit. Maybe DH can help?", "Thu Apr 11 15:35:07 ": "@spartacus303 Hi. It’s just not that simple: absolute safety can never be guaranteed. But risk is extremely low at the level detected.", "Tue Apr 23 08:30:39 ": "Did you know we’re funding research aiming to see if the things you eat as a child influence food #allergies later? http://t.co/dUYKQJpH7L", "Tue Apr 09 12:59:42 ": "RT @divinefoodco: ITS NOW OFFICIAL Check out the food hygiene rating for Divine Food Company Limited http://t.co/xmxusl1T9U via @foodgov", "Tue Apr 16 16:30:25 ": "@elfiem Hi there. Thanks for getting back in touch. Not trying to avoid, but @dhgovuk might be better placed to answer this one for you :-)", "Wed Mar 27 17:31:22 ": "Have you checked out our eggsellent #FHRS website yet? It's better than our #Easter puns...promise! http://t.co/mSAy6XtHEm", "Thu Mar 28 09:32:44 ": "RT @biloddy: The @WodcNews Food Inspectors were out tonight in #Witney &amp; #Carterton. They do a great job with @foodgov keeping us al ...", "Mon Apr 08 12:01:44 ": "RT @MikeGalloway: @foodgov @puffles2010 @jessbrammar Better still is Norwich which publishes all reports by default http://t.co/CG2j83ja ...", "Wed Mar 27 11:01:31 ": "Never mind Easter bunnies, at the FSA we know food bugs multiply quickly. If you’re eating out, check the #FHRS http://t.co/6SvWzEFMi7", "Mon Apr 22 14:35:59 ": "RT @Nutfreeday: @foodgov and National Nut Free Day 3 May 2013 to raise awareness and provide support (Please RT)", "Mon Apr 15 08:59:07 ": "@judicature We only publish results as above 1% on our consumer advice page. More info on this approach here: http://t.co/RXdKIKDBTD", "Wed Mar 27 12:12:09 ": "@aco_bd Thanks for the invite. We'll check it out when we get a mo ;-)", "Thu Apr 11 12:39:43 ": "@foodjezebel Hi. Sorry for delay. Local councils can only apply for the costs of the case and the rest goes back into the courts.", "Wed Apr 10 10:15:51 ": "@usibenn  The CMO has said that the risk to human health is ''very low''. Check out more info on this here: http://t.co/TY2QJdYrb5", "Tue Apr 23 15:35:40 ": "Final result for FSA's sampling of beef products finds that the product does not contain horse DNA at or above 1%: http://t.co/43L7kpFcXB", "Tue Apr 02 11:01:54 ": "Are you a firm believer in the '5-second rule'? Take a look at this and see if it changes your mind! http://t.co/PMJ91ieP5J", "Mon Apr 08 11:23:32 ": "The Scottish Food Advisory Committee of the FSA will be meeting in Aberdeen tomorrow (9th April) – more info: http://t.co/HnJ3D8CX6u", "Mon Apr 08 11:05:38 ": "@puffles2010 @jessbrammar If you want to report a complaint, your local food safety team can help. Handy finder here: http://t.co/DnA6NCck6j"}