{"Sat Feb 16 23:52:26 ": "@whatamindblast no ticket yet. guess i should though. you going on monday?", "Sat Apr 20 01:02:10 ": "Happy Record Store Day! Whats your most prized vinyl? Here's one of ours... http://t.co/L3fYfQ9pUn", "Mon Feb 25 22:13:20 ": "@MissSoot much appreciated for sending through those documents!", "Thu Mar 14 02:50:18 ": "@Tom_Roberts1989 yeah dude we do", "Sat Mar 02 02:35:07 ": "Being on a big tour one has to keep your ego in check. Lucky this chemist was able to help us out. http://t.co/nS45r6QtjS", "Sat Feb 16 11:40:32 ": "addicted to love is a battlefield.", "Sun Mar 17 10:05:39 ": "We jut came off stage at the Enmore, Birds Of Tokyo up next! @ Enmore Theatre http://t.co/4UQnxuzKJx", "Mon Mar 18 09:44:25 ": "@Gav9 @BIRDSOFTOKYO hey Gavin!  we've been going on at 8.50pm some nights and 9.20pm some others... will let you know when i find out!", "Sun Feb 24 23:52:34 ": "before embarking on gruelling tours with @BIRDSOFTOKYO we like to unwind by um chopping up and making collages. http://t.co/U1epRUxGxR", "Thu Feb 28 01:02:56 ": "@adamnotevetwita yes we are in Victoria. Currently in a van on our way to Frankston. Loving the overcast weather and truck stops.", "Mon Feb 18 04:06:57 ": "@Sose_Carter awesome, would be great if we could fit it in!", "Thu Feb 14 11:24:33 ": "@jillianparkes awesome i have a wardrobe of St Vinnies stuff. will go smell now.", "Thu Feb 28 09:13:19 ": "Third Eye http://t.co/loMaN8AGAB", "Fri Mar 22 01:11:57 ": "Hotel room jams in Brisrael http://t.co/QDxrxTI5jr", "Thu Feb 28 01:28:18 ": "@adamnotevetwita yeah playing Frankston tonight, Traralgon tommorrow then Melb saturday and sunday with @BIRDSOFTOKYO", "Sat Mar 02 14:06:44 ": "@MissSoot venue has bad reception! Thanks for coming think I saw you in the crowd...we'll be kicking round Melbourne tommorrow in any case..", "Sat Feb 16 11:39:09 ": "if i could turn back in black betty.", "Thu Apr 18 23:42:59 ": "Storm Thorgerson. Old buddy old pal. You did good. See you again someday soon.  Thanks for hanging out that day. http://t.co/0oj7kNIgxA", "Tue Mar 05 04:49:08 ": "@sootmag Book called Moonchild of Yesod. Available here...http://t.co/Mv7uwzx6MQ  free download or hardback. We recommend hardback though!", "Sat Feb 16 11:42:15 ": "@georgiecel ha ha. i swear at the time you tweeted i was working on 'all you need is love me do you want to know a secret.'", "Thu Feb 28 02:04:25 ": "@MissSoot No problem. We will have shirts and vinyl for sale.", "Thu Feb 14 22:36:54 ": "going to...hotel...girls...?   the answer was California. as in going to california..hotel california and california girls...#musicgeek", "Wed Mar 20 02:33:47 ": "RT @JemNott: Here's my review of @birdsoftokyo, @regularjohnband and @theGuppiesband at the @enmore_theatre on @MoscaMediaOz  http://t.c ...", "Thu Feb 14 22:23:02 ": "going to....hotel...girls...I might need some help, think I'm missing a word?", "Sun Feb 24 23:42:06 ": "@teganvictoria hey Tegan... will know closer to the date. could be likely though.", "Mon Mar 04 23:19:11 ": "Current tour bus literature... http://t.co/JGadclznKH", "Mon Apr 08 23:30:26 ": "RIP Margaret Thatcher. Thanks for the all the awesome songs and albums you inspired. http://t.co/jBNEkTERQ2", "Fri Mar 01 05:33:21 ": "Nothing says 'on a rock n roll tour' like milk &amp; cookies in the motel. On 8.50pm tonight w/ @BIRDSOFTOKYO, Traralgon http://t.co/yRq2EgwioW", "Sat Feb 16 11:37:01 ": "stairway to heaven is a place on earth.", "Sat Feb 16 02:21:53 ": "Rush. Please enjoy your journey and dare you not to smile.   http://t.co/tSllKiEM", "Mon Apr 22 04:32:15 ": "We're out of our post tour hibernation! Next show: May 9th at The BackRoom Sydney with Siamese Almeida &amp; TheChitticks http://t.co/imipQcjbKl", "Fri Apr 12 12:18:04 ": "I swear, he's everywhere I look these days. http://t.co/niArJGJPQg", "Sat Mar 09 12:13:18 ": "@Sose_Carter thanks Sose! all good, king brown was discovered hiding in the van, he has been safely returned to his family.", "Fri Feb 22 02:42:51 ": "Another simple cut and paste job. The collage craze continues... .http://t.co/ch83PRAh5Q", "Fri Mar 01 03:42:22 ": "Jackson Five brought me back to life.", "Thu Mar 14 23:42:55 ": "@tpatroy damn that looks nice.", "Mon Mar 18 22:43:26 ": "RT @Tim_Lockhearts: Watching @milesdevine 'the dancing guitarist' rock out with @regularjohnband  at the enmore on Sunday was… http://t. ...", "Wed Feb 20 01:13:04 ": "Letting the mind out for a walk by making collages. Scissors, glue, old books. Create chaos, reassemble into order. http://t.co/FwSdxVp6", "Mon Mar 18 01:24:45 ": "For anyone who missed the Enmore shows, it looked a little something like this! Photo by http://t.co/bP5x4nwSlN http://t.co/7Z5xkKXfdG", "Wed Mar 20 02:44:06 ": "RT @the59thsound: Our photos of @BIRDSOFTOKYO, @RegularJohnBand and @TheGuppiesBand at the @Enmore_Theatre are now online! RT http://t.c ...", "Wed Feb 20 01:15:29 ": "@NevskyBand Gentle Giant...awesome band. haven't heard that album though. will check it out. thanks!", "Mon Mar 11 05:13:22 ": "RT @theAUreview: Live Review: @BIRDSOFTOKYO + @RegularJohnBand + Sincerely, Grizzly @sncrlygrzzly - HQ, Adelaide (05.03.13) http://t.co/ ...", "Fri Apr 12 04:10:15 ": "RT @planetsinmotion: Top 3 discs spinnin in the car @RegularJohnBand 'Strange Flowers', @HeyGeronimo self-titled EP, @alt_J 'An Awesome  ...", "Mon Feb 25 22:44:22 ": "One of the best Bowie songs you've never heard. Crystal Japan. http://t.co/jMDCq58Wr9", "Thu Feb 14 22:45:06 ": "@flea333 it's where we all came from too.", "Fri Apr 12 11:23:01 ": "The guy at the bottom of this pic haunts my dreams. http://t.co/4xbjUol5Nz", "Fri Mar 01 03:47:36 ": "Frankston has more guitar stores and pawn shops than any other town I've been to in Australia. I'm sure they are working together.", "Thu Feb 28 01:15:32 ": "Poverty Point, Ballarat. No gold was found. Poverty is still a reality.. http://t.co/S7w7FY8u1d", "Mon Apr 08 23:41:53 ": "Iron Maiden. Says a lot when this is your nickname. http://t.co/AC6JcTEir6", "Tue Mar 12 00:03:46 ": "@tpatroy absolutely. i knew it broke down for a reason. and the reason was that comic book. well worth it!", "Sat Feb 16 23:35:19 ": "RT @SGSNSteve: Bittersweet Symphony Of Destruction? RT @RegularJohnBand: addicted to love is a battlefield.", "Sat Mar 02 04:13:47 ": "@teganvictoria hey tegan can you message the name of your buddy?", "Mon Mar 04 22:07:41 ": "Up bright and early this morning to head to Middle Earth for some recording while we're in Adelaide. It's hot too incase you are wondering.", "Thu Mar 07 00:36:39 ": "@Sose_Carter Eight hours from Sydney. It's not so bad though. Locals are friendly. One of them even knows our music. He calls us \"the boys\".", "Sat Mar 02 04:18:17 ": "@MissSoot yes indeed. We are on at eight fifty.", "Sat Mar 16 01:16:21 ": "Nice to wake up and know there's no driving for gigs today or tomorrow. Two nights at Enmore Theatre with @BIRDSOFTOKYO. Special.", "Mon Apr 22 06:07:58 ": "RT @ReckoningEnt: JUST ANNOUNCED: @RegularJohnBand have will be playing a very intimate show on May 9 at The BackRoom in Sydney", "Sun Mar 17 22:49:20 ": "@BobEvansMusic damn. we need to get on twitter more often. would have put you on the guest list if we'd seen this!", "Thu Mar 14 23:08:27 ": "@themoneygo tour has been awesome. about half way through. heading to Newcastle tonight then two shows at the Enmore over the weekend!", "Fri Mar 01 12:21:24 ": "I dig checking out historical monuments in different towns. Touring Australia ain't a bad gig. No puns intended. http://t.co/sM4RmhoJjc", "Sat Mar 02 04:24:23 ": "@MissSoot yep yep no problem.", "Fri Feb 15 12:07:07 ": "@georgiecel can't be a bad thing? unless you actually do try, in which case i'd imagine you might die of exhaustion. rocking exhaustion.", "Thu Mar 07 00:33:09 ": "Broken fuel pump en route to Sydney from Adelaide. Three day wait for repairs. Universe is cackling. So are we.", "Mon Feb 25 22:09:49 ": "Woke up this morning and realised...we start our tour with @BIRDSOFTOKYO tomorrow. Expect many updates and requests for good driving music", "Thu Feb 14 22:51:05 ": "@whatamindblast damn i totally missed that one.", "Thu Feb 28 01:02:48 ": "@MissSoot yes indeed I beleive it is possible. Which date is best?", "Fri Mar 01 12:03:25 ": "Backstage with Captain Jack Sparrow in Traralgon with @BIRDSOFTOKYO http://t.co/08HuJbWnhj", "Mon Apr 15 23:23:59 ": "Very confused this morning. Who put who in the what now? #bostonMarathon http://t.co/bolXc7lUpE http://t.co/YKNqxsiVqd", "Fri Mar 22 05:55:08 ": "RT @NevskyBand: Was rather nice hearing Time Machine by @RegularJohnBand on @triplej this morning on the drive to hell/work.", "Fri Mar 22 05:55:15 ": "RT @Ben_Preece: @RegularJohnBand are quite remarkable! Ashamed to say last night was the first time I've seen them @NikTropiano", "Thu Feb 28 11:16:32 ": "Frankston, I've heard what people say but you ain't too bad a place. Thanks for having us this evening.", "Fri Mar 01 05:36:50 ": "@teganvictoria hey buddy will know for sure tomorrow hope that isn't too late!", "Tue Feb 26 00:34:28 ": "RT @sootmag: Dudes, we have our @BIRDSOFTOKYO interview going up this morning!And they hit the road with @RegularJohnBand tomorrow! Firs ...", "Thu Feb 28 07:10:13 ": "RT @cstrzadala: Can’t get enough of the @RegularJohnBand album ‘strange flowers’.", "Fri Mar 08 09:52:20 ": "RT @Sose_Carter: Goes to HQ to review, ends up wanting to kill vapid door mole. Again. @sncrlygrzzly, @RegularJohnBand &amp; @BIRDSOFTOK ...", "Sun Mar 17 23:45:21 ": "@BobEvansMusic ah shucks. was our best show of the tour so far too! hit us up next time we're playing if you're still keen!", "Fri Feb 15 11:14:54 ": "Spending time in an Animal Kingdom this evening with two very different beasts. Are there any Animals missing? http://t.co/Ztg922Gd", "Thu Mar 14 02:58:43 ": "@AndrewPStreet totally agree. our last album was ten tracks for those exact reasons.", "Wed Feb 27 01:51:57 ": "Oh Hai, creepy Ballarat motel bed! #ontour http://t.co/ypUmhNPk9A", "Mon Apr 15 04:10:12 ": "I swear the less I'm on twitter the more followers we get. Strange world.", "Mon Mar 11 23:50:47 ": "Having a van break down isn't all bad. You can find Pope comic books in second hand book shops while you wait... http://t.co/f5gfIwsGtz", "Fri Mar 22 01:04:41 ": "Damn, Brisbane you make for a fine crowd. We're now raiding your record &amp; book stores. See you again tonight. x http://t.co/h95xfLrfwu", "Sat Mar 23 00:49:57 ": "RT @Gav9: Awesome gig last night @RegularJohnBand - the new songs sounded great! http://t.co/ikSGKVDYUr", "Mon Mar 18 22:50:08 ": "Some propaganda it's okay to believe in. http://t.co/5SkM1zF2wx http://t.co/40VL242j4N", "Fri Apr 12 09:22:42 ": "@WhippedCreamAU Revealed: The men in front of the curtain. http://t.co/25920tcP6q", "Wed Feb 27 10:39:33 ": "Fuckin' #rush http://t.co/RNE8s69K4I", "Thu Feb 14 09:50:13 ": "the power of love is the drugs don't working for the man", "Sun Mar 10 02:13:22 ": "Shane Clark from Buckshot Photography caught our set in Traralgon, VIC. Check out pics here: http://t.co/c9QsdpPNGh http://t.co/O320N5J5hP", "Thu Mar 07 00:29:32 ": "Second day of limbo in Balranald with van still broken down. Think I might I might swim in their river.", "Wed Mar 20 02:44:33 ": "RT @GroupieMagazine: Our snaps from @BIRDSOFTOKYO &amp; @RegularJohnBand at the @Enmore_Theatre on Sunday are now up: http://t.co/akXc0W ...", "Sat Mar 16 07:35:26 ": "Chilling in the air conditioned Enmore Theatre. We start our set at 8.20pm. See you there.", "Fri Mar 01 07:09:18 ": "Yo dawg I heard you like mirror balls.. #traralgon http://t.co/V7n3SZkBOa", "Mon Apr 15 23:32:06 ": "RT @tpatroy: @RegularJohnBand The world spins while we sleep, thus we arise to confusion.", "Sat Feb 16 11:37:35 ": "two out of three ain't bad medicine.", "Thu Mar 14 10:44:23 ": "Mercury Inflation. Queen of all currency. image from http://t.co/69d0goK7fR http://t.co/pMKTsR0vRl", "Sat Feb 16 11:43:41 ": "@georgiecel That's a tie i think. You did really good. Game needs a name.", "Tue Apr 23 01:37:53 ": "RT @sludgefactory11: @RegularJohnBand announces special Sydney show http://t.co/wpa8Irp5hS", "Sat Mar 09 22:55:28 ": "@doppelganger47 glad you enjoyed it. Adelaide was one of the best shows on the tour. even if our van broke down about eight hours later ;)", "Thu Feb 28 00:56:46 ": "Ballarat. We loved your monuments to gold, your salvation army stores and your music appreciating population. #ontour @BIRDSOFTOKYO", "Tue Mar 05 04:53:56 ": "Just recorded two sneaky tracks to tape #liveatTwinEarth studios in Adelaide before our show with @BIRDSOFTOKYO. http://t.co/Qs7sboyOBG"}