{"Mon May 28 20:56:51 ": "Saved something for you @nodirectionhomefestival http://t.co/mw87gzXW http://t.co/DsNcpurN", "Sat May 19 18:23:37 ": "Me, @bermudabriangle, the Thermals, and Twin Sister tonight at Carleton College.  http://t.co/7vTqBAmo http://t.co/1wZ86LVS", "Wed Jul 11 18:20:48 ": "Do to reasons beyond our control our performance at SoundTown has been cancelled.", "Tue Jul 03 18:42:11 ": "I googled \"how to retweet\" just now.  Leaving the office.  Great work guys.", "Tue Jun 05 19:00:06 ": "♫ Tomorrow: London, United Kingdom - Jun 6 at Slaughtered Lamb http://t.co/Y3C827EW", "Thu May 17 19:59:52 ": "♫ New Date: Brighton, United Kingdom - Jun 10 at Theatre Royal Brighton with Andrew Bird http://t.co/hXvNi2Nb", "Tue Mar 19 17:55:17 ": "PWC in MPLS / STPL Thurs. http://t.co/YbxExZXFK9", "Thu May 31 12:42:35 ": "Tonight at Primavera we play at 7:15pm at the Vice Stage. Hello Barcelona", "Sat Jun 09 19:01:08 ": "♫ Next Week: Milwaukee, WI - Jun 16 at Cactus Club with Free Energy http://t.co/RlgJBx6I", "Mon Jun 11 20:01:22 ": "WED we're at Triple Rock Social Club. $7 cover, 18+, 8pm Doors, Prissy Clerks at 830pm, followed by The Blind... http://t.co/qegCVqT0", "Thu Sep 13 23:21:40 ": "We regret to inform the good folks of Eau Claire that we have cancelled our shows that are taking place this... http://t.co/sY31EVC0", "Thu Jan 10 02:58:11 ": "I could play basketball to this song for ever. http://t.co/Bwnk2bAH", "Fri Jun 15 15:00:45 ": "Madison tonight, Memorial Union Terrace, we're on at 11", "Tue May 22 15:10:47 ": "♫ New Date: Somerset, WI - Jul 26 at Sound Town Music Festival http://t.co/rTkTtAVG", "Thu Jun 07 19:01:16 ": "♫ Next Week: Eau Claire, WI - Jun 14 at Summer Concert Series http://t.co/NCKtgq9E", "Tue Jul 03 18:38:52 ": "RT @humorherald: Holiday Undercover 2011: Peter Wolf Crier cover &amp;quot;Last Christmas&amp;quot; http://t.co/hkJg0gpd", "Fri Jun 08 17:46:18 ": "All we're saying is nexxxt Wednesday, music is going to start at 830pm (and be done early) and along with the $7... http://t.co/pWaflmw9", "Thu Dec 06 17:04:50 ": "Show coming up in Eau Claire!\nhttps://t.co/FATPliJD", "Fri Nov 02 16:47:36 ": "For the next 2 weeks, our label Jagjaguwar will donate $1 from every purchased from their mailorder to Red Cross... http://t.co/mkz9qhgr", "Sun Jun 03 19:00:42 ": "♫ Next Week: Brighton, United Kingdom - Jun 10 at Theatre Royal Brighton with Andrew Bird http://t.co/wsJKBily", "Fri May 11 19:03:36 ": "♫ Who's Coming?: Derby, United Kingdom - Jun 8 at No Direction Home Festival http://t.co/rHVvr8fO", "Thu Jun 07 19:27:17 ": "NEXT WEEK: Triple Rock on WED, Eau Claire on THR, The Terrace at UW Madison on FRI, and Cactus Club on SAT, look... http://t.co/OecQRdzt", "Tue Jul 03 18:30:37 ": "Bastille Day is July 14th I think in Minneapolis. And I'm shooting great from behind the line. http://t.co/QXUF3ysd", "Tue Aug 21 15:20:40 ": "Peter sang and played guitar on a cover of a Red Hot Chili Peppers song with the band Blessed Feathers.  Listen to... http://t.co/07q3XWoN", "Mon May 28 20:49:11 ": "Hoopin in preparation for @primavera. It's as hot as a boy band in America.  http://t.co/ZD1DLVZ7 http://t.co/tQwp5GtV", "Wed May 23 16:07:10 ": "Why so serious?  Cut loose with a video of Brian and I playing out the back of a van through a microphone in my... http://t.co/YATCr4Ir", "Sat Jun 02 11:13:26 ": "\"I don't feel like a human right now\" @bermudabriangle http://t.co/y3cLVwuV http://t.co/bdYBvp0n", "Thu Jun 14 21:56:16 ": "Eau Claire's outdoor show has been cancelled due to golf ball-sized reasons.  Go OKC.... http://t.co/xIytG8q6", "Tue Jul 03 19:01:59 ": "Bastille Day. July 14. Working hard.  http://t.co/eB3mIJcg", "Tue Jul 03 18:38:26 ": "@realdaytrotter I'm so glad I actually checked this twitter page today.  Because if I would have missed this... BUMMED.  Have fun out there.", "Fri Jun 15 21:23:17 ": "We improvise. You'll see, Madison. Tonight.  http://t.co/af2QkPFp http://t.co/P1twhqhY", "Sun Jul 15 18:17:26 ": "6:25PM set time tonight hosers. Werewolves. .  http://t.co/IbJRLQ9b", "Sat May 12 19:03:59 ": "♫ Next Week: Northfield, MN - May 19 at Carleton with Twin Sister and The Thermals http://t.co/vcOIH9d3", "Wed Jun 06 12:05:35 ": "Tonight The Slaughtered Lamb with Tiny Ruins, glad to be back London", "Thu Dec 13 22:00:08 ": "♫ This Weekend: Eau Claire, WI - Dec 14 at University of Wisconsin-Eau Claire http://t.co/IKrXdJRV", "Sun Jun 03 20:14:32 ": "Thanks to the talented Charlotte Zoller for this awesome photo from Primavera Sound Festival. Check out more of... http://t.co/Q2bJ5FG0", "Sat Jun 09 19:00:08 ": "♫ Tomorrow: Brighton, United Kingdom - Jun 10 at Theatre Royal Brighton with Andrew Bird http://t.co/AE1T0K0N", "Thu Jun 14 07:15:16 ": "RT @LocalThiefDrums: @PeterWolfCrier never lets you down, they kill it every time", "Tue Nov 27 19:55:08 ": "♫ New Date: Eau Claire, WI - Dec 14 at University of Wisconsin-Eau Claire http://t.co/gvpbOw3C", "Thu Jun 14 15:39:32 ": "RT @jagjaguwar: Dear Eau Claire, Don't miss @PeterWolfCrier tonight at Sounds Like Summer Concert Series in Phoenix Park! @VolumeOne...", "Thu Apr 04 22:01:01 ": "I haven't listened to this yet.  Don't spoil it for me.  Love.\n\nPeter http://t.co/vjSrW4krY2", "Tue May 01 15:50:10 ": "\"somehow up until 10:00pm that night I had sidestepped the music of Peter Wolf Crier. By about 10:02pm, I was... http://t.co/FDEtzrwJ", "Wed May 23 19:00:57 ": "♫ Next Week: Barcelona, Spain - May 30 at Primavera Festival http://t.co/b7OqcJOF", "Tue Mar 19 17:56:31 ": "PWC MPLS / STPL Thurs http://t.co/ET7tR1P9Os", "Mon May 07 15:37:50 ": "**NEW SHOW**\nWED June 13th at The Triple Rock with The Blind Shake + Prissy Clerks. $7, 18+. ** The first five of... http://t.co/txlRhLbj", "Wed May 30 19:00:03 ": "♫ Next Week: London, United Kingdom - Jun 6 at Slaughtered Lamb http://t.co/VWR9YFmk", "Wed Jun 06 14:36:22 ": "Not into paying for people to see our posts who like us, so visit us on Twitter (@peterwolfcrier)!", "Fri Dec 07 22:01:48 ": "♫ Next Week: Eau Claire, WI - Dec 14 at University of Wisconsin-Eau Claire http://t.co/fFQ18Y8L", "Fri Aug 31 15:26:23 ": "Oh man, Milagres.  You guys are great.  Thanks for doing this. http://t.co/quPvWXOR", "Mon Apr 08 12:51:06 ": "Listen to Brian play blues with Justin Vernon of Bon Iver and Phil Cook of Megafaun today on NPR.  We're real... http://t.co/ZgzgZ9YCYC", "Mon May 07 20:02:19 ": "♫ New Date: Madison, WI - Jun 15 at The Terrace at UW Madison http://t.co/xvfYAnnM", "Tue May 08 13:30:00 ": "You can stream both of our albums in full on Bandcamp.\n\nhttp://t.co/Y1PAGQlZ http://t.co/fBtMoTJx", "Fri May 18 19:03:04 ": "♫ Tomorrow: Northfield, MN - May 19 at Carleton with Twin Sister and The Thermals http://t.co/lOm4aI9W", "Wed Jun 27 17:01:56 ": "I made a playlist for the people at Spotify, with some very specific instructions. http://t.co/T4Bpa0nc", "Fri Jun 01 19:01:55 ": "♫ Next Week: Derby, United Kingdom - Jun 8 at No Direction Home Festival http://t.co/FLaZ8SY1", "Tue May 08 00:49:24 ": "RT @triplerockmpls: @PeterWolfCrier - June 13th! w/ @TheBlindShake and @prissyclerks ! tickets available now - click the magic link....", "Mon Aug 27 18:18:15 ": "Larry King couldn't fuck up Iron Mike.  Iron Mike get's very true with Larry King.  It's really a beautiful video... http://t.co/J1fKwxdP", "Fri May 18 16:44:41 ": "Want to see Peter Wolf Crier and Andrew Bird at the Theatre Royal in Brighton?  Well shit.  You can! http://t.co/W5VLmhoP", "Tue May 29 19:01:57 ": "♫ Tomorrow: Barcelona, Spain - May 30 at Primavera Festival http://t.co/ghurqWMc", "Sun Jun 10 14:04:16 ": "I posted a new photo to Facebook http://t.co/S3vAP668", "Sun May 06 23:44:17 ": "Oh, wow. These roots are naked.  Minneapolis show announcement tomorrow.  http://t.co/SoTvUO8t http://t.co/C3Y5WIlQ", "Sun Jul 22 20:12:45 ": "Fucking Dads. http://t.co/qv0mMSoi", "Thu Jun 14 07:15:10 ": "@schmuckeroo time of our lives.", "Wed May 30 21:12:37 ": "Bye guys. We're gonna wake up in Barcelona, play a show, go to London, try to visit Mooji, play a show in London,... http://t.co/6uBNoyj0", "Wed May 23 13:58:29 ": "Did you know you can stream the sh*t out of our albums on Bandcamp? \n\nhttp://t.co/Y1Pw9gl5 http://t.co/Jd0FksnL", "Thu Jun 14 19:19:26 ": "♫ New Date: Minneapolis, MN - Jul 15 at Bastille Day at Barbette http://t.co/S4EWfH05", "Tue Jun 12 16:41:19 ": "Here is the link I am talking about.\n\nhttp://t.co/q9WEuXCk http://t.co/NxvnmncN", "Tue Jul 03 18:36:26 ": "@New_Dork my college self is having a great day.  Saw them 6 times in 2 years I think.  Thanks for sharing.", "Wed May 30 11:57:48 ": "The boys are packing up and heading out to play Primavera Festival tomorrow, then they are off to the UK for 3... http://t.co/NtpsZSYd", "Wed May 16 19:05:17 ": "♫ Who's Coming?: Minneapolis, MN - Jun 13 at Triple Rock Social Club with Blind Shake + Prissy Clerks http://t.co/up8yNw2R", "Wed May 02 19:00:18 ": "♫ Who's Coming?: Barcelona, Spain - May 30 at Primavera Festival http://t.co/rfebNdfh", "Thu Jun 14 07:14:01 ": "RT @OgiEyewear: @PeterWolfCrier Thanks for comin in to Ogi Eyewear today! Excited to see you wearing our frames! David, Peter &amp; Bria ...", "Mon Jun 04 13:03:28 ": "LONDON: at The Slaughtered Lamb on WED with Tiny Ruins", "Mon May 21 19:41:07 ": "♫ New Date: Eau Claire, WI - Jun 14 at Summer Concert Series http://t.co/AdyVxrEA", "Tue Jun 05 10:14:32 ": "Ipswich, England: June 5th 2012.  Slaughtered Lamb rehearsals.  http://t.co/bO7Sy3Mk http://t.co/wCUTZDRD", "Sat Jun 16 20:42:49 ": "I'm going horizontal for a while.  We're playing Milwaukee tonight at the Cactus Club tonight 9:30PM with Free... http://t.co/r6V8Vfk0", "Sun Dec 09 14:23:23 ": "'Tis the season to be with your loved ones.  See ya soon, BMo. http://t.co/EYl4AdPn", "Thu Nov 22 18:05:23 ": "...is thankful for a RESCHEDULED SHOW AT UWEC.  See you in December, Wisconsin! http://t.co/0k6Nkq4L", "Tue May 15 12:45:21 ": "$7 cover, $7 CD's, $7 t-shirts? Holy sh*t?  When? Where?\nRight here sucka!  - mgmt... http://t.co/529FDhra", "Sun Jul 15 21:37:53 ": "Tonight at 630pm, Bastille Day at Barbette, I'm asking for a return of the red leather pants. No guarantees though.", "Fri Jun 08 19:02:39 ": "♫ Next Week: Madison, WI - Jun 15 at The Terrace at UW Madison http://t.co/Me5JAtoH", "Sat May 19 19:05:01 ": "♫ Who's Coming?: Milwaukee, WI - Jun 16 at Cactus Club http://t.co/xFkA3VPb", "Wed Dec 12 17:44:29 ": "Peter released a solo record today.  Here is the first song.  You can get it online only. http://t.co/LwsOIBdy", "Sun Nov 04 17:00:59 ": "RT @rippleent: Please RT, NYC bands, if you have a van, contact a Sandy collection center in your neighborhood to help them deliver goods...", "Fri May 18 19:04:55 ": "♫ Who's Coming?: Madison, WI - Jun 15 at The Terrace at UW Madison http://t.co/4LiMuvUz", "Wed Jul 11 18:20:13 ": "To do reasons beyond our control our performance at SoundTown has been cancelled.", "Wed Jun 06 19:00:36 ": "♫ Next Week: Minneapolis, MN - Jun 13 at Triple Rock Social Club with Blind Shake + Prissy Clerks http://t.co/L7inoqjV", "Wed May 09 19:03:18 ": "♫ Who's Coming?: London, United Kingdom - Jun 6 at Slaughtered Lamb http://t.co/5U0CYiqQ", "Thu Jun 07 19:00:22 ": "♫ Tomorrow: Derby, United Kingdom - Jun 8 at No Direction Home Festival http://t.co/ZjhBe9gy", "Thu Jun 14 07:14:40 ": "@OgiEyewear This is unreal.  You guys own our cheeks.  You know what I mean.", "Thu Jun 07 19:29:22 ": "Show Info, as always, right here: https://t.co/xoSxcDpY http://t.co/tmrwTsqx", "Thu Jun 14 15:39:36 ": "RT @battle_cry_mke: Free Energy + Peter Wolf Crier + Night Animals this Saturday at Cactus http://t.co/QpoHfxxr", "Fri Jun 08 09:50:08 ": "Lake Stage (Main Stage) 3:00PM today. Or after @bermudabriangle gets out of the shower.... http://t.co/zZx2WGEV", "Fri May 25 13:11:42 ": "Lil' Wayne asks, \"why do you do what you do?\"  And it's all beautiful the way he asks, to me. http://t.co/bC1uA46D", "Sun Jun 10 12:43:46 ": "Tonight, Theatre Royal Brighton (UK) with Andrew Bird... http://t.co/5khTnTAd", "Mon May 07 20:27:39 ": "♫ New Date: Milwaukee, WI - Jun 16 at Cactus Club http://t.co/1BUDH01R", "Mon Mar 04 17:11:35 ": "Hey, Minnesota.\n\nThe boys are back in town.  Thursday, March 21st.  \n\nhttps://t.co/Q0pCnLWkBi", "Wed May 09 19:48:15 ": "Twin Cities, we can't wait to see you on June 13th. \n\nhttps://t.co/Pu8kZBbB http://t.co/Mjhnn863", "Sun Jul 22 20:13:44 ": "Fucking Dads. http://t.co/ROcYxxq5", "Tue Jun 12 16:44:49 ": "Here is the link I am talking about:\n\nhttp://t.co/q9WEuXCk http://t.co/NdlP1UIw"}