{"Mon Apr 08 18:20:39 ": "Dinner, drink, and dessert menus from @andrecarmellini's new spot, Lafayette. It opens next week: http://t.co/4ycTTFQHuy", "Tue Mar 26 19:39:31 ": "One of the tweet-shamed no-shows from Red Medicine couldn't make the reservation because her uncle died that day: http://t.co/3Y52upC81S", "Tue Mar 12 15:42:44 ": "Meat processors in the midwest sometimes handle farmed lion meat (!!) from WI and MN. On @GrubStreetCHI  http://t.co/1YsXwqB5b3", "Wed Mar 13 14:16:11 ": "Great: @SierraTishgart on how, exactly, to persuade dinner companions to order what you want, and nothing you don't: http://t.co/9y2Mb1W6RK", "Mon Apr 01 15:57:31 ": "New &amp; fantastic Charles Bradley video opens in Pies 'n' Thighs, ends with outstanding dance moves: http://t.co/GOg2gVTA2Q", "Sat Mar 23 03:30:26 ": "Snowstorm soccer game just got cancelled -- then play resumed after players said they were ok to play. Awesome.", "Wed Mar 20 13:32:21 ": "The new-and-improved Kajitsu will serve lunch. Also it looks lovely: http://t.co/Uc6A1AElwY", "Thu Mar 07 19:52:13 ": "Tørst sounds like it's going to be goddamned incredible: http://t.co/yahyK08yOU", "Fri Mar 01 21:57:13 ": "@kcbaskin There's elegance in understatement.", "Mon Mar 04 20:09:07 ": "NB Instagrammers, this is how you do food porn. RT @chef_timothy Tart of scallop tartare, fennel, citrus and caviar.http://t.co/OhCZVCjf2w", "Thu Mar 28 14:36:28 ": "Menu for Alder, Wylie's new restaurant, is live. \"Shamrock Amigo\" might win for all-time greatest cocktail name: http://t.co/FFLVMXFVQ9", "Tue Apr 09 19:51:51 ": "What would you even do with a truck full of soup? I'd get sick of it after, like, can number three: http://t.co/jZLmjRUxC6", "Fri Apr 05 15:11:14 ": "Richard Belzer is a very good sport. RT @hughmerwin: This is amazing http://t.co/Kj0aQBSn92", "Tue Apr 09 20:41:03 ": ".@hughmerwin says DOH inspectors should be spending more time in restaurants, not less: http://t.co/lghppIPM5H", "Mon Apr 08 15:20:57 ": "Surprise c/o @plattypants: \"the Beatrice Inn is in that ephemeral, rarely achieved sweet spot for a scene restaurant\" http://t.co/0ZCYRWNiwr", "Mon Apr 08 18:53:44 ": "Phil Suarez on Wylie Dufresne: \"We thought we were working with J.Crew but Marc Jacobs was coming out of that kitchen\"http://t.co/CPT7hmFQ52", "Fri Mar 22 13:26:03 ": "NY Diet of @hestaprynnmusic c/o @ApronAnxiety \"Kidd Kraddick and I pondered whether a Xanax can or cannot be juiced.\" http://t.co/8xmvOIPOzV", "Fri Mar 29 15:50:15 ": "Oops! People are going to the wrong Carbone. We talked to the owner of the \"original\" Carbone in Hell's Kitchen: http://t.co/RsYfOzsDbv", "Mon Apr 15 18:06:35 ": "I know what I'm drinking tonight. MT @DavidWondrich: @jordanarothman New York Sour. Simple, strong, elegant.", "Thu Mar 21 17:05:43 ": "Nespresso: the coffee of choice at more Michelin-starred restaurants than you might think (like 700 of them actually) http://t.co/K3b4gwZaar", "Mon Mar 18 14:16:27 ": "Big upcoming openings: Lobster Club and ABC Cocina next month. New Brooklyn Fare, Ivan Ramen, Luksus sched'd for May. http://t.co/uHBUCnXVGC", "Fri Apr 05 01:36:13 ": "RT @erinphraner: I am way onboard with this place. @aldernyc http://t.co/Yy814Zispb", "Thu Feb 28 21:39:27 ": "I don't know a single \"modern man\" who would wear any of this shit: http://t.co/af8ojhteIs", "Mon Apr 08 18:02:35 ": "Why else would someone willingly live in Florida? RT @kurtsoller: It's amazing, yet so dumb, what good weather does to your mood.", "Mon Mar 18 21:15:10 ": "For the sake of comparison, the video game music in question: http://t.co/Qj8tlFomxJ", "Tue Apr 16 16:59:33 ": "Per the Robs, Lee Hanson and Riad Nasr are parting ways with Keith McNally: http://t.co/Ts0vgYCCv8", "Fri Mar 01 14:10:27 ": "The Grub St. diet didn't work out how @saraschaefer1 hoped: \"I dreamed a dream, and that dream turned to total shit.\" http://t.co/VjDWWM6BMG", "Mon Mar 11 17:12:33 ": "@bittman Big Gulps not affected (7-11s regulated by state, not city). If anything, BG sales could rise as other big-drink options disappear.", "Mon Mar 18 15:50:42 ": "RT @beardfoundation: Group Food Blog: Dark Rye; Eater National; Grub Street NY #jbfa", "Tue Mar 12 15:11:37 ": "Irish whiskey recs c/o @jordanarothman: \"from ferocious overproof drams to shut-up-and-drink shot-glass fodder\" http://t.co/aSsJfhi5mF", "Mon Mar 11 17:40:51 ": "There is at least one person not sweating Noma's norovirus outbreak: Justin Bieber's guitarist. http://t.co/DqH6j0jmUo", "Mon Mar 11 20:32:43 ": "So how do I get my hands on one of those 17-oz cups that DOH inspectors were going to be using?", "Wed Mar 06 20:10:18 ": "RT @hodgman: I was going along with all the twee on this lunch menu in Portland until I saw they have kombucha on tap. That's really pus ...", "Mon Apr 15 15:30:10 ": ".@MelissaHom &amp; @iknauer killed it on the pics. MT @grubstreetny: Drinks From All 50 States. http://t.co/FBAEejbJdJ http://t.co/t02SZqokiO", "Sat Apr 13 13:21:41 ": "Ramp mania. This was the scene at the USQ market at 8:46 a.m. http://t.co/cHCiTGf3ay", "Sat Apr 13 12:01:53 ": "RT @barbutonyc: #FF @JBSchef @scottaweston @Craft_NewYork @kkrader @deanfearing @MichaelTusk @FrankBruni @asytsma @billyharris @StVincen ...", "Wed Mar 27 16:15:04 ": "We sent some actual Italian grandmas to Carbone to get their thoughts. \"The cheese was the best thing.\" http://t.co/IG0vdum4jb", "Mon Mar 18 21:13:55 ": "Third song on the new Strokes album reminds me of the background music from the original NES Ninja Gaiden: http://t.co/GqITGMuhZX", "Mon Mar 18 21:20:34 ": "\"The vodka martini had three garnishes: the onion, the olive and a goat’s eye\" http://t.co/EfANyTUYko", "Fri Mar 01 20:07:11 ": "@stevecuozzo Which helped contribute to their buzz, and by extension, their rankings on the list. More than any \"nuisance factor\" did anyway", "Fri Mar 15 15:39:13 ": "Tribeca community board not feeling NYC expansion plans from one of the world's best chefs: http://t.co/nJYTMrLC0p", "Wed Apr 03 17:09:24 ": "Fallon gets the Tonight Show, yet Questlove gets his own chicken stand: http://t.co/ezGRWIDUJ9", "Fri Mar 08 14:19:59 ": "\"There's nothing brunchier than a croissant with Nutella.\" http://t.co/fczYK2ejVJ", "Fri Mar 01 18:06:22 ": "The surprising thing about Taco Bell meat containing horse is that it means Taco Bell actually used real meat in something.", "Tue Apr 02 17:57:36 ": "Lovely. TGI Friday's manager allegedly calls customer who complained about service and tells her \"You're gonna die.\" http://t.co/d0kmnZfp6a", "Fri Mar 15 13:41:05 ": "Well played. @TeddyWayne1999 manages to ref both Don DeLillo and David Brent on the first day of his NY Diet. http://t.co/DVN2i3DKLX", "Thu Mar 14 19:29:11 ": "Uni is the new truffle: http://t.co/9o2o3yNzd4", "Wed Mar 06 16:45:09 ": "Probably the only Asian hipster cuisine trend curve you'll see all day: http://t.co/y18dA5p2vK", "Thu Mar 21 18:13:32 ": "Wylie Dufresne's new restaurant Alder opens to the public 3/28. (That's a week from today): http://t.co/FDqnW8ZOrg", "Thu Feb 28 19:47:42 ": "Montmartre, new resto from Gabe Stulman and @tienhonyc opens TONIGHT. Serious potential. Cassoulet pour deux = oui: http://t.co/EVQ4iyGRb1", "Fri Mar 01 16:43:08 ": "Lots of people pushing to re-start horse slaughter in the U.S. Hey, what could go wrong? http://t.co/2knOwQtV7F", "Mon Mar 11 17:21:56 ": "Since when are there dulce de leche flavored Cheerios?! http://t.co/XbRP4st0cG", "Fri Mar 15 14:48:22 ": "\"This mouthful of walrus would probably have tasted funky since walrus meat was usually fermented before being eaten\" http://t.co/0xH6pjjyOU", "Fri Mar 08 15:33:55 ": "Noma's norovirus info: \"63 ill out of 78 who ate there in the period of 12th Feb. to 16th Feb\" Happy Valentine's day! http://t.co/n7pB5YyV3r", "Tue Mar 19 17:20:54 ": "\"The subjects' orbitofrontal cortexes tend to go wild with the pricier wine\" http://t.co/Y67lSEHHGy", "Fri Mar 08 18:17:06 ": "Dude's a class act. RT @NYMag The 20 most despicable things Gordon Ramsay has said and done, ranked. http://t.co/XR0W2dhQNO", "Fri Mar 01 17:54:17 ": "Restos on list maybe not your scene. MT @ @stevecuozzo @grubstreetny not sure what restaurant \"power\" ranking means beyond nuisance factor", "Wed Mar 13 19:59:21 ": "Two new Bonnie \"Prince\" Billy tracks that Will Oldham recorded for Dogfish Head, on @GrubStreetPHL: http://t.co/GOZHiZdKe9", "Fri Apr 05 16:31:55 ": "Pretty sure the world's already got all the \"Mad Men-inspired\" cocktails it will ever need.", "Thu Mar 07 15:25:00 ": "Places serving horsemeat on purpose, including somewhere in Brooklyn that's (maybe) doing it: http://t.co/dtY2YYyZWC", "Mon Apr 15 17:09:03 ": "@jordanarothman Scotch? If we're talking one drink only, hard to argue w/ patriotism of a good rye old fashioned. Urbane, strong, effective.", "Fri Mar 01 17:32:20 ": ".@emofly had better be taking notes. MT @dansaltzstein @qualityrye @BuzzFeed \"42 Puppies Who Love Wine\" #freeidea", "Wed Apr 17 20:41:15 ": "\"In these heady times of 'societal norms' for free samples ... we have Larry David to guide our moral perspectives.\" http://t.co/Nl36L067TX", "Fri Mar 01 22:24:43 ": "Salt, pepper, Tabasco, dash Worcestershire, squeeze o' lime, 2 oz tomato juice, 2 oz vodka. Ice, celery, nothing more http://t.co/gkcXUCXFGy", "Tue Mar 12 15:18:15 ": "RT @jordanarothman: In which I invoke leather daddys, Heath Bars &amp; rom-coms in describing Rothman-approved Irish whiskies @grubstree ...", "Tue Mar 12 20:25:12 ": "Balut straight talk from Pete Wells: \"As for the little embryo, it gave way to the spoon as easily as custard.\" http://t.co/VC4eRFSr0T", "Tue Apr 16 18:11:18 ": "I sense a follow-up to the @pete_wells Guy's American Kitchen &amp; Bar review: http://t.co/rfzs4jPpiR", "Wed Mar 06 22:50:03 ": "Better stunt would have been reviewing Guy Fieri's resto. MT @grubstreetny Marilyn Hagerty goes back to Olive Garden http://t.co/5yNhJmhNm0", "Wed Mar 13 20:18:37 ": "Always strange when the restaurant reservation confirmation call comes in like 15 minutes after I made the actual reservation.", "Sat Mar 23 02:39:45 ": "A Notre Dame loss would just be God's punishment for all the fluorescent green nonsense.", "Fri Mar 15 16:37:42 ": "RT @RobertOSimonson: #FF @DavidWondrich @jordanarothman @jchesh @dansaltzstein @fedification @Francis_Lam @farrellnyt @asytsma @toquelan ...", "Mon Apr 08 18:15:54 ": "RT @bgporter: Steady access to great Cuban food? “@asytsma: Why else would someone willingly live in Florida?\"", "Mon Mar 18 13:46:00 ": "New expanded Franny's will take reservations for big groups and offer large-format feasts (porchetta!): http://t.co/D4OkK7p5wS", "Wed Apr 10 17:28:34 ": "@emofly I'd have a tough time getting past the logo.", "Mon Apr 08 15:28:56 ": "Here's @kcbaskin taste-testing Dunkin' Donuts's new doughnut breakfast sandwich. We owe her a debt of gratitude: http://t.co/9wp8fraH0v", "Tue Mar 26 14:00:13 ": "Editing a story about Carbone when an IM from non-food friend pops up: \"Been to Carbone yet? Is it worth the hype?\" Elbow-deep in red sauce.", "Thu Mar 14 15:13:13 ": "I'd skip the Corned-Beef Collins. @mattlatmatt tries to find a St. Patrick's Day drink that's actually potable: http://t.co/L02daOhRT0", "Tue Apr 09 19:13:11 ": "That spaghetti is funny looking. http://t.co/bIfY9wLc6O", "Fri Mar 01 17:48:58 ": "\"Wowing people who are sitting in your restaurant isn't marketing strategy, that's you doing your job.\" http://t.co/0flVKScY8H", "Thu Mar 07 15:44:30 ": "@emofly Doing what I can to ensure an escargot boom.", "Mon Mar 25 16:18:04 ": "Per Rob and Robin, Totonno's is open again in Coney island: http://t.co/PJPjFN8wrQ", "Mon Apr 15 13:25:38 ": ".@plattypants talks w/ @michaelpollan: \"I added a new rule: Don’t buy any foods you’ve seen marketed on television.\" http://t.co/srorlpKqLs", "Mon Apr 22 18:23:18 ": "Do NOT make pastries based on Richard Serra's work, no matter how much his sculptures resemble giant cookies: http://t.co/P3xiKzzz49", "Fri Mar 08 15:18:37 ": "\"If your intention is to blow up Manhattan, are you okay having Scottie Pippen’s blood on your hands, Kim Jong Un?\" http://t.co/FBeyn3k0z2", "Mon Apr 08 15:49:26 ": "@kcbaskin If you mean the burger of that name, sure.", "Fri Mar 29 13:33:23 ": "Into the fact that @DovetailNY's John Fraser wanted us to take his Grub Diet pic while he was kickboxing: http://t.co/puLsf0SLA1", "Thu Apr 18 21:04:24 ": "RT @bendwilliams: Important: 9 reasons the cupcake boom went bust. http://t.co/0dTb0PianY", "Mon Apr 01 12:42:31 ": "New at Smorgasburg: \"Real\" Greek yogurt, beer cheese, nachos, and old-world bagels from a former Per Se baker: http://t.co/qmFAwbkUbm", "Tue Mar 19 15:45:16 ": "Peak Internet. MT @TheHanBurger #GofT black hole continues thx to @RebeccaRams. Game of Thrones Characters as Cats http://t.co/CCbF5nnvCC", "Fri Mar 01 17:23:59 ": "If BuzzFeed did wine lists: 78 Wines That Will Blow Your Mind. MT @kcbaskin Why advertise \"fine wines\"? Isn't \"fine\" another word for \"OK\"?", "Mon Mar 11 15:08:11 ": "Soda ban starts tomorrow. Will be only slightly more difficult to sustain my eight-liter-a-day Mountain Dew habit. http://t.co/4MAjR6MZ2f", "Tue Apr 16 15:40:39 ": "RT @grubstreetny: Inside the timeless world of the Wisconsin supper club: http://t.co/BqgKhKsjyK", "Tue Mar 19 19:03:14 ": "Next-level Shake Shack ordering advice from @kcbaskin: Get Shack Sauce on your fries. http://t.co/tfUe8Ok4Nn", "Thu Apr 18 16:50:40 ": "I have little interest in watching Oblivion, but the sci-fi Iceland porn in the trailers makes me want to go back to Reykjavik immediately.", "Wed Mar 06 18:31:32 ": "@kittenwithawhip @jordanarothman @MissTanya Pork trotters as the new pork belly?", "Sun Mar 31 13:07:16 ": "@jdocwill Peep whoopie pies and an \"Easter sundae\": http://t.co/jtzye5p3mH", "Tue Apr 16 16:42:54 ": "RT @GrubStreetBOS: Here's a list of restaurants that are helping victims of the #marathon, plus closings. Tweet us tips. http://t.co/UiA ...", "Fri Mar 22 17:24:31 ": "Peak bacon? The 500 pound (!!) \"hog log\": http://t.co/M5pyMfOx6K", "Thu Mar 14 18:31:53 ": "RT @RobertOSimonson: A Boston bartender may be responsible for the outcome of the 2012 Presidential election. #47Percent http://t.co/CCD ...", "Tue Apr 09 19:27:24 ": "Find myself doubting Ray J's (objectively awful) claim that he hit it first. \"I Hit It 20th or So\" seems more likely. http://t.co/HolhpvN0Aw"}