{"Fri Mar 08 15:07:37 ": "@j2271 @mbsings Glad you had fun....I was under the weather but the MUSIC lifts me up every time.", "Sat Aug 04 00:20:04 ": "i sang with Fagen on alot of his solo music.\nNever saw him live.  Couldn;t keep my eyes\noff him.And Michael McDonald just does it\ngoosebumps", "Fri Nov 16 07:57:50 ": "@MoustacheYVR  Very overlooked song....Nice to hear you respond to it...Yes,Nicks presence\nis very much felt.", "Wed Jul 18 23:51:42 ": "@Leilamodel @AsiaAshford @ivaleriesimpson  Leila thanks to your\npersistance and Jim Bessman's insistance,  I'm all a twitter!", "Mon Oct 08 21:21:45 ": "@tueretreasures   Overlooked by many--but it's a fav of mine too! Glad to know I'm not alone.", "Wed Aug 08 20:06:12 ": "Valerie Simpson:\"A Tribute To Nick Ashford\",LIVE Friday. Aug. 10th. FREE ADMISSION! http://t.co/JvQL5Hl8", "Tue Nov 13 20:00:55 ": "Valerie Simpson and Nick Ashford's Sweet Spot - Video - @OWNTV http://t.co/4DPuObnl", "Fri Apr 12 19:09:30 ": "Cast from Marvin Gaye Show at Beacon\nhung after hours at SB.  I'll see it Sat night\nHow bout u?", "Mon Sep 10 21:25:54 ": "Big ups to my pal Laura Smalls--Michelle Obama looking fab in your purple dress while she intro'd her hubby at Dem. Conv!!", "Sat Aug 04 00:16:55 ": "I wanted to throw myself on the stage and slap somebody.    All 3\nof them on stage together...Killing it.   Magical!", "Sun Mar 10 14:30:40 ": "@mbsings Reminds me of our jingle days--i'm still squeezing trying to sing on top!", "Sat Dec 22 13:02:48 ": "@JimBessman  Loved loved and I knew very well Inez Andrews. Incredible VOICE.", "Fri Mar 15 15:31:58 ": "@hit_lyryx1   Always love to see u put your stamp on A&amp;S.  Go for it!", "Thu Feb 28 20:46:30 ": "@INAYADAY I was holding my stomach muscles in when you looked....V", "Sat Dec 22 12:59:18 ": "@ToniBFan  Ha, Ha, Interesting choice.  Glad she's going for it!", "Wed Mar 06 16:47:00 ": "@RhondaRossWords @SugarBarNYC @DamienSneed  Happy to have you at SB....V", "Sat Mar 23 20:19:33 ": "Saw Stanley Clark n George Duke @ blue note last night. 2 people-so much music!..going home to practice!  INSPIRING", "Fri Jul 20 17:00:46 ": "Great singers and musicians last night at Summerstage for Nick.  Thanks Ron Grant\nAbi Dyer, Clayton, Damarra, Tiffany Stevenson, Andre Henry", "Mon Oct 22 12:30:44 ": "@justicestar25  Didn't know it was re airing. Glad u enjoyed.. Still miss my honey.", "Sat Aug 11 23:38:43 ": "no wind no rain--clear skies last night Prayers answered..Lincoln Center rocked!", "Tue Nov 20 14:39:09 ": "@Hockeyfrilla Well that's truth with a beat under it....V", "Mon Oct 22 23:35:18 ": "@lat1203  G.Q....Raheim just did a dance mix --very interesting. Hope to get it out there. Thanks!", "Mon Aug 06 02:07:29 ": "@vickienatalie  loved your video..hope to\nsee you on Aug 10 at Lincoln Center outdoor...I'm doing a free show.", "Sat Oct 20 12:20:07 ": "late review: Tyler Perry does a fine job as\nAlex Cross n I love the villain! hot n lethal \nTook a pic with Tyler after screening--gave\nprops", "Mon Oct 22 23:40:29 ": "@lat1203  Always there on Thurs.'s (if in town) and most Tues....Sure you'll enjoy!", "Thu Feb 28 20:40:33 ": "This hanging every night is a trip....A good\ntime  is hard to turn down--but takes a toll.\nI'm willing to pay the price!", "Mon Mar 04 13:09:54 ": "hung out with my daughters n Vinko for his b'day in Atl City. Saw shows Tony Toni Tone Dru Hill n Michael Bolton--MB rocked\nthe hardest!", "Wed Oct 24 11:38:20 ": "@mills70disco  \"look behind me it's there still\"'  love that lyric...glad it works on grey days in UK", "Tue Nov 13 20:03:53 ": "How Valerie Simpson Feels Nick Ashford's Presence - Video - @OWNTV http://t.co/UeS5sOPt", "Tue Apr 09 18:15:10 ": "@nycamyg  What a nice thing to say!  I'm encouraged...V", "Tue Jan 29 12:59:23 ": "With sleep in my eyes I'm on Good Day New York this a.m.", "Fri Sep 21 10:32:20 ": "Okay how lucky can I be in 1 week singin\nwith Michael Bolton 2 times. We hit it at\nthe SugarBar last night--Ain't no Mt. &amp; Real\nThing.FUN!", "Mon Sep 10 21:27:17 ": "Laura Smalls Fashion show tomorrow should be hot hot hot now that Michelle\nObama is wearing her wares.", "Mon Sep 10 21:31:11 ": "Caught the Madonna show in the rain Sat.\nthat's dedication....she was on it and hitting it hard.  People watching was a plus that night!", "Sat Aug 18 07:11:27 ": "@IAMANITABAKER  Always love how you squeeze the juice out of a lyric  Congrats on your new music...ivaleriesimpson", "Wed Mar 13 18:57:42 ": "@loudersoft Independent ......Ha ha ha ha", "Sat Aug 18 08:48:04 ": "@UsherRaymondIV  theres collective arms holding you up pulling you thru Lay back on it.", "Wed Mar 20 04:04:40 ": "@JimBessman  I have a picture of me n Liberace taken at 20/20 our first restaurant!\nMichael D. n Matt Damon took it all the way there! HOT", "Thu Aug 09 03:15:29 ": "Just caught screening of 2 Days in N.Y.the new Chris Rock...Laugh out loud-quirky script-kudo's to Julie Delpy-co star-writer.", "Sun Dec 23 16:05:16 ": "@JimBessman  Ms Tee would beg to differ..I wish you could have seen Inez Andrews live--A powerhouse and most amazing voice. A LEGEND", "Mon Dec 24 13:15:24 ": "@lat1203_traci  Nothing scheduled but that date Jan 31.  Hope u can make it...V", "Thu Feb 28 20:38:29 ": "@ClaytonBryant @INAYADAY I think you did some wrecking yourself!....V", "Tue Jul 24 23:13:16 ": "The Gospel on the View was uplifting and the hats were awesome....a fresh 11:00a.m. experience.  say amen somebody", "Mon Dec 03 08:28:06 ": "@Edmond_Frost I trusted Oprah as a friend, and she didn't let me down", "Sat Oct 20 12:09:32 ": "@tanesiaDC  Nice to hear....thanks much...", "Mon Nov 26 22:38:20 ": "@Hotlikf22  Yeah, I'm proud of that too....V", "Mon Oct 08 14:46:07 ": "looking forward to hearing Frenc Pierre Sibille tomorrow at SB. His blues is unique.\n&amp;piano and harp on the money! c'est magnifique!!", "Wed Nov 07 15:31:34 ": "@shinuh  You looked and sounded great!...Next week you won't have to compete w OBAMA!", "Mon Jul 23 19:42:03 ": "NY Post Are you giving the Joker what he\nwants now? Front page FAME.  Stop enough...Take the light off this darkness", "Mon Oct 08 14:41:19 ": "@AsiaAshford By all means, GIFT-it's the thought that says i cherish\nwhat we have-your couple counselor and mom", "Thu Oct 18 17:17:10 ": "@larrymorel  Always glad to be of service!...V", "Thu Oct 18 17:22:20 ": "Can't wait to see Tyler Perry re-invent himself yet again tonight as Alex Cross...", "Mon Oct 08 14:35:16 ": "@Basiloil  Can't imagine how you found that one! I can't even hum it--so long ago", "Fri Jul 20 16:57:52 ": "tribute last night to Nick at Summerstage in Harlem I have key to city Don't know what door to open tho.", "Fri Nov 16 18:47:00 ": "The Inspiration for 'Ain't No Mountain High Enough' - Video - @OWNTV http://t.co/6UHlrJYP", "Wed Jan 16 13:48:20 ": "@LilMsMisinformd @TheHarlemTimes1 @LincolnCenter  Loved what you wrote....Thanks,...V", "Mon Apr 15 12:34:39 ": "@ZeolaGaye  A pleasure to be present....You are to be commended....V", "Wed Aug 15 22:11:53 ": "Mighty fine acting in the screening last night\nof SPARKLE..Surprised by my song Your All I Need making the cut...Turn out for\nopening Fri.", "Mon Dec 03 19:52:17 ": "@Hotlikf22  Glad you liked it...First  comment I ever heard on that song!..V", "Wed Nov 07 15:36:35 ": "@shinuh  On 2nd thought opening for OBAMA is a great gig...You did great!", "Tue Nov 13 12:36:32 ": "@MSADRIENNE4REAL @Oprah @OWNTV -Hard to watch myself--but so pleased with my girls..", "Mon Nov 12 14:25:24 ": "@SISTERBRATION @Oprah  I'll never forget Nick's words and like you.. realize time is precious", "Sat Aug 18 07:16:57 ": "go see Sparkle...boxoffice equals someone\nelse getting another chance. Need more of our stories outhere...Pick up a pen and wait on the muse", "Mon Nov 05 23:27:40 ": "@Hotlikf22  Haven't seen your face?  Where u been....Election night---SB family together\nlike 4 years ago....V", "Wed Mar 13 21:15:17 ": "@loudersoft I havent made anyone else speechless today--so it's all good..", "Mon Oct 08 16:13:45 ": "@Maestro_Lacombe  Thanks for the tweet!\nSo excited being a part of things, forgot to\ntweet in real time...", "Mon Mar 25 23:56:29 ": "@OneSoundandEnt  Glad to be apart of your musical sound track!...V", "Thu Mar 21 15:41:50 ": "@AsiaAshford @Leilamodel @ClaytonBryant @shinuh @KimNicky @SimplyMissNikki I didn't\nknow we were shoutin out our tweet world.  my bad!", "Fri Jul 20 17:06:50 ": "Happy Birthday Jim Bessman he'll hate me for this but it's a thin line between love and hate. Wish I wrote that one.", "Tue Nov 13 20:02:05 ": "How Nick Ashford Penned 'I'm Every Woman' - Video - @OWNTV http://t.co/IaziJqVX", "Sun Oct 28 21:12:39 ": "@ToniBFan   Made me laugh....Enjoy!...V", "Mon Oct 08 16:04:51 ": "@ledisi You know I love ya. You're making me proud!", "Thu Feb 28 20:41:17 ": "figure out what makes you happy--and do a whole lot more of it!....", "Fri Jan 25 05:04:12 ": "Greg Morrison and Lisa Lambert,\nTony award writers partying at the Sugar Bar and Sex and the City's Kim Cattrall", "Fri Jul 20 23:56:19 ": "real life is alot scarier than the movies", "Wed Sep 19 22:10:19 ": "@PORJIE05 Thanks for the review. I'm just a beginner now so it means alot.", "Thu Nov 08 20:06:34 ": "Likewise!  Check out Oprah..Sun. 9:00p.m.  She did a piece on me 4 Next Chapter . Valerie", "Sun Nov 11 06:25:24 ": "@AChrisGajilan  Thanks, A. Chris....Can't wait to see it--but then you know all things....V", "Tue Mar 26 20:25:59 ": "@ToddSchefflin With your expressive gift and how you work the sax you would have loved this show!", "Tue Nov 13 21:57:36 ": "@RFProphetess  I will put you in my prayers....You can never have enough.  V", "Fri Jul 20 17:04:39 ": "!'m sure I'm screwing up Adi Dyer's name.  whatever you call her she can sure nuff sing!", "Wed Sep 19 19:00:50 ": "Check out Val Ghent next Tues!..Slamming\nShe needs some good weather--and YOU. AT Sugar Bar--see ya", "Mon Apr 22 16:22:33 ": "@harryweinger @MotownMusical  I am proud!", "Mon Mar 04 13:02:42 ": "@ToniBFan  Nice to hear from u....Encouraging!....V", "Sat Aug 11 23:44:29 ": "thanks to Raheim GQ, Ron Grant, Alison Williams, Kimberly Nichole, Andre Henry\nAndre Smith, Phil Geston, Will on harp\nClayton Val G and Asia", "Sat Dec 01 07:51:08 ": "@soulmotown  Thanks for turning me on to this...Like very much...V", "Thu Aug 30 18:43:39 ": "If you are in the Boston area, meet me at Scullers on September 8, 2012. There will be two shows. Come back and say Hi.", "Wed Mar 06 22:08:17 ": "@ColemanMichael I like that one too!  Thanks...V", "Sun Apr 14 18:20:16 ": "@debostic Amen....V", "Thu Feb 28 20:48:58 ": "@tdlavell  Miss you much....V", "Wed Sep 19 18:59:03 ": "Got to sing Ain't No Mt. with Michael Bolton last night on the restored original piano from Motown- I played all those years ago.\nAmazing", "Sun Nov 18 22:21:57 ": "@pbsgwen @KEM_Intimacy @JanelleMonae Loved seeing u dancin with Berry Gordy...Great\ninterview too...V", "Fri Aug 10 16:26:03 ": "\"no wind no rain or winter storm can stop me babe if you're my goal\"--See you tonight!", "Mon Nov 12 14:37:38 ": "@pamelarcone @Oprah True, For all those years it was the real thing, so I can't just grieve--I have to be grateful too...", "Thu Jul 26 23:13:28 ": "On my way to BB king to see Kindred\nFamily Soul--husband and wife duo--fab\nhope my heart can take it...", "Mon Jul 23 22:42:40 ": "@LeilamodelDid I miss an article about Sam Moore and Me", "Sat Aug 04 00:13:10 ": "Last night at the Beacon. Michael McDonald\nDonald Fagen Boz Skaggs..I lost my mind\nbecame the worst groupy ever/ AMAZING\n2 and a half hours", "Fri Nov 16 18:47:48 ": "Nick Ashford's Daughters Remember Their Father - Video - @OWNTV http://t.co/TxaxNvRV", "Fri Jul 20 17:02:03 ": "Don't let me forget John James. My heart was full.", "Fri Apr 12 19:12:09 ": "@tdlavell Give us body!  I'm going to do 100 sit ups right now!!"}