{"Mon Jan 21 03:54:49 ": "The high on Tuesday is suppose to be 12 degrees in Morgantown!!! That makes me want to head to Peoria for Spring Training immediately", "Wed Feb 20 03:35:29 ": "@DVSBrewster thanks Doug hope ur doing well", "Sun Mar 31 00:29:57 ": "Getting ready to fly over the great WV!!! #almostheaven http://t.co/hj1hvgVd6E", "Mon Feb 04 01:13:56 ": "“@Mtalicafrk1: ouch, wanna re-pick?” \nNot my best pick", "Mon Mar 25 03:50:48 ": "Reruns of Duck Dynasty never get old!!!", "Sat Feb 09 23:52:47 ": "Had a great time at FanFest!!! Humbled by all the fan support at petco today. @Padres #FanFest", "Mon Mar 04 13:37:28 ": "“@j_lib_32: @FoxSportsSD it's the 1st gyorko jersey to be owned. Had it before jedd. You can ask him.” Fact!! Nothing beats a padres camo", "Thu Jan 10 01:38:39 ": "@bosshogswife what was the total number of donuts consumed by the 4 of them. #duckdynasty", "Wed Jan 02 01:21:26 ": "RT @StevieMo17: Only people that go or went to #WVU know why everyone loves it so much", "Sun Dec 30 03:53:06 ": "The Babe and rest of monument park. Pretty cool tradition http://t.co/k2oWCc3k", "Fri Feb 01 01:41:45 ": "“@Michael_b_Webb:Excited to see you get your opportunity! Even more excited your a home state guy! #WestVirginiaForLife” bleed blue and gold", "Mon Dec 31 03:05:15 ": "If a team blitz's on every third down, how hard is it to call a screen to slow down the rush. #findanewOC", "Sat Dec 29 14:59:06 ": "Let's goooo Mountaineers!!! http://t.co/gXEnm93O", "Sun Mar 10 02:06:32 ": "Congrats to WVU Rifle Team. 15th National Championship!!! #dynasty @WVUSportsBuzz @WVURifle", "Sat Feb 23 04:14:40 ": "“@acolaizzi: This whole @JGyorko05 being from WVU is troubling.”  Now what would make someone say that!!! WVU=best college ever", "Wed Jan 30 02:09:25 ": "@JonathanMayoB3 I thought my wink at rookie program would bump me up a couple spots lol #MLBPipeline", "Fri Mar 08 17:39:16 ": "RT @boltupnation17: @JGyorko05 jedd im ur biggest fan and im a huge padres fan from new jersey !!! Can i please have a rt or follow ,, g ...", "Fri Feb 08 12:59:31 ": "Getting ready to board with the wife! Next stop San Diego for FanFest!! Who's coming?? @gaslampball @friarhood @Padres", "Thu Jan 24 01:31:41 ": "Deniz with 2 consecutive dribbles without a turnover. New personal best!! #tidesareturning", "Wed Jan 16 05:04:19 ": "Petco Park and Fish and chips from Tinfish!!! Gotta love San Diego", "Fri Mar 29 01:02:40 ": "Chillin with @SuaveCF1 as we fly to San Antonio!!!", "Sat Jan 12 02:43:19 ": "@mickeykoke thanks for the support I appreciate it!! Go Padres!!", "Mon Dec 31 03:53:01 ": "Please run one screen play #CowboysNation", "Thu Apr 04 22:10:43 ": "Feels good getting that first W!! Makes for a happy flight to Denver.", "Fri Jan 04 04:15:59 ": "“@JHagerty33: @JGyorko05 I'm sorry they cut you from the cast of buckwild bc you are married. You fit right in!” Bahaha MTV missed out", "Fri Jan 04 03:19:45 ": "#BUCKWILD might be worst show ever!! Will I watch next week, absolutely", "Tue Apr 09 01:36:12 ": "Peyton Siva is signing his letter of intent at halftime to play at L'ville for the next 8 years.", "Fri Mar 22 17:26:10 ": "My nephew Mason is ready for the season to start!!! @Padres http://t.co/zUuQtbeHJo", "Sun Feb 10 22:04:51 ": "Loving San Diego!!! @gaslampball @padres http://t.co/n8qDEg0K", "Sun Dec 30 03:46:35 ": "Pretty good middle of the order http://t.co/ywiOwDqj", "Wed Jan 09 23:40:37 ": "“@BobcatGolfer11: @JGyorko05 congrats on camp invite! I can't wait to vote for u at 2B for the #ASG13” Thanks bud", "Thu Feb 21 23:14:38 ": "Can't wait to start playing games tomorrow!! #getafterit", "Thu Mar 21 20:37:58 ": "RT @nbcsandiego: Petco Park named top baseball stadium &gt;&gt; http://t.co/WsC5V9g7kM RT if you agree", "Thu Mar 21 23:42:52 ": "It amazes me how many lay-ups r missed in college basketball!! These r suppose to be the best in the country. #justlayinit", "Fri Jan 11 22:28:28 ": "“@J_Chicle10: \"@omgthatspunny: What's Forrest Gump's password? 1forrest1\" -- @JGyorko05” haha it's obviously Jenny1-7", "Tue Feb 26 00:35:12 ": "RT @J_Chicle10: What about naming and being a part of @JGyorko05 fan club and calling it the \"Gyork-a-holics\" @gyorkocfn @MDvo_22 @Grant ...", "Tue Mar 12 03:14:11 ": "RT @ScheidlersList: Proud to say I drafted a Mountaineer tonight in fantasy baseball @JGyorko05 #MountaineerNation", "Fri Feb 08 01:34:48 ": "Always tough saying bye to family but can't wait for the season to start!!! Headed to SD in the AM. #grindtime", "Tue Feb 19 00:24:39 ": "Please give @splitsullivan a follow!! A teammate with 33 followers", "Mon Jan 28 00:42:01 ": "@RobLowe2 breakfast brunch", "Thu Jan 17 22:05:06 ": "Good time is San Diego the last 3 days, but time to go home to my wife. Be back for FanFest Feb 9th!!!", "Fri Feb 15 13:31:29 ": "Good luck @WVU_Baseball @CoachMazey @BradyWilson23 Opening Day!!!", "Mon Dec 31 01:56:11 ": "Starting to look like the Romo of old #stillearly", "Tue Jan 01 15:08:26 ": "Hope everyone had a good and safe New Year!!!", "Tue Feb 26 03:05:22 ": "RT @RayRayScanlon: @JGyorko05 I'm a \"Gyork a holic\"! Great start to the spring Jedd. Looks like Father Padre has found the answer to his ...", "Fri Feb 22 00:03:31 ": "@gyorkocfn @kevinconnoley I think u guys should do a wonderlic test on the show and see how u stack up against tavon, geno,stedman,&amp;madsen", "Mon Apr 01 21:21:08 ": "Thanks to everyone for your incredible support!! One of the greatest experiences in my life!! @Padres", "Mon Feb 04 01:15:01 ": "I didn't know the halftime show was a dance competition. Get someone that is actually gonna sing!!! #countrymusicplease", "Sat Mar 30 21:54:31 ": "RT @gyorkocfn: I'm the proudest big brother in the world. Pleased to announce the #Padres have finally agreed 2 #FreeGyorko. NYC, here w ...", "Sun Feb 10 00:36:46 ": "@matttclark23 #boom Y would u have a pic of urself running!! Ur way to slow for that. Get a pic of u hitting", "Sun Dec 30 03:51:30 ": "@WSGinWV @gyorkocfn story of his life lol", "Wed Feb 20 02:24:40 ": "@einho I try to always sign my fan mail. Send me what u have ill get it back ASAP!!", "Mon Feb 11 02:38:25 ": "RT @GRIFF_31: “@EvryDayBaseball: When life throws you a curveball, sit back and drive that bitch the other way.” @JGyorko05 #freegyorko", "Mon Dec 31 02:31:35 ": "@MCville27 Cowboys!!!!!", "Sun Feb 10 15:57:23 ": "RT @j_lib_32: Got the 1st @JGyorko05 jersey today and its the camo one. Thanks for signing it! http://t.co/ecE5xCkn", "Sun Feb 03 23:32:42 ": "30-13 49ers. My prediction", "Mon Jan 14 20:40:55 ": "@swiste32 yes I did thanks", "Sun Dec 30 03:50:41 ": "@theheadbandit thanks I appreciate it and I'm not sure I hope so", "Mon Apr 08 22:01:36 ": "Can't wait for the home opener tomorrow!! Gonna be a honor to put the  uni on for the padre faithful!! #padrenation @Padres @gaslampball", "Mon Apr 15 20:36:31 ": "Prayers for everyone in the Boston area and the families that are affected. #sadday", "Sun Jan 06 21:24:02 ": "Shawshank Redemption between football games!!! Perfect", "Thu Jan 10 00:36:03 ": "@kevinconnoley too much pressure I guess lol", "Tue Jan 29 00:31:59 ": "@heelsonthefield @JGyorko05 My favorite Mountaineer athlete from my time as a #WVU student. Even surpasses Pat White.” Thanks man!!!", "Sun Feb 10 01:06:35 ": "@matttclark23 haha that's y I'm holding a bat in my pic thanks to @blaketekotte", "Sat Jan 05 13:42:35 ": "Good luck bro @matttclark23 #LetsGo", "Fri Jan 04 00:26:43 ": "Buckwild tonight!!! Bad publicity for WV but looks too funny not to watch", "Mon Jan 14 19:54:05 ": "@MDvo_22 @bradywilson23 @grantbuckner I'm not, flying to SD today. It's a shame I won't be able to make it", "Wed Feb 20 01:42:01 ": "“@SD_Bandwagon: i wonder if we could ever get @JGyorko05 to do an interview with us about his battle for 2nd base?” Maybe u should ask lol", "Mon Jan 14 03:18:14 ": "“@GrantBuckner: @BradyWilson23 when and where??!” And most importantly why", "Mon Mar 25 14:21:14 ": "Want to wish my beautiful wife a happy birthday today!!! #gettingold", "Mon Dec 31 02:07:37 ": "Is it too early for a Childress for Heisman campaign!! @gyorkocfn @WVUSportsBuzz", "Tue Jan 08 03:50:51 ": "Huggins came home to coach the Mountaineers. Y can't Saban come home and coach here #justonechampionshipwilldo", "Wed Feb 06 15:04:41 ": "@DSBerk Alford flipped for WVU. Still waiting on Golson.” Mountaineers&gt;wildcats", "Wed Jan 09 23:41:47 ": "“@kevinconnoley: OMG, there's @JGyorko05 ! Gonna try to get my kid an autograph. #sonervous” I use to love listening to u on the Eric show", "Fri Jan 04 02:16:36 ": "@MCville27 I'm not sure", "Mon Feb 04 00:59:52 ": "RT @Iam_theBean: My lonely @JGyorko05  game used, autographed bat needs an a display case. Christmas ideas for Bean! #freegyorko http:// ...", "Sun Mar 31 00:23:58 ": "“@j_lib_32: My 8,000 tweet goes out my bit on making the @padres. Keeping working hard Jedd! #1Fan http://t.co/6Tu5FZdZVc”  thanks bud", "Sun Mar 31 02:02:52 ": "Congrats to Nate for making the A's opening day roster. Couldn't have happened to a better person or friend!! @Blumenherst", "Wed Jan 16 05:06:59 ": "“@sdsuaztec4: @JGyorko05 Tinfish is the best pre-game bar. Giant beers!” You mean Padre beers, might hit a nerve", "Mon Feb 18 03:28:45 ": "Any other show&gt;NBA all-star game!! Waste of time #zeroD", "Fri Mar 29 19:13:49 ": "RT @j_lib_32: Love my @JGyorko05 #padres jersey so much! One day ill get a @Padres hat to match it. http://t.co/fAXepZbbOZ", "Sat Dec 29 18:29:51 ": "Winter wonderland http://t.co/C60bdvvp", "Tue Feb 05 02:54:23 ": "S/O to @BradyWilson23 as he gets ready for the season!!! #WVU #newera", "Sat Jan 12 02:32:52 ": "If u've never heard of or seen \"Second City\" comedy you need too. Hilarious!!! #rookieprogram", "Sun Jan 27 20:48:56 ": "Like him or dislike, Tiger playing well makes golf a million times better!! #eyeofthetiger", "Fri Feb 08 01:55:57 ": "“@spidermayb24: This tin fish on point right now” best place ever", "Sun Dec 30 13:13:48 ": "@Legal___Hustle unfortunately", "Sat Mar 30 21:31:16 ": "Spring Training is finally over!! Can't wait to wear #9 in NYC!!! @Padres", "Thu Jan 10 04:00:36 ": "“@gyorkocfn: #Buckwild is less embarrassing for West Virginians...”I bet Shain could make at least 1 three-pointer in 15 tries", "Mon Jan 14 20:26:11 ": "Just landed in PHX on my way to SD to workout and they said its 37 degrees. Doesn't PHX know spring training is less than a month away!!", "Sun Mar 03 23:01:26 ": "RT @j_lib_32: I'm pumped for a @Padres game on @FoxSportsSD today! Wearing my lucky @JGyorko05 camo signed jersey. http://t.co/hPUPYV2plh", "Wed Feb 27 02:24:03 ": "RT @blaketekotte: I hear that dude @JGyorko05 has a fan club already?! #Gyorkaholics", "Sun Jan 06 21:33:07 ": "“@TradeDeadliner: @JGyorko05 how's there time for that in between games?” Always time for that", "Thu Jan 10 02:49:30 ": "If WVU would make a shot, we wouldn't go over someone's back on every possession!!! #worstshootingteamever", "Sat Feb 23 01:20:55 ": "“@matttclark23: @JGyorko05 I see you!!! #swipe #letsgo #boom! You better keep that going even without me. #bashbrother” believe it", "Thu Mar 14 01:43:56 ": "Having a great dinner with the best agency in the business @Baseball_ACES", "Fri Jan 04 04:01:48 ": "Is it just coincidence that Catfish comes on right before and after #BUCKWILD I think not", "Mon Mar 25 23:23:56 ": "RT @The_Fliz: So proud of my fantasy baseball name that I had to share it with the world: DGyorko Unchained. Thx for the inspiration, @J ...", "Sun Mar 17 16:34:45 ": "RT @radinenicole: @j_chicle10 we are ready to see Jedd!! #padres http://t.co/hrtCRsNrsa", "Wed Feb 20 01:34:27 ": "The new Dikembe Mutombo commercial is hilarious!!! #notinmyhouse"}