{"Thu Jan 17 04:28:42 ": "JANUARY 25th. Stay tuned dreamers. http://t.co/ASAnc3Zn", "Wed Jan 09 16:48:21 ": "HAIM's Don't Save Me is my first soundtrack song of 2013", "Thu Jan 24 16:39:13 ": "Preparing our custom album sleeves in the bitter cold! http://t.co/A1UzH62h", "Sun Jan 27 23:32:58 ": "Teen Commandments are playing an intimate show on Tuesday at Don Pedros, with our buddies Ichicuts. \n\nwill you... http://t.co/o8gWUlsk", "Fri Apr 19 04:13:31 ": "RT @RollingStone: Daft Punk's \"Get Lucky\" reveals itself, startlingly, as an old-school disco jam:  http://t.co/dhBK9Publ2", "Tue Jan 08 00:04:52 ": "I'm flying on the back of a giant bat!", "Thu Dec 27 00:05:57 ": "It's true what Dirty Projectors say: While you're here you're alive. Shivering. Ecstatic. Enslaved. And Free.", "Tue Jan 15 18:55:43 ": "Overheard in bk, '\"Who would take a jehovah's witness to chuck-e-cheese?\"", "Thu Jan 03 20:05:53 ": "♫ This Weekend: Brooklyn, NY - Jan 4 at Glasslands Gallery http://t.co/5yA6Ma5C", "Thu Apr 11 00:00:51 ": "I posted 3 photos on Facebook in the album \"\" http://t.co/7RoQ5LqBDF", "Wed Apr 03 17:25:41 ": "Just did a hilarious photo shoot for the New York post on the G Train @brooklynbrewery - some lady asked me if my keyboard connects to a VCR", "Fri Jan 04 16:35:47 ": "see you at glasslands tonight! we play at 8:45, so get there early. bring your mind. \n\nx", "Sun Apr 14 23:36:28 ": "Nick just asked me if I know how to get to his place. Note: He's my roommate.", "Fri Dec 28 20:02:49 ": "♫ Who's Coming?: Brooklyn, NY - Jan 25 at Cameo Gallery http://t.co/kVyvRa5W", "Thu Jan 24 00:33:34 ": "Reason #112 to come to the Teen Commandmants EP release show this Friday. handmade album giveaways by artists... http://t.co/vIJ0xO9m", "Thu Feb 14 06:43:14 ": "ive touched a hundred hands \nhands that touched and touch again ive shivered alone\nive crossed the ocean\nset kaleidoscopes of sex in motion", "Tue Apr 16 01:27:01 ": "Confession time: I concocted the Anne Frank House/Justin Beiber story to generate publicity for Teen Commandments. Sorry Chicago!", "Thu Jan 10 00:11:45 ": "we're releasing our first EP, DANCER, at the end of the month!   advance tickets are available and recommended!... http://t.co/tVrGziFo", "Mon Apr 08 16:37:56 ": "Tonight, my friends. The Manhattan Inn is a really unique place to catch us– table service with dinner/snacks,... http://t.co/XudEAUWCEI", "Thu Jan 17 01:10:40 ": "9. Koi No Yokan (Japanese)\nThe sense upon first meeting a person that the two of you are going to fall in love.", "Thu Jan 31 17:23:26 ": "dear morning self, you lack discipline. \n\nlove, evening self.", "Tue Jan 22 19:43:25 ": "@NEWMYTHSmusic @cameogallery @LeBoum Whose bringing the glitter gun?", "Thu Dec 20 16:38:20 ": "in case you were wondering where to find us tonight.. http://t.co/HhFTbPe4", "Thu Mar 14 04:07:57 ": "RT @andymientus: My God, the Teen Commandments EP, Dancer, is so undeniable. Tunes that make you look skyward. @ParadiseInNYC", "Wed Dec 26 23:58:07 ": "in case you were curious... http://t.co/7PWi096D", "Wed Jan 30 01:51:51 ": "let's celebrate it not being miserably cold– free Teen Commandments show TONIGHT at Don Pedro's in Bushwick. We... http://t.co/TO775qEi", "Tue Jan 22 19:36:24 ": "Here's a lil' jem from our childhood~\nhttp://t.co/DKUbWKXH http://t.co/rZe0lr78", "Fri Apr 19 04:14:26 ": "http://t.co/lbVQWlBTRJ http://t.co/PwzS4TQBJp", "Sat Feb 02 05:40:29 ": "Humans at bars. How charming.", "Fri Mar 08 18:27:30 ": "seriously one of the coolest bills we've ever done. a whole night of ultra-dancey synth pop and electronic... http://t.co/ZETTFNWvBc", "Wed Jan 16 06:08:40 ": "James Edward Almost", "Fri Dec 28 20:02:45 ": "♫ Next Week: Brooklyn, NY - Jan 4 at Glasslands Gallery http://t.co/r6WDXkmP", "Fri Mar 29 20:03:08 ": "My@", "Fri Feb 01 00:22:53 ": "this ice wind should go well with The Ice Choir tonight.", "Thu Feb 07 18:12:45 ": "So we're playing at Piano's in the Lower East Side on Valentines Day. This will be our first ever show with live... http://t.co/pHqN55h5", "Sun Apr 07 22:58:52 ": "young dreamers, \nlet's do the monday dance. free show tomorrow night at The Manhattan Inn featuring... http://t.co/s4zXIqZTmV", "Mon Feb 11 01:26:32 ": "Valentines Day with Teen Commandments, wherein we rebuke the yearly overtures of love and declare u should be in love every day of ur life!", "Mon Jan 28 00:16:57 ": "We are projecting videos onto our building! Suggestions of what we should project?", "Sun Feb 24 23:25:18 ": "teen commandments politely request your presence at our Death By Audio show on Wednesday. mmk? http://t.co/Mb0Bk7jLjm", "Mon Jan 14 14:56:29 ": "dreamed i was a MOOG again last night", "Mon Feb 04 01:52:28 ": "an appropriate time to repost: Teen Commandments performing Beyoncè's \"Videophone\" with our brother Andy Mientus... http://t.co/BmOsEsp6", "Thu Jan 24 19:16:21 ": "Drums Eat Everything: new artist spotlight // Teen Commandments http://t.co/PPofsSR4", "Mon Jan 14 18:49:35 ": "Nick, should we do a cover of this theme song? http://t.co/TWu8cUqw", "Mon Jan 07 04:52:40 ": "Almost done with the EP! Angels hovering up above. http://t.co/sCTeqcIH", "Sun Mar 03 19:01:45 ": "@andymientus love you man", "Sun Jan 27 23:32:23 ": "Teen Commandments are playing an intimate show on Tuesday at Don Pedros, with our buddies Ichicuts. \n\nwill you... http://t.co/wooDD1DQ", "Sat Apr 20 20:18:27 ": "Good News! TC is being added to Pandora ~ Just had to buy our EP from Amazon to send to Pandora for inclusion into... http://t.co/5RCl70qJAV", "Sat Jan 12 00:35:38 ": "Going to see @two lights make beautiful pop music at Living Room. When did a little rain ever stop me? - b", "Tue Jan 08 09:47:15 ": "It's 4:44 a.m. and I just finished mixing our EP, it's all happening! \n\n-Nick", "Thu Mar 21 18:51:04 ": "!!! http://t.co/yhCiWwb02S", "Mon Apr 15 16:10:02 ": "i'm terrified of giant african land snails. does that make me weak?", "Thu Apr 04 04:15:53 ": "@andymientus  getting that sen-say-sun again.. put that foot on the ignition! (midnight MK listening all by my lonesome..)", "Tue Jan 22 16:20:10 ": "Angels, our album is up for streaming/download starting NOW. http://t.co/OWwG6yLb", "Thu Dec 20 17:56:17 ": "The city has a real edge today, have you noticed? Shits about to get all Ghostbusters 2.  @lesliemcdonel @andymientus", "Mon Apr 15 03:43:55 ": "Sometimes I hate myself while reading Huffington Post.", "Fri Mar 15 00:07:27 ": "This is going to be one of the coolest shows ever - tonight at Muchmores! Come on over.. There must be 100 synths in here.", "Tue Apr 16 03:27:42 ": "What song would you like to hear covered at our next show?", "Fri Jan 25 23:12:28 ": "Teen commandments EP release show is TONIGHT. We go on at 10 at Cameo gallery.  tickets still available.", "Sun Jan 27 23:32:06 ": "Teen Commandments are playing an intimate show on Tuesday at Don Pedros, with our buddies Ichicuts. \n\nwill you... http://t.co/rJtDU4mw", "Wed Jan 02 21:37:06 ": "hilarious: making an iPod shuffle playlist for my dad. tame indie rock. nothing too angular, of course. and  hot-tub ready.", "Mon Mar 18 16:48:37 ": "Some blog love! Thanks Dingus! :0 \n\nyours,\nthe washed out 80's http://t.co/tidqUXCPSL", "Tue Apr 16 00:05:20 ": "Dear reader, I'm pretty sure we were separated at birth.", "Fri Mar 29 20:03:28 ": "My god! somebody save the bees!", "Fri Feb 01 04:00:49 ": "working on our new single. you're gonna like this one. \n\n#vibraslap", "Mon Jan 28 00:24:11 ": "http://t.co/iT3YL02X", "Fri Mar 08 18:27:23 ": "seriously one of the coolest bills we've ever done. a whole night of ultra-dancey synth pop and electronic... http://t.co/ad8iKZvdHX", "Sun Jan 27 23:31:49 ": "Teen Commandments are playing an intimate show on Tuesday at Don Pedros, with our buddies Ichicuts. \n\nwill you... http://t.co/kcEdqmpZ", "Thu Feb 14 05:14:15 ": "TEEN COMMANDMENTS SHOW TONIGHT, VALENTINES, AT PIANO'S. We've got our BAD ASS projection artist @Salome Asega in... http://t.co/XYkHE5in", "Wed Jan 02 22:11:32 ": "HEEB Magazine has some nice words to say about us...\n\n\"The Teen Commandments operated as if they had been the main... http://t.co/HXUbiWFw", "Fri Jan 18 18:06:23 ": "if you want to hear our REALLY weird musings, you'll need to follow us on twitter: @paradiseinnyc", "Tue Apr 23 14:01:10 ": "Midnight tour of Gothenbergs famous Gramophonic Recording Studios- simply unbelievable- miles of live rooms,... http://t.co/KjaFhIMhbo", "Wed Mar 06 18:56:43 ": "this made me think of you http://t.co/UG6TXqAf44", "Sun Jan 06 19:25:16 ": "Thanks to all for a wonderful night at Glasslands on Friday, we had a blast! Putting the final touches on our EP... http://t.co/niSdn79w", "Thu Feb 14 05:13:43 ": "TEEN COMMANDMENTS SHOW TONIGHT, VALENTINES, AT PIANO'S. We've got our BAD ASS projection artist @Salome Asega in... http://t.co/KYBOiKOr", "Thu Jan 03 19:50:43 ": "If you guessed that I am going feather shopping right now, good god you're right! How did you do that?!", "Tue Feb 05 03:31:18 ": "@andymientus Andy dreams of pizza.", "Mon Apr 15 04:17:46 ": "Sorry, but your whole life is a dream I'm having.", "Sun Jan 06 23:35:11 ": "We've been recording since A.M with no end in sight. Took a little break to hang out with Björn from ECHOREV.... http://t.co/ZUlWVZtF", "Wed Jan 02 19:31:03 ": "Excited to announce that kickass video artists @Salome Asega will be joining Teen Commandments at Glasslands this... http://t.co/bDYlDLgb", "Sun Apr 07 22:51:40 ": "Teen Commandments with the G train in todays NYPost! Catch us Monday 10:30 at the manhattan inn.  @BrooklynBrewery http://t.co/qkSrPOJfVs", "Thu Mar 14 06:19:39 ": "we're playing a new song tomorrow! i better get some sleep.", "Thu Jan 17 20:36:57 ": "Koi No Yokan (Japanese)\nThe sense upon first meeting a person that the two of you are going to fall in love.\n\nThat... http://t.co/cVxzAaJ4", "Tue Apr 09 16:29:02 ": "Our friends at I Give Good Hebrew have been producing a gleefully bizarre jewish-gay-supernatural web-series.... http://t.co/1ZaiCnLwnF", "Tue Apr 16 16:38:23 ": "RT @dfarecords: 150 more tickets have just been released via @RBMA for the May 25 event.  http://t.co/qPmWkniYS3 http://t.co/RfUfKySvz3", "Thu Apr 18 12:19:04 ": "Vanbot put on an electric show at Debaser last night! Gosh, it was nice to be back at one of my all time favorite... http://t.co/dUZapDRX0K", "Wed Feb 27 17:21:05 ": "TONIGHT beautiful! Teen Commandments with live drums at DEATH BY AUDIO. 10PM. See ya!", "Mon Feb 11 01:13:17 ": "http://t.co/sDuijhyL", "Thu Jan 17 16:45:56 ": "@ElspethMerry Introducing Williamsburg mystics, Teen Commandments, and our debut Dancer: http://t.co/e9ajdnDy Stop being so cool will ya?", "Wed Feb 20 04:31:48 ": "The ever awesome Walter Wlodarczyk captured us playing We Live At Night last week at Piano's. Check out Salome... http://t.co/bYiKeIr3", "Mon Apr 15 02:50:09 ": "Teen Commandments &lt;3 Jalapeño Tuna Salad @BagelSmith", "Fri Dec 28 17:16:23 ": "Young Visionaries, \n\nI'd have you join me for our Glasslands debut with the notorious MATH the band. I'd have you... http://t.co/B322PYg4", "Fri Jan 25 06:33:48 ": "tonight, Teen Commandments will play our EP Release show at CAMEO with two of our favorite Brooklyn new wave... http://t.co/xzsSJGQy", "Fri Jan 18 17:36:47 ": "feeling all neato today.", "Tue Jan 22 15:47:44 ": "There are very late nights when Nick &amp; I put on LCD Soundsystem and dream about the sort of music we want to make... http://t.co/T3P5RMQ8", "Fri Jan 04 17:55:24 ": "\"At every age we think we're having the last laugh, and at every age we're wrong\" yeah right nytimes! It don't get better than this!", "Sat Apr 06 21:44:28 ": "We're going to be giving away puppies at our show on Monday at the Manhattan Inn.", "Mon Feb 11 01:14:17 ": "over there is valentines day #1, full of anxiety and dispair: hallmark conspired with satan to create this... http://t.co/kSvRmINS", "Sun Jan 06 00:15:30 ": "Videotaped an aggressive encounter with a cab driver last night. I'm putting it in my time capsule, to be opened in 2019.", "Fri Jan 11 07:25:47 ": "About to listen to the new EP master for the first time! Excited as shit.", "Sun Jan 06 21:29:19 ": "Teen Commandments - No Burning Headlight - Glasslands Gallery - 1/4/2013 http://t.co/wH4je2LX"}