{"Thu Feb 21 20:15:41 ": "Fun Fact: It takes approximately 42 espresso beans to make one shot of espresso. http://t.co/EE55y66mRf", "Thu Apr 18 20:04:22 ": "@Huntress62 Swoon away, and thanks for being a fan....", "Fri Apr 05 14:35:50 ": "@ccguinto Thanks for being a fan. No definite K-cup plans yet, but we appreciate your interest and the feedback.", "Thu Apr 18 13:43:39 ": "@Crystallion_oO It's mutual! Thanks for being a fan.", "Fri Apr 19 13:51:19 ": "@gerry1076 Thanks for the feedback. No details to share, but we appreciate your interest!", "Thu Apr 18 13:29:38 ": "@tsswedish Make it a great day!", "Mon Apr 22 19:17:46 ": "@MoxPowers We like the way you think! Thanks for being a fan....", "Fri Apr 05 14:37:03 ": "@MarkThompsonNBC Thanks for the call-out!", "Sun Apr 14 14:30:00 ": "RT this if you’ll be finishing up your taxes with a cup of Café Bustelo® by your side. Don't forget - the deadline is tomorrow!", "Thu Apr 18 14:14:24 ": "@drugstoredivas Make cup No. 1, and then make it a great day. Thanks for being a fan!", "Mon Apr 08 12:39:38 ": "@InFlightIdeas Thanks for being a fan!", "Sat Mar 09 16:00:02 ": "Don’t forget to set your clocks one hour ahead before bed tonight! Wouldn’t want to be late for your cafecito… ;)", "Thu Feb 14 18:31:01 ": "Happy Valentine's Day! You DID remember to brew some Café Bustelo® Coffee for your sweetheart, right? http://t.co/6KMrGLLA", "Thu Apr 18 20:03:53 ": "@MoxPowers Go for tres! And thanks for being a fan.", "Fri Mar 29 14:48:42 ": "@nella22 Salud, indeed....and happy writing!", "Wed Apr 03 14:00:05 ": "¡Encuentra las diferencias! There are 5 differences here — can you spot them all? http://t.co/WDDs9vXVtZ", "Thu Apr 18 19:39:50 ": "@RicThaSneak We think so, too! Thanks for being a fan!", "Thu Apr 18 13:30:04 ": "@EllaMonstrous And good morning to you! Thanks for being a fan!", "Thu Apr 18 15:38:31 ": "@BAD_mama_GAMMA Glad to be of assistance, and thanks for being a fan!", "Fri Mar 22 14:00:01 ": "Uh-oh… looks like someone lost a can of Café Bustelo® in this sea of yellow. ¿Dónde está?", "Mon Apr 22 14:42:27 ": "Regla número uno: If you drink the last of the coffee, brew some more! http://t.co/oGVoiuq3Px", "Thu Apr 18 16:14:22 ": "@themakersmill It's good coffee in any mug, and thanks for being a fan!", "Thu Apr 18 14:56:22 ": "@ThisisJoeyG Make it a great day, and thanks for being a fan!", "Thu Apr 18 13:44:33 ": "@jessandunnotis We adore you, too. Thanks for being a fan, and make it a great day.", "Sat Apr 06 17:13:25 ": "@MikoHolmSan Thanks for the morning mention! And for being a fan....", "Wed Apr 10 21:32:39 ": "@JoannaSace  Thanks for being a fan!", "Thu Apr 18 14:56:00 ": "@InfamousAce_410 Make it a great day, and thanks for being a fan!", "Thu Apr 18 13:42:58 ": "@marjoriejean Thanks for the feedback, and thanks for being a fan.", "Thu Apr 18 14:11:20 ": "@Hungry_Jane Thanks for being a fan!", "Mon Apr 08 14:13:05 ": "@indik Thanks! We appreciate your support!", "Tue Mar 26 14:30:00 ": "Smile — it's time for a #coffee break!", "Mon Apr 08 12:39:23 ": "@ChefPaulGerard Thanks for the morning mention!", "Thu Apr 18 14:56:39 ": "@boyleprime Hey! Thanks for being a fan, and make today a great day!", "Thu Apr 18 13:40:16 ": "@DaveDiCarlo Thanks for being a fan! Make it a great day!", "Thu Feb 21 20:00:43 ": "Dato Divertido: Se utilizan aproximadamente 42 granos de café para hacer un shot de café espresso. http://t.co/gF8kl14kwD", "Fri Apr 05 15:00:01 ": "¡Refréscate! Mixing up a glass of iced tea is a perfect way to do it. Pick up some Té Bustelo® Iced Tea Mix here: http://t.co/BaNEiUJIp5", "Thu Apr 18 14:55:43 ": "@boyleprime Hey! Thanks for reaching out.", "Thu Apr 18 14:11:03 ": "@crunchy_f Thanks for being a fan, and make it a great day!", "Mon Feb 25 14:30:17 ": "It's Monday, but… http://t.co/yDdOHVwFAo", "Thu Apr 18 16:22:44 ": "@ReadWolfHood Lovely artwork! Appreciate your talents, and thanks for being a fan!", "Thu Apr 18 14:12:04 ": "@AuntAltha Si! Gracias! Thanks for being a fan!", "Mon Apr 08 12:40:11 ": "@indik Thanks for mentioning us..and for being a fan!", "Tue Mar 05 15:30:01 ": "Put your sentence together and tweet it back at us!", "Thu Apr 18 18:21:01 ": "@IsraeliSniper Sorry to say we don't offer a whole-bean variety at\nthis time. Thanks for reaching out!", "Thu Apr 18 16:25:18 ": "@IsraeliSniper If your can't locate our products in your local stores, consider buying from our friends at http://t.co/dEEhENTOdK. Enjoy!", "Wed Apr 17 15:04:46 ": "Don’t forget the most important item on your list… ;) http://t.co/u8MGHhCC1J", "Thu Apr 18 13:44:08 ": "@OhSo_Savage Thanks for being a fan!", "Mon Apr 08 12:40:49 ": "@Minnie_Elle Well, gosh! We think you're great, too. Thanks for being a fan!", "Thu Apr 18 15:46:04 ": "@redhotbetty Make today a great day!", "Thu Apr 18 13:30:42 ": "@ClubdelasDiosas Good morning to you, too! Thanks for being a fan.", "Fri Feb 22 21:00:21 ": "If you guessed left… you're right! http://t.co/pEEZElvhzp", "Thu Apr 18 19:39:16 ": "@newpractice Build a snowman for us, and thanks for being a fan!", "Thu Apr 18 15:57:26 ": "@tsswedish Make today a great day!", "Thu Apr 18 13:41:18 ": "@pedrosqueen Thanks for being a fan! Make it a great day.", "Mon Apr 22 14:52:01 ": "@Naft_punk712 Here's hoping you got your day started in the best way!", "Thu Apr 18 13:41:50 ": "@AgneAdele Whatever! Make it a great day, regardless! Thanks for being a fan...", "Tue Apr 09 13:30:00 ": "Fun Fact: Tuesday is the most productive day of the week. So pour yourselves another cup… ¡hay mucho que hacer!", "Thu Apr 18 13:39:43 ": "@chefanista34 Welcome! And thanks for being a fan!", "Mon Apr 01 12:40:25 ": "Uh oh… looks like some mischief is afoot. #aprilfools #pranks http://t.co/8MOvI3nDbd", "Thu Apr 18 15:39:05 ": "@RheumatoidMom Thanks for being a fan, and make today a great day!", "Fri Mar 01 17:38:59 ": "Employees of the world: Savor the day, because today is YOURS. Happy Employee Appreciation Day! http://t.co/OzJZFqYWHO", "Thu Apr 11 14:59:19 ": "Which cup of café are you on? http://t.co/Qzh0R1nore", "Mon Apr 15 15:16:31 ": "@iSabrinaEspinal Glad you're a fan!", "Thu Apr 18 14:11:40 ": "@CofficeNearMe Thanks for being a fan, and make it a great day!", "Thu Apr 18 18:12:02 ": "@TheVeganGrip  Thanks for being a fan!", "Thu Apr 18 14:12:27 ": "@Tiger1962 Let us know what you think of the tea mix, and thanks for being a fan!", "Thu Apr 18 17:07:11 ": "@JayKillin Thanks for being a fan, and make today a great day!", "Wed Feb 27 21:30:16 ": "RT this if you're ready for the weekend! http://t.co/nCo0irOUwl", "Thu Apr 18 13:42:27 ": "@shlmtsteph Thanks for being a fan, and welcome aboard! Make it a great day.", "Thu Apr 18 15:04:10 ": "@MadameCharisma Thanks for the suggestion, and thanks for being a fan!", "Wed Mar 20 17:00:00 ": "Ah, yes — spring has finally sprung. Don’t forget to stop and smell the flowers (y el café, of course).", "Fri Feb 22 15:04:02 ": "Can you guess where the jar of Café Bustelo® Instant Coffee is? http://t.co/RY60Qoc1oU", "Thu Apr 18 17:07:28 ": "@ThatWhiteGrrl Thanks for being a fan!", "Thu Feb 14 16:30:55 ": "iFeliz Día de San Valentín! Te acordaste de prepararle un poquito de Café Bustelo® a tu amor, ¿verdad? http://t.co/Pb0NhyBo", "Fri Apr 12 12:53:06 ": "@JoannaSalce Make it a great day!", "Thu Mar 28 20:36:25 ": "@nella22 @NutmegNanny What a great way to start the day! Thanks for being a fan!", "Thu Apr 18 16:22:07 ": "@HeatherSanto Thanks for being a fan!", "Thu Apr 18 13:33:24 ": "@SocialInfluenz Good morning, thanks for the info, and thanks for the suggestion.", "Thu Mar 28 20:35:54 ": "@chalasers Love the artwork! Thanks for being a fan!", "Thu Apr 11 15:37:15 ": "@HarborENT Thanks for being a fan!", "Thu Apr 18 14:13:31 ": "@thiswaywest Thanks for being a fan!", "Mon Feb 18 15:00:50 ": "No es justo… http://t.co/fXdrev1E", "Thu Mar 28 20:34:29 ": "@oreillyfotograf  Please visit JavaCabana http://t.co/dEEhENTOdK to buy your coffee online. Thanks for being a fan!", "Thu Mar 28 20:33:06 ": "@FlantasticNYC Thanks for the suggestion! And thanks for being a fan!", "Thu Apr 18 19:40:25 ": "@Uncle_BLAZER Glad you rely on us to get your morning started. Thanks for being a fan.", "Fri Mar 15 14:00:00 ": "Friday? More like Fri-YAY! #tgif #friday", "Wed Feb 27 19:30:17 ": "¡RT esto si estás listo para el fin de semana! http://t.co/HzJ3O1CW2G", "Sun Mar 31 15:00:04 ": "Forget the golden egg — go for the golden can. ¡Feliz Día de Pascua!", "Sun Mar 10 14:00:00 ": "The secret to an awesome Day of Awesomeness? This. Stay awesome, amigos.", "Thu Apr 11 15:36:38 ": "@JoannaSalce Thanks for being a fan!", "Mon Mar 18 13:30:00 ": "New week = new perspective. Make it epic, amigos.", "Mon Feb 18 18:00:17 ": "It just doesn't seem fair… #caseofthemondays http://t.co/bnZe1R3T", "Thu Apr 18 14:57:28 ": "@crunchy_f Indeed! Thanks for being a fan, and make today a great day.", "Thu Apr 18 13:39:00 ": "@t_f Really!??!!?? Thanks for being a f-f-f-fan!", "Mon Apr 15 15:18:00 ": "@mommacuisine Good morning! Make it a great day!", "Tue Mar 12 13:00:01 ": "What’s your style: #decafcoffee or #regularcoffee? Tweet your choice @cafebustelo", "Thu Apr 18 15:53:00 ": "@MiKeMcDnet Now that you're awake, make today a great day! Thanks for being a fan.", "Thu Apr 18 16:14:45 ": "@EvanSmi12885457 That's a lot of coffee! Thanks for being a fan.", "Sun Feb 17 15:30:48 ": "It's Random Acts of Kindness Day! What are you going to do to brighten someone else's day? http://t.co/kp56KZbq", "Thu Mar 28 15:00:03 ": "Is it true? RT this if you do! ;)"}