{"Sun Apr 21 00:37:51 ": "Last day of the tour, Vancouver, commodore. Best venue in Canada.", "Tue Jan 29 18:34:35 ": "For those of you that haven't seen my new video for 'Credit!' yet, it's now on YouTube: http://t.co/F9RnQOi1", "Fri Jan 25 16:12:00 ": "Hung over from playing chivas gig last night with k-os. All worth it to wake up and look at a picture with Doug Gilmour http://t.co/ixjelImf", "Tue May 22 20:09:34 ": "Oh wait. I have a whole other record to begin mixing tomorrow. Argh.", "Fri Feb 08 05:49:31 ": "Review of my record by The Grid TO: http://t.co/6EqZd5D8", "Sat Jul 14 01:37:12 ": "Monks Show event: http://t.co/WyfIcRU1", "Sun Apr 14 20:38:11 ": "Day off in Calgary today. I think we'll do a big band dinner somewhere. Sleeping in a real bed instead of the bus made me hungry!", "Mon Dec 10 06:04:37 ": "Gear loaded back in to all the different places, hotdogs consumed, shower had. Feet hurt. Time for bbc Sherlock Holmes, cigarettes and beers", "Thu Aug 23 17:21:43 ": "'You Lovely You', single available on iTunes, Sept. 4th.", "Sun Mar 10 18:04:16 ": "Shooting another video today. This one for 'The Price You Pay'. You'll see it in a couple months.", "Fri Jun 15 00:42:55 ": "It's only Thursday, and I'm already exhausted from NxNE", "Sun Dec 09 18:45:15 ": "Shooting video for 'I Wake Up Every Day' today. Video days are fun and horrible at the same time.", "Tue Feb 26 23:14:35 ": "Playing bass for Lindy tonight at The Shoe.. I think we're on at about 10pm.", "Thu Sep 13 06:27:43 ": "Just saw @twrpband at the corner of Markham and Bloor. Kind of the best thing ever.", "Fri Sep 21 04:00:04 ": "Hot Snakes in Montreal. Fuckin killer.", "Thu Aug 02 21:42:11 ": "Mixing 'You Lovely You' at The Orange Lounge", "Sat Aug 25 21:58:19 ": "Heading in to Canterbury to record three new Dave Schoonderbeek songs.", "Tue Apr 23 04:53:09 ": "Check my new EP on Soundcloud. Really this stuff should have been on the next record, but I just couldn't wait: http://t.co/5ddTF3eyEy", "Tue Feb 05 17:33:09 ": "My new album is finally out!! Download on  iTunes here: https://t.co/Nqlube7x", "Sun Oct 07 22:25:14 ": "I made a $100 bet with Alex Bonenfant that neither of us would eat McDonald's anymore. Right now, a bacon cheeseburger seems about worth it.", "Sun Jan 06 00:01:13 ": "Shooting video for 'credit' today (song you haven't heard yet from new album). How is it we've shot two videos before ever playing a show?", "Tue Mar 05 04:16:13 ": "Quote by James Robertson who is mad that I didn't credit him on my tweet", "Thu Jul 19 20:05:28 ": "Found photos, including Monks live at Massey Hall in 1980! Toronto Star interview was ok.", "Thu Jul 19 21:42:50 ": "Join the Monks night facebook event: http://t.co/WyfIcRU1", "Thu Aug 23 17:00:09 ": "Still waiting to see when 'You Lovely You' will hit iTunes. It's close! Be patient.", "Sun Dec 09 21:45:02 ": "I'll post some photos of video shoot. You'll still have no idea what it's gonna look like in the end. http://t.co/L3zTNiru", "Thu Jan 17 02:29:54 ": "Tickets are now on sale for the Feb 9th show at the Horseshoe. $10 at Rotate This, Soundscapes and The Horseshoe front bar.", "Tue Jul 17 21:44:37 ": "Just did an interview about the Monks record with The National Post. Having a hell of a time finding any old photos of them though.", "Thu Mar 07 16:04:21 ": "Mastering an EP with Joao Carvalho today. I think I'll put out four more songs with the next single.", "Fri Jun 22 17:33:31 ": "Heading to Winnipeg to see Rusty @imaginarycities get married.", "Sat Feb 02 02:57:53 ": "Recorded five songs today for The Verge (XM/Sirius)", "Mon Apr 15 07:43:52 ": "If anybody knows who stole my guitar pedals off the stage last night, please let me know. So annoying.", "Mon Apr 22 06:07:36 ": "Home sweet home.. Finally. And just in time for the Leafs to officially make the playoffs.", "Fri Oct 26 14:55:45 ": "You Lovely You 7\" now available here: http://t.co/anvNtDRq", "Thu Dec 06 18:03:47 ": "My first press coverage for the new record: http://t.co/zCVTzPSQ", "Mon Jun 25 01:27:26 ": "Stabbing outside my hotel. Running joke over the weekend: 'At least Winnipeg is just stabby, not shooty.' That's something. Back home now.", "Mon Dec 10 00:24:05 ": "Mini Steve and jamie http://t.co/7JWD1qZq", "Wed Sep 12 01:17:45 ": "Things I did last week: played K-os show w/ Saul WIlliams. Went to cottage. Worked a night at Sonic. Thought about starting Persian Rugs mix", "Thu Apr 18 21:12:24 ": "On my way to Whistler for a gig tomorrow. A hot bath is crucial. Yes.... I'm a bath guy. What of it?", "Thu Jul 26 05:42:30 ": "Coverage for Monks show by The Toronto Star, The National Post, Now Magazine, Exclaim and more. See it all at http://t.co/WyfIcRU1", "Wed Apr 17 18:35:56 ": "Playing Sugar in Victoria tonight. Party.", "Tue Jan 29 02:15:49 ": "20 Questions with CBC's Frank Opolko: http://t.co/MVzvK4AC", "Fri Aug 17 04:55:49 ": "At Clinton's checking out the Whirly Birds", "Fri Jun 22 04:26:36 ": "Recorded two new songs with @ryandahle.. Poppy as shit.", "Wed Jan 30 18:46:50 ": "Vote for me to be in the CBC Radio3 Top 30: http://t.co/AZ2gR9T4", "Fri Mar 01 15:53:41 ": "Help me out by voting for me at CBC radio3. It talkes only one click!: http://t.co/36AFtC0W3M", "Mon Jan 21 20:51:22 ": "AUX just shot a 360 degree panoramic photo of my studio space. Gonna look awesome. Let's get nerdy.", "Wed Jan 30 18:15:11 ": "MTV Drops: http://t.co/Lz8u7vxI", "Thu Feb 07 17:33:07 ": "Free song: 'Mr. Business'. A B-Side that probably should have made it on my record. Trade for a 'like': http://t.co/w0wwcmk9", "Tue Mar 05 21:41:21 ": "Check out the article about me in this months AUX magazine for iPhone and tablets: https://t.co/wUaBTgA8qo", "Wed Apr 17 01:55:56 ": "Lindy show tonight at the Horseshoe. Maury filling in for me on bass while I'm on tour. Weird to not be doing it myself, but oh well.", "Fri Dec 14 05:32:31 ": "Andy Kim X-Mas party tonight. Got Chris Murphy to play drums for Kos. Good times.", "Tue May 22 20:09:06 ": "Please let this be my last day of mixing....", "Fri Jun 01 01:36:32 ": "Looks like a live performance of The Monks album is going to happen - with one of the actual singers from The Monks!", "Mon Aug 13 00:56:08 ": "Just created a new fan page now that I'm 'solo' or whatever. Like me! http://t.co/5upVCPcw", "Fri Nov 30 21:23:00 ": "Some keyboards in my studio: http://t.co/2iiPKVyH", "Thu Mar 28 15:13:25 ": "Playing MuchMusic and The Edge today in the k-os band.", "Thu Jun 28 20:17:51 ": "Here's one song from the Monks Covers record: http://t.co/JQYaBMh9", "Wed Dec 05 20:34:31 ": "My new website!: http://t.co/W32noweS", "Sun Jul 22 02:05:15 ": "At Greek wedding. Why does every Greek song sound like a karaoke version of itself. With words.", "Wed Oct 24 05:04:42 ": "Gave Eight and a Half a ride to Montreal today. Now watching Sic Alps. Montreal is always good.", "Mon Dec 10 03:31:38 ": "Video is wrapped! Now for editing. Done in a month. http://t.co/h0S1wivc", "Sat Jun 23 06:01:22 ": "The Seventh Sin at The Cavern in Winnipeg. I haven't enjoyed metal in a while. Shit is dope.", "Sat Apr 20 09:21:28 ": "Holy shit... Whistler makes me feel so fucking old.", "Tue Jun 26 21:20:35 ": "Monks tribute record is mastered!", "Sat Jun 16 18:34:07 ": "Tonight: Flaming Lips and Limblifter.", "Mon Dec 10 00:13:11 ": "Goose. http://t.co/Qni29zQd", "Thu Jun 28 19:17:27 ": "http://t.co/AwDLF9ry", "Thu Apr 11 00:47:18 ": "Rockin The Peg tonight with Kos. Rich Aucoin has been rad every night.", "Fri Jul 27 22:18:39 ": "Thanks to everyone for the amazing show last night. Was the most fun I've had in a while.", "Thu Oct 11 18:28:52 ": "Rockin a bunch of frosh in Montreal tonight", "Tue Apr 16 19:18:19 ": "Another drive day today... Nelson to Victoria. I hope they still have Galaga on the ferry.", "Wed Apr 17 04:19:58 ": "Just had 'Pig' BBQ IN Victoria. I'll give it a 7 cuz it exists in Victoria. Would be a Toronto 6. In Texas would be a 3 out of 10 at best.", "Thu Aug 16 15:47:21 ": "New Telus ad with me on it: http://t.co/QEAqvY5K", "Sat Mar 23 18:30:23 ": "Our failed audition tape for The Amazing Race Canada: http://t.co/vIi2nh9hs3", "Fri Dec 07 19:40:10 ": "Listening to vinyl test pressing of the new record. I'm so proud of this. I feel like if others don't love it, I should just quit music.", "Tue Jun 12 01:37:55 ": "Coincidentally, my dog Roger turned four today. He will be able to let me know if my songs are truly reaching his demographic.", "Tue Apr 23 17:24:00 ": "My new EP is out today. Get it on iTunes: https://t.co/iQeFdouyji", "Mon Dec 10 00:33:40 ": "Full band. http://t.co/Pwy9WgTg", "Sun Sep 16 19:59:18 ": "I don't think I could ever really trust a person that claimed to actively dis-like Bob Marley. Indifference - MAYBE.", "Sun Sep 23 21:37:04 ": "Great weekend at Pop Montreal. The music and good times may have even beaten the smoked meat this time.", "Wed Feb 06 16:40:51 ": "You can order CD copies of my new record here (ships internationally): http://t.co/LxIJi6jP", "Tue Jan 01 02:00:39 ": "Just found out that Jack White's label - Third Man Records - is named after one of my uncle Carol's movies.", "Mon Jan 28 16:33:56 ": "Watch my first video for the song 'Credit' from the upcoming album:\nhttp://t.co/vwgZ8g0f", "Sun Dec 16 22:23:17 ": "Photo shoot today with Victor Tavares. Looking as dapper and English as I possibly can.", "Fri Nov 30 07:48:05 ": "If you see someone with a vintage grey cup 1979 toque, CBC logo, red Pom Pom, it is stolen. It belongs to the clapper!!", "Mon Dec 10 00:23:37 ": "Mini Steve and Jamie http://t.co/lSFBbOZA", "Thu Jul 26 15:09:47 ": "Tonight is the big show. Monks tribute feat dude from The Monks at The Shoe. 9:30 - Order of Good Cheer, 10:30 - John Ford, 11:30 - The shit", "Wed Oct 03 16:48:44 ": "My new musical instrument insurance company needs to know if I play any 'Rap Music'. Actual question on the application.", "Wed Jan 30 00:08:51 ": "MuchMusic Thomas D'Arcy First Spin: http://t.co/xwyM4HpE", "Sun Aug 26 00:22:15 ": "What is with the new Colby Rasmus braided mullet?", "Fri Dec 14 19:02:48 ": "The ultimate maker of laser sounds http://t.co/BONaybMg", "Mon Jun 11 21:02:38 ": "Writing music for a kids show. 4 year old children have to understand it. The limitations of a haiku are what set you free.", "Tue Mar 05 04:14:09 ": "'if you're happy, I'm mostly happy, but...'", "Sat Jun 23 06:04:38 ": "Apparently a band played here called 'Cunt Punisher'. Haven't seen such a good band name since chicago's 'Faggy Pussy'. Metal is hilarious.", "Fri Jan 04 02:49:42 ": "Ken Burns baseball documentary: worst soundtrack of all time", "Sun Jul 22 17:07:36 ": "Download the Monks Covers record here: http://t.co/KFBV4boi", "Thu Sep 06 03:33:01 ": "Hanging around k-os video shoot today. Leant my vista-lites, which is kind of like being in it?", "Tue Sep 04 04:11:18 ": "'You Lovely You' single now available on iTunes: http://t.co/BobqAZ0H", "Fri Dec 21 23:13:43 ": "Somehow I've managed to avoid all Christmas parties this year. Except our own at the studio."}