{"Mon Oct 29 07:06:41 ": "@tahnee_atkinson hello:) hope your going well:) and Thankyou very much for your Vidio:)", "Mon Nov 05 23:54:01 ": "Thankyou everybody for your support:) let's just hope we can get through another week:) Thankyou all", "Tue Jan 15 23:56:09 ": "Perth Perth Perth woooohooo:)", "Mon Oct 22 22:46:06 ": "Goodmorning everybody:) well lets all have fingers crossed for tonight and hope for the best:) I hope you all have a great day:)", "Sat Oct 20 07:51:41 ": "@BellaFerraro17 ok cool:) come round when ya get back and chill:) watch Mel go gangnam hahaha. I'll be here", "Wed Oct 17 09:51:17 ": "@BellaFerraro17  BELLA AND FARMER JASON:) x http://t.co/dKk6lg1K", "Thu Apr 11 07:17:05 ": "Go to my website for all the details for my tour with @amberlawrence !! http://t.co/zRSZRN9YT3", "Mon Jan 07 03:41:08 ": "First x factor tour and the first ever tour show is on the gold coast:) WOOOOHOOO", "Mon Dec 03 02:27:59 ": "RT @tinrooftouring: Only 4 Days until Samantha Jade's album is released! Come and Support her LIVE!\n@sjademusic \nTickets: http://t.co/uQ ...", "Tue Jan 22 11:42:43 ": "Might see some of you tomorrow at the airport:)", "Thu Oct 18 06:26:00 ": "Loving the amazing views around here:) awesome:) http://t.co/IzSnq6tH", "Mon Oct 22 10:47:29 ": "I do not love Bella I just like her a lot :)", "Sun Oct 28 10:27:55 ": "Well everybody here we go again live show tomorrow night:) WOOHOO lets do it:)", "Wed Oct 17 08:21:48 ": "One happy little family hahaha:) http://t.co/EJYgJJFG", "Fri Nov 23 00:13:36 ": "Hey everybody let's bring my single MAKE IT LAST up the charts more WOOHOO", "Fri Oct 26 07:25:39 ": "Awesome dinner with j Owen:) http://t.co/9XZfN6Rq", "Wed Dec 05 06:45:15 ": "Good old dancing in the moonlight:) http://t.co/yv9UdZBI", "Fri Dec 21 04:11:10 ": "Gotta love good old Sydney:) but there is no place like home:)", "Mon Nov 12 23:22:04 ": "@BellaFerraro17 hahaha they won't:) I know how cute is it haha:) gotta love em", "Thu Oct 11 02:45:11 ": "@evie_smurf  happy birthday for tomorrow I hope you have a great day:)x", "Thu Oct 11 02:46:14 ": "@evie_smurf happy birthday for tomorrow I hope you have a great day:) x", "Mon Mar 25 06:50:33 ": "Pre-order your signed copy of LIFE IS A HIGHWAY from Sanity http://t.co/x6bnnhctau. Hope you like the album cover :)) http://t.co/mdpN7H3odr", "Mon Apr 22 06:25:25 ": "Filming the music video for my single Island in the Stream with @amberlawrence! Can't wait for you all to see it :)) http://t.co/6YXhrv8kcE", "Sun Oct 21 09:51:49 ": "@OfficialMelB  best mentor:) just lazer cut this for you:) http://t.co/QHyyuho2", "Thu Oct 11 02:44:25 ": "@__krystaaal thankyou very much:)", "Thu Apr 11 07:02:11 ": "Hey guys, my new single ISLANDS IN THE STREAM, is not out on iTunes just yet but you can preorder the album at Sanity or JB Hi-Fi :)))", "Fri Dec 07 05:57:13 ": "Goodluck to everybody who is auditioning for next years x factor:) let's hope you all get that call to Sydney:) goodluck enjoy the ride.", "Tue Dec 18 23:59:37 ": "Hello everybody:) I hope you are all good:) merry Xmas to you all:)", "Sun Jan 13 02:48:54 ": "In Hobart guys:) can't wait to see you all tonight:) wooohooo", "Mon Oct 15 12:38:12 ": "@BellaFerraro17 hahaha yeh sounds good:) maaaaaaa hehe", "Thu Jan 10 03:48:43 ": "\"@kirstenshinea that's so sweet:) Thankyou so much for coming:)", "Mon Jan 07 03:39:39 ": "Gold coast:) YEH", "Sun Oct 21 09:59:28 ": "RT @OfficialMelB: @jasonowen070 you are the perfect gentleman always can't wait for you to show OZ what ya got in store tomoz", "Sat Oct 20 07:19:07 ": "@BellaFerraro17 farmer Bella come watch the live shows back with us lol:)", "Wed Nov 21 13:09:01 ": "@BellaFerraro17 sorry i didnt get to say goodbye:) farmer jas is at albert and wants to know when your coming out hahaha? i miss everyone:)", "Sun Feb 24 12:09:58 ": "@VictoriaLaauren hope to soon", "Sat Oct 13 04:26:17 ": "@BellaFerraro17 AHHHH NOOO BELLA HE HAS GONE MAD. http://t.co/WXsNyqQT", "Mon Oct 22 10:48:13 ": "And she's going to come to albert!!!!! Xxxxxx", "Mon Mar 25 06:48:51 ": "'Life Is A Highway' is now available for pre-order online at Sanity! Go to http://t.co/x6bnnhctau to pre-order your SIGNED copy :)))", "Wed Apr 17 00:36:31 ": "Signing some stuff to give away to my amazing fans... :))) http://t.co/MnRRJP3tcL", "Thu Jan 17 00:32:13 ": "Sydney here we come:)", "Thu Nov 22 12:34:33 ": "WOOHOO my single will be released tomorrow:) enjoy  everybody:)", "Sat Nov 10 10:55:10 ": "@BellaFerraro17 @bobneedaname hahaha so cute Bella", "Mon Oct 15 12:29:38 ": "@BellaFerraro17  heyy yeh sounds good:)", "Tue Oct 23 11:51:51 ": "You are all amazing Thankyou so much for all your support:) I wouldn't be here without you guys:) love you all:)", "Tue Mar 12 05:35:47 ": "Drum roll please...", "Wed Mar 06 03:30:57 ": "Instagram finally guys hahahah:) JasonOwenOfficial.", "Tue Mar 12 01:36:57 ": "Going to be announcing the title of my new album today! Who's excited?!", "Thu Apr 11 04:05:28 ": "The first single 'Islands In The Stream'  is out at radio today!!! It's a duet with country music star Amber Lawrence. Hope you all like it!", "Sat Oct 13 06:42:40 ": "@BellaFerraro17 hahahaha cuuute:)", "Thu Apr 04 07:29:15 ": "Hey guys:) hope to see you at the Dubbo rsl on the 12th of April at 8 pm :) first time performing song of my new album life is a highway:)", "Thu Oct 11 02:22:16 ": "@jasonowen070 @BabyBrittles Thankyou so much for your support love ya:) x", "Tue Feb 26 04:27:15 ": "Will be at Tottenham NSW memorial park on Saturday 2nd of march at 4pm:))", "Tue Mar 05 03:43:30 ": "miss these guys :) http://t.co/Wy4u3vd6FB", "Thu Jan 10 03:45:05 ": "In Melbourne what an awesome place:)", "Tue Apr 23 02:55:26 ": "Listen to my single Islands In The Stream feat @amberlawrence  before my album goes on sale this Friday https://t.co/CWFw7vc156 :)", "Sat Oct 20 09:27:54 ": "@BellaFerraro17 where are ya farmer Bella hahaha:)", "Sun Nov 11 10:30:09 ": "@BellaFerraro17 how many months ago was 6 months ago  hahahaha:)", "Thu Apr 11 07:04:14 ": "Check out my tour posters! :))) http://t.co/boVX8qOxwy", "Fri Oct 19 05:54:45 ": "RT @MadelineOGorman: @jasonowen070 daaaamn boy you fine http://t.co/l568rjNx", "Thu Oct 18 07:13:07 ": "Big roo haha:) http://t.co/kBtnA2IO", "Fri Nov 30 07:54:38 ": "Welcome back Sydney:) YAYYYY", "Tue Jan 22 01:23:38 ": "Flying to the gold coast tomorrow woooohooo:)", "Sat Oct 20 02:56:35 ": "@BellaFerraro17  nawwww you cutie:) YES YOU ARE:( hahahaha x", "Sun Feb 24 12:02:03 ": "Hey everybody hope your all going well:) I have had a very nice weekend and hope you all did to:) night and talk to you all tomorrow", "Wed Mar 06 20:15:44 ": "Photo shoot today :D woohoo", "Wed Nov 14 00:11:03 ": "@BellaFerraro17 you are one in a million:) nobody has a voice like you it AMAZING:) i miss you already but ill see all you guys again soon:)", "Tue Jan 22 09:27:54 ": "RT @VictoriaLaauren: @jasonowen070 meet and greet?", "Fri Nov 30 09:37:02 ": "Out to dinner with some great friends:) http://t.co/MGhFcjpW", "Sun Feb 24 12:10:35 ": "@melbosse_ Thankyou very much", "Thu Oct 18 09:06:06 ": "I have never been to a cafe were you having to cook your own dinner hahaha:) http://t.co/5ZXAUgPp", "Wed Oct 17 11:07:14 ": "@BellaFerraro17  hahaha well there is no explanation to what I look like hahaha:)", "Mon Oct 15 11:52:57 ": "Hey everybody hope you enjoyed my performance:) please help me to stay in:) you are all the best:)", "Thu Mar 21 07:19:34 ": "Have u signed up to receive my newsletter?\nIm going to reveal the track listing for  Life Is A Highway next week!\n\n http://t.co/zRSZRN9YT3", "Wed Jan 23 22:51:47 ": "Wet and wild today or what hahaha", "Thu Oct 11 21:41:23 ": "RT @BabyBrittles: @jasonowen070 you need a profile picture :) This should do...looking fiiiiiine ;) You really are talented #LoveYouJaso ...", "Wed Apr 10 12:05:14 ": "Dubbo rsl this Friday guys:) hope to see some of you there seeing triple j is on Saturday there:) Friday night 8pm dubbo rsl:)", "Mon Jan 28 06:55:25 ": "What's on in the gold coast tonight?:)", "Sun Dec 30 04:54:39 ": "Getting close to the tour now everybody:) wooo hoo", "Fri Oct 12 04:33:27 ": "LOVE IT:))) hahaha http://t.co/4gBVWnpO", "Thu Jan 24 23:21:48 ": "Time zone surface paradise in bout half hour so keen hahahah:)", "Thu Oct 18 09:11:46 ": "@saarahh_10  hello sure do:)", "Wed Oct 17 09:21:18 ": "RT @Deannahahaha: @jasonowen070 4 FOR U JASON OWEN U GO JASON OWEN!!!!!! Do us fans proud!! Retweet???? :)", "Sun Feb 24 23:25:13 ": "Gods morning everybody I hope you all had a great sleep and into the another beautiful day:)", "Sat Jan 26 22:31:22 ": "Flying back to sydney today had the best time on the gold coast with holly Claire:) Probley see some of you at the airport at bout 3:)", "Thu Apr 11 07:15:04 ": "@BrandonWoodz Check out my website http://t.co/zRSZRN9YT3 :))", "Thu Oct 11 02:48:25 ": "@KaylynKegans thankyou very much to you all:)", "Wed Apr 10 12:07:02 ": "@SmithChippies very sorry bout that you knew what I meant lol. Nice to meet you guys:)", "Tue Mar 05 03:52:18 ": "Hey everybody I now have instagram follow me @ JasonOwenOfficial", "Wed Mar 20 07:14:16 ": "Sydney again working on album for you all:))", "Mon Apr 08 03:29:04 ": "You can now pre-order my album @JBHiFi http://t.co/e467jtLHli\n#LifeIsAHighway", "Mon Feb 18 08:13:47 ": "Love these guys:)) http://t.co/oIU6RF1b", "Wed Nov 28 01:40:11 ": "Make it last is now out on cd:) WOOHOO:)", "Mon Nov 26 08:04:28 ": "If you haven't got my single yet, you can get it at iTunes :) http://t.co/j3LlSxhR", "Mon Oct 22 11:16:26 ": "@BellaFerraro17 your sneaky:) you got hold of my phone and twitter hahaha:) x", "Mon Mar 25 07:28:37 ": "RT @sanityonline: Life Is A Highway, the debut album from @jasonowen070 will be released April 26! Pre-order -&gt; http://t.co/r4ZyLrSLC ...", "Wed Nov 14 01:22:47 ": "@BellaFerraro17 hahaha nawww god love you:) I can't wait it's gunna be great:) farmer Bella gotta come out before Christmas soooo fun", "Wed Oct 17 11:09:58 ": "My awesome mentor goes gangnam hahaha:) http://t.co/Td5GB72E", "Tue Feb 12 03:49:49 ": "On the recording studio WOOHOO love it:)", "Tue Mar 12 05:44:56 ": "So, the name of my upcoming album is...Life Is A Highway :)))"}