{"Sat Aug 11 18:47:38 ": "Gold!!!! Go Mo!! OMG!!!!", "Tue Apr 03 21:39:35 ": "@MiuGlitch only if it was a glamorgan sausage...", "Fri Jun 22 17:44:43 ": "@StealthMountain ...cheers chuck!", "Sun Feb 03 20:23:03 ": "@mock so sorry - if there are none left on our website, think they've all sold out.", "Thu Apr 05 17:40:36 ": "Just to let you know that Chris is playing at Sound Control, Manchester tonight! Should be a goodun! http://t.co/9OzFEEeW", "Fri Aug 03 14:46:55 ": "@Macker202 sorry to hear that, the 4 CD box set contains rare and unreleased stuff! Not sure if distinctive will make available for download", "Mon Oct 29 22:02:18 ": "@saj1964  .... Hahahahahaaaa!!!", "Mon Sep 24 09:34:41 ": "Limited numbers of the 4CD boxset now available from our website + canvas printed artwork and iphone cases. http://t.co/WsqqPkrc", "Wed Feb 06 08:30:53 ": "I just travelled 91 meters into the frantic mines of @RailRush on iOS! Can you top it?  http://t.co/IQYMdO6h", "Fri Feb 15 20:31:10 ": "@__DJohnson__ not sure... Will find out - maybe chris could re-enact it and plop it on soundcloud if it wasn't?", "Mon Aug 06 17:15:41 ": "Our Summer mix #BeatportMixes http://t.co/ozjRQwAl via @beatport", "Sun Aug 12 21:42:47 ": "Go Norman!!!!", "Sat Jun 23 10:31:18 ": "So... today is Chris' birthday... and he's doing his first Triathlon... it's going to be one hell of a triathlon after party! :D", "Wed Jul 18 08:50:14 ": "@UNKLEPaulTHX what did they play? :)", "Tue Nov 29 18:50:09 ": "We are not the greatest fans of mrs Susan Boyle at this very moment...", "Wed Aug 22 13:32:45 ": "@dignitasR2K ... Hmm... Not that we're aware of - we'll ask Distinctive!", "Mon Jul 16 19:44:19 ": "RIP Jon Lord - http://t.co/21sG1MUS", "Sat Aug 11 18:52:06 ": "Truly amazing!! RT @simonpegg: OMoG!!!!!!", "Wed Nov 30 09:52:40 ": "'Our ice cream man was found lying on the floor of his van covered with hundreds and thousands. Police say that he topped himself'", "Sat Nov 26 18:16:02 ": "Kelly Roland ...'Tonight, you're making everything feel right, Tonight, I wanna get high and touch the sky. I'm down for whatever'...Oh dear", "Mon Jun 11 13:36:44 ": "Really excited to say that Ghost Recon Future Soldier just went #1 worldwide! http://t.co/TjTRTFD0", "Sun Aug 12 21:24:31 ": "Surely one song from George Michael was enough?", "Tue Apr 03 19:57:56 ": "Working on Total Recall - Here's the official site http://t.co/dOlXtNvl", "Wed May 23 20:42:29 ": "Our soundtrack for ghost recon is out on iTunes and amazon feat. new original music from us and co composer Tom Salta- http://t.co/MuI47cV9", "Tue Apr 03 20:04:58 ": "Sorry... do we sound a tad excited?...... @totalrecall", "Sun May 27 15:49:40 ": "My new sounds: Hybrid - Ghost Recon Future Soldier (Soundtrack Clips) http://t.co/Ogs2IfMg on #SoundCloud", "Wed Oct 31 18:13:17 ": "Happy Halloween! X http://t.co/CSlO15Qj", "Fri Dec 02 15:21:51 ": "So with a small amount of help from a size 12 shoe, a modicum of verbal abuse and a good thrashing, the mixing desk seems to be working!", "Mon Dec 26 12:38:45 ": "RT @NeilNavarra: Second gig tonight is  for @hybridsound and friends at Monkey in Swansea! Set time TBC!! Knitwear special so get your X ...", "Tue Jun 26 13:55:35 ": "@t0nymt - that's really a question for @distinctiverecs", "Tue Nov 20 23:47:27 ": "http://t.co/fpUJnuzZ", "Wed Feb 20 20:41:38 ": "@Thismode3 ... We make all our drum sounds, FX and noises .. Wouldn't remember how we made those though I'm afraid.", "Tue Nov 20 23:47:37 ": "http://t.co/4VkWMaoS", "Thu Feb 02 13:24:14 ": "Oooh... New update of lion.. Will this save us from the agony of having to go back to snow leopard??? Please Apple please!!!!", "Fri Jun 29 15:24:10 ": "Promised you a sneaky peek of our cover of Depeche Mode's 'Enjoy The Silence' and here it is! ... http://t.co/vIfyPqMR", "Thu Jan 17 23:42:21 ": "RT @creamreunion: Tickets flying out for Cream Reunion @graemepark @john00fleming @hybridsound @DJPBleasdale &amp; Joanna Law. Dont miss ...", "Wed Aug 29 23:47:33 ": "@Tim_SwanSmith bloody norah!!! We're doing the best we can to supply the sweets and it's not even our sweet shop!", "Thu Nov 15 00:47:20 ": "http://t.co/pb7W2CDL", "Sat Dec 01 00:52:13 ": "If anything ... Palma Violets have caused an effect, in me, it's irritable band syndrome... Scratching my arse thus!", "Mon May 28 09:28:45 ": "Sorry - last link to Ghost Recon Soundtrack didn't work.This one does though! http://t.co/lHWen1AE", "Mon Dec 05 17:25:04 ": "Just finished photo shoot at the custard factory. They must have made a hell of a lot of custard! http://t.co/9iRXJGCM", "Mon Dec 26 19:55:18 ": "Do please send us pics of your horrendous Christmas knitwear! We loves it! X", "Sun Feb 03 18:19:09 ": "Chris took this photo of someone's t-shirt at @creamreunion party last night! Awesome! Who is hero number 4 though?... http://t.co/9U28rinf", "Sat Feb 02 13:08:55 ": "Chris is all set for @creamreunion tonight!", "Wed Sep 26 21:39:49 ": "... Mr Jonny Greenwood's 'There Will Be Blood' score is truly magnificent ... And just as bonkers as Daniel Plainview", "Wed Sep 26 20:50:51 ": "New studio set up - first track to play, Shawshank Redemption... Fricking LOUD!", "Sun Aug 12 22:05:34 ": "Well done the UK for being beautifully eccentric as always! We are dead proud! Isn't it!", "Thu Aug 09 20:37:56 ": "Total Recall score now available on iTunes, additional music by team Hybrid! http://t.co/dbY6HvOb", "Sat Mar 10 21:54:54 ": "Sometimes... We can't mention what we're doing because if we told you, we'd have to shoot you, then ourselves....", "Sat Dec 24 21:27:22 ": "Happy Christmas!!", "Fri Jul 27 18:16:34 ": "Can't help but feel proud for the UK this evening! Go London and Go Danny Boyle!! May Mary Poppinseseses fall from the sky!", "Tue Apr 03 19:52:09 ": "Finally able to let you know that we're working with Harry Gregson-Williams on the new summer blockbuster Total Recall http://t.co/ysGT1kOS", "Mon Sep 17 23:18:12 ": "Just moved house... It's so quiet I can hear my own tinnitus. The sound of the motorway used to block it out...... One door opens...", "Fri Jul 27 21:06:48 ": "Go Dizzee!!", "Thu Dec 01 23:02:23 ": "Two blondes walk into a building... You would have thought at least one of them would have seen it?", "Thu Jan 12 22:36:48 ": "@qbject Experience tells us that when you know something, you know nothing at all so we wouldn't like to say either way. Let the mud decide!", "Sat Nov 26 18:18:30 ": "Back from Ireland with new mixing desk after meeting a man in the woods in true deliverance style! The lengths we go to for a bargain!", "Fri Dec 23 15:20:30 ": "@LeonAlexnder @stevehope @EvaHope @LIZZY_B_ @gerarddriveby @DJNickWarren @jodywisternoff @Photek @emikatwit @WillSaul Happy Christmas!!!", "Fri Jun 22 17:43:37 ": "Finally able to tell you that the mystery cover we did last year was Depeche Mode's 'Enjoy The Silence'. Sneak peek for you next week!", "Sun Jan 29 03:17:27 ": "http://t.co/4oBKwTyD", "Thu Jan 17 23:38:59 ": "http://t.co/WhA1hfTu", "Thu Feb 02 13:21:06 ": "@LukeRedlight I feel your pain! Charl x", "Mon Oct 29 21:16:04 ": "Just another average night in the studio... More pillows for Chris please!  http://t.co/cOJXswHp", "Fri Jul 27 20:18:20 ": "Watching Olympic ceremony - pats on backs to @underworldlive, it's sounding awesome!", "Sat Nov 26 18:57:34 ": "@HeavyFeet ... Oooh you're warm!", "Fri Jun 22 17:31:42 ": "Finally able to tell you that the mystery cover we did last year was Depeche Mode's 'Enjoy The Silence'. Sneak peak to be released next week", "Mon Jul 16 19:41:34 ": "RT @distinctiverecs: @hybridsound \"Classics\" - Limited Edition 4 CD Box Sets ... Not many left now, get your pre-orders in quick! http:/ ...", "Fri Jan 20 22:31:17 ": "http://t.co/6V6aTaYI ...because her voice was part of so many lives, whether they knew it or not.", "Fri Dec 02 15:16:31 ": "ok - last of the Tommy Cooper jokes..... Two elephants fell off a cliff... Boom boom!", "Fri Jul 27 20:44:53 ": "Not sure what drugs they were taking when the devised the uk Olympics ceremony, but they must have been jolly good!", "Tue Nov 20 22:07:55 ": "Studio dementia http://t.co/3Le1OKLc", "Thu Jan 12 22:09:32 ": "@qbject ... Those in the know are fighting it out in an all weather mud bath somewhere hot & sticky. As soon as we know we'll let you know!", "Thu Feb 02 13:25:56 ": ".... Speaking of which.. Just nipping down the laundrette to get my anorak washed!", "Sat Nov 26 18:33:48 ": "@HeavyFeet ...a big shiny one with flashing knobs and slidy sliders... Flashing things and blue lighties! It's amazing!!!", "Wed Sep 26 21:28:20 ": "@LiamTeaTate ... Mike says, I against I (massive attack) perfect for mixing, I reckon fifth element and Shawshank perfect for orch. Charlx", "Fri Jun 22 17:56:18 ": "Classics album artwork http://t.co/iJqddyCk", "Tue Nov 20 23:47:12 ": "http://t.co/rgFTaBzP", "Sun Dec 04 21:05:08 ": "Photo shoot tomorrow... shame on you Sunday lunch!! Shame on you!!!", "Fri Jan 20 22:23:45 ": "Etta James... What a voice.. RIP", "Sat Mar 10 21:52:09 ": "RT @cynicalmatt: The most common question I get is \"where is your inbox?\" Perhaps where the large, stylized sign indicates. http://t.co/ ...", "Wed Jul 11 09:41:25 ": "Here's a ten minute mini-mix of the forthcoming Classics album to tickle your ears with! http://t.co/KPhJhJyK", "Fri Aug 24 09:35:47 ": "@RobStormchaser - Distinctive said shipping would be yesterday or today with delivery next week! :) sorry for the delay!", "Fri Aug 24 06:59:21 ": "RT @simonpegg: Holy shit! A young, single guy was photographed having naked fun on holiday!!! The Mayans were right. The end of days is  ...", "Thu Jan 26 17:25:15 ": "@LeonAlexnder @stevehope @compijamas ... Those wine bottles are deceptively large! Three heads go boom boom boom... Ouch!", "Sat Dec 01 00:29:54 ": "So so so so so so so so very disappointed in Jools Holland for bringing us Palma Violets... Oh ... Dear... Oh dear... WHYYYYyyyyy!!!", "Wed Sep 26 21:58:08 ": "I have a milkshake... And you have a milkshake... (Been possessed by Daniel Plainview)", "Mon Sep 24 17:58:48 ": "@ccavlish ... Oh poo.. did Facebook and forgot Twitter! Rubbish!! ..will endeavour to update you all much more in future! Many apologies.", "Fri Jun 22 18:08:34 ": "@M0ZZMAN @Dickiebb ... No comment .... But yes.", "Mon Aug 20 08:12:25 ": "Shocked and saddened to hear of the death of Tony Scott who we had huge the privilege to meet &amp; work on his films. R.I.P.", "Wed Aug 29 09:48:34 ": "@Tim_SwanSmith hi Tim, said on FB last week Distinctive were shipping last week with delivery this week - know no more than that. Sorry", "Fri Jan 06 10:39:47 ": "A new favorite: Guy J & Miriam Vaga -  Fly (Hybrid Soundsystem remix ) by @djjohndigweed http://t.co/vwomLYXR on #SoundCloud", "Sun Sep 23 21:25:26 ": "Hello everyone, wanted you to know about a bit of fundraising Charlotte's doing and a link to a song http://t.co/jk2W3tip", "Fri Jun 22 17:51:29 ": "Our 'Classics' album will be released on July 30th too! Contains highlights of the past 4 albums plus some rare &amp; unreleased tracks.", "Mon Jan 09 18:41:59 ": "Guy J & Miriam Vaga -  Fly (Hybrid Soundsystem remix ) by @djjohndigweed via #soundcloud http://t.co/uTktRpbW", "Wed Dec 14 20:29:12 ": "@dizetoot @MasterChefUK ... We just scraped our jaws from the floor...!", "Fri Aug 24 07:01:43 ": "RT @simonpegg: The level of disgust expressed at naked Harry is directly proportionate to the amount those people need to have some dirt ...", "Wed Nov 14 23:49:31 ": "Half way through a movie, the strain is starting to show .... http://t.co/0nxlVBem", "Tue Nov 29 18:55:00 ": "Hands up who eats their own bird's nuts.. No? No one? Hmm..", "Thu Jan 12 21:54:57 ": "early mornings.. ewwww, been up since half four AM and in the final flailings of Ghost Recon. Ooh it's sounding tasty!! more coffee anyone?", "Fri Jul 27 21:12:54 ": "... And Sir Tim Berners-Lee, the inventor of the world wide web... Posh!"}