{"Wed Apr 24 19:33:58 ": "@richydunne @SportCasuals Sooooo much better ;-)", "Sun Apr 21 11:36:27 ": "Where is my mind?", "Wed Apr 24 19:04:59 ": "@fuck__forever dancing can be dark; just depends what you're trying to forget.", "Sun Apr 21 14:43:24 ": "RT @TommBentley: I refuse to give money to eBay touts for RSD items so if anyone has seen a @chapelclub 12\" picture disc album sampler let …", "Wed Apr 24 13:13:33 ": "And join the Facebook group for all the info on future events: http://t.co/xOtb6WwM9R  :-)", "Sun Apr 21 00:29:02 ": "@foghorngleghorn I love you so much. You put all my doubts in your pocket and buy me a drink. What more can a person ask for?", "Sat Apr 20 15:29:06 ": "@MikeDiver (Obvs realise you were just messing, btw.)", "Sat Apr 20 09:47:14 ": "RT @TheBeatJuice: If you missed it yesterday check our exclusive on the @chapelclub TRUE FATHOMS mixtape http://t.co/rfgSELHTPp", "Sat Apr 20 07:54:06 ": "It's bittersweet actually cos I went to theirs this morning and they're not here. I'm sat on the front wall if anyone wants to come say hi.", "Sun Apr 21 11:35:48 ": "Where is my wife?", "Wed Apr 24 19:06:57 ": "Pretty exciting to think that reviewers now have the new record.", "Wed Apr 24 19:03:39 ": "@Lloyd_Bartlett shoulda said hi man", "Wed Apr 24 19:33:43 ": "@deadbeatsummerr June 3rd. And hopefully...", "Sat Apr 20 15:17:48 ": "@joshsoupy check Banquet Records; otherwise I'll let you know if we get extras - though it's unlikely. Admin rools!", "Fri Apr 19 14:04:41 ": "RT @HannaHanra: CHAPEL CLUB EXCLUSIVE ‘TRUE FATHOMS’ MIXTAPE  &lt;3 &lt;3 &lt;3  http://t.co/mrp24lqv4O via @thebeatjuice", "Sat Apr 20 11:45:35 ": "RT @AutumnsBand: @chapelclub Got the record. It's fantastic. I literally can't take my eyes away from it.", "Sun Apr 21 01:16:30 ": "@Groxley Be strong.", "Sun Apr 21 11:32:30 ": "@linnb_ We r pleezed.", "Thu Apr 18 20:22:12 ": "@ewanpearson Ha, if @paulepworth was in GoT the Starks wouldn't be in this mess. And there'd be far less lute.", "Sun Apr 21 00:37:05 ": "@MikeNightingale If we go, we'll write ourselves one hell of a eulogy.", "Wed Apr 24 22:02:34 ": "brothers and sisters have i none but this man's father is my father's son. when i was little that shit took away like, a week of my life.", "Mon Apr 22 17:39:12 ": "@HarryBarnes Thank you! Glad you like it.", "Thu Apr 18 19:17:27 ": "Not being funny but I would make a brilliant filthy little scumbag. Imagine me with mud all over my face tramping around Ireland snarling.", "Sat Apr 20 15:23:12 ": "@BeverleyPK72 Ha, we don't make any money from it; I'd be happy to give him a free one if I had any x", "Sun Apr 21 00:53:34 ": "@texmexinjersey go for it brother; I'm listening to the last track on the new strokes record &amp; it's amazing.", "Tue Apr 23 11:50:52 ": "TRUE FATHOMS MIXTAPE. Check out our mixtape of our own jams, remixes + other tracks.\n\nhttps://t.co/JSm9tjR6OQ", "Mon Apr 22 20:54:42 ": "Admittedly I only heard of Broadchurch tonight but as long as Vicky McClure's innocent, I'm happy. #sorrydan", "Wed Apr 24 13:11:45 ": "On May 12, CC are DJing @eso_soup @southplacehotel. Brunch + booze + tunes = one fun Sunday. Visit http://t.co/ax6vZe4H5j to book a table.", "Fri Apr 19 12:42:15 ": "I mean, how is it that I know the contents of a dead terror suspect's Amazon wishlist within hours of his death? It's mind-boggling.", "Sun Apr 21 00:27:56 ": "RT @JonHatchman: @chapelclub #RSD13 http://t.co/MNUT8IeKGv", "Tue Apr 23 19:02:58 ": "Win one of these 12\" picture discs, signed by the band @RSDUK.\n\nEnter here&gt;&gt; http://t.co/qxsQUsPmG6 http://t.co/qIAdUMspDX", "Thu Apr 18 19:32:00 ": "Take a look at our 12\" picture disc, made especially for Record Store Day @RSDUK &gt;&gt; http://t.co/iE2awYb8Gj", "Thu Apr 18 19:17:42 ": "Really want a part.", "Thu Apr 18 22:28:38 ": "@HarryBarnes not sure chap, sorry - best to call or visit your local store and ask... X", "Sun Apr 21 00:54:54 ": "@linnb_ Linn, if I worried about /10 scores... This is an experimental electronic pop record about love and depression. It's ace.", "Wed Apr 17 20:20:57 ": "@HarryBarnes Looks legit, yep x", "Sun Apr 21 00:40:04 ": "@linnb_ Oh I believe in the new gear, don't worry. We've been brave and fun and harsh and tender. That's what it's all about, i think.", "Sat Apr 20 15:28:43 ": "@MikeDiver So annoying to release st &amp; hear that fans can't get it, then look on eBay &amp; find people already listing it at triple the price.", "Wed Apr 24 19:08:56 ": "@jakethh Soooooonnnnnn. Even I'm over the wait and I've had it for ages.", "Sat Apr 20 12:56:59 ": "@TommBentley I promise if I can rustle up any extras I'll let you know, sorry again chap - my folks couldn't get any either :-(", "Sat Apr 20 14:21:10 ": "We wanna see photos of our #RSD release on your turntables! Mainly because none of us has one.", "Sun Apr 21 01:17:21 ": "@linnb_ Man, he doesn't need a hat. He - along with my wife - is My One.", "Sun Apr 21 00:56:58 ": "@linnb_ Linn, my dog is god backwards. We're going to live in Panama together. X", "Mon Apr 22 20:48:38 ": "He's covering up for his kid! #Broadchurch", "Sun Apr 21 01:15:45 ": "@MikeNightingale kickinnnnnnnnnn x", "Wed Apr 24 16:07:00 ": "RT @liamrothers: oh my lord @chapelclub http://t.co/LoIuzK5qxS", "Mon Apr 22 17:38:56 ": "@joshsoupy ah, good news!", "Sat Apr 20 11:45:39 ": "RT @oliverbearhall: @chapelclub beautifully hypnotic http://t.co/WHDdvgq4tI", "Sun Apr 21 00:35:04 ": "The problem with Twitter is that it encourages me to instigate conversations with people who don't respond. That shit kills me.", "Sun Apr 21 00:27:16 ": "RT @SamCarruthers1: And the award for most beautiful @RSDUK release goes to @chapelclub for their 12\" good together picture disc vinyl. htt…", "Fri Apr 19 12:43:58 ": "RT @TheBeatJuice: TFIF and we've got the exclusive on the @chapelclub 'True Fathoms' mixtape &lt;3 http://t.co/hsXVPUkJwq", "Sun Apr 21 00:27:47 ": "RT @trudehatchman: After 6 hours of routing through London record shops finally found @chapelclub RSD13 release!", "Thu Apr 18 12:08:39 ": "Until today I never knew I was a fan of Maori love songs", "Sun Apr 21 00:44:49 ": "@linnb_ The dog will freak out. But his bark is worse than his... Etc.", "Thu Apr 18 19:22:00 ": "@Cue_DoubleYou This is England: winter never left.", "Wed Apr 24 19:15:26 ": "@AdamMeagher One step forward, two steps back.", "Wed Apr 17 19:08:32 ": "London show added to our June tour, tickets available here: http://t.co/B6Pkqa15ve", "Wed Apr 17 21:44:18 ": "@SophieeML @BethanieAbes Did you know that the best way to get rid of temptation is to give in to it?", "Sun Apr 21 11:36:04 ": "The answer is Mexico :-(", "Thu Apr 18 14:30:36 ": "On my way to interview a literary legend!", "Sun Apr 21 00:55:39 ": "@Groxley Grace, my heart breaks twice a week, minimum. I've acclimatised to it. It's good for you.", "Thu Apr 18 19:21:01 ": "I'd settle for a massive wolf. Can we pls get this trending so the casting people see it and think 'That'd be great PR, let's hire him'.", "Thu Apr 18 18:25:28 ": "How do I get a part in Game of Thrones?", "Sat Apr 20 09:46:45 ": "@TommBentley Not going to a shop I'm afraid :-( At me Nan's innit", "Sun Apr 21 00:52:18 ": "@joetronomy let's talk", "Sun Apr 21 00:31:10 ": "Guys, I don't even know how much longer we're gonna be able to do this. But I love u all so much. Life is bittersweet. But it's cool, right?", "Wed Apr 24 19:12:38 ": "@AdamMeagher oops. *some* reviewers :-)", "Sun Apr 21 11:33:14 ": "@texmexinjersey maybe soon, maybe never; we'll let you know :-)", "Fri Apr 19 06:26:01 ": "@paulepworth @laurenlaverne @ewanpearson @maryepworth This kind of wordplay is exactly what they need down at Casterly Rock.", "Fri Apr 19 16:49:28 ": "@foghorngleghorn there's my favourite little fearcracker", "Sun Apr 21 00:37:43 ": "@Groxley Eeeeeeeeeesh. Who knows. Tentative times.", "Wed Apr 17 16:59:47 ": "RT @bengomori: New remix for @chapelclub coming very soon, being promoed now. They are on the same label family as Oasis + Primal Scream ...", "Sun Apr 21 14:16:57 ": "It's Kevin is toooo good.", "Fri Apr 19 20:07:27 ": "@foghorngleghorn I only get 3 myself, despite various desperate entreaties. And they're for family, so I won't even have one. Sorry chap.", "Sun Apr 21 01:16:09 ": "@arrowsoferos :-)", "Sun Apr 21 00:52:52 ": "@MikeNightingale man, I started planning it in 2010", "Fri Apr 19 15:03:15 ": "TRUE FATHOMS MIXTAPE. Listen to our new mixtape on @TheBeatJuice here &gt;&gt;http://t.co/DpAIVC45ze", "Wed Apr 24 19:33:30 ": "@_losingtoday JUNE 3RD!", "Thu Apr 18 12:07:30 ": "RT @SoundCloud: Wonderful: New Zealand parliament breaks in to song after same-sex marriage bill is passed » http://t.co/e66wxZ5bDx", "Sun Apr 21 00:27:45 ": "RT @liamrothers: so gutted I'm missing RSD2013 though. All I want in life is @chapelclub's Good Together picture disc", "Sun Apr 21 11:30:22 ": "I stayed up late and talked a LOT of shit. What fun. Disregard everything I said. Or almost everything. Have a good Sunday.", "Wed Apr 24 19:14:17 ": "@oneofthethree @louderthanwar You'd have to speak to our mgmt/label/PR... Details should be on our Facebook. They'll help you out.", "Sun Apr 21 00:43:24 ": "@linnb_ I have no clue. Soon, I guess? Come see me sometime and we'll listen together. Come to my house this week! I'm free I think.", "Sat Apr 20 09:47:05 ": "RT @HarryBarnes: Managed to nab Chapel Club, Peace and Biffy Clyro for @RSDUK , absolutely beautiful @chapelclub ! http://t.co/51kTE8ZEiT", "Thu Apr 18 19:18:58 ": "I think I'd be a Greyjoy, a treacherous weasel type. There must be some fucking grim little Greyjoys coming in the next series.", "Sun Apr 21 00:27:52 ": "RT @_molly_jones: @chapelclub Good Together picture disk is the best vinyl I've ever seen, why only 500 copies ):", "Thu Apr 18 11:04:49 ": "RT @BanquetRSDfeed: a healthy supply of the Primal Scream #rsd13 release http://t.co/n6nqCHyvIe / an ok amount of @chapelclub #rsd13 12\" ...", "Fri Apr 19 18:44:53 ": "@BBC6Music Ghanaian disco :-)", "Sun Apr 21 00:26:56 ": "\"@AdamMeagher: @chapelclub looks and sounds amazing, probably the best £10 I've ever spent. http://t.co/VsKAzWC1dq\". Dude I love you.", "Fri Apr 19 14:05:01 ": "RT @rdeanstone: awesome @chapelclub mixtape up on @TheBeatJuice has some hyper artwork to go with http://t.co/vfXAYOnXBg", "Sun Apr 21 00:32:38 ": "@_molly_jones I designed that shit! I'm so happy you like it :-)", "Sun Apr 21 00:36:33 ": "@AdamMeagher we do our small-time best :-) I want one, I'm sitting listening to vinyl now and no one understands why I don't have it.", "Sun Apr 21 11:37:33 ": "On the coffee table under the Tanqueray. Bleurgh.", "Mon Apr 22 21:01:50 ": "Omg they didn't just show a vision of the dead kid?!?! #epicfail #broadchurch", "Thu Apr 18 19:19:42 ": "I'd quite like to have a dragon... but I don't think I'm the Khaleesi's type.", "Fri Apr 19 18:45:06 ": "@BBC6Music and Foxygen", "Fri Apr 19 12:40:56 ": "The Boston story is frightening in so many different ways, not least the media frenzy and crowd-sourced reporting.", "Mon Apr 22 21:01:00 ": "Cheeeeeeeeeze #Broadchurch", "Wed Apr 24 14:44:16 ": "Is there a kid left in England who doesn't go everywhere by scooter? Not into it.", "Wed Apr 24 19:05:08 ": "RT @JackyParker93: Reviewing the new Chapel Club LP for @thisisfakediy - it is a heavenly LP. Heavenly."}