{"Thu Apr 18 08:38:03 ": "@ReaLMizzNobody Sooooo proud of my little sister. Absoloute trooper x", "Thu Apr 18 01:39:57 ": "RT @Ollyofficial__: @OfficiallyCleo love you Cleo ever since Cleopatra comin at ya xxx RT", "Thu Apr 18 12:07:46 ": "@monitivony @YouTube wicked x", "Thu Apr 18 07:16:35 ": "@TerriLi lmaO! Come see me today, I miss ya x", "Thu Apr 18 01:51:40 ": "@ReaLMizzNobody Amazing! Didn't think I could massage for 3 hours and under water! Wearing white, It looked like a wet t-shirt contest lol", "Mon Apr 22 21:59:58 ": "Updating my YouTube channel for you all. \nThis is my take on Cry Me A River. Hope you like it\nSpeak soon x http://t.co/BHMtlZ6mCF", "Thu Apr 18 08:28:25 ": "@JacquesDaKing I cant wait for the battles now but we have a few weeks... hipe they wizz by", "Thu Apr 18 09:05:30 ": "@keelybop43 I know Kat. Not heard from her in ages", "Thu Apr 18 02:02:57 ": "@NateDoherty Nah-ah where is that?", "Thu Apr 18 01:21:58 ": "@keelybop43 reeeeeeaaaaaallllyyyyy!?", "Sat Apr 20 20:22:19 ": "Carl, \"No More I Love You's\" you shut it DOOowwwn x @BBCTheVoiceUK", "Thu Apr 18 07:13:25 ": "@sinocarroll  \"Hey\" right back atcha from us all x", "Thu Apr 18 23:30:57 ": "@missnubian1 @TerriLi @AngelZainam", "Sat Apr 20 19:55:26 ": "Carla Babra I see you xxxxx♡♡♡♡♡♡ @CarlaandBarbara", "Thu Apr 18 06:35:31 ": "@mr_sainty well, the live shows are a way away, for now, better see how the battles turn out! \"ROUND 2, FIGHT!\" Lol x", "Thu Apr 18 06:33:00 ": "@XchezaliciousX Ah wicked. Thought you didn't see my message. Yep I will totally have that done for you x Thanks for your love and support ♡", "Thu Apr 18 09:37:39 ": "@ChrisHague87 lmao I know! Not that I go out.... I hope you keep watching, the battles are fierce! Don't wanna give anything away though x", "Thu Apr 18 09:06:58 ": "@Engs777 will do babe :D :D :D", "Thu Apr 18 02:11:34 ": "@Chrisrich25 Wow! What are the chances!? I support The British Heart Foundation and wish you all the best of health x", "Thu Apr 18 07:06:40 ": "@amypazza_ start with yourself, then a mirror, then a trusted friend or family member,  then a smal group. Record all andcwaych back. Luck2u", "Thu Apr 18 01:25:49 ": "@Mrs_CK_ tis biblical and our Grandfather Higgins name. Baby is being nicknamed or shortened zy x", "Thu Apr 18 06:39:41 ": "@Dance_IsMyDrug Thank you sweetie. Hope I can see you dancing some day x", "Sat Apr 20 19:55:42 ": "@CarlaandBarbara Awesoooooooooooomeeeeee", "Thu Apr 18 01:41:28 ": "@Fatzk Thanks Fatz! Hwy it's been a while since you styled me. What's new from your line? X", "Thu Apr 18 23:44:00 ": "Tirrrreeeeed. Night now x", "Thu Apr 18 06:29:21 ": "@missnubian1 Thank you guys. You're #gonewiththewindfabulous lol x", "Thu Apr 18 06:59:00 ": "@Naomicahill78 @AngelZainam Harlee has the most vocal control I've heard from a child and could contend with some recent established acts! ♡", "Thu Apr 18 08:35:35 ": "@reidhcooper @BBCTheVoiceUK Now that's 1 serious statement! Thank you so much for the toot toot ;) beep beep lol x", "Thu Apr 18 23:29:03 ": "@TerriLi pfttt no! I didn't know but...... paaaahahahahaaaaa! Sorry sis but only You x", "Thu Apr 18 07:15:13 ": "@CC_Mairead :) battle round next, \"let's DO THIS!\" Hope you're ready?", "Thu Apr 18 09:38:49 ": "@WabaraPR @missnubian1 @BBCTheVoiceUK bless you xxx", "Thu Apr 18 01:24:06 ": "@TeamWillTVUK ♡ u 2. I know you have my back, regardless x", "Thu Apr 18 07:17:45 ": "YAY! Thanks, #gonewiththewindfabulous   @coralouisedixon @voiceUKbbc xxxx", "Thu Apr 18 01:54:26 ": "@Bubbles_Olly man* lol", "Thu Apr 18 01:43:03 ": "@CleoHigginsfan really!? They do that!? Wow. Well glad you're back honey x", "Thu Apr 18 01:47:50 ": "RT @Ollyofficial__: @OfficiallyCleo looooved your performance on @BBCTheVoiceUK", "Thu Apr 18 02:08:07 ": "@theadamsean Never! Omg! Thank you for the flattery though. Much love x", "Fri Apr 19 21:12:06 ": "@CleoHigginsfan lol forgot this was on my You Tube. https://t.co/x7KWbVLyMg", "Fri Apr 19 14:42:30 ": "@CleoHigginsfan bless ya. Where are you from. Will let you know if I'll be around. We'll grab a hot drink x", "Thu Apr 18 02:13:47 ": "@LUCASYASHERE aw thats sweet. Thank you x", "Thu Apr 18 06:19:08 ": "@John26oc Aw thanks John. Funy photo btw x", "Thu Apr 18 01:56:13 ": "@freakyfungustv Ooh Belarus! Hiiiiii Thank you for the love x♡x", "Thu Apr 18 06:28:22 ": "@WabaraPR @missnubian1 Thank you hun. I've followed. You're doing big things for black beauty! Keep it up gurl x", "Sat Apr 20 20:27:58 ": "@MiriDSpurs thank you darling x battles next yeaaaahhh grrrr lol", "Thu Apr 18 06:42:41 ": "@ian_mannly @kavana_official it should have been done a long tme before as you're always doing wouk publicly.", "Sat Apr 20 20:19:28 ": "Jess was and is amazing! Flipping \"Don't You Want Me\" Beautiful riffs and top notes, flawless. I'd buy your album. Blessed x @BBCTheVoiceUK", "Thu Apr 18 07:09:07 ": "@datgirl84 Wow that's mad. Your photo looks like a Jody I've known x thank you x", "Thu Apr 18 16:47:57 ": "Cleo Higgins in the studio recording \"ONEderful\" with Laztech. Enjoy x http://t.co/4wwdD0fJ5c", "Thu Apr 18 07:12:10 ": "@emmawhitfield86 that would be AWESOOOOOME xxx", "Thu Apr 18 06:59:06 ": "RT @Naomicahill78: @AngelZainam @OfficiallyCleo Hi ladies Pls have a listen to my friends daughter she's 12 publicity needed! Thnku! Xx  ...", "Thu Apr 18 08:32:09 ": "@ian_mannly lol! It was never easy, it took her a long time to choose to push! Baby was ready long time, however, Yonah just wasn't lol", "Thu Apr 18 08:21:29 ": "@Marcquelle @vauxhalljermain @BBCTheVoiceUK ♡ back atcha Marquelle x", "Sat Apr 20 20:30:17 ": "@TerriLi oh wow, not really lol", "Fri Apr 19 18:23:43 ": "@TerriLi @meganbulmer @ZaneshaEdwards don't, crying with laughter lmao!", "Sat Apr 20 20:50:56 ": "Woah was I just on The Jonathan Ross Show????!!! @CleoHigginsfan @christine18262 @judithshawstar", "Thu Apr 18 02:15:47 ": "@DeanoTheSaxman1 thank you hun, I will do x", "Thu Apr 18 08:27:25 ": "@stevenawson31 Wow your friend died!? That's so sad... I am sorry. I pray they are blessed with sleep, my condolences to thier family x", "Thu Apr 18 07:08:07 ": "@LaurenHick22 Thank you Lauren. Kerp watching... will need you're support in the battle round! X", "Thu Apr 18 23:42:15 ": "In the studio with @OfficiallyCleo &amp; Laztech recording the song \"ONEderful\" https://t.co/62IFwlfMgP", "Sat Apr 20 20:32:16 ": "@CleoHigginsfan what's that? Is it a live feed? If it is, I don't know how...", "Thu Apr 18 23:42:09 ": "@_TeamCleo I am loudly proud of you all. Absolute gems xxx", "Thu Apr 18 01:49:02 ": "@VITHORLIMA @Mitchelemms Looooooovvvvveeeee yooooouuu toooo! Mitchel you too baba x", "Thu Apr 18 01:18:22 ": "@DaniTentiou LMAO! I wont babe. That just made my day hahahaaaa! ♡", "Thu Apr 18 07:19:02 ": "@TerriLi did you take it the wrong way? Lmao", "Thu Apr 18 07:01:51 ": "@wallacendommett \"...I'll have you know I'm quite well actually...\" lmao! ;) just kidding, Thank you honey x", "Sat Apr 20 21:13:53 ": "The Jonathan Ross Show ITV+1 still time to see it lol", "Mon Apr 22 21:56:59 ": "I love to sinh Jazz numbers. One of my favourites here 9n my YouTube channel x https://t.co/03klLZ2u98", "Thu Apr 18 01:43:41 ": "@CleoHigginsfan lmao just saw the request x", "Thu Apr 18 08:29:44 ": "@wendybelendi lol you know sometimes I wonder if I am ;)", "Thu Apr 18 07:07:06 ": "@ForeverLovingAx Thanknyou hun x", "Thu Apr 18 01:44:52 ": "@CleoHigginsfan so many to respond to, I will get to dming soon x", "Thu Apr 18 01:16:39 ": "@DrusillaSummers awww Thank you Dad x", "Thu Apr 18 08:37:15 ": "@jaylynnwidmark (sheepishly) I have... can't help it... it's like I'm watching someone else!", "Thu Apr 18 01:31:43 ": "@nilli33 I read both your write ups. 1st I totally respect you. #hardworking #inspiration #nevergiveup honey. Hope you're ok also x♡x", "Fri Apr 19 21:00:15 ": "@CleoHigginsfan hope you like this guys. https://t.co/aizp7EDEQt", "Thu Apr 18 09:39:22 ": "@missnubian1 @WabaraPR @BBCTheVoiceUK Thanks for the support guys x", "Thu Apr 18 07:04:35 ": "@5UP3RNATURAL \"Cleopatra, is your Aunt Ya!\" LmaO! Gonna take the children to meet him later. Might have to sing it to him lol.", "Thu Apr 18 16:58:09 ": "Happy Birthday my old friend and Producer Hitesh Ceon xxx", "Thu Apr 18 08:19:53 ": "@lawlyofficial lol we rarely did. But the pa sound wasn't always good enough so we'd sinh over a lot. Annoying but the shiw must go on x", "Thu Apr 18 08:33:45 ": "@CCFan007 Thank you Joe. Deffo keep watching, the singers in this comp are all awesome! Glad I'm not a coach...", "Thu Apr 18 02:06:42 ": "@Mr_DPT *choke* urrm... I really don't think that wise lol", "Thu Apr 18 01:27:01 ": "@Krissy_Lee1 Thank you honey x. Ooh! I must have those music icons!!!", "Thu Apr 18 06:24:15 ": "@lwilliamsmusic Lol, \"we got SOul up in here\" Thank you. I don't have flash on my phone so couldn't listen to your myspace:( post me a link?", "Thu Apr 18 02:02:25 ": "@Mitchelemms @LEANNEJARV yo I was knocked out by then. So nice to see you though. Missed you too Leanne x", "Thu Apr 18 07:11:10 ": "@jodielovecheryl lmao! I sing a lot of my revision, helps me a great deal x", "Thu Apr 18 01:53:43 ": "@Bubbles_Olly ...you've wanted a touch of love, no ma is an island you can't be by yourself! I want... ok enough ;) thank you x", "Thu Apr 18 01:37:16 ": "@christine18262 Mooooooooom! Ahaaaa! Love you. Imma send you a pic tee hee ♡♡♡ http://t.co/1olxCpqvQs", "Thu Apr 18 01:17:19 ": "@balbyboy Wow Thank you. Hope I can keep it up for you x", "Thu Apr 18 01:46:28 ": "@ChrisHague87 Aaaw you're a troop leader you are x Thanks. YEP Manni is my town. Hope I rep it well enough for you x", "Thu Apr 18 01:28:08 ": "@Domsantoriello Aw thank you honey bun x", "Thu Apr 18 01:59:30 ": "@LEANNEJARV @Mitchelemms I'll see you both soon enough, let me know when you're in my neck of the woods and visa versa x", "Thu Apr 18 06:31:06 ": "@DrusillaSummers was nice but couldnt stay long, School run back in Manchester lol.", "Thu Apr 18 08:18:14 ": "@SweetGyal_83 whoop! Glad to see you kept yours nice! Mine is qashed out because it got borrowed and now they think it's theirs, grrr kmt", "Thu Apr 18 01:21:17 ": "@SandraNiDara BIG! Thank you baba x I love @TheScript_Danny too, you have great taste ;) Go on gurl", "Thu Apr 18 08:22:38 ": "@vauxhalljermain @BBCTheVoiceUK @Marcquelle Fair enough, go for it and you will achieve it x", "Thu Apr 18 09:07:53 ": "@DrusillaSummers not a whole lot just whwn I have stuff to do that can't be done here.", "Thu Apr 18 01:55:03 ": "RT @Bubbles_Olly: @OfficiallyCleo http://t.co/2bTaT5YvOW wow wow wow what an amazing performance or what xxx RT", "Thu Apr 18 01:42:08 ": "@CleoHigginsfan why did tgey suspend you?", "Thu Apr 18 01:38:57 ": "@Engs777 I'm so excited! I keep smiling! My 1st nephew!", "Fri Apr 19 21:04:29 ": "@CleoHigginsfan Another Cleo original for you x https://t.co/1qh4YYQqfb"}