{"Tue Oct 18 20:51:13 ": "Switzerland Announces Winners of Significant Investment Projects for 2010: http://t.co/HCB6D5Xw", "Mon Jun 11 20:48:28 ": "What well known Swiss have to say about Rio+20 - http://t.co/b0xCU6BY", "Fri Aug 12 20:06:38 ": "Swiss psychologist strives to break sex taboos http://t.co/kxJrmZW", "Wed Jan 04 20:57:52 ": "An American Dream - In Switzerland?\nhttp://t.co/xyfE3CJT", "Wed Oct 05 18:54:03 ": "Climate change scenarios confirm warming http://t.co/chhdZu30", "Wed Nov 16 00:06:03 ": "Swiss singer #SophieHunger now playing at 9:30 club in DC http://t.co/aSe7uu5V", "Tue Jul 17 18:16:01 ": "Stanford's Katharina Zellweger to talk about North Korea tomorrow - http://t.co/QMLmDyih", "Fri Dec 16 16:44:52 ": "Do your research in Switzerland in 2012 with @thinkswiss scholarship: 2-3 months in top Swiss institution. Apply now! http://t.co/SeJA1g6O", "Fri Jan 13 20:56:46 ": "Solar side of skiing - secluded Swiss mountain village boasts cutting-edge solar ski lift - http://t.co/oqIYIrEt", "Thu Jan 05 16:05:17 ": "Switzerland is exploring sustainable energy sources http://t.co/osRpbwfu", "Fri Jul 13 15:46:13 ": "Seven days till the opening of House of Switzerland - http://t.co/JHYUwDhR", "Thu Sep 29 15:51:49 ": "People to Buildings: Don't waste your Energy! http://t.co/lAyTcf8g", "Fri Jun 22 18:34:20 ": "H.E. Valentin Zellweger to continue the discussion on the restitution of illicit assets at the World Affairs Council in SF this afternoon.", "Mon Feb 27 15:16:25 ": "Federal Councilor Didier Burkhalter speaking at 19th session of the UN Human Rights Council - http://t.co/JKxiIxdP", "Fri Nov 04 10:09:47 ": "Swiss study tracks aging HIV  patients http://t.co/Y9ZUHMyh", "Mon Jul 11 21:42:52 ": "How a Swiss scientist saved 20 million people http://t.co/QBfNyxF", "Mon Nov 21 19:30:43 ": "Top Swiss diplomat sees no US decline http://t.co/MUGF2kS6", "Tue Jan 03 23:28:17 ": "RT @ScholarshipsGL: RT @BeasiswaS1: http://t.co/hqWwQjKr Summer Research Program in Life Sciences and Technology, Switzerland ~0104", "Fri Jan 20 00:21:58 ": "Swiss international law expert appointed to UN Human Rights Committee - http://t.co/qL5GBex4", "Wed Jan 11 22:55:50 ": "The Swiss government has appointed Yves Rossier as the new secretary of state at the Swiss foreign ministry \nhttp://t.co/hv39IWbz", "Mon Dec 12 19:31:13 ": "RT @swissnexSF: Geneva University makes chemistry cool - swissinfo http://t.co/Rz07if4r @unigenews", "Mon Jan 09 17:27:48 ": "The future of Architecture - by Gramazio & Kohler and Raffaello d'Andrea\nin cooperation with ETH Zurich -  http://t.co/Qakm0wnK", "Wed Dec 21 16:42:43 ": "RT @SwissAirLines: We've teamed up with @ZRH_Airport & @Skyguide to develop a new procedure to minimise CO2 emissions on approach to the ...", "Wed Jan 18 15:56:02 ": "Swiss health and humanitarian organisations address the worldwide need for properly trained healthcare professionals http://t.co/ivoFyuVr", "Wed Dec 21 23:02:55 ": "RT @USEmbassyBern: #Bern #Embassy is going supergreen! Read all about it @thegreenleague http://t.co/n3raY8NS", "Tue Dec 20 21:10:22 ": "After a year in DC, Swiss Ambassador to the U.S. Manuel Sager talks about issues ranging from Iran to tax negotiations\nhttp://t.co/FDYHzVvP", "Fri Oct 07 20:16:29 ": "RT @NDungan: 'Responsible Finance: Albert Gallatin and the Swiss-American Example' 29 November @FinanceMuseum http://t.co/Ev6pSKwT @thin ...", "Thu Jan 12 19:44:30 ": "The Swiss Mountain \"Die Jungfrau\" is Lit Again - http://t.co/JoObsjYh", "Mon Dec 12 21:02:05 ": "PlanetSolar prepares to enter pirate waters http://t.co/EVuPNdON", "Wed Dec 21 16:42:29 ": "Don't miss the bubble ballet by Award-winning Swiss design studio Greutmann Bolzern - last days! @swissnexSF", "Mon Jul 02 13:12:27 ": "Federal Councilor Didier Burkhalter addresses conference participants of the Syria action group - http://t.co/e2RyKFrE", "Wed Dec 21 17:13:03 ": "Swiss Events Calendar for Washington DC - January & February 2012 http://t.co/RkiRiHQu", "Wed Nov 09 17:04:00 ": "RT @NDungan: '#Gallatin and #Responsible #Finance' @FinanceMuseum 29 Nov 12.30 48 Wall St http://t.co/Ev6pSKwT @NYUpress @thinkswiss @NY ...", "Tue Dec 20 22:06:27 ": "@TuftsUniversity Research Scholarships in Switzerland http://t.co/SeJA1g6O", "Mon Nov 14 19:26:24 ": "RT @columbia_energy: Wind energy is a mature technology, important part of sustainable portfolio http://t.co/og5zYAZM @TGEink @nytimessc ...", "Thu Dec 22 15:51:43 ": "The Embassy of Switzerland´s e-newsletter, designed to inform you of the many things uniquely Swiss! http://t.co/XvEkTkLN", "Thu Jun 07 13:58:54 ": "Federal Councilor Didier Burkhalter at the Global Counterterrorism Forum in Istanbul - http://t.co/eLToNUpm", "Tue Nov 29 23:29:19 ": "Swiss official talks Iran | The Cavalier Daily http://t.co/LoonuUu8", "Wed Jan 11 22:59:34 ": "RT @SwissStartups: Check this video out -- Swiss startup and CAMP participant Bioapply on Arte! http://t.co/ns0DJhbB @bioapply", "Thu Feb 02 22:48:42 ": "Swiss Foreign Policy Report 2011 out now - http://t.co/4R3XlrkO", "Mon Nov 14 22:17:05 ": "The Delta robot: Swiss-made and fastest in the world: http://t.co/yjVx1kgs", "Thu Sep 01 19:38:51 ": "Expatriates given lessons in direct democracy http://t.co/BD9EKEI", "Tue Jun 26 13:43:36 ": "United Nations Public Service Award 2012 for geoportal of the Swiss Confederation - http://t.co/IG7iMCO4", "Fri Jul 01 15:01:42 ": "Global Innovation Index 2011 - Switzerland ranks first among 125 economies on innovation levels: http://t.co/fJ47IW9 via @AddThis", "Tue Dec 20 22:05:13 ": "@Yale Research Scholarships in Switzerland http://t.co/SeJA1g6O", "Fri Jun 15 19:26:50 ": "Join us at the CSIS on Tuesday to learn about asset recovery and geopolitical turmoil - http://t.co/7euK61vc", "Tue Jan 03 21:09:28 ": "A giant light installation by Gerry Hofstetter commemorates the 100-year anniversary of the Jungfrau railway http://t.co/7vFlzycI", "Mon Jan 09 21:20:18 ": "The UN has declared 2012 the International Year of Cooperatives. Can they serve as an alternative economic model? http://t.co/dx0VuTVR", "Mon Jul 16 13:48:49 ": "The newly produced FREE \"Swiss Games\" app has been released for IPhones and Android phones - http://t.co/27GS3HYj", "Tue Jul 10 19:39:17 ": "Stanford University's Katharina Zellweger to give unique insight into North Korea next week - http://t.co/QMLmDyih", "Thu Dec 15 17:10:06 ": "CERN: ATLAS and CMS experiments present Higgs search status: \nhttp://t.co/PPcIQy81", "Wed Dec 07 15:33:23 ": "Clinton in Geneva champions global gay rights http://t.co/rWDBRG8X", "Fri Jun 17 14:04:34 ": "Corruption and the Arab Spring | Foreign Affairs: http://t.co/7kwcn4l via @AddThis", "Thu Dec 22 14:58:42 ": "RT @davos: Watch: Annual Meeting 2012 Co-Chair Yasuchika Hasegawa countdown to Davos \"inspiring action for the year to come\" http://t.co ...", "Thu Dec 29 15:47:07 ": "The Swiss have a vote for it: http://t.co/a7ncRtb8 \nLearn more about modern direct democracy at http://t.co/TzmXx2vv", "Tue Dec 20 22:08:47 ": "@Univ_Of_Oregon Scholarships for Research Projects in Switzerland http://t.co/SeJA1g6O", "Thu Jan 05 17:01:08 ": "Top Swiss World Records with Bragging Rights - http://t.co/bEPHIkhZ", "Mon Nov 28 15:51:52 ": "Apply now: ThinkSwiss Research Scholarships 2012 - http://t.co/SeJA1g6O", "Fri May 04 23:17:18 ": "Join us on Capitol Hill on May 9th for an event on strengthening the political participation of women - http://t.co/zBdU7tBK", "Tue Nov 01 18:20:20 ": "RT @chronicle: Why boys are more likely to be suspended than girls, and what that means for college later: http://t.co/6Rk4ZliR", "Wed Dec 21 16:01:56 ": "RT @SwissNetInc: Bio battery turns paper to power http://t.co/rVFeTspJ", "Tue Sep 13 20:01:52 ": "Swiss planet hunters chalk up successes http://t.co/MhSgO4c", "Thu Jul 14 17:39:58 ": "Leuthard warns against egoism in green issues http://t.co/ZUFdxGk", "Wed Jan 11 21:34:31 ": "ThinkSwiss offers scholarships for a research stay in Switzerland - http://t.co/SeJA1g6O", "Fri Dec 16 16:40:19 ": "Didier Burkhalter just appointed Minister of Foreign Affairs: http://t.co/BiumV4bA", "Mon Jan 16 23:27:08 ": "RT @swissnexSF: Cognitive Robotics and Artificial Intelligence http://t.co/khN5t12e  Beyond mimicking humans...Come find out on Thurs 1/ ...", "Tue Sep 20 19:16:32 ": "How Do We Put the People Back in the Initiative Process? http://t.co/Pob97DBu", "Tue Jan 03 18:12:59 ": "The brown long-eared bat has been named Animal of the Year by Swiss environmental organisation Pro Natura http://t.co/7esvBVJI", "Thu Mar 29 14:51:42 ": "The deadline is coming closer - Don't miss this opportunity to get one of our research scholarships: http://t.co/SeJA1g6O", "Tue Jun 21 16:56:46 ": "FDI into the U.S. in 2010 - Switzerland invested the most: http://bit.ly/kYgzdV", "Tue Dec 06 19:00:15 ": "If it isn't neutral, it's not collaboration. http://t.co/lpixpDMR", "Wed Jun 27 13:37:44 ": "Switzerland to remain in the U.S. Visa Waiver Program - http://t.co/oiFrSor5", "Tue Dec 20 03:23:08 ": "RT @sciencesuisse: The US Department of Energy has budgeted $100 million for permafrost studies by 50 scientists. http://t.co/XHUILsjY", "Wed Dec 07 21:39:36 ": "US launches online embassy for Iran decades after physical mission in Tehran closes http://t.co/ZEBqakKN", "Tue Jan 03 21:41:33 ": "Save energy by drawing heat from the earth (or the foundations of a building) - An idea with potential! http://t.co/MXe0yTUm", "Fri Jan 13 15:27:17 ": "ThinkGlobal - Global Risk 2012: http://t.co/bt13g0dV", "Fri Jan 27 15:07:04 ": "\"We have an obligation to act now\" - Swiss President Eveline Widmer-Schlumpf's speech in Davos - http://t.co/aOH7bjL9", "Thu Jan 12 15:45:27 ": "Switzerland is the 5th freest economy in the 2012 in a world in which economic freedom is contracting - http://t.co/mHUdnRyP", "Thu Dec 08 15:58:55 ": "Energy balance sheet gives new climate clues @swissinfo_en\nhttp://t.co/3IWbvYKA", "Thu Sep 01 19:52:59 ": "Swiss Push to Save Language Opens Rift http://t.co/rmGnLqx via @WSJ", "Thu Oct 20 16:16:13 ": "Switzerland was asked to host high-level talks between the United States and the D.P.R.K. (North Korea) in Geneva.", "Mon Dec 19 16:40:57 ": "The way we design our streets and cities is an illustration of our policies and therefore priorities as a society: http://t.co/nokYNKi1", "Tue Dec 20 20:37:25 ": "@ScholarshipsGL http://t.co/SeJA1g6O Scholarships in Switzerland - open to students of all fields", "Tue Jun 19 14:47:00 ": "LIVE: H.E. Valentin Zellweger discusses asset recovery and geopolitical turmoil at CSIS - https://t.co/6639x0Vs", "Tue Oct 25 21:32:51 ": "Washington's woman in Iran is Swiss: http://t.co/uxzTxtiw via @WTOP", "Thu Oct 27 19:00:48 ": "Bernese billionaire works to keep U.S. West wild http://t.co/dqoiL329", "Mon Dec 19 21:16:18 ": "The Swiss approach to transportation could provide useful lessons for the United States: http://t.co/IaOJXizv", "Wed Feb 15 23:08:46 ": "Swiss architect about to give lecture accompanying the traveling exhibition \"Smarter Living: The 2,000-Watt Society\" – http://t.co/HQHhftYI", "Mon Oct 24 18:36:58 ": "All the provisory results of the Federal Elections: http://t.co/ZhUqoAun", "Mon Jul 09 20:10:59 ": "Join us at Brookings on Wednesday for a conversation on the UN Human Rights Council - http://t.co/cdOd64g5", "Tue Jan 24 02:17:53 ": "Cutting-edge research and development of microreactors in Switzerland - http://t.co/3uP4lqDD", "Wed Dec 21 19:30:08 ": "Do you know what happens to the waste we produce over Christmas and New Year?http://t.co/rQfEpEmi", "Wed Dec 14 13:42:05 ": "New cabinet, same political colors: http://t.co/SESnN15f", "Fri Jan 06 17:16:40 ": "Hear how robots self-reflect and adapt to new circumstances on January 19 at swissnex San Francisco - http://t.co/U2Sz41Wp", "Tue Jan 17 20:45:40 ": "Meet the humanoid robot Cronos this Thursday, Jan 19 at #swissnex SF \n#Robotics\nhttp://t.co/UBr9PDEg", "Tue Dec 20 22:04:18 ": "@Harvard Research Scholarships in Switzerland http://t.co/SeJA1g6O", "Wed Jan 11 21:52:04 ": "RT @BaselArea: Did you know 5 of the BEST universities in the world are located in the region around Basel, Switzerland? Learn more: htt ...", "Mon Dec 26 16:09:13 ": "Relations between the United States and Switzerland are strong (Congressman Wally Herger, R-CA): http://t.co/RqqKUpHH", "Thu Mar 15 21:26:42 ": "Switzerland's new health foreign policy entered into force today to tackle current challenges - http://t.co/8Dc4Y4H5", "Tue Dec 20 22:07:31 ": "@seattleu Scholarships for Research in Switzerland http://t.co/SeJA1g6O"}