{"Fri Feb 10 23:18:24 ": "This photo says it all...Bonded By Baloff!!! http://t.co/ubi6aEf0", "Mon Nov 07 07:45:09 ": "What did everyone do this weekend?", "Fri Jan 13 00:53:52 ": "http://t.co/RRGH2ON3 \n\n23 days and counting down until the Bonded By... http://t.co/I52a4nxC", "Sat Dec 31 22:06:38 ": "So what is or was you New Year's Eve Plans?", "Thu Jun 21 19:56:35 ": "http://t.co/QDqdfgjx\n\nI've spent the last couple of days rehearsing for the Death To All... http://t.co/nWjlgvAL", "Mon Apr 30 22:48:34 ": "Thank you Santiago! Last nights gig was a high point in Forbidden's entire career! It was indeed, EPIC!!!", "Mon Oct 24 09:37:41 ": "RT @Scott_Ian: Kirk Hammett guest vocals on I Am The Law and then guitar on an abridged version of Whiplash. Great to see @TheGeneralMH  ...", "Sat Feb 04 20:58:23 ": "Today is the day for Bonded by Baloff! Our set time is 8:05pm.\n\nWe will see you in the pit if you are fortunate... http://t.co/Lptva5Si", "Sun Feb 05 18:56:22 ": "The Bonded by Baloff show was an incredible success for the bands and the fans alike! Paul's warmth and spirit... http://t.co/TSIrp3sd", "Mon Apr 09 19:51:05 ": "FORBIDDEN’s CRAIG LOCICERO ISSUES UPDATE http://t.co/tjBL9jE0", "Wed Oct 26 07:52:45 ": "http://t.co/0Atp0pLp \nMust be time to brace ourselves for the Omega Wave once again. http://t.co/Hu2JNdCE", "Fri Mar 30 17:56:29 ": "these guys know how to have a killer time! check out the new video clip from label mates Municipal Waste at... http://t.co/ud0HT16V", "Thu Oct 20 17:08:30 ": "Day one of drummer auditions was yesterday. We have already seen some talent and fire! The next two days should tell the tale!", "Sat Oct 22 18:04:19 ": "We'd like to thank all of the drummers who came out to audition from different parts of North America and even... http://t.co/0yo4xY7K", "Mon Jul 23 16:41:15 ": "Our thrashin brothers have a new album out soon! @testamentband #darkrootsofearth at @itunesmusic http://t.co/tcsvAhms", "Wed Apr 25 19:42:50 ": "http://t.co/Fy3WSzdj\n\nCheck out this new... http://t.co/EXshVggu", "Wed Oct 19 11:15:32 ": "Drummer auditions in the Bay Area this week. Some killer ones!!", "Sun Mar 04 19:33:39 ": "The world lost one of the great guitar Icons of all time yesterday. RIP Ronnie Montrose. You will always be remembered!", "Mon May 21 20:03:53 ": "http://t.co/Rw0xv9hb!\n\nCheck out the NEW interview and live... http://t.co/PVihwUhI", "Tue Nov 01 07:35:46 ": "We do what we must...Adapt Or Die! http://t.co/3zngi9Uh", "Tue Mar 13 19:45:53 ": "http://t.co/OduXiswc\n\nIt's time to gather up everyone for another MASSIVE... http://t.co/wJG9tz5H", "Tue Jan 17 21:39:32 ": "FORBIDDEN'S STEVE SMYTH: NAMM SIGNING SCHEDULE & SIGNATURE GUITAR GOLD AWARD http://t.co/TrOrkJ9c", "Sun Jun 24 00:47:35 ": "http://t.co/4mbeEL7j\n\nCheck out Craig's report from the Death To All... http://t.co/tR2JHup6", "Wed Apr 11 19:50:20 ": "Sasha arrived in the Bay Area yesterday and Steve Smyth arrives Saturday. Time to fire up the Thrash Attack for... http://t.co/WJpa1TiL", "Wed Apr 18 20:38:13 ": "New Merch fresh out of the box! These VERY limited edition \"Four Dates of the Apocalypse\" shirts will be... http://t.co/Ok9eRRf1", "Mon Apr 09 17:18:32 ": "We start preparation for the Four Dates of the Apocalypse this week. New songs, old songs and songs yet to be... http://t.co/TXBvMLIm", "Mon Jan 23 19:47:49 ": "Check out this article with Sasha Horn in the new Drum magazine that was being handed out for free at the NAMM... http://t.co/HEFyNcmW", "Mon Jan 09 20:33:57 ": "BONDED BY BALOFF - 2/4/12 - ALL AGES - Oakland Metro Operahouse http://t.co/f2oMoexT", "Mon Oct 31 23:28:30 ": "FORBIDDEN ANNOUNCE NEW DRUMMER! http://t.co/nsVxrV2U", "Tue Jan 03 07:53:48 ": "Good News!\nThere is a new feature in the tab „MERCH + SHOP“ on the left: you can download our album „Omega Wave“... http://t.co/b5uJadDk", "Thu Apr 19 18:08:10 ": "http://t.co/4L8gejmI... http://t.co/qvW7kAMY", "Thu Feb 09 20:06:57 ": "THIS will be an amazing festival in one of our favorite places in the world...Chile!!! http://t.co/jKwsXaIx", "Sun Mar 31 02:08:04 ": "Whatever you're into, this still rules! http://t.co/CoBA19OtOG", "Thu Apr 26 21:30:47 ": "We leave for our destination tomorrow! Can't wait to see all of our Bro's in the bands and of course our fans in... http://t.co/RHPN2JHH", "Tue Jan 24 18:34:58 ": "We had our first songwriting session with Sasha, Steve and my self last night. It was extremely productive and... http://t.co/B1chACI8", "Mon Nov 14 04:04:55 ": "Craig Locicero interviewing protesters, participants and normal people for the Omega Wave Show at Occupation... http://t.co/uebp7ZDt", "Sun Jan 01 04:21:48 ": "Happy New Years everyone! Let's all hope that everything we've ever read or heard about 2012 is all bullshit!... http://t.co/ppiJAOsB", "Tue Dec 13 07:20:30 ": "I can't believe it's been so long. One of the highest of highs in my lifetime. Playing with Chuck Schuldiner,... http://t.co/NpkGQftm", "Fri Feb 03 06:04:33 ": "NAMM 2012 Craig Locicero-Forbidden http://t.co/vulM5VAk", "Fri Apr 20 23:29:05 ": "Craig, Sasha and Steve will be on the Metal Zone tonight to talk about tomorrow's show at the Avalon in Santa... http://t.co/7yHAQvGA", "Thu Oct 20 00:43:46 ": "DRUMMER CHRIS KONTOS DISCUSSES A.F.A.R. ON THE LATEST ΩMEGA WAVE PODCAST http://t.co/3C8LXD0s", "Wed Dec 28 02:35:07 ": "http://t.co/l6T5PMIl\n\nForbidden's first show of 2012 is a MASSIVE Metal... http://t.co/WQbtujQT", "Tue Nov 29 15:40:05 ": "Check out these pictures of Steve Smyth giving a Masterclass in the U.K. last week! http://t.co/Z1DqOlaA", "Tue Jan 10 17:56:40 ": "Chili anyone? http://t.co/3WiadfV5", "Tue Feb 28 23:33:36 ": "In the studio finishing up the live mixes from Progpower last year. Sounds killer and Hoglan was crushing it!", "Mon Jan 02 20:03:51 ": "When we started writing Omega Wave a couple of years ago, some of us foresaw the erosion of America's Bill of... http://t.co/Ztz7kRB6", "Tue Mar 06 22:35:23 ": "http://t.co/0Atp0pLp\n\nCrumbling world economy, revolutions all over the globe, threat of... http://t.co/VJ6gWsSa", "Fri Feb 24 23:44:24 ": "Forbidden joins the Rock Band network!! Go get your game on at http://t.co/9rFTrmoL and click on FORBIDDEN \\m/ http://t.co/xr95fEUM", "Tue Apr 16 03:38:56 ": "Hey everyone it's me, Craig Locicero. \n\nI have the honer and the pleasure of be a guest on Lonn Friend's second... http://t.co/4CVHQE2Pqn", "Fri Feb 03 20:06:16 ": "One day and counting until Bonded By Baloff kicks in your face and....well, if you know the rest SCREAM IT!!!", "Mon Jan 09 22:35:35 ": "All of Forbidden want to wish everyones Dark Riff Lord, Tony Iommi, a full and speedy recovery. When you talk... http://t.co/BWlukUAs", "Tue Nov 01 19:02:13 ": "http://t.co/9n6oczxj http://t.co/A1rGEBwz", "Sun Oct 23 18:25:15 ": "Calling ALL Forbidden fans. Our guitar tech/tour manager and friend, Dane Wolf, was attacked by a group of thugs... http://t.co/ndnE9rK6", "Sun Apr 29 20:30:12 ": "THANK YOU SANTIAGO!!!! That was so amazing!!!!", "Tue May 08 17:45:03 ": "Sasha leaves the Bay to go back home and be with his family tomorrow and we unload the studio today. We got A LOT... http://t.co/qScVb48s", "Sat Mar 17 08:15:02 ": "4/2112 http://t.co/n2NJTF4I", "Fri Mar 16 07:56:06 ": "4 / 2112 http://t.co/qSErNGlD", "Thu Jan 03 19:09:12 ": "Never say never... http://t.co/z0usjKQH", "Fri Jul 06 07:30:25 ": "Omega Wave was our middle finger to this worlds corruption and senseless state of unconciousness and ignorance.... http://t.co/xw9KyUc8", "Tue Apr 17 18:40:30 ": "Forbidden have arrived for the rehearsals to the Four Dates of the Apocalypse that begin THIS THURSDAY in Modesto... http://t.co/L4j7O2j8", "Sun Apr 22 18:41:29 ": "Last night's show in Santa Clara was CRUSHING! All of those who showed up got to see Forbidden at our best. The... http://t.co/MWY24AQ3", "Fri Dec 16 01:48:24 ": "Metal or other... what is your favorite Holiday song?", "Fri Oct 28 20:49:45 ": "We are getting VERY close to making our decision and announcement about the next GREAT drummer of Forbidden. Look for it Monday!", "Thu Mar 08 20:51:26 ": "http://t.co/rIKV9gyc\n\nThis song seems appropriate for today. http://t.co/ZwBdFDyr", "Mon May 21 20:02:11 ": "http://t.co/Rw0xv9hb!\n\nNew interview and live footage from the... http://t.co/q0hy6ZbU", "Mon Apr 23 18:36:23 ": "Yesterday Sasha Horn, Steve Smyth and Craig  Locicerowent to the book signing of Harold O's and Brian Lew's... http://t.co/9eLmLpDi", "Thu Jan 12 15:43:30 ": "http://t.co/aGnJ9AnC \n\nWho's got their Nuclear Blast shelter's ready? If we... http://t.co/bxnGs7cI", "Thu Jul 05 20:43:20 ": "FORBIDDEN: Forced to Cancel Wacken Open Air Performance http://t.co/QCIfCUW4", "Sat Jan 07 09:25:07 ": "The Alcatraz Festival back in August of '11 with our Brother, the Mighty Gene Hoglan killing it with us! Great... http://t.co/pIRQzWK6", "Sun May 13 18:08:11 ": "http://t.co/vsfFMl9d\n\nForbidden would... http://t.co/RU4QwDXq", "Wed Feb 22 01:13:52 ": "http://t.co/pcZrBZyh http://t.co/AlKAEpeN", "Mon Jan 09 22:34:26 ": "All of Forbidden wants to wish everyones Dark Riff Lord, Tony Iommi, a full and speedy recovery. When you talk... http://t.co/4pTTHCjU", "Wed Nov 16 20:44:20 ": "did you know Forbidden have a YouTube channel?! GO SUBSCRIBE!!! http://t.co/RUkN41iW http://t.co/w7zCJ0vf", "Tue Jan 31 20:21:49 ": "We are neck deep in between rehearsing for the Bonded By Baloff show this Saturday and working on new songs for... http://t.co/4WJZZX1F", "Sat Apr 28 16:38:38 ": "We have arrived in Santiago! Let the metal games begin!!!", "Fri Apr 27 18:20:16 ": "Awaiting our flight to Santiago!!!", "Thu Sep 06 22:43:06 ": "Hmmm, I wonder why I'm feeling this song so much today? When I wrote the lyrics, it was 6 months before Obama was... http://t.co/5JCXLUWy", "Wed Jul 18 15:58:27 ": "Thrash Fucking Metal has got to win! Vote Testament at: http://t.co/bJo8pFnR\n\nOnly takes two clicks, go help... http://t.co/bQ36yUaE", "Wed Jan 04 00:40:20 ": "Members of Forbidden discuss Judas Priest's Painkiller album: http://t.co/WH2E0YEJ http://t.co/QrufCozE", "Sat Jan 14 00:16:23 ": "http://t.co/Qkc2Sh7L http://t.co/fZdLDVNP", "Tue Jan 03 03:39:24 ": "A new look for a new year? http://t.co/6q9HLKNK", "Mon Oct 31 22:11:42 ": "I uploaded a @YouTube video http://t.co/HHuuVmFS drums", "Tue Jan 17 22:01:15 ": "FORBIDDEN + EXODUS Comment on Upcoming Bonded By Baloff Special Show http://t.co/1o0iT9yv", "Wed Jan 25 19:58:53 ": "Sasha Horn, newly crowned drummer for Forbidden (once home to well-known skinsman Paul Bostaph), has been featured... http://t.co/QD3fXCYX", "Tue Jan 24 19:21:32 ": "Craig and Sasha of Forbidden were among those present at the at Meshuggah listening party last Thursday:... http://t.co/aXUsmj3k", "Fri Nov 11 18:06:45 ": "It's 11-11-11, so Forbidden is honoring Nigel Tufnel today! Please share your 'Spinal Tap' moments with us. http://t.co/4bhSSnKr", "Tue Jan 03 01:50:08 ": "http://t.co/CTtafezJ\n\nI am - hand of the elite, you know who\nI am - winds of tyranny, too... http://t.co/9II1J8kF", "Sat Dec 31 22:07:03 ": "So what is, or was, your New Year's Eve Plans??", "Wed Nov 16 19:22:09 ": "http://t.co/SlSIbJ3Q\nCorpses laid out for the Rapture\nNew World Order Burried in it's Tomb! http://t.co/q9OejyQQ", "Tue Nov 29 18:27:04 ": "Except your existence, there is no resistance http://t.co/ehnehUo5", "Wed Mar 28 18:55:04 ": "http://t.co/GIM6aotW\n\nThis song goes out to our close friend who we lost... http://t.co/feH2DYnp", "Wed Mar 14 21:48:05 ": "The Four Dates of the Apocalypse coming this April! http://t.co/LNtpzJw1", "Wed Feb 29 19:51:35 ": "Breakfast of Chimps... http://t.co/rtQ0bgnX", "Fri Nov 18 01:57:52 ": "!", "Sun Apr 29 16:11:21 ": "In 3 hours we will have Santiago, Chile Marching Into Fire with us!!!", "Fri Oct 21 18:41:03 ": "We had another excellent day of try-outs yesterday. All of these guys are showing some serious drive and talent.... http://t.co/H5sMiU7C", "Fri Nov 18 01:58:50 ": "The writing process has offically begun. Let there be Thrash Metal!", "Mon Oct 24 09:37:46 ": "RT @Scott_Ian: Tonight in SF was just over the top. Amazing show, the Warfield was packed and insane! Unbelievable energy. Kirk Hammett  ...", "Mon Nov 07 08:43:20 ": "Look through these eyes\nSee all my faces their hiding behind\nHere by my side\nThose who I trust turn against and... http://t.co/hkBZSgXT", "Sun Nov 20 15:24:11 ": "http://t.co/ke8qXR34\nThis song is for Sundays! Who's your team? http://t.co/nkA20eCd"}