{"Thu Apr 18 09:51:02 ": "Wake up &amp; smell the free coffee with The Lab at Balally @Luas &amp; @DundrumTC this morning,2moro &amp;Sat morning #coffeefix http://t.co/KqHzymqdKZ", "Wed Apr 17 08:42:42 ": "Do you work in one of the many shops or cafes @DundrumTC ? Visit The Lab to bank at a time that suits you,SelfService open 24/7 #heretohelp", "Sun Apr 21 12:10:49 ": "In Dundrum for some Sunday Brunch? Why not pop into The Lab  @DundrumTC level 1 to see AIB’s new banking experience #visitthelab", "Sat Apr 20 19:17:40 ": "IBB is now back up and running sorry for any inconvenience caused. Thanks ^ND", "Wed Apr 17 16:13:47 ": "RT @OpportunityBiz1: AIB targets its small business customers with new online services: The bank will provide a web-based payroll f... h ...", "Mon Apr 22 09:52:08 ": "@almurph75 thanks for visiting @TheLabAIB hope to see you again soon. ^DP #thelabaib", "Mon Apr 22 09:59:00 ": "@alanjkh thanks for the tweet, The Lab team are happy to help #thelabaib #sevendaybank #Ireland", "Mon Apr 22 09:51:26 ": "RT @AlMurph75: Dropped into @thelabaib today in @dundrumtc.  #newageofbanking :)", "Wed Apr 17 20:05:14 ": "Remember FREE coffee from 8.45am at Balally @luas station tomorrow #wakeupandsmellthecoffee #caffeinefix #thelabaib RT", "Wed Apr 17 16:14:51 ": "RT @Win8IE: Near Dundrum? Check out the AIB Lab, Ireland's most high tech bank. Uses Pixelsense, Windows 8 &amp; WP8 Video: http://t.co/ ...", "Sat Apr 20 12:20:56 ": "Our first weekend @DundrumTC &amp; The Lab team are ready to help our visitors “Learn About Banking” #visitthelab #learnaboutbanking", "Sat Apr 20 11:18:58 ": "RT @karenfitz21: Dropped by @TheLabAIB in dd very impressed", "Fri Apr 19 15:17:15 ": "Follow @TheLabAIB AIB’s new digital banking store located in Dundrum Town Centre for exclusive competitions and store updates!!", "Tue Apr 16 19:02:47 ": "The Lab team is on Facebook http://t.co/Fadp8CSXbF &amp; Twitter Mon to Fri 9.00-21.00, Sat 9.00-19.00 and Sunday 10.00-19.00 #thelabaib", "Sat Apr 20 12:31:28 ": "Want to be in with a chance to win a Samsung Galaxy Tab2? Enter now on FB mobile http://t.co/FrISj47Hjv &amp; on desktop http://t.co/gYgcqBu3Od", "Sun Apr 21 13:36:13 ": "Enter our comp to be in with a chance to win a Samsung Galaxy Tab2 mobile http://t.co/ujMacm1JAs &amp; on desktop http://t.co/7rfB3BNt7q #win", "Wed Apr 17 14:05:05 ": "RT @SophieDonkin: AIB launches \"the LAB\" in store http://t.co/Odll86uaCP showcasing their digital banking services to customers http://t ...", "Wed Apr 17 08:38:40 ": "RT @ColinDRyan: Happy Birthday to @TheLabAIB - 9 months in the making and one day old today!!", "Mon Apr 22 18:07:00 ": "7pm on a Monday evening &amp; The Lab staff are here and ready to help you \"Learn About Banking\" call in now if you are in Dundrum #visitthelab", "Mon Apr 22 09:53:01 ": "RT @AngelaZoeH: Just had my first visit to @TheLabAIB great experience and service. Chris made it a breeze to set up new account! Great idea", "Fri Apr 19 16:00:36 ": "@oldfellascook really sorry to hear that, thank you for letting us know. We will pass this information back to the Mgt Team immediately. ^DP", "Tue Apr 16 19:02:03 ": "@conor_mcnally thanks for the comparison, hope to see you back at The Lab soon #thelabaib #digitalbanking", "Thu Apr 18 13:42:50 ": "RT @corywestmedia: Twitter launches music app http://t.co/C40nsf0EnE #twitter", "Mon Apr 22 09:52:27 ": "RT @Alanjkh: Just set up a bank account on a Sunday of all days thanks to Chris @ThelabAIB. Certainly a step in the right direction.", "Tue Apr 16 18:58:43 ": "RT @conor_mcnally: Looks a bit like a fancy Apple Store but this is actually an AIB bank in Dundrum.  Nice. http://t.co/SCjXA6RhFo", "Fri Apr 19 08:22:54 ": "@mcgconor @TheLabAIB Hi Conor, thanks for your feedback, we've passed this on to the Development Team, thanks^ER", "Sat Apr 20 18:03:18 ": "Great first Saturday at The Lab, thank you to all our visitors, have a nice evening we will be back again tomorrow #thelabaib #saturdaynight", "Thu Apr 18 19:55:44 ": "The end of another good day at The Lab, we will be back nice and early again tomorrow at 9am. #thelabaib #goodnight", "Mon Apr 22 09:54:35 ": "@angelazoeh thanks for the tweet and for coming to visit us @TheLabAIB the team are looking forward to welcoming you back again soon, ^DP", "Mon Apr 22 10:46:47 ": "@keithq96 The Lab is AIB's new banking experience located in Dundrum Town Centre, Dublin for more info check out http://t.co/tBNRVepkQS ^DP", "Thu Apr 18 10:54:03 ": "RT @thevonbismark: Check out Von Bismark's awesome tech aging installation in Dundrum! http://t.co/P7TbCUpFFg", "Sun Apr 21 10:15:47 ": "What is The Lab all about? Watch our launch video to find out for yourself   https://t.co/nQe201gmYi #thelabaib", "Wed Apr 17 16:12:40 ": "RT @johnvasili1: Allied Irish Bank (AIB) has unveiled a high-tech concept branch in Dublin that will showcase the firm's digital service ...", "Sun Apr 21 14:31:48 ": "The Lab Team will be here until 7pm today so you can drop by at a time that suits you #visitthelab", "Tue Apr 23 08:20:37 ": "@angelazoeh please follow us so we can DM you or fill out our contact form http://t.co/LES17uhfKl ^DP", "Tue Apr 23 14:14:32 ": "@salcuraireland great to hear, thank you for the tweet, The Lab team look forward to welcoming you back again soon ^DP", "Thu Apr 18 10:34:12 ": "RT @PMLGroup: AIB used dPods in conjunction with launch of 'The Lab'. Check out the campaign video http://t.co/CM1OloNERW @CBS_Outdoor @ ...", "Mon Apr 22 12:44:22 ": "Enter our comp to be in with a chance to win a Samsung Galaxy Tab2 mobile  http://t.co/QdL5DQXiPx &amp; on desktop http://t.co/a47NDORbJN", "Sun Apr 21 18:03:01 ": "End of our first week in The Lab @DundrumTC &amp; we’ve had a great time &amp; enjoyed welcoming all our visitors. We're back 2moro @9 #thatsawrap", "Fri Apr 19 18:32:43 ": "Anyone planning on spending their Friday evening @DundrumTC? What are you going do? Pop in and say hello or tweet us here! #thelabaib", "Thu Apr 18 08:21:19 ": "RT @StarlingDigital: Very interesting to see AIB's new digital services @TheLabAIB in Dundrum: http://t.co/gF4XGjKoxt", "Sun Apr 21 13:11:33 ": "In @DundrumTC but have no cash in your wallet? The Lab has 2 ATMs in store &amp; more new technologies to offer. Pop in and see #thelabaib", "Tue Apr 23 13:37:56 ": "The friendly &amp; supportive Lab staff are here at level 1 @DundrumTC to teach &amp; assist you on new banking technologies #thelabaib", "Tue Apr 16 18:35:02 ": "@BlackMarble thanks for the tweet, glad you like it #digitalbanking", "Thu Apr 18 08:21:28 ": "RT @Niadoy: @TheLabAIB: The Lab @DundrumTC was months in the making check out our before &amp; after time-lapse video http://t.co/NbuY7p ...", "Sun Apr 21 10:55:40 ": "Want a new banking experience? Come visit us at The Lab. And remember The Lab is open to all #visitthelab #learnaboutbanking", "Fri Apr 19 09:09:20 ": "@trixiecampbell thanks for the tweet, indeed we are AND our self-service area is open 24/7   :)  #thelabaib #innovation", "Thu Apr 18 12:51:18 ": "RT @ENFPvisuals: @TheLabAIB loving the lab! Very sci-fi!", "Tue Apr 16 20:02:33 ": "That’s it from us for today, we’ll have more tomorrow. Don’t forget to come visit The Lab and include #thelabaib when tweeting!", "Wed Apr 17 12:38:52 ": "RT @rogerbusby: Launch of The Lab AIB at Dundrum Town Centre - Nice use of Digital by AIB to connect with customers! http://t.co/yIWSn6Eup2", "Fri Apr 19 14:32:40 ": "Have you taken The Virtual Tour of @thelabaib yet? Now is your chance to see what it's all about http://t.co/ESdfmPtKW1 #thelabaib #dundrum", "Wed Apr 17 08:09:09 ": "RT @s_powell: Launch of The Lab AIB at Dundrum Town Centre - YouTube http://t.co/k9K4aNnQkE", "Sat Apr 20 13:31:56 ": "Why not visit The Lab with your children, they can enjoy the kids zone while you Experience new technologies #visitthelabaib", "Sat Apr 20 13:24:03 ": "RT @RoisinGlynn: Visiting @thelabaib in dundrum, place looks amazing. Definately showcases the future of banking!", "Wed Apr 17 17:04:11 ": "RT @stephenmulligan: Very cool stuff happening here. Check it out. Launch of The Lab AIB at Dundrum Town Centre: http://t.co/wbtFSIX4g7", "Wed Apr 17 16:10:51 ": "@jwbirch thanks for the tweet glad you like it, come visit The Lab  @dundrumtc again soon #thelabaib", "Sat Apr 20 14:06:00 ": "Using all your phone credit on data charges? Call into The Lab today and use our FREE Wifi #freewifi #thelabtechnology", "Wed Apr 17 11:14:24 ": "RT @aaroadwatch: Traffic lights are back working on the Dundrum Bypass at the Taney Rd/Churchtown Rd Upr jct. http://t.co/wbZRPQbi6K #AARW", "Wed Apr 17 07:58:16 ": "RT @my_ponchoboys: cannot wait until i have money/a job so i can visit @TheLabAIB more often!", "Tue Apr 16 18:35:50 ": "RT @maparesearch: Confused by digital banking? AIB have opened a branch to showcase their digital services http://t.co/cSJVJ0DhQ4 #digit ...", "Wed Apr 17 13:10:25 ": "Love coffee?Check out Balally @Luas station from 8.45AM tomorrow &amp; experiment with coffee flavours with @thelabaib IT’S FREE!! #thelabaib RT", "Wed Apr 17 08:52:51 ": "RT @aaroadwatch: Traffic lights are out of action on the Dundrum Bypass at the Taney Rd/Churchtown Rd Upr Jct. Take care. http://t.co/wb ...", "Fri Apr 19 08:09:11 ": "RT @TalkingPayments: Financial services provider AIB will launch Ireland’s first ever #digital #banking store - http://t.co/szWigS5z0H #news", "Fri Apr 19 09:17:55 ": "Hurray it's Friday, do you have a Friday treat? Tweet us your suggestions - who said you can't have more than one! #thelabaib #fridaytreat", "Thu Apr 18 15:52:03 ": "Planning a shopping trip to @DundrumTC this evening? Take a break from the shops and come experiment at The Lab #thelabaib", "Thu Apr 18 19:31:29 ": "We want to catch the early birds so the free coffee from @TheLabAIB will be around the Balally @Luas area 2moro morning from 7.45AM RT", "Fri Apr 19 11:37:45 ": "RT @Irish_Marketing: Allied Irish Banks PLC : AIB unveils first dedicated digital banking store in Ireland | 4-Traders http://t.co/63ET3 ...", "Fri Apr 19 16:46:13 ": "The first 300 visitors to The Lab @DundrumTC from 9AM 2moro will get a FREE 3 hour Parking ticket, so be sure to arrive early #thelabaib RT", "Wed Apr 17 16:08:33 ": "RT @jwbirch: Everyone should check out @TheLabAIB in Dundrum, looks amazing! #AIBBank #innovationatwork", "Sat Apr 20 15:21:07 ": "Wondering how you can experiment at The Lab? Take our Virtual Tour  and to see all The Lab has to offer #thelab http://t.co/ESdfmPtKW1", "Tue Apr 23 10:40:18 ": "RT @jacobsays_ie: @DundrumTC I was in AIB Lab and I must say they impressed me with equipment and their digital approach to the client.", "Tue Apr 23 10:39:48 ": "RT @DundrumTC: Don't forget to enter our fab comp to win a Samsung Galaxy Tab courtesy of the lovely folks @TheLabAIB !", "Wed Apr 17 18:14:00 ": "@cathreonine glad you like it, don't forget our self service zone is open 24/7 @DundrumTC #thelabaib", "Mon Apr 22 10:53:40 ": "@eoinkearney thanks for the tweet, the video explains it nicely too! #thelabaib", "Mon Apr 22 11:19:31 ": "Check out http://t.co/MSk47ycUjk for info on ways to bank at The Lab in Dundrum &amp; we have the same opening hours as @DundrumTC #sevendaybank", "Thu Apr 18 18:05:55 ": "When you come and visit The Lab there are services available for AIB and Non AIB customers, call in and check us out #visit #thelabaib", "Sat Apr 20 08:01:45 ": "Are you en route to @DundrumTC ? Hurry, the first 300 visitors to experiment at The LAB will get a free 3 hour parking voucher #thelabaib", "Fri Apr 19 10:20:37 ": "If you visit The Lab you will have free use of iPads, iMacs &amp; FREE Wifi &amp; a unique banking experience! Pop in an see @DundrumTC #thelabaib", "Mon Apr 22 09:51:13 ": "@oldmanphillips The Lab is open the same hrs as Dundrum TC &amp; our self-service area is open 24/7, so you have plenty of time to visit us! ^DP", "Wed Apr 17 14:15:59 ": "The Lab promotional staff are in @DundrumTC asking people to play the tech-age game? Have you played? #techage", "Fri Apr 19 13:10:32 ": "RT @man_rivas: AIB opens branch to showcase digital services http://t.co/jampuV4gmZ via @Finextra", "Wed Apr 17 08:09:02 ": "RT @shaneoleary1: This is cool, new digital store for AIB in Dundrum 'The Lab': http://t.co/V8DncjSWId", "Wed Apr 17 11:46:39 ": "Enter our Tech-Age comp to be in with a chance to win a Samsung Galaxy Tab 2 on mobile http://t.co/xpZxQhBCZ6 desktop http://t.co/9Qxy1rae7C", "Wed Apr 17 10:48:50 ": "Call in &amp; use our iMacs &amp; Touch Phones for many of your banking needs,the staff at the Lab are here to help #digitalbanking", "Fri Apr 19 19:56:04 ": "Don’t forget the first 300 visitors to The Lab from 9AM tomorrow will get a FREE 3hour Parking ticket, so be sure to arrive early #thelab RT", "Wed Apr 17 17:03:42 ": "RT @cathreonine: Super handy! AIB have lodgement machines in Dundrum Town Cntr now", "Fri Apr 19 10:08:44 ": "RT @WebfactoryIRL: We are delighted to support design partners AIB @TheLabAIB visit their @facebook page today #LearnAboutBanking\n\nhttps ...", "Thu Apr 18 12:53:27 ": "@enfpvisuals thanks for the tweet, indeed \"sci-fi\" banking has landed @DundrumTC !! #thelabaib #innovation", "Sat Apr 20 10:20:00 ": "@OldFellasCook Hi John, We will pass your feedback to our store manager. thanks^AH", "Sat Apr 20 08:40:47 ": "Save your change - visit us at The Lab this morning we have free 3 hr parking vouchers to give away to the first 300 visitors #thelabaib", "Sat Apr 20 09:31:07 ": "Are you travelling on the @Luas today? Jump off at Balally &amp; you will see The Lab coffee dock serving up FREE coffee #thelabcoffee", "Sat Apr 20 16:06:18 ": "We have the same opening hours as @DundrumTC so we will be here until 7pm tonight to help you “Learn About Banking” #visitthelab", "Sat Apr 20 13:04:56 ": "Good news followers the team at The Lab @DundrumTC have a few FREE 3hour parking tickets left so call in to get one now! #dundrum #free", "Thu Apr 18 12:34:17 ": "@aidanoboyle here is the time lapse video http://t.co/oYS68AbgM3 and we have more info on our website http://t.co/zfIaz3pE9g  #happytohelp", "Fri Apr 19 17:56:05 ": "The Lab will be open all weekend from 9am –7pm on Saturday and 10am -7pm on Sunday so you can drop by at a time that suits you #visitthelab", "Wed Apr 17 19:07:05 ": "The Lab @DundrumTC was months in the making check out our before &amp; after time-lapse video http://t.co/AYfsxSlKhd #howitsmade #thelabaib RT", "Thu Apr 18 10:45:47 ": "RT @MaoRestaurant: Anyone looking for a nice #lunch later on today in @DundrumTC make sure to check this out: http://t.co/PjQs6mMvTC", "Sat Apr 20 14:41:24 ": "It is a busy day in @DundrumTC today, are you here? Bought anything nice? #thelabdundrum", "Mon Apr 22 14:26:00 ": "Call in &amp; use our iMacs &amp; Touch Phones for many of your banking needs,the staff at the Lab are here to help #digitalbanking", "Fri Apr 19 08:59:18 ": "RT @trixiecampbell: Loving AIB's new @TheLabAIB! Brilliantly done. Most importantly they're online weekends and evenings!"}