{"Fri Apr 05 11:12:05 ": "Manish Tewari:Govt. does not intend regulating content.On the techno-comm. side industry should deliberate the need for a separate body.", "Fri Apr 05 07:13:19 ": "PM’s address at the International Workshop on Green National Accounting for India http://t.co/TjBzAtTFYH", "Fri Apr 05 06:50:32 ": "Achievements of Food Safety and Standards Authority of India during 2008-2012 http://t.co/wf6cTDxeW4", "Wed Apr 17 15:02:03 ": "Manish Tewari: AIR to start 24 hour dedicated News Channel Shortly", "Mon Apr 22 07:36:01 ": "PM's statement to media outside Parliament http://t.co/j3j4FSh6uJ", "Fri Apr 05 02:38:21 ": "The Nation Pays Homage to BABU JAGJIVAN RAM on his 106th Birth Anniversary: http://t.co/B2Ld3dye4t", "Tue Apr 09 11:07:24 ": "MIB  to release Limca Book of Records 2013-Cinema Special, tomorrow  at 12 pm , Venue:FICCI Auditorium, New Delhi", "Thu Apr 11 09:58:01 ": "Manish Tewari meeting delegation from Bangladesh led by H.E. Hasanul Haq Inu, Minister of Information, Bangladesh\nhttp://t.co/Y6SzX3ZCwi", "Thu Apr 11 11:22:09 ": "India And Bangladesh To Consider Joint Collaboration On Mega-Film On “War Of Liberation” http://t.co/auhVHjSyQN", "Wed Apr 03 06:46:20 ": "Prime Minister’s Address at the CII National Conference and Annual General Meeting http://t.co/d896Lx0Ptn", "Thu Apr 11 05:09:31 ": "Manish Tewari presenting Limca Book of Record ‘People of the Year’2013 to Pioneer of Assamese Art Cinema, Jahnu Barua http://t.co/PxjPT8XqF1", "Wed Apr 03 08:43:15 ": "Salient Features of the National Food Security Bill, 2013 http://t.co/Nc4J8XuwMY", "Wed Apr 10 12:58:05 ": "Single window clearance mechanism for shooting of foreign films in india shortly:Manish Tewari .http://t.co/kNj59Y9WES", "Fri Apr 05 11:09:59 ": "The President, VP, PM, and other dignitaries, at an Investiture Ceremony (Padma Awards), at Rashtrapati Bhavan http://t.co/Vm2a6Pgvcv", "Sun Apr 07 17:59:25 ": "Agni-2 Launched : Accurately Hits Target Area http://t.co/dd32HBLvyg", "Fri Apr 05 07:07:30 ": "Major activities undertaken by  AYUSH Department for development and recognition of AYUSH Systems of Medicine abroad http://t.co/bjAsYp7hLs", "Thu Apr 18 07:22:02 ": "Manish Tewari addressing the opening session of “4th CEOs Roundtable on Broadcast” organized by CII, in New Delhi http://t.co/ZsWBwbgvjH", "Fri Apr 05 06:28:15 ": "Prime Minister to hold meeting on 5 April 2013 (today) to Expand the Direct Benefits Transfer (DBT) System http://t.co/hgsjCIBg5E", "Wed Apr 10 08:44:35 ": "प्रधानमंत्री डॉ मनमोहन सिंह जर्मनी यात्रा पर.. http://t.co/tYceo3rt1X", "Thu Apr 11 07:40:37 ": "PM's Visit to Germany:Photo gallery http://t.co/gq7LM3LB0V", "Wed Apr 10 05:00:26 ": "PM’s statement prior to his departure for Germany http://t.co/eRZHl2F2e9", "Thu Apr 11 10:36:02 ": "RT @KnowMyPet: GOI has taken several steps for protection of endangered species of wild animals in the country. @MIB_India . http://t.co ...", "Wed Apr 17 12:21:57 ": "@iamsbv sorry no video is available with us.", "Fri Apr 12 11:47:48 ": "TRAI releases Draft Standrd Tariff Packges for STB/CPE 2 be mandatorily offerd by DTH &amp; cableoperatrs;invites commnts http://t.co/l9E68F7BiI", "Thu Apr 04 05:14:32 ": "The Commander of Turkish Armed Forces, General Necdet OZEL laying wreath at Amar Jawan Jyoti, in New Delhi. http://t.co/VQDISDQqLX", "Fri Apr 12 10:20:45 ": "Visit Ministry of Information and Broadcasting's Facebook Page http://t.co/uFxueU7OAf", "Thu Apr 11 07:14:33 ": "Manish Tewari meets delegation from Bangladesh led by H.E. Mr. Hasanul Haq Inu, Minister of Information, Government of Bangladesh", "Tue Apr 09 07:40:37 ": "Department Related Parliamentary Standing Committee on Commerce Invites Suggestions on the NID Bill, 2013... details http://t.co/nat2xw623I", "Fri Apr 12 12:26:56 ": "Veteran Film Actor Pran conferred the Dadasaheb Phalke Award for the year 2012\nhttp://t.co/WCGq4wUCh0", "Fri Apr 05 07:37:40 ": "PM Dr. Manmohan Singh's address at the International Workshop on Green National Accounting http://t.co/Q2PbXufFin", "Mon Apr 15 14:39:01 ": "RT @PMOIndia: PM: I have always believed that the media has a very important contribution to make to the processes of nation building in ...", "Thu Apr 11 04:58:52 ": "Manish Tewari presenting  Limca Book of Record ‘People of the Year’2013 to Prabhu Deva, at a function, in New Delhi http://t.co/ygwi3njYYK", "Tue Apr 16 11:08:05 ": "Karnataka High Court dismisses suit against DAS implementation; DAS comes into force in Banglore and Mysore.", "Sun Apr 14 03:45:43 ": "The Nation pays homage to Dr. B. R. Ambedkar on his 122nd Birth Anniversary: http://t.co/62HqTUV9MC", "Sat Apr 20 06:14:56 ": "RT @PIB_India: Krishna Tirath: Am deeply shocked &amp; aggrieved by incident of 5 yr child brutalised in Delhi. I condemn this act in the s…", "Sat Apr 06 07:12:31 ": "#JobOp Employment News:Job Highlights http://t.co/xh88EpgOeE", "Tue Apr 16 10:05:23 ": "Latest figures by TAM show that DD's #Newsnight is most watched news programme among all news channels", "Thu Apr 11 07:58:47 ": "RT @PMOIndia: PHOTO: PM, Dr. Manmohan Singh being received by the German Chancellor Angela Merkel at the Federal Chancellery. http://t.c ...", "Thu Apr 18 02:29:42 ": "Watch \"India's Struggle for Freedom:Quit India\", a classic documentary by Films Division http://t.co/zQpSaGLs9v", "Wed Apr 03 08:47:04 ": "Sh. V.Narayanasamy, MOS and Sh. Manish Tewari, MIB to release 5 Documentary Films on good governance initiatives today at 3pm.", "Fri Apr 05 17:30:05 ": "Prime Minister approves expansion of Direct Benefits Transfers (DBT) http://t.co/gRq4viZSuy", "Mon Apr 15 14:41:39 ": "RT @PMOIndia: PM: I also believe that the media has, on balance, acquitted itself well. We can be justifiably proud of its vibrancy and  ...", "Mon Apr 15 14:38:50 ": "RT @PMOIndia: PM: Digitization will help broadcasters in market discovery, equitable distribution of income, and provide consumers with  ...", "Fri Apr 12 12:02:45 ": "85%  Digitization Target Achieved During  Phase II Of DAS;Ministry of I&amp;B Monitoring Digital Switch over in 38 Cities http://t.co/vYXuBeDwmF", "Fri Apr 19 11:02:34 ": "Unique screening of Silent film \"Throw of Dice' with LIVE  orchestra by Maestro Nishat Khan at the Inaugural Function of #CFF on 25th April", "Sat Apr 06 03:14:38 ": "CGHS Facilities Enchanced for PIB Accredited Media Persons http://t.co/TW1sPasbyF", "Fri Apr 19 10:59:08 ": "#CFF I&amp;B Minister to inaugurate “Indian Cinema 100 (Celebrating a Century: An Audio Visual Voyage)” Exhibition:  http://t.co/zkZLpAM6df", "Wed Apr 17 05:25:14 ": "Manish Tewari to give away #AIR Annual Awards today at 6pm.", "Wed Apr 03 12:42:55 ": "100th Birth Anniversary of Field Marshall Sam Manekshaw: http://t.co/iQNiRKjt3K", "Sat Apr 13 03:19:21 ": "RT @PMOIndia: May Vaisakhi, Vishu, Puthandu, Mesadi, Vaisakhadi and Bahag Bihu usher in peace, prosperity and happiness for all- \n http: ...", "Wed Apr 03 09:09:29 ": "K Chiranjeevi:Growth of foreign tourist arrivals to India in Jan &amp; Feb 2013 positive http://t.co/l3h0hoYpNC", "Fri Apr 12 12:19:04 ": "IIDEM Conducts Training for Election Officials from Across The World  http://t.co/bbs8yv1Bbx", "Mon Apr 15 07:07:58 ": "MIB celebrates 100 years of Indian Cinema from 25th April to 3rd May 2013. Venue- Siri Fort Auditorium, New Delhi http://t.co/bT0Y5mQiUZ", "Fri Apr 12 07:26:48 ": "Prime Minister’s remarks at the closing ceremony of the Days of India in Germany http://t.co/DwTMnUDcbC", "Thu Apr 04 09:35:13 ": "Central Press Accreditation Committee Reconstituted. Details at: http://t.co/j6Tv42irJC", "Wed Apr 03 13:03:42 ": "RT @PIB_India: V. Narayanasamy &amp; Manish Tewari release 5 films on good governance initiatives; produced by Dept of Admin Reforms. ht ...", "Thu Apr 18 11:02:07 ": "#JobOp: Watch out for latest Job opportunities... http://t.co/cL5gWGsrYA", "Tue Apr 16 04:58:25 ": "RT @PMOIndia: Prime Minister condemns Boston bombings. Expresses his solidarity with the American people in the struggle against terrorism.", "Tue Apr 16 12:26:08 ": "Last opportunty 4 stakeholdrs 2 submitt comments on TRAI’s consultation paper on “Issues relating to Media Ownership\" http://t.co/Y5oZyXqKO9", "Mon Apr 15 12:05:59 ": "Vice President Hamid Ansari arrives in Tajikistan: http://t.co/FujqLnH9Fv", "Fri Apr 19 10:55:18 ": "#CFF Centenary Film Festival to be launched from 25th April to commemorate 100 years of Indian Cinema http://t.co/25ie3Bjoq0", "Thu Apr 04 09:11:13 ": "National Programme for Health Care of the Elderly http://t.co/AqtfuKeFD8", "Fri Apr 05 11:03:27 ": "Padma Awards:Photo Gallery http://t.co/Qu35tW70OS", "Mon Apr 15 14:38:45 ": "RT @PMOIndia: PM:This process of change in the media sector is continuing with the digitization of the cable industry which is in its II ...", "Thu Apr 04 11:02:06 ": "Steps Taken to Protect Ecology of Indian Himalayan Region http://t.co/c5gRtmwenu", "Mon Apr 15 09:52:02 ": "Inter-Ministerial Committee expectd 2 promote India as a Filming Destination;to act as ‘single window’ for filmmakers http://t.co/S49WqDVvSc", "Mon Apr 15 07:37:38 ": "Agreement (DTAA) and Protocol Signed Between India and Malta for the Avoidance of Double Taxation http://t.co/R0iy2uqhvW", "Fri Apr 19 06:03:58 ": "India's first satellite was launched on this day in 1975 . Watch \"आर्यभट्ट का सफर\" http://t.co/YpkpwZrwMX", "Fri Apr 12 11:32:49 ": "RT @PIB_India: TRAI releases draft tariff orders prescribing STP for Set Top Boxes for DTH services http://t.co/cTpsADndHC", "Wed Apr 17 10:17:15 ": "Celebration of Indian Cinema, a week long Centenary Film Festival begins on 25th April. #CFF", "Thu Apr 04 14:13:05 ": "MIB to address at the opening session of the 1st meeting of the Expert Committee on Prasar Bharati tomm 10 am @ INDIA HABITAT CENTRE,", "Fri Apr 19 11:46:18 ": "केन्द्र सरकार ने मंहगाई भत्ता बढ़ाया: http://t.co/vxUZa2Y1I1", "Wed Apr 03 10:59:08 ": "PM: All records, documents regarding 2G placed before JPC http://t.co/3pvXcKUdkc", "Sat Apr 06 05:25:24 ": "@javednama thank you", "Mon Apr 08 07:24:12 ": "Foreign Tourist Arrivals Increases by About Three Percent;Foreign Exchange Earnings From Tourism also Increases http://t.co/OaPsnAHRwV", "Fri Apr 12 03:22:22 ": "ManishTewari:I&amp;BMin &amp; Bangladesh explorg jnt prodn of a grand epic on 1971Liberation war.FilmsDiv to do similar thing on battle of Rezang La", "Wed Apr 17 06:33:12 ": "MIB celebrates Centenary Film Festival. Visit to Watch Classic Movies &amp; other attractions. See details http://t.co/qhPzapoxWn", "Wed Apr 10 12:29:10 ": "A view of the newly Commissioned Indian Coast Guard Ship H-191, in Mumbai Harbour on April 09, 2013. http://t.co/yQF7tKFIGp", "Wed Apr 17 11:15:33 ": "Speech of the FM on “The Rise of the East: Implications for the Global Economy” Delivered at Harvard University http://t.co/jBmYPUIqe6", "Fri Apr 12 09:56:25 ": "Major Recent Initiatives in Farm Sector http://t.co/FYtEYpwYmV", "Wed Apr 10 07:37:28 ": "Performance Report of Major Ports http://t.co/pQbmtJDG1W", "Tue Apr 09 08:00:40 ": "Auction for Sale of Government Stocks...details http://t.co/puMfIKciiD", "Mon Apr 22 17:12:27 ": "197 Lakh Mts Foodgrains Storage Capacity to be Created in 19 States http://t.co/faBZrARGgj", "Thu Apr 04 04:54:54 ": "Jairam Ramesh:One lakh youth will get jobs under Himayat in J&amp;K http://t.co/r2sZIQnM38", "Fri Apr 05 09:56:48 ": "The President,Prime Minister, and other dignitaries, at an Investiture (Padma Awards) Ceremony, at Rashtrapati Bhavan http://t.co/pgubHT7nWH", "Thu Apr 18 17:57:15 ": "Manish Tewari:Consumer Concerns Vital for Success of Digitization;Addresses 4th CEOs Round Table on Broadcast http://t.co/N1LcLdfhgm", "Mon Apr 15 14:39:32 ": "RT @PMOIndia: PM: We expect it to point out the shortcomings of the government and thus help in improving the effectiveness of the admin ...", "Fri Apr 19 16:09:55 ": "Prime Minister deeply disturbed by shameful rape of child, says police action against protesters unacceptable http://t.co/VUQQoZBhes", "Wed Apr 17 12:22:41 ": "@pratul19 thanx for the information", "Sun Apr 07 07:37:27 ": "@RAUNI__7 thank you", "Fri Apr 05 07:57:12 ": "National Maritime Day (5th April):Charting the Future of Indian Shipping http://t.co/Thj6awwkCC", "Mon Apr 15 09:49:17 ": "I &amp; B Ministry constitutes an Inter-Ministerial Committee on Promotion and Facilitation of Film Production in India http://t.co/S49WqDVvSc", "Wed Apr 03 13:03:59 ": "Manish Tewari: Ministry of I&amp;B will extend full assistance to Ministry of Personnel to publicise good goverance initiatives.", "Tue Apr 09 11:31:36 ": "PMO writes to Secretaries on roll out of Phase II of Direct Benefit Transfer http://t.co/ST6ZesZC7a", "Wed Apr 03 13:05:37 ": "Manish Tewari: Digitization will bring benefits to the consumer &amp; usher in transparency to help broadcasting sector", "Wed Apr 03 14:31:29 ": "HMIB: Looking into Broadcasting universe,we r not going to relax deadlines for digitisation but we r sensitive towards people's concerns.", "Wed Apr 17 09:40:10 ": "Manish Tewari 2 be the Chief Guest at “4th CEOs Roundtable on Broadcast” Venue: Aftab Hall, Taj Mahal Hotel,New Delhi:April 18, 2013.", "Tue Apr 16 04:32:17 ": "Interaction with Music Director Mr. Nishat Khan, on \"Silent Film is being set to live music\" #CFF http://t.co/WfT2DGI5h8", "Mon Apr 08 10:36:39 ": "Steps taken to Reduce Air Pollution in the Country http://t.co/LyMea1RY1N", "Mon Apr 15 12:43:28 ": "ManishTewari:In addn to addressg concerns of foreign Film makers,Min. endeavors to create conducive environ.for domestic Film producers also"}