{"Thu Apr 11 09:00:03 ": "“Data is the new oil” &gt; http://t.co/BdMu5H57dx  How could #BigDatachange your business?", "Fri Apr 19 08:32:47 ": "@MattDHarper We will accept a roly-poly Matt ;)", "Fri Apr 19 16:19:00 ": "Our service vision for business customers is to offer choice and flexibility with digital tools playing a key role  http://t.co/kW0i09fLRj", "Thu Apr 11 11:30:59 ": "@Camp_Cupcake For DM's select the message icon on your profile, to add an account select the gear symbol. Let us know how you get on", "Thu Apr 18 09:00:18 ": "Just booked our tickets for the #MRetailSummit next week, looking forward to it already! Check back here next week for updates on the event!", "Mon Apr 15 11:00:03 ": "Budget and expenditure are important in business. What would you save if you switched your business landline to O2? http://t.co/brjn1AIYRg", "Mon Apr 15 12:23:49 ": "@JordonACooper Hi Jordan, what issues have you had with data? Let us know if we can help. Thanks", "Thu Apr 04 13:30:00 ": "We're helping businesses find out about sustainability &amp; their #CSR Register for @BiTC1 event on 15 April for #RBweek http://t.co/6U1fkfjxH4", "Thu Mar 28 10:21:24 ": "One of your employees has requested #flexibleworking, but you’re not sure what to do? Here’s some advice http://t.co/nTD1Q80rJ7", "Wed Apr 03 19:38:56 ": "@Topnotchdriving You can always pop in store and use our phone. Let us know what WiFi Hotspot you are using and we can direct you.", "Wed Apr 10 15:04:19 ": "@marketingjulia We can’t wait to see it! Keep us updated on the progress - Thanks Julia.", "Tue Mar 26 15:30:02 ": "Wondering what #4G means for your business? Derek McManus, COO of O2 UK reveals it all. http://t.co/Dk8NvbQRXk", "Wed Apr 10 09:00:03 ": "#FlexibleWorking can help you juggle the kids and your work. Share with us how it helped you mix business with pleasure during the holidays?", "Wed Apr 10 16:02:21 ": "@breenster You can check out all of the bolt on packages we offer here http://t.co/DqYGNInZzb let us know if you need anymore information.", "Mon Apr 08 12:01:19 ": "Marketing Matters: Find out what we're doing to support our partners' long term marketing strategies - http://t.co/5D02GNnmpy", "Fri Apr 05 11:00:00 ": "Technology 'tipping point' for SME success. http://t.co/e4neruYbwY How does technology play a pivotal role for your business?", "Wed Apr 10 09:33:08 ": "@breenster We offer up to 2GB of data on our business deals and 4GB on our standard contracts", "Mon Mar 25 14:00:03 ": "Is it becoming harder to choose the right smartphone platform for your business? http://t.co/FTb3CfQ50a What works for your business?", "Wed Apr 03 11:30:00 ": "Winning awards for your business - what impacts on your customers &amp; investors? Here's what we learnt: http://t.co/qQvGsKM1ye #Smarta100", "Tue Apr 09 09:10:23 ": "Browse web on your way to work - from June O2 customers will get free Wi-Fi access on the London Underground. More: http://t.co/SReXS5yFEk", "Wed Mar 27 15:30:00 ": "RT @ILM_UK: Video: O2's David Plumb talks about their flexible working trial day and the results http://t.co/1BoteD6dpw #flexibleworking", "Tue Apr 16 13:30:00 ": "Doubting the value of Enterprise mobile apps? Research shows they’re key for company's that aim to be more efficient http://t.co/8dYfara25A", "Wed Apr 10 08:47:21 ": "@Paularthurphoto Great! We are glad you are staying with us Paul!", "Tue Mar 26 11:00:03 ": "According to these petrol prices, #flexibleworking saves parts of your body!  http://t.co/wBIW4HGK5h", "Fri Apr 19 09:32:20 ": "#O2Passenger insight;  Know your landscape &amp; invest in understanding it. Embed social media into your organisation and  don’t isolate it", "Wed Apr 03 15:00:02 ": "Who knew that the first open plan office plan was created in 1962? We're fans of hot desks; every desk we lose saves £7k p.a", "Mon Apr 22 08:03:42 ": "Should you be focusing on running a #smallbusiness before becoming an ‘entrepreneur’? http://t.co/v8PVy2slwt", "Wed Apr 03 18:18:08 ": "@Topnotchdriving We are open till 8pm Mon-Fri.  Call 8002 from the mobile or 0800 977 7337 from a landline.", "Tue Apr 16 11:00:10 ": "Reducing cost and complexity, both now and for the future: River Island reveals all &gt; http://t.co/en7C6ig8wF", "Tue Apr 09 09:25:53 ": "@TMPeverett We are sending the builders round as we tweet...", "Wed Apr 10 11:00:01 ": "How is consumerisation affecting your business? Register and pop along to Leeds or Slough to learn more with us &gt; http://t.co/7nZWGQO0Tp", "Fri Apr 19 09:42:01 ": "#O2Passenger insight; social media value comes not from dashboards/quant analysis but qualitative analysis of what your audience is saying", "Wed Apr 17 11:00:01 ": "7,110,900,000 and counting... The number of mobile-connected devices will exceed the world's population this year  #O2consumerisation", "Mon Apr 15 13:04:31 ": "@tracilorenzo Drop us a DM with your postcode and we can have a look into this for you.", "Wed Apr 17 09:00:04 ": "It's Responsible Business week this week! Find out how being sustainable could help your business &gt; http://t.co/RQV5uvZc8o  #RBweek", "Thu Apr 04 11:00:00 ": "Do you get bored of seeing the same type of shops on the #HighStreet? Support unique independent retailers: http://t.co/9TiJnG3qDT", "Mon Apr 15 09:00:02 ": "We are looking forward to sharing thoughts &amp; ideas with everyone at O2 HQ today for the Responsible Business event with @BiTC1 – #RBweek", "Wed Mar 27 12:00:04 ": "Can public transport manage the growing passenger demands? We think, mobile technology is key for future. http://t.co/eszgSZDeio", "Wed Apr 10 14:39:16 ": "@breenster As in can you have less if you wish?", "Mon Apr 22 17:17:04 ": "RT @O2: Six million people are now using O2 Wifi. Join the UK's fastest growing wifi network, even if you're not on O2: http://t.co/ix0TLTI…", "Tue Mar 26 19:45:12 ": "What makes an award winning business? At #Smarta100 hearing about crowd sourcing and social enterprise.  http://t.co/FGUYHM3Og3", "Wed Apr 03 09:03:00 ": "What could your business do with Samsung Galaxy S4's new collaborative media sharing feature? To pre-order, visit: http://t.co/0bAtvlJbmD", "Wed Apr 17 13:30:00 ": "It’s a passenger’s world! Read the latest expert opinion on the future of passenger services here – http://t.co/dAtx3FO0f6  #O2ComeOnIn", "Fri Apr 12 11:00:03 ": "Office, home, plane, train or automobile! Here're five ways mobile technology has inspired us to work from anywhere http://t.co/Rq4t91ky6n", "Mon Apr 15 11:07:58 ": "Abi Bracken, Head of Learning and Development, O2 UK \"I joined partly because Telefònica offers flexible working\"  http://t.co/CyHH07nt0p", "Mon Apr 15 13:56:06 ": "#RBWeek Talking point- Paul from @gocarshare thinks he's more productive at home than with office distractions   http://t.co/EEE4cqY7Ki", "Wed Apr 10 16:22:45 ": "@SophieBarley This isn't at all good Sophie :( Try this link: http://t.co/JI5PcYJJGX please let us know if you can access the form needed.", "Mon Apr 22 13:30:00 ": "How do you buy IT for marketing? @OJPotter reveals all http://t.co/rTsmvBo015", "Tue Apr 02 09:06:06 ": "The UK Police force has released documentation on #flexibleworking – great news! http://t.co/Yr9tH7PpT9 Let us know your thoughts?", "Fri Mar 22 13:01:00 ": "RT @O2UKThinkBig: Fancy a tour of @O2 HQ or want to know how #FlexibleWorking can help you &amp; your business? Register today: http://t ...", "Wed Apr 03 18:42:56 ": "@Topnotchdriving We are sorry you feel that way, can you use the landline you are tweeting from to call us?", "Mon Apr 08 08:00:54 ": "Are the emails on your mobile totally unorganised? These 3 apps may save your sanity... http://t.co/7wjeklGoaj", "Thu Apr 11 15:02:40 ": "RT @O2: Free. Easy. Underground. O2 customers can access free London Underground WiFi from June. Find out more here: http://t.co/PFh5t4FLMU", "Tue Apr 16 09:00:04 ": "#FlexibleWorking has saved us millions, how much could it save your business?  http://t.co/SbPqH9hjns", "Tue Mar 26 21:05:39 ": "If you couldn't make it to the @SmartaHQ event tonight, check the hashtag #smarta100 for great inspiration. Panel and audience were amazing!", "Wed Apr 03 16:19:00 ": "Can you believe today’s the 40th anniversary of the first mobile phone call? Phones back then were far from ‘smart’ http://t.co/Ok4GcyGaQk", "Mon Apr 22 16:20:11 ": "Changing the way we engage with local government:@NeilPrior_O2UK shares his vision for the future http://t.co/MFQbEYfyS9  #O2ComeOnIn", "Mon Mar 25 19:00:37 ": "Fascinating night with @LorraineStone1 on collaborative big data and smart steps.  #O2ICEvent #BigData   http://t.co/aaar8ybfTF", "Tue Apr 09 13:30:00 ": "153 years ago today the oldest audible recording of a human voice was made - a long way from video conferencing, webinars &amp; Google voice!", "Mon Apr 15 11:08:47 ": "Abi Bracken - \"try a no-travel week to get the culture of flexible working embedded in your team\" @O2Learn #FlexiWorking", "Mon Apr 08 13:30:02 ": "Using your own devices at work is more than an IT issue - find out what it could mean for your business: http://t.co/L30svkwucS #BYOD", "Thu Apr 11 13:30:02 ": "Want to know more about the future of digital in businesses? Here's an Insight from Phil Jordan, CIO of @TefDigital http://t.co/QWReLl79d8", "Tue Mar 26 17:00:02 ": "RT @bendowdo2com: Tonight  @SmartaHQ we'll be talking about one of my passions: how to build an award winning #business. Join us! http:/ ...", "Tue Apr 02 11:00:00 ": "Are you ready for consumerisation? Join us this month to learn about technology and network to support BYOD. http://t.co/k1a3i9EvjP", "Wed Apr 10 14:21:53 ": "@marketingjulia Have @Foyles thought how they might go about it? Sounds a good fit with what shoppers say they want &gt; http://t.co/MILtPKPBFX", "Thu Apr 18 08:00:01 ": "Want to start your own business? Here are the 10 fastest growing industries for small businesses &gt; http://t.co/IAL9ysMyBv", "Fri Apr 12 08:01:01 ": "APParently 64% of mobile phone time is spent on apps. Find out how apps and other technology can grow your business  http://t.co/hlOCqenLMX", "Mon Mar 25 16:00:04 ": "Learning all about Big Data &amp; its role in customer experience tonight with @LorraineStone1 at @tefdigital offices #O2ICEvent #BigData", "Thu Apr 04 09:00:02 ": "Decrease in Help Desk traffic - an unexpected side effect of BYOD http://t.co/S1Zo4e7CTg @CIOUK What are your thoughts?", "Wed Apr 10 12:10:32 ": "@marketingjulia What do you think the next chapter holds, Julia? Do you think we’ll see more digital engagement from @Foyles and others?", "Mon Mar 25 12:00:04 ": "We think this guy’s having Monday morning blues! http://t.co/iNEtCos14B", "Sat Mar 23 18:48:02 ": "RT @O2: We’re supporting #EarthHour today. Want to get involved but don’t want to be late? Text ‘EARTH’ to 2020 to set-up your reminder now.", "Fri Apr 12 17:15:33 ": "@JonathanMLevy Oh dear Jonathan, when have you spoken to us about this? What was said? Were you given a reason as to why you can't call?", "Thu Mar 28 14:00:01 ": "If you’re a small business, come &amp; learn how to become a supplier to Telefónica. Meet our buyers on the 5th April. DM us for an invitation", "Thu Apr 11 11:00:00 ": "Paying too much for your business landlines? Find out quickly with our simple calculator &gt; http://t.co/cfGtcutwzY", "Fri Apr 05 08:00:00 ": "New breed of \"size zero\" SMEs emerge - http://t.co/5BdnoWNgit", "Fri Mar 22 15:00:52 ": "A third of small businesses in the UK will pay no jobs tax as part of #Budget2013. Good decision for businesses? http://t.co/yD3f9DhD96", "Fri Apr 12 09:00:02 ": "Check out the latest thinking on the future of retail, courtesy of our experts &gt; http://t.co/PBIdbOvKDA #O2ComeOnIn", "Fri Apr 19 13:39:01 ": "Thanks to everyone who attended our #O2Passenger event last night. If you fancy coming to our next event, follow us for future details..", "Thu Mar 28 17:34:28 ": "Congratulations to all of the @WayraUK  winners. Look forward to seeing you in the London Academy soon http://t.co/Zou3CrXUYE #wwuk", "Tue Apr 02 10:00:00 ": "We encouraged people to challenge their local council, and they came up with some pretty good ideas! http://t.co/OdLPkN7a5C #O2ComeOnIn", "Mon Apr 15 11:12:53 ": "\"Flexible working is not just home working, even a few hours in the office can keep those valuable corridor conversations alive\"", "Tue Mar 26 09:25:32 ": "To ensure our supply chain is open to SMEs’ &amp; Social Enterprises, we’re hosting a Buyers Fair on 5th April @O2 HQ. DM us to register now!", "Tue Apr 16 08:00:01 ": "“Work is something you do, not somewhere you go” See how local government is implementing #flexibleworking http://t.co/swnZTvgckK", "Wed Apr 10 08:01:00 ": "Flexible Working can help your business grow! Check out the FREE eBook we put together with @SmartaHQ &gt;  http://t.co/zBSSrkJNvc", "Wed Apr 10 13:30:00 ": "Consumers habits are effected by more than the changing times. See how the cold snap can effect business http://t.co/9umxbnSZsH #O2ComeOnIn", "Mon Apr 08 16:00:03 ": "Looking forward to #RBweek next week - we're hosting tours of our offices &amp; telling our #sustainability story @BiTC1 @O2UKThinkBig", "Tue Mar 26 12:00:02 ": "Interesting info-graphics from @ILM_UK. Do you've any challenges around #FlexibleWorking?  http://t.co/ws9P3h956J", "Mon Apr 22 11:00:04 ": "Research shows that women who run their own #business are generally happier than those who don’t! http://t.co/GEkbnriJzp", "Thu Apr 18 13:30:02 ": "Converting complaints to compliments.  Looking forward to finding out about this &amp; more at the #O2Passenger event! &gt; http://t.co/jdSfuMbBSK", "Wed Mar 27 14:00:04 ": "Got a smartphone? Here’s an infographic of 13 must-have apps for #business! http://t.co/v9at1Pqvmn What's your favorite?", "Wed Apr 17 08:00:01 ": "We're looking forward to seeing everyone at the Slough consumerisation event today! #O2consumerisation", "Tue Apr 09 11:00:00 ": "Still a few spaces left at our Leeds and Slough consumerisation events next week. Register now: http://t.co/Q4ZNc9d53E", "Thu Apr 11 18:33:24 ": "@tracilorenzo Is there something we can help with Traci? Is there a loss in signal? Let us know if we can help.", "Wed Mar 27 10:01:51 ": "Is this how business cards should look like?!  http://t.co/F0sZOtWoN0", "Tue Apr 02 13:30:00 ": "Have you got any good April fools to share? @BBCR4today would win our award: http://t.co/8fNRfW1FSj", "Tue Mar 26 14:00:03 ": "Want to learn how to build an award winning #business? Or network with some that have made it? Join us today! http://t.co/iODME4jy5P", "Wed Apr 03 10:00:00 ": "Love reading case studies? Here's one from Reading Borough Council - http://t.co/FYUP5ORPTU We'd love to hear your thoughts!", "Thu Apr 11 08:01:00 ": "Incorporating mobile commerce as part of your customer offering? A huge 76% of SME retailers are being left behind &gt; http://t.co/ZSmjgDgt9R", "Fri Mar 22 17:00:03 ": "Our enterprise customer service calls might be taking longer but overall we think this is better for everyone http://t.co/uh9t2yRoeP"}