{"Mon Apr 22 17:23:39 ": "STORY: Bomb suspect to be tried in federal court, and not as an enemy combatant. http://t.co/fQRp7CO7k0", "Mon Apr 22 19:11:48 ": "@ejsuess Thanks!", "Mon Apr 22 13:18:54 ": "Suspected marathon bomber described as having grown increasingly militant. http://t.co/U2zUn8kEX9", "Sun Apr 21 19:49:13 ": "Memorials planned for Marathon bombing victims http://t.co/000VIldINt", "Sun Apr 21 12:30:52 ": "VIDEO: Five days in April. http://t.co/FX6knnMr2F", "Sun Apr 21 16:38:17 ": "NOTE TO READERS (2/2) On Monday, we will return to subscriber-only access – with one notable change. http://t.co/DDQ9afaTei", "Sun Apr 21 21:05:47 ": "New details: Chief says at least 200 shots fired, maybe 300. Officers grappled, hand-to-hand, with Tamerlan Tsarnaev.", "Sun Apr 21 21:19:08 ": "Other phases are utility restoration, debris removal, and internal building inspections.", "Mon Apr 22 18:13:29 ": "Dzhokhar Tsarnaev had \"apparent gunshot wounds to the head, neck, legs and hand\" when captured. http://t.co/fQRp7CO7k0", "Sun Apr 21 16:37:42 ": "NOTE TO READERS (1/2) BostonGlobe. com was made available to all readers for the past week’s extraordinary events http://t.co/DDQ9afaTei", "Sun Apr 21 21:43:05 ": "RT @Boston_Police: BPD will begin returning personal property tomorrow", "Sun Apr 21 16:32:05 ": "MARATHON BOMBING UPDATE: Boston officials say Tsarnaev brothers planned for more violence but were acting alone", "Sun Apr 21 20:33:06 ": "#Royals defeat #RedSox, 4-2, ending Boston’s seven-game winning streak.", "Sun Apr 21 15:07:58 ": "#Boston Mayor Menino says bombing suspects acted alone http://t.co/jWCdwUXYaW", "Mon Apr 22 17:37:52 ": "US Attorney: Dzhokar Tsarnaev charged: conspiring to use weapon of mass destruction against persons and property in U.S. resulting in death.", "Sun Apr 21 15:41:48 ": "MARATHON BOMBING UPDATE: Suspect Dzhokhar Tsarnaev remains in serious condition at Beth Israel Deaconess Medical Center, per the FBI.", "Mon Apr 22 17:23:38 ": "Dzhokhar Tsarnaev named in sealed complaint. Initial appearance held before magistrate judge in hospital, says Gary Wente, court official.", "Mon Apr 22 18:58:51 ": "RT @JesseJNunes: RT @leahysean: BostonGlobe observes the moment of sileve in memory of #BostonMarathon victims on our homepage http://t.co/…", "Tue Apr 23 00:44:19 ": "MBTA Police recount moments leading to arrest of bombing suspect http://t.co/YaOi3QTCvg", "Mon Apr 22 13:26:48 ": "Will Dzhokhar Tsarnaev face the death penalty? And will he be tried in Mass.? Legal questions now surround case. http://t.co/U3aCkW8TVm", "Mon Apr 22 02:20:33 ": "Royals defeat #RedSox again today, 5-4, after tonight's game went to 10 innings", "Sun Apr 21 21:57:24 ": "Sunday worshippers urged to find light in the darkness; hundreds gather near Boston bombing scene", "Sun Apr 21 13:31:39 ": "FBI was warned of alleged bomber’s radical shift http://t.co/TlLbQw2GxV", "Tue Apr 23 00:03:51 ": "Students from Kazakhstan arrested on visa violations; may have known brothers accused in bombing http://t.co/BLOlV37uTd", "Sun Apr 21 21:47:02 ": "19-year-old bombing suspect still in serious condition at @BIDMChealth http://t.co/DtTJb3g8uD", "Sun Apr 21 21:44:52 ": "STORY: Watertown police chief says older suspect's fatal injuries may have been caused by younger brother http://t.co/DtTJb3g8uD", "Mon Apr 22 23:10:04 ": "Live updates from tonight's Democratic senate debate http://t.co/ZPoc8K4RrY", "Mon Apr 22 20:07:05 ": "The FBI will turn Boylston Street back over to the City of Boston at 5 p.m., mayor's office says.", "Mon Apr 22 16:26:53 ": "Thanks to the @ChicagoTribune for sending us lunch from @ReginaPizzeria today!", "Sun Apr 21 17:50:00 ": "8-year-old victim Martin Richard is mourned at tearful Dorchester service http://t.co/kIODnimSWy", "Sun Apr 21 12:53:10 ": "MT @meg_heckman Stop what you're doing and watch the video on @BostonGlobe. Modern storytelling at its finest. http://t.co/FX6knnMr2F", "Mon Apr 22 19:49:15 ": "Tsarnaev was visibly in serious condition; clearly responding to inquiries, nodding or mouthing yes or no reports @MiltonValencia", "Mon Apr 22 17:27:58 ": "BREAKING: Dzhokhar Tsarnaev has been charged, made initial appearance before magistrate judge in hospital", "Sun Apr 21 13:27:04 ": "A riveting and dramatic video: “Five Days in April,” produced by The Boston Globe http://t.co/QBpma07xwk", "Sun Apr 21 12:52:03 ": "Edward Markey has been enorsed by @GlobeOpinion in the Democratic race for #MaSen http://t.co/zMazOwr5MQ", "Mon Apr 22 17:14:27 ": "Dzhokhar Tsarnaev will be tried in US District Court, not as enemy combatant. http://t.co/bhT3gBO8ju", "Sun Apr 21 17:37:59 ": "Boston officials say Tsarnaev brothers likely planned more attacks but acted alone http://t.co/AaBoCb9Dhf", "Mon Apr 22 22:09:47 ": "Lynch, Markey to square off in first debate since bombing http://t.co/x8Q59kk2r2", "Sun Apr 21 21:14:58 ": "MBTA officer Richard Donohue -- wounded in shootout w/ bombing suspects -- is in stable but critical condition today at Mt. Auburn Hospital.", "Mon Apr 22 03:18:55 ": "PHOTOS: The memorial to the bombing victims was moved from Boylston and Berkeley to the sidewalk today http://t.co/pbXNOuMtQS", "Mon Apr 22 16:34:11 ": ".@ChicagoTribune random act of pizza for us today: \"We can't buy you lost sleep, but we can buy you pizza.\" Classy to the core.", "Mon Apr 22 01:57:05 ": "ICYMI: Stretch of Boylston Street likely to reopen within the next two days http://t.co/C8CY0EqhHV", "Sun Apr 21 19:41:02 ": "Officials will announce a multistage plan to reopen Boylston Street http://t.co/pEQ5Hv4KPi", "Sun Apr 21 21:18:37 ": "City unveils 5-step plan to reopen Boylston Street Marathon blast scene. Starts with biohazard testing, structural assessment.", "Mon Apr 22 17:41:32 ": "Charges call for death penalty, but Obama administration has not decided whether to seek death penalty.", "Sun Apr 21 19:55:01 ": "UMass Dartmouth reopens after closure due to bombing suspect  http://t.co/86Ux6vjBeo", "Sun Apr 21 21:04:05 ": "New details emerge on wild shootout with bomb suspects in Watertown; chief believes one brother killed by other's desperate getaway", "Sun Apr 21 21:21:01 ": "Tamerlan Tsarnaev appeared to run out of bullets, then charged officers, who tackled him, says Watertown chief. http://t.co/TC5mE1Ko53", "Sun Apr 21 14:29:56 ": "London Marathon is held amid tight security, moment of silence for Boston http://t.co/8BsvWJDjrZ", "Mon Apr 22 01:45:06 ": "6 rules to keep you out of trouble at work when texting http://t.co/Bqc2Mq0CJk", "Mon Apr 22 11:46:32 ": "Thorny US legal questions swirl in the case of Marathon bombing suspect Dzhokhar Tsarnaev. http://t.co/9ETe682hVR", "Sun Apr 21 21:22:11 ": "As bomb suspect wrestled with officers, younger brother drove at them. Cops dove away, while the suspect was run over, Watertown chief...", "Mon Apr 22 13:48:19 ": "Teamsters to shield Krystle Campbell's funeral from Westboro Baptist Church members if they picket, as promised. http://t.co/sUXiEIPu9y", "Mon Apr 22 12:15:44 ": "In a life of seizing opportunity, GOP candidate Gabriel Gomez is reaching for one more in his run for #MASen. http://t.co/BUTq0KNfkk #mapoli", "Sun Apr 21 20:15:57 ": "#Bruins end slide with 3-0 win over #Panthers http://t.co/hRj01GCDD5", "Sun Apr 21 16:21:54 ": "Thursday news conference, with release of photos, seen as turning point in Marathon bombings probe http://t.co/ImHO5guG2h", "Sun Apr 21 16:58:20 ": "Mass DOT:  Mass Pike (I-90) eastbound Exit 22 Copley exit ramp will REOPEN today, Sunday, at 3 p.m. Ramp had closed after Marathon blast.", "Sun Apr 21 23:19:53 ": "Officials say part of Boylston Street expected to reopen soon, likely in the next two days http://t.co/C8CY0EqhHV", "Sun Apr 21 19:05:39 ": "Boston's Cardinal Sean O' Malley prayed for victims, lauded heroes -- and urged forgiveness for bombers -- at service http://t.co/omdX3mJAfQ", "Sun Apr 21 20:05:21 ": "Cambridge mosque official says bombing suspect Tamerlan Tsarnaev objected to comparison of Prophet Muhammad with Martin Luther King Jr.", "Mon Apr 22 18:08:04 ": "Here is the criminal complaint against Dzhokhar Tsarnaev (PDF). http://t.co/4XUI4kG1Sg", "Mon Apr 22 18:56:08 ": "Authorities searching back of Cambridge building where suspects’ father once worked on cars. Story upcoming.", "Mon Apr 22 18:30:06 ": "RT @jm_bos: Awaiting Gov Deval Patrick, top state officials, and legislators for a 2:50 moment of silence on State House steps. http://t.co…", "Mon Apr 22 01:03:33 ": "Marathon bombings cast a shadow as Boston-area schools prepare to come back from April break http://t.co/FP2HISxGCl", "Sun Apr 21 16:33:45 ": "Boston officials say Tsarnaev brothers planned for more violence but were acting alone http://t.co/kB0bfJHcw6", "Mon Apr 22 02:39:50 ": "Game story: #RedSox drop a doubleheader to the Royals, 4-2 and 5-4 http://t.co/wWAXtLM3HP", "Mon Apr 22 22:00:58 ": "Oakland A’s players visit young bomb victim in hospital http://t.co/MLju1RjX5P", "Mon Apr 22 19:02:12 ": "Authorities searching Cambridge premises where Marathon bombing suspects' father once worked.", "Mon Apr 22 17:15:50 ": "Law enforcement source: Transit Police Officer Richard Donohue Jr. is improving; now breathing on own and asked to speak with his wife.", "Mon Apr 22 17:41:25 ": "BREAKING: Marathon bomb suspect  Dzhokhar Tsarnaev charged with using a weapon of mass destruction.", "Mon Apr 22 14:51:30 ": "Globe columnist Adrian Walker talked with Boston police Commish Ed Davis and the race to be the next mayor of Boston. http://t.co/leEEOD3XJX", "Mon Apr 22 15:06:14 ": "RT @twallack: Please welcome the wonderfully talented @BostonGlobe higher ed reporter @GlobeMarcella to Twitter", "Sun Apr 21 16:14:42 ": "The Globe’s Kevin Cullen offers a glimpse of Boston’s first responders http://t.co/6Ca5wXiYwG", "Sun Apr 21 23:42:27 ": "ICYMI: Older bombing suspect had disrupted speaker at Cambridge mosque over comparison of MLK to Muhammad http://t.co/OAOCbANHoP", "Mon Apr 22 01:37:43 ": "From our Ideas section: Daily life in an urban area like Boston opens us to almost unimaginable risk http://t.co/q4CKbfYIod", "Mon Apr 22 18:00:47 ": "STORY: Dzhokhar Tsarnaev charged with  conspiring to use a weapon of mass destruction. http://t.co/fQRp7CO7k0", "Sun Apr 21 22:21:38 ": "STORY: Worshipers gathered near bombing scene today for joint service http://t.co/fPtUmnRVby", "Sun Apr 21 16:32:45 ": "The officials' comments came on Sunday interview shows", "Tue Apr 23 00:01:50 ": "FBI returns Boylston Street to Boston; city has plan to reopen street http://t.co/IOsjSyUBfM", "Sun Apr 21 17:50:20 ": "Senator Coats, Sen. Select Intelligence Committee member, says on ABC it's not clear when or whether Dzhokhar Tsarnaev will ever talk again.", "Sun Apr 21 17:38:12 ": "Indiana Senator Dan Coats: Boston Marathon bombing suspect who was captured Friday evening was \"shot to the throat.\"", "Mon Apr 22 00:39:02 ": "PHOTOS: A line formed for bombing victim Krystle Campbell's wake, and runners in London remembered Boston http://t.co/pbXNOuMtQS", "Sun Apr 21 21:15:25 ": "Donohue was critically injured when bullet ripped his right thigh, hitting both branches of femoral atery, and femoral vein.", "Mon Apr 22 18:35:30 ": "Police probe possible link between Marathon bomber and unsolved triple homicide in Waltham.", "Sun Apr 21 21:15:58 ": "Docs, family say Donohue was able to wiggle toes and squeeze his wife's fingers today. Docs \"cautiously optimistic\" about recovery.", "Sun Apr 21 20:01:40 ": "Bombing suspect disrupted Cambridge mosque  http://t.co/7znoLU0sTj", "Mon Apr 22 17:01:10 ": "White House says Dzhokhar Tsarnaev will be tried in US courts and won't be treated as an enemy combatant.", "Sun Apr 21 22:55:04 ": "Travelers return to a changed Boston http://t.co/HQYLfxX76d", "Mon Apr 22 16:24:45 ": "FBI didn’t know of bomb suspect's Russia trip because his name was misspelled, Lindsey Graham says. http://t.co/b5llZpnCkI", "Sun Apr 21 23:47:32 ": "RT @Charliemagne: The @BostonGlobe has a good tick-tock of the chase that began Friday's manhunt. The eldest was captured briefly. http://t…", "Sun Apr 21 13:44:23 ": "Stories of two rescuers who were determined to keep helping http://t.co/f4BiHpBDEq", "Mon Apr 22 18:47:54 ": "Moment of silence approaches to commemorate victims of Boston Marathon bombings.", "Mon Apr 22 18:38:04 ": "Relative of triple homcide victim in Waltham says brutal murders occurred on Sept. 11, 2011, 10th anniversary of Sept. 11 attacks.", "Mon Apr 22 03:03:01 ": "Watch: 'Five Days in April' marks important moments in a week of fear http://t.co/QBpma07xwk", "Sun Apr 21 22:55:18 ": "RT @Knothea: New #bostonstrong graffiti on a building off Tremont Street http://t.co/g9Vl8x69VZ", "Sun Apr 21 19:27:58 ": "Food editor @sheryljulian is writing about what people cooked during the last week. Send her a description &amp; photo #thestresskitchen", "Sun Apr 21 22:40:05 ": "STORY: Royals end #RedSox winning streak; they face off again tonight at 7:05 http://t.co/wWAXtLM3HP", "Mon Apr 22 17:41:20 ": "Tsarnaev charged with conspiring to use weapon of mass destruction, resulting in death - http://t.co/mxkFehhv6X", "Mon Apr 22 18:24:47 ": "Boston Globe account on charges against Dzhokhar A. Tsarnaev.  http://t.co/bhT3gBO8ju", "Mon Apr 22 00:09:36 ": "VIDEO: Boston imam says bombing suspect was too radical for local Muslim institutions http://t.co/OAOCbANHoP"}