{"Thu Jun 28 17:24:09 ": "Good evening Ladies &amp; Gents! Did anyone happen to hear ES Posthumus' \"Moonlight Sonata\" on America's Got Talent last night?", "Thu Jul 01 00:38:02 ": "Good evening all!! How is everyone's summer going thus far? Who's up for trying to break the 3000 mark for this... http://fb.me/ADIu9Jum", "Sun Jul 25 20:38:16 ": "I\n continue to be blown away by the out pouring of love and support here. \nIt just goes to show how special 2... http://fb.me/CmvyfVVC", "Thu Jan 31 20:34:54 ": "Jambalaya, Gumbo &amp; Crawfish! Helmut VonLichten is in New Orleans today with CBS Sports to Jazz Up SUPER BOWL... http://t.co/Z24A0pzq", "Fri Jul 23 16:27:28 ": "I would like to thank you for letting Helmut know how much what he and Franz created meant to you all. You're the... http://fb.me/CpDNBTV8", "Thu Apr 22 00:26:22 ": "Good evening all...hope you are all having a good week! I'll be around on Friday hoping to start a little... http://bit.ly/dlCWWA", "Mon Jan 24 02:08:41 ": "Everyone enjoying ES Posthumus during the Jets game?", "Fri Nov 12 01:17:45 ": "And here is Helmut's message to you all...", "Wed Nov 07 05:22:55 ": "Please \"like\" to support ES Posthumus getting out there beyond a mere 7% of our community and encourage other... http://t.co/H5ZdS8mk", "Thu Jul 22 13:38:34 ": "Friends, please read the note posted below...", "Tue Jul 20 17:35:37 ": "Ah I see someone beat us to the punch...but yes Helmut just informed me that \"the mashup we did w/ Jay Z and... http://fb.me/B4xhOuog", "Tue Nov 13 04:30:51 ": "\"We Will Rock You VonLichten\" as in Helmut VonLichten.... as in ES Posthumus.....  the single has dropped on... http://t.co/Sa1LR3Hv", "Mon Mar 08 18:13:43 ": "Slight change in plans kids...if no one gets the right answer by 5pm EST tonite I will post the answer here. Along... http://bit.ly/aB2pvw", "Sun Jul 29 03:20:14 ": "http://t.co/1T9koGMv", "Thu May 20 19:09:58 ": "Just dropping in to say hello folks!! Now recovering from my 2 week vacation and playing catch up on life!! How are... http://bit.ly/arPqfb", "Sun Feb 03 18:59:35 ": "Get Ready...... http://t.co/O4QPJTt6", "Tue Apr 05 00:35:40 ": "As of this moment, Helmut has new music in the NCAA Championship College Basketball game tonight on CBS, 6:00 PT/... http://fb.me/E1xjz3BV", "Fri Jul 13 23:02:04 ": "http://t.co/Nq9JLZeP", "Sat Apr 06 00:57:28 ": "Keep up with Helmut here ... https://t.co/SQFqQPaUqI http://t.co/KJdiUIZkNO", "Wed Jul 07 06:00:39 ": "Alright folks just one day to get 182 more fans added to this page!!!! Can we do it?? who will be fan number... http://fb.me/B6d4cr5T", "Sun Jul 25 20:40:52 ": "I continue to be blown away by the out pouring of love and support here. It just goes to show how special 2 people... http://fb.me/waMzX5WS", "Fri Apr 05 21:26:44 ": "I might have music in the Final Four open this Sat on CBS. -Vonlicthen", "Sun Mar 14 16:13:11 ": "Kevin W please contact me at esposthumusguru@gmail.com ASAP! http://bit.ly/9NFzgH", "Tue Apr 09 01:01:21 ": "ALERT!!! Song for tonight's game has been changed to VonLichten's \"Incredibly Close\". Airs at 6PM PST. http://t.co/OWaJ1CLnIr", "Tue Jan 01 10:59:46 ": "bonne année!! \nwe hope everyone's glasses were clinking at midnight and lots of hugs shared ...  happy new year!!", "Sun Mar 07 20:42:47 ": "Howdy folks!!!! Hope you are all doing well on this wonderful day...latest update on the contest - we still have no... http://bit.ly/bfso9L", "Thu Jul 22 14:02:20 ": "Thank you all for the beautiful messages. We will be keeping this page up and I will continue to be here as well.... http://fb.me/CNAajcJX", "Mon Apr 15 04:04:43 ": "At Laker game.... Heard some ESPosthumus. http://t.co/PJYNCIgKMj http://t.co/HP6b2U94cE", "Thu Jul 22 13:38:04 ": "Sad News... http://fb.me/ztltndrk", "Tue Jan 24 09:08:04 ": "Les Friction's debut album is now available. Buy it today to experience the evolution of Helmut and ES Posthumus. http://t.co/hEj7dKyK", "Mon May 31 23:11:59 ": "Isn't Pandora an amazing thing?? What are some of your favorite programs?? http://bit.ly/ao6XcZ", "Sun Feb 03 18:59:14 ": "Get Ready...... http://t.co/hSK2r1VP", "Wed Nov 07 05:37:30 ": "Thanks everyone! If you hover over the \"like\" box another box will pop up and that's where you can add us to your... http://t.co/e5Uh7w8i", "Thu Nov 29 01:22:13 ": "Louder Than Words.. pumping up the crowd last Saturday at the Rose Bowl, Pasadena, CA http://t.co/xmxstFYt", "Tue Nov 15 00:26:44 ": "Helmut Vonlichten of ES Posthumus has a new band & FB page....  check it out for updates.... http://t.co/ewPDqkIU", "Sat Mar 20 04:46:30 ": "Welcome to all the new folks! I was in Vega son business but am back at it full speed ahead!!! So - anything... http://bit.ly/dnIVeL", "Sun Jul 08 02:42:13 ": "Hope all of you are enjoying the weekend!  Just a \"heads up\" that our website, http://t.co/dRtyAxJY,  has been... http://t.co/82sCVruS", "Fri Apr 23 16:21:21 ": "If anyone is lucky enough to attend an Orlando Magic NBA Playoff Game , The Magic are using \"Kalki\" and \"Kuvera\"... http://bit.ly/cbCJmN", "Sat Jul 14 19:32:10 ": "Do you have your dancing shoes on? Here's the performance to \"Unstoppable\" from SYTYCD this week and what a... http://t.co/KCBBrXSC", "Mon Feb 04 05:32:41 ": "http://t.co/aPSLk4Q5", "Thu Jul 22 13:37:30 ": "I have posted a short note from Helmut...please take a moment to read it.\n\nThank you - the guru", "Thu Nov 15 16:57:36 ": "\"We Will Rock You VonLichten\" is #5 on iTunes Rock Charts..  Thx to everyone for their support.... http://t.co/LQLo02ek", "Thu Sep 02 12:37:55 ": "And to leave you all with another tidbit, E.S. Posthumus wrote the theme to the US Open which will air on CBS this... http://fb.me/FRr7kGA6", "Fri Nov 25 20:58:29 ": "Les Friction is trying to bring humanity back from the brink. Check out their free download of \"Torture\" and share... http://t.co/FiDjOylH", "Tue Apr 09 00:09:10 ": "http://t.co/NaTKUoSmrH", "Thu Oct 21 13:51:23 ": "Good morning all!! Just dropping in to see how all of you wonderful people are doing? Looks like the cold weather... http://fb.me/A1VHSD01", "Sun Nov 25 04:04:17 ": "They're playing \"Louder Than Words\" at the Rose bowl ... !", "Sun Jul 29 03:19:24 ": "Each Olympian is more amazing than the next... !!!", "Tue Apr 09 00:09:41 ": "VonLichten has composed a song for the NCAA Championship game tonight on CBS (6PM PST)\"Force Of Destiny\". Will... http://t.co/nwXBDCWEkj", "Sat Mar 13 00:49:35 ": "Sorry with the torrential rain here I lost my internet connection...I am going to make an executive decision here... http://bit.ly/dDpEi5", "Fri Oct 29 16:18:17 ": "Hmmmm something is in the air...make sure you remember to check in here. Never know when something new is going to land here. :D", "Sun May 02 14:11:14 ": "So how's everyone's weekend going thus far??? :D http://bit.ly/911Kqz", "Tue Nov 29 01:10:33 ": "Les Friction has posted a FREE download of the song \"TORTURE\". Download the song and share this post with all you... http://t.co/l3g5B4n4", "Tue Sep 04 19:04:29 ": "A shout out to Cole Horibe who sent us this link and a note: \n\n\"I love your music. Thank you very much for... http://t.co/4F4G5h6o", "Fri Apr 16 13:00:48 ": "Good day everyone! The Brothers have seen the talk of the Masters and their music and have sent me something to... http://bit.ly/cJ7NlN", "Thu Dec 23 04:26:51 ": "Greetings all...just wanted to pop in and say hi and that I hope you are all having a wonderful holiday season... http://fb.me/Q8Xzx8My", "Wed Feb 15 19:23:28 ": "Les Friction released their debut self-titled album a couple weeks ago on January 24. It maintains much of the... http://t.co/Yo9lGVkP", "Mon Aug 22 16:57:44 ": "Greetings all. Welcome to all the new people! I'm the guru your liaison to E.S. Posthumus. Hope you've all been... http://t.co/Hdm5OlU", "Wed Jul 11 20:51:53 ": "This just in....  ESP's \"Unstoppable\" to be featured in a routine TONIGHT, Wed July 11, during So You Think You... http://t.co/OGzOImsr", "Wed Mar 10 16:55:25 ": "Heads up for Friday!!! New contest question coming...warm up those thinking caps! :D http://bit.ly/cGLKig", "Mon Jun 07 21:40:02 ": "You know when I put out the query as to your favorite programs I didn't even consider some would go the TV... http://bit.ly/978Jui", "Fri Nov 18 21:47:16 ": "Les Friction – “Torture.”  A Potential Star Band Arises Out Of E.S. Posthumus | Back Page Magazine http://t.co/m2cFOF4Y", "Sun Mar 14 16:12:33 ": "CONTEST UPDATE: the Vonlichtens gave me the wrong year in the question. They apologize. The question is NOW: In... http://bit.ly/aRzYH5", "Fri Mar 04 03:10:13 ": "Ooohh we are thisclose to 7000 members!!!!! this pleases the guru...\n\nHow are we all doing this fine day/evening??", "Sat Mar 13 17:02:44 ": "NEW CONTEST QUESTION:  In 2006, Which HBO Series featured which E.S. Posthumus Song from Unearthed ?  So I need 2... http://bit.ly/cb3R80", "Fri Feb 01 21:32:03 ": "QUEEN + VONLICHTEN TO OPEN SUPER BOWL XLVII", "Sun Jul 29 14:33:12 ": "So far it's been fun watching the finest athletes in the world, Olympians that have sacrificed and strived to... http://t.co/1NdGjv54", "Mon Oct 11 19:42:17 ": "Almost at 4100 on here and 658 following on Ping!! Welcome to all the new people... \n\nthe guru", "Fri Mar 12 23:16:14 ": "OK kids...heads up! Contest question will be posted in 15 minutes... http://bit.ly/bS5Dtw", "Sun Nov 13 19:05:00 ": "Here's a link to Helmut Vonlichten's  \"Torture\" as broadcast on college radio yesterday. Click on \"2011-11-12\".... http://t.co/9WPnm5nT", "Wed Sep 12 18:39:43 ": "The X Factor will be airing Unstoppable sometime in the next 3 weeks. Can you be our eyes and ears and let us... http://t.co/qptoGWDg", "Mon Nov 05 00:48:59 ": "Helmut VonLichten of ES Posthumus has hooked up with Brian May Of Queen and created the ultimate EPIC SMASH UP...... http://t.co/iHBLiVQo", "Sun Mar 13 14:26:17 ": "So Spring is creeping closer. Yay. Daylight savings for those of us in the US (except those few states that do not... http://fb.me/IMYiqGDN", "Sun Jul 25 20:37:46 ": "I continue to be blown away by the out pouring of love and support here. It just goes to show how special 2 people... http://fb.me/EfZOzyru", "Wed Jan 16 00:55:23 ": "ES Posthumus founder, Helmut VonLichten,  is in the lab creating secret sauce for the Super Bowl... follow @VonLichten for clues....", "Fri Jan 28 17:46:10 ": "Thought I'd share a photo of our winter wonderland with you all!! Hope you are all doing well on this Friday or... http://fb.me/u52qfofE", "Fri Mar 26 15:11:08 ": "Good morning folks! Happy Friday/Saturday to you all!!!! :D Got a little tidbit for you... E.S. Posthumus' Theme to... http://bit.ly/bnYAz2", "Sun Jan 02 19:16:13 ": "And a great big welcome to 2011!!!!! How's the New Year treating you all thus far??", "Sat Jul 14 03:51:23 ": "Helmut Vonlichten of ES Posthumus has a new single release with his band Les Friction.... take a chance &amp;... http://t.co/X7FYrCx5", "Sat Nov 12 19:38:21 ": "ES Posthumus co-creator, Helmut Vonlichten,  has a new band: Les Friction.  Nic Harcourt to debut the first... http://t.co/CyFcmIR1", "Wed Jan 04 01:05:58 ": "World-renowned DJ Nic Harcourt picked Helmut's/Les Friction's song \"Torture\" as the #1 track of 2011. http://t.co/pjd3eJBV", "Tue Jan 03 21:08:32 ": "There are two FREE songs available for download from Helmut's new incarnation as Les Friction. Visit the page... http://t.co/aMAJCy3v", "Wed Jan 12 02:34:37 ": "Howdy people!!! Hope this post finds you all doing well and the New Year treating you all splendidly!!! 1.11.11 -... http://fb.me/LFDh0fXJ", "Mon Sep 26 03:53:53 ": "Well that certainly got  your attention didn't I!! LOL...oh and check out how close we are to the 10.000 number!!... http://t.co/coahdJ5k", "Thu Jan 26 01:47:54 ": "A well-written review of Les Friction http://t.co/2O4mnccA", "Fri Apr 05 21:27:33 ": "I might have music in the Final Four open this Sat on CBS. \n-VonLichten", "Wed Apr 07 02:43:23 ": "Welcome to April!! And the warmer weather has begun...how's everything in your corner of the planet?? http://bit.ly/cFUOah", "Sun Mar 14 02:01:30 ": "Heads up for you all!!! I'll be back at 12 EST tomorrow to update on where we stand with the contest! I'll also... http://bit.ly/aSCFE8", "Tue Sep 07 02:26:07 ": "Good evening all! Hope you all enjoyed the most recent ES Posthumus work on the US Open theme!!! And thank you as... http://fb.me/zaK348Px", "Tue Jul 20 17:37:33 ": "And may I just say welcome to all the new folks!! Nice to have you here!", "Sat Apr 06 19:07:36 ": "http://t.co/tZQ0bRkfmy", "Tue Mar 16 23:50:32 ": "Congrats to Kevin W and Hammed our 2 contest winners!!! Can you both email me your mailing address -... http://bit.ly/cWoJ7U", "Tue Sep 04 19:08:28 ": "We'd like to share this note and link from Cole Horibe. \n\n\"I love your music. Thank you very much for allowing me... http://t.co/P6pHS85Z", "Fri Sep 24 18:46:13 ": "Good afternoon friends!!!! Tis the guru with some news for you! E.S. Posthumus was offered an invite to Ping. I... http://fb.me/AGTGsFJ0", "Sat Jan 21 18:02:50 ": "Helmut has released a new transmission through Les Friction. Download a FREE copy of \"Here Comes The Reign\" from... http://t.co/b0wEFokt", "Fri Feb 01 18:54:47 ": "Did someone mention secret sauce? The secret's out!!!! Read the latest press release from CBS Press Express .... http://t.co/Q3OvMqbI", "Tue Sep 28 14:54:46 ": "Has everyone started following us on Ping??", "Sun Sep 25 22:55:59 ": "What was that? Did you all hear it? A faint rustling? Is something happening? Is there something in the air?? Stay tuned...", "Sat Nov 24 08:39:41 ": "I feel your love!!! I HOPE U FEEL IT BACK!!!", "Wed Nov 17 01:53:43 ": "Thank you all for taking a moment to share your thoughts on the new song and your love of Helmut and Franz. It is... http://fb.me/EHREzZE8"}