{"Fri Nov 02 20:29:29 ": "\"Some people are old at age18 and some are young at 90...time is a concept that humans created\" #HOLYWAR", "Sat Nov 17 14:27:03 ": "Breaking Dawn pt II tonight! can't believe it's over..Kind of a bittersweet feeling", "Sun Nov 11 03:28:27 ": "@MercXIV ha yeah just asking? Look, you can go tell your friend who is having you ask me this, that he can ask me himself.", "Sun Jan 06 15:33:08 ": "RT @TrulyCapricorns: #Capricorn are hard to stay mad at.", "Mon Feb 18 13:13:15 ": "RT @autocorrects: *Walking into restaurant* \"Would you like a table?\" ..... \"Nah, we'll just eat on the floor.\"", "Fri Dec 07 03:27:10 ": "The sky has never been the limit.", "Sun Oct 28 14:21:13 ": "@HoldYuDown I'm ready.. Just not looking forward to being stuck inside for 2 days. Be safe!", "Sun Nov 11 03:08:19 ": "@MercXIV who what", "Sun Nov 11 03:41:42 ": "@MercXIV and yes you can ask a simple question, but you're not even following me so how would you find my tweets?! Lol try to keep up", "Tue Oct 16 15:19:30 ": "Try to be a filter, not a sponge.", "Thu Oct 18 23:40:18 ": "RT @UberFacts: Giving birth is the second most painful thing a human can experience - The first is being burned alive.", "Sun Nov 11 05:55:43 ": "@MercXIV he doesn't use twitter.", "Mon Oct 22 14:42:16 ": "RT @TheFunnyTeens: Dear dramatic bitch, grow the hell up. No one cares about your bullshit.", "Mon Oct 22 14:42:05 ": "RT @TheFunnyTeens: I hate people who steal my ideas, before I think of them.", "Tue Oct 02 15:11:14 ": "RT @iQuoteComedy: They should definitely have cell phone chargers in waiting rooms instead of magazines.", "Sun Nov 11 06:24:19 ": "@MercXIV I told you, the fact that someone I don't know, never even heard of before, saw my page supposedly thru my ex's page and", "Sun Nov 11 14:33:23 ": "RT @SoMindBlowing: “Wow, You’re cool.” 90% of the people read that in a sarcastic voice. Retweet if you did.", "Thu Jan 31 13:49:58 ": "is @gary_head going to be on the show at any point? @PBandJenelley_1", "Mon Dec 17 15:27:35 ": "RT @ItsBC3: The things most people want to know about are usually none of their business.", "Sat Dec 22 15:23:08 ": "@PBandJenelley_1 get well soon Jenelle!! If not for yourself then for the sake of your son. Don't make him grow up without a mom too", "Fri Dec 07 17:37:56 ": "RT @ItsFunnyLife: Apparently twilight is popular because teens can relate to it. yeah, I remember that time I was a vampire.", "Wed Dec 05 15:30:08 ": "RT @PBandJenelley_1: I'm not pregnant. Jesus, still only weighing 100 lbs over here... Lol", "Tue Oct 02 15:08:53 ": "RT @iQuoteComedy: Mentally preparing yourself to step out of the shower during winter.", "Sun Nov 11 03:56:38 ": "@MercXIV I'm confused. I have no idea who you are, so how do you know I dated him? He's never mentioned you before.", "Fri Dec 07 17:42:00 ": "RT @ItsFunnyLife: Whenever I delete text messages, I feel like I’m deleting evidence.", "Sun Jan 06 15:33:41 ": "RT @TrulyCapricorns: #Capricorn is ambitious and strong, but also somewhat conservative.", "Mon Feb 04 15:02:32 ": "RT @awkwardposts: I wish you could Google anything. Like, \"Where is my phone?\" and it would be like, \"It's under the couch, dumbass.\"", "Tue Jan 15 16:04:02 ": "I love watching people that can't walk in their 4+ inch heels. Hysterical 😂 #youlookridiculous", "Mon Dec 17 15:29:16 ": "RT @TeenMomNewsFeed: #TeenMom: MACI AND RYAN GETTING BACK TOGETHER?! Seriously, it might happen! PHOTO &amp; Details --  http://t.co/Iye ...", "Sat Nov 10 03:55:11 ": "I have the most caring, sweetest, thoughtful boyfriend ever 💜", "Fri Jan 18 23:20:27 ": "RT @garettnelson: #FACT all human beings should receive a 60 minute massage once a week.", "Mon Oct 29 13:42:50 ": "Yes, we know we have bad weather coming our way, so why do people insist on writing 4568543356 statuses about it? #getoverit", "Sat Nov 24 14:39:44 ": "Curiosity often leads to trouble.", "Tue Jan 01 23:13:33 ": "RT @TedsPosts: Don't ask for my opinion then get mad when I tell you the truth.", "Fri Dec 28 14:11:41 ": "RT @AlltheTeenMoms: #TeenMom2 Courtland Publicly Admits to Jenelle's Heroin Use. Will it be on #TeenMom2 ? http://t.co/lzAtwccl", "Fri Dec 07 17:42:48 ": "RT @ItsFunnyLife: Money may not buy happiness but it can certainly improve the quality of your misery.", "Sun Oct 21 02:03:43 ": "Watching hocus pocus! This movie never gets old.", "Sun Nov 11 14:31:46 ": "RT @SoMindBlowing: If camera lenses are round, why are all the pictures square ?", "Mon Oct 22 14:42:01 ": "What a weight off my shoulders! Sometimes things go better than expected and when they do, it makes it that much better. #truth", "Wed Oct 31 21:46:57 ": "RT @thatakwmoment: That awkward moment when you realize you're too far into a conversation to ask what their name is.", "Wed Dec 05 16:04:09 ": "RT @factsof18years: Saying \"I'm tired \" when you're actually sad.", "Sun Oct 28 12:56:43 ": "@HoldYuDown good morning! 😋", "Fri Dec 07 17:36:14 ": "RT @ItsFunnyLife: \"Twitter is stupid!\" *one month later* \"DUDE, I can't stop tweeting!\" Who remembers saying this?", "Fri Oct 19 14:08:36 ": "Precious http://t.co/J6Bvdilu", "Tue Oct 09 13:37:23 ": "RT @funnyortruth: That moment of pure joy when you see your food coming in a restaurant.", "Fri Dec 07 17:45:27 ": "RT @TheFunnyTeens: That awkward moment when your walking down the stairs and think theres another step and you hulk stomp the ground.", "Sat Dec 22 15:01:48 ": "RT @PBandJenelley_1: @NicholeWhite19 lol it's whatever it's going to get out when the time is right.. I mean vivid details but u have to ...", "Wed Dec 05 15:30:30 ": "RT @BreakingCeleb: Kristen Stewart Kicked Out Of Robert Pattinson's Christmas Plans! http://t.co/ptUtS8Ai via http://t.co/KpkCIRFV", "Wed Dec 05 15:25:48 ": "RT @Maxwell4911: World news:---The world's tallest woman, 7' 7\" (233.3 centimetres), has died. Chinese state media says Yao Defen died a ...", "Sun Jan 06 15:34:32 ": "RT @TrulyCapricorns: If you don't want sarcastic answers from #Capricorn, never ask stupid questions.", "Wed Oct 10 03:35:22 ": "@Kclemens11 shut upppppp. It's such a good movie!!", "Sun Nov 11 06:25:35 ": "@MercXIV claims to just be interested in who my bf is, is a little strange don't you think? Bad planning on both your parts.", "Sun Nov 11 14:32:27 ": "RT @SoMindBlowing: Before going to bed, 93% people count that how many hours of sleep they're going to get.", "Mon Oct 01 03:46:04 ": "\" don't waste your feelings on people who don't value them.\"", "Thu Oct 18 23:36:31 ": "RT @WeThinkTeen: That fake laugh you do when you don’t understand what someone said to you.", "Fri Dec 28 23:40:51 ": "RT @TedsPosts: While in the shower: 2% Cleaning body 8% Singing 90% Winning fake arguments", "Thu Oct 25 02:07:39 ": "RT @Rxmy: The best relationship is when you two act like lovers and bestfriends.", "Wed Oct 31 03:30:35 ": "What an amazing day it turned out to be! Night teedos 😴", "Sun Oct 28 12:54:02 ": "Choose the guy that always tells you how beautiful you are each and every day 💜", "Sat Dec 08 23:43:53 ": "RT @ItsBC3: Whoever gossips to you will gossip about you.", "Fri Nov 02 20:16:36 ": "RT @BREEZENYC: If NYC Marathon Happens I Feel Bad For The Riot That's Going To Happen. People Are Left With Nothing And You Worry About  ...", "Sun Nov 11 03:43:25 ": "@MercXIV hmm could his name be tucker? Like I said, I'm flattered, but you can tell your friend to leave you out of it and ask me himself.", "Tue Oct 09 03:01:45 ": "If we know people can change for the worse, then why is it so hard to believe they could also change for the better?", "Wed Dec 05 15:32:09 ": "RT @TheFunnyTeens: That awkward moment, where theres an awkward moment, and everyone knows it's an awkward moment, then somebody says, \" ...", "Sun Oct 28 13:20:02 ": "@HoldYuDown I'm good just a little tired. How are you?", "Fri Jan 11 06:49:25 ": "I can't believe i'll be 25 in 2 days! 😕I feel so old", "Fri Nov 02 20:33:10 ": "NYC marathon still on.. Smh. How about helping the #SandyVictims instead! Where are people's priorities? #hurricanesandy #Sandy", "Wed Dec 05 15:28:13 ": "RT @PBandJenelley_1: @nrn617 @jessylee_3789 it's $15k+ to get Jace back and I don't have a stable environment to bring him into. I'm mov ...", "Thu Oct 18 23:38:30 ": "RT @UberFacts: Women tend to eat more when there are no men around. And they consume more when in larger groups of females.", "Sun Nov 11 03:46:58 ": "@MercXIV I'm not defensive, I have no problem talking about my bf, but I know you're just doing someone else a favor and that's all it is", "Fri Dec 07 17:36:41 ": "RT @ItsFunnyLife: Teacher: If you have 10 chocolate cakes and someone asks for 2, how many do you have left?........ Me: 10", "Mon Jan 07 17:12:29 ": "Kinda sad I'm gonna miss #TeenMom2 tonight 😕", "Wed Dec 05 16:05:20 ": "Why does America care so much about what the royals are gonna name their baby?", "Fri Nov 09 23:01:27 ": "RT @ComedyPosts: Every female knows that one annoying boy who constantly asks \"So when we gonna chill?\"", "Thu Oct 25 16:14:01 ": "Season 3 Trailer http://t.co/mFWIwBxW via @MTV", "Wed Oct 10 02:56:06 ": "I wanna see Perks of Being a Wallflower again! Such a good movie!", "Fri Oct 05 02:08:45 ": "Jersey shoreeeee!", "Sun Oct 21 02:06:14 ": "@Kclemens11 no I love this movie! It's a classic", "Tue Oct 09 13:33:02 ": "RT @BreakingCeleb: Kristen Stewart wants us to know that she &amp;amp; Rob are ‘officially a couple again http://t.co/fcOWfLnC via http: ...", "Fri Nov 16 06:44:01 ": "Too bad there's not a \"turn off\" button for DM's... These spam messages are annoying!", "Sun Oct 28 13:26:28 ": "@HoldYuDown me too! This Frankenstorm is gonna be insane! Hopefully we don't get hit too hard though 😕", "Sun Nov 11 03:50:39 ": "@MercXIV ok well thanks for asking! I'm very flattered that you're interested in my love life. I'm not revealing his name though. Sorry!", "Fri Dec 28 14:11:14 ": "RT @TeenMomWetpaint: Jenelle Evans and Courtland Rogers Break Up: \"Courtland and I Are Going to Get a Divorce\" http://t.co/CeOtPDdp @Tee ...", "Sun Nov 11 14:29:51 ": "RT @UnusuaIQuestion: What if oxygen makes our voice deeper, and helium brings it back to normal?", "Fri Dec 07 17:40:04 ": "RT @ItsFunnyLife: Hardest thing to answer: Describe yourself.", "Tue Oct 02 15:08:13 ": "RT @topmovielines: \"I will never stop trying. Because when you find the one... you never give up.\" ~ Crazy, Stupid, Love. (2011)", "Sun Nov 11 03:20:10 ": "@MercXIV I don't even know who you are and you're asking me who my boyfriend is? I doubt you'd know him", "Wed Jan 02 04:44:35 ": "I seriously have the sweetest boyfriend ever 😘💜", "Sun Jan 06 15:33:03 ": "RT @TrulyCapricorns: #Capricorn will help you out and expect nothing in return.", "Tue Oct 09 13:32:50 ": "RT @DJPaulyD: New Jersey This Saturday Night My Favorite Place In AC @poolafterdark !!! Come Party With Me !!!! \n\n#YeahBuddy", "Fri Dec 07 17:43:30 ": "RT @ItsFunnyLife: That awkward moment when someone likes your Facebook picture you uploaded 11 months ago.", "Sun Nov 11 14:28:31 ": "RT @SoMindBlowing: Blue color has a calming effect, releases calming hormones in the brain. Therefore many big co. like Twitter, Faceboo ...", "Tue Oct 02 15:00:32 ": "It's amazing how so many people love each other, but no one really likes each other.", "Sun Nov 11 14:26:15 ": "RT @WeLoveYouForbes: Never go extra miles for what isn't worth the run.", "Tue Oct 09 03:07:22 ": "Worrying never changes the outcome.", "Fri Dec 07 17:35:53 ": "Believe that you can and you're already halfway there 😘", "Wed Nov 07 21:16:32 ": "The election is over. Obama won, so why are people still arguing? #getoverit", "Fri Nov 09 23:03:19 ": "Day 11 without power! Getting ridiculous 😒 and starting to think they skipped us. #hurricanesandy", "Tue Jan 01 23:13:10 ": "RT @Lord_Voldemort7: Bring it the fuck on, 2013!", "Sun Nov 11 03:40:39 ": "@MercXIV oh, so you randomly found me on twitter not knowing who I am and decided to ask me who my bf is just bc you're curious? Right.", "Fri Jan 11 06:49:51 ": "RT @TedsPosts: \"k\" is the shortest way to spell \"Fuck you.\""}