{"Mon Mar 26 20:07:30 ": "Eyeing up the open bottle of wine in the fridge &amp; wondering what the chances were of me doing more work this evening anyway. Slim, right?", "Tue May 01 07:00:10 ": "RT @caitlinmoran: I loved it when the drought was announced with \"We'd need two months of solid rain to refill the reservoirs\" and we we ...", "Thu May 03 08:50:00 ": "To do list: 1) stop browsing twitter. 2) do actual work.", "Mon May 07 09:56:42 ": "@MrsRF so sorry xxx", "Mon Jun 04 18:16:28 ": "@cathylton @DMXRonin But you did it anyway!", "Fri Apr 06 14:28:02 ": "RT @RevRichardColes: Peter denied it, and at that moment the cock crowed. http://t.co/NJFYJbXe", "Wed May 02 18:04:13 ": "@mermhart Is that not how you do work? Oh....", "Fri Apr 06 14:27:15 ": "RT @RevRichardColes: Then delivered he him therefore unto them to be crucified. And they took Jesus, and led him away. http://t.co/vnSVjltA", "Sun Dec 30 12:22:43 ": "@MrsRF Well, I'm right at least, if a little unoriginal....!", "Fri Apr 06 14:28:10 ": "RT @RevRichardColes: Eloi eloi lama sabacthani? http://t.co/WF5wtynl", "Sat Mar 24 18:36:53 ": "Would it be wrong to put the clocks forward now and send the kids to bed? They'd never know.", "Fri Jan 11 22:48:00 ": "@bagginsmum that's spooky. I did not send that tweet earlier! Who did?!", "Sun Dec 30 10:58:37 ": "@MrsRF @lizziebooks @ratsbey @bagginsmum Worst Witch? (Jill Murphy) my stock response to girl present dilemmas!", "Fri Apr 06 14:27:30 ": "RT @RevRichardColes: Then the band and the captain and officers of the Jews took Jesus, and bound him,\nAnd led him away http://t.co/3YT3Ccc7", "Wed Mar 28 17:03:54 ": "@cathylton ha ha ha! So true!", "Tue Jan 08 07:31:04 ": "@laurenlaverne SQUEEEEEEEAAAAALLLLLLL #bowie", "Fri May 11 10:42:49 ": "@bagginsmum French elastics? French skipping? Are we talking knotted together tights looped around legs?", "Sun Dec 23 20:32:10 ": "@MrsRF yes, can understand that!", "Mon May 21 08:54:33 ": "@unslugged @the_z_factor was about to say exactly that. Friend made that mistake once #truestory", "Fri Jan 11 22:49:30 ": "@bagginsmum I'm a bit worried now :-/ good job it wasn't saying anything awful!", "Fri Jul 13 08:48:29 ": "@laurenlaverne I thought that sounded quite reasonable actually, until I realised I had misread 'handbag' as 'HOUSE'.", "Thu Apr 12 15:50:36 ": "@DMXRonin @cathylton Fantastic! Just spoken to boys. They are full of it! Think you've made their entire holiday. Thanks! Xxx", "Fri Apr 06 14:27:22 ": "RT @RevRichardColes: Pilate entered into the judgment hall again, and called Jesus, and said unto him, Art thou the King of the Jews? ht ...", "Mon Mar 26 20:26:39 ": "@bagginsmum @auntyjodi Scotch eggs!", "Fri Apr 06 14:21:05 ": "@RevRichardColes Thank you for today's tweets. Have been unable to get to church today, but you've reminded that the Passion is all around.", "Sun Apr 29 08:41:24 ": "@The_Z_Factor because it's beautiful sunny spring day and you can't wait to get out there. Oh, wait.....", "Wed Jan 02 07:17:19 ": "@bagginsmum WHY, for the love of god, WHY?", "Mon May 21 07:19:44 ": "@KathViner I'm still confused about what happened. He can't have been in the box because it was upright and he was lying down #thebridge", "Thu Jul 05 20:10:21 ": "@thefworduk have you seen this? I hardly know where to start! http://t.co/R8S0hk6F", "Sun May 20 20:48:44 ": "@bagginsmum Why I'm so frustrated.....", "Mon Jun 04 18:06:07 ": "@bagginsmum Plus the TRAFFIC! Opinion not helped by living on the M4 / M5 interchange.....", "Mon Mar 26 20:31:24 ": "@bagginsmum @auntyjodi Woooaahhh. :-) There was always some poor bugger with a hard boiled egg. Sometimes it was me.", "Mon Mar 26 19:44:48 ": "No2 son off on school trip tomorrow. Why do I think he needs twice as much in packed lunch as he needs on normal day? #itsamumthing", "Sat Jun 09 13:33:19 ": "@RevRichardColes I so often end up buying my own stuff back from the charity shop...", "Mon Mar 26 20:04:37 ": "@AuntyJodi good point.", "Fri Apr 06 20:20:22 ": "@MrsRF Can read to herself? There's a verb missing there so guessing! No2 son the same, but think he's getting there slowly #sharedworries", "Tue Apr 03 07:10:46 ": "@cathylton @DMXRonin @jpd77 Love this! http://t.co/ItgHz7ZN", "Mon Jun 04 18:03:21 ": "I want some patriotic cake. And a silly hat. #revisionsucks", "Thu Apr 05 17:06:17 ": "RT @VictoriaCoren: Today I'm depressed about some naked women and I've written a blog about it. http://t.co/q2sjJCKX", "Wed May 02 18:06:17 ": "@cathylton You know there will be major delays while they actually do it, though, don't you? Just saying.... #killjoy x", "Tue Mar 27 12:48:12 ": "RT @VagendaMagazine: #TipsForLadies Tell anyone who thinks they know what's best for your vagina very firmly to fuck the fuck off.", "Sat Mar 24 18:29:44 ": "RT @RevRichardColes: How to answer the question does a haddock have a soul? *flounders*", "Wed Apr 18 08:49:42 ": "RT @TwopTwips: CREATE INTRIGUE by always answering the question “Where are you going?“ with “To do what I should have done a long time a ...", "Thu Apr 05 06:33:22 ": "RT @RevRichardColes: It may be noted that Jesus' command that we love one another is perhaps the one the Church most often ignores.", "Sun Dec 23 20:26:20 ": "@MrsRF yes, remember feeling! really is case of muddling through - you'll get to end of it having never nailed study \"routine\". I did!", "Sat Mar 24 18:32:20 ": "@slightly_bored @mrsrf I only read the last two tweets and immediately knew you were talking Dick and Fanny.", "Sun Dec 23 20:19:09 ": "@MrsRF and yes, FT. Nanny complete godsend, couldn't do it otherwise! Out of house 8am till 7pm most days. All ok though!", "Mon Apr 23 08:24:59 ": "@HuffPostUK Who cares? Seriously.", "Wed Jan 02 08:53:48 ": "@MrsRF @bagginsmum I think I'd have to go into seclusion if I gave up caffeine :-/ and yes to the running! Need app recommendations please", "Sun Dec 23 20:13:09 ": "@MrsRF how's it going? Not sure I have any advice to offer other than \"push on, soldier\"! #helpful", "Sun Dec 30 11:36:33 ": "11.30am, still eating breakfast #holidays", "Sun May 20 20:06:23 ": "@JGONeill @thefworduk who says my head is pretty? Oh no, I've failed as a woman.....", "Thu Apr 05 14:30:00 ": "@LettersOfNote Extremely polite is often far more cutting than extremely rude.", "Sun Mar 24 09:33:16 ": "@MrsRF *sharp intake of breath*", "Fri Apr 06 14:27:44 ": "RT @RevRichardColes: Then Pilate took Jesus and had him flogged. And the soldiers wove a crown of thorns and put it on his head, and th  ...", "Sat Mar 24 19:07:04 ": "@The_Z_Factor Pink and shiny. And never minds shares; when they tell me I'm worth it, I practically weep with a sense of personal redemption", "Mon Jul 30 16:36:39 ": "RT @The_Z_Factor: Fuck's sake, Frankie Boyle: stop being such an unutterable cunt. http://t.co/NxHI5jDb #London2012 #Olympics", "Mon Jun 04 18:01:16 ": "@bagginsmum We said that when we were in Pembrokeshire recently! (\"why do people go to Cornwall when Pembs is so *perfect*? etc)", "Mon Mar 26 20:20:00 ": "@AuntyJodi Museum and docks. Made him promise not to go for impromptu swim. Oh, and hula hoops and kit kat #schooltriprule", "Fri Apr 06 19:04:07 ": "Suffering the kind of sudden blood sugar drop that necessitates immediate consumption of salt'n'vinegar hula hoops. Urgh.", "Sat Jun 09 11:58:13 ": "@AbbieKWalsh @giles_fraser Yep, always better to say / do something than nothing. People remember that you were there, not what you said.", "Tue May 08 19:39:14 ": "The \"really important thing\" the 5 year old had to say to me before I went to pilates this eve: \"have a lovely time, and be well\" #sweetboy", "Mon Jun 04 16:15:18 ": "@DMXRonin @cathylton Good work!", "Sun May 20 20:45:35 ": "@bagginsmum I dunno. I really get off on staying absolutely still.", "Fri Mar 29 18:06:53 ": "@bagginsmum with how many?", "Sun Dec 23 20:28:07 ": "@MrsRF trainees have had some v long days: 9pm... 11pm.... 3.40 am... :-0", "Sun Dec 23 20:18:08 ": "@MrsRF basically, you CAN'T do everything, so don't even try!", "Thu Apr 05 06:33:16 ": "RT @RevRichardColes: 'I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another'.", "Sat Apr 28 07:45:04 ": "RT @charltonbrooker: And Captain America. I really don't want to see that jingoistic prick in anything but a fatal headlock.", "Fri Mar 29 18:09:08 ": "@bagginsmum good work! :-)", "Fri Feb 15 08:40:05 ": "@louisebrealey @The_Z_Factor Yeah, died so young. Tragic waste of superb pair of knockers #hernamewasReevaSteenkamp #notbuyingit", "Mon Jun 04 18:08:53 ": "@bagginsmum 233.5 hours until all exams are over. Not that I am counting.....", "Fri Mar 29 17:08:49 ": "@bagginsmum ha! Where are you?", "Sun Dec 23 20:17:32 ": "@MrsRF ignoring all the housework, mainly! Only do what needs doing, and when the kids are out, ignore everything but study.", "Tue May 01 15:08:00 ": "@madchickenlady @auntyjodi what, in t'other place? It's shit there! Doesn't work! Prob better with broad band, mind...", "Fri Apr 06 20:20:50 ": "@MrsRF 'course, you might be talking about something else entirely in which case ignore me!", "Sun May 20 18:21:25 ": "@thefworduk The Economist, New Scientist, Private Eye, NME and Runner's World: all under \"men's interests\" mags in Tesco. Sorry, what?", "Thu Jul 12 17:01:30 ": "Much noise from offspring. Do I intervene now, or wait till there is blood and proper screaming? Dilemma.", "Sun Mar 24 09:33:53 ": "@MrsRF also, I went into blank denial when the Stone Rose 20th anniversary edition came out.", "Wed Feb 06 07:41:59 ": "Let me not to the marriage of true minds\nAdmit impediments.", "Mon Jun 04 16:18:19 ": "@DMXRonin @cathylton That's cos she's hard! (must get off arse and do some exercise myself now)", "Thu Apr 05 14:27:11 ": "“@HuffPostUK: Samantha Brick fights beauty backlash on ITV's This Morning http://t.co/uejSaBTf” And she still doesn't get it....", "Sun Dec 23 09:19:23 ": "'Sup, Twitter? Been a while. So, what did I miss in the last 6 months? A round up in 140 characters, if you will.", "Sun May 20 20:29:57 ": "@linksan @thefworduk I intend to. I know space can be limited, and things have to be crammed together, but take the signage down!", "Fri Apr 06 14:27:07 ": "RT @RevRichardColes: So they took Jesus; and carrying the cross by himself, he went out to what is called The Place of the Skull, which  ...", "Tue May 22 12:51:03 ": "@sarahewingart @janegarvey1 I know it's proper summer when I forgo my woolly bed socks. We're not there yet.", "Fri Feb 15 17:58:22 ": "RT @BeardedGenius: Reeva Steenkamp RIP http://t.co/zdc05rTt", "Wed May 02 18:49:47 ": "RT @guardiannews: Thousands join girl in urging Seventeen magazine to publish unedited images http://t.co/EgzFy8Wa", "Mon Jun 04 18:07:17 ": "@bagginsmum &lt;sigh&gt; I would so love to. J and boys are in Swansea this weekend. Day trips to Gower, etc. Me? Stuck with the books. Meh.", "Fri Apr 06 14:27:36 ": "RT @RevRichardColes: Pilate saith unto him, What is truth? http://t.co/ywQhfDXG", "Fri Feb 15 08:26:01 ": "RT @EvaWiseman: Oof. http://t.co/bTFGhdFh", "Tue Mar 27 12:59:11 ": "@harithecomic I think use of the word \"courgette\" is nicely balanced out by use of the phrase \"cheese eating surrender monkeys\".", "Sun Mar 24 09:37:08 ": "@MrsRF mine predates email and the Internet :-0 microfiche in the library.... *wistful sigh*", "Tue Mar 27 12:49:34 ": "#Tipsforladies : Don't read #Tipsforladies . It will only piss you off.", "Sun Dec 23 20:27:27 ": "@MrsRF and yes is v full on here. Training contract lasts 2 yrs and will vary depending on dept am in. Have been lucky so far, other (ctd)", "Fri Jul 13 08:40:01 ": "Could someone please go into town on the bus for me and do all the town stuff that needs doing? Because I don't want to.", "Sun Mar 24 09:29:31 ": "@laurenlaverne since when was the 90s \"vintage\"? *weeps quietly*", "Wed May 02 18:47:02 ": "@nkendallphoto @vagendamagazine Wooooaaaah, where to start?!", "Sat Apr 28 07:44:00 ": "@bagginsmum here! With marmalade! Unfortunately am off to uni for the day any minute or I'd genuinely offer...", "Sun Jun 10 12:04:00 ": "@EvaWiseman Thank you so much for this. It's such a complex issue, almost impossible to untangle. We've got to keep shouting about it.", "Fri Apr 06 14:28:13 ": "RT @RevRichardColes: It is finished. http://t.co/gWZQPaZF"}