{"Mon Dec 31 00:31:05 ": "Shattered a glass in the kitchen tonight. Not one piece was larger than a thumb tack and all were sharper :(", "Fri Jan 18 17:21:29 ": "100% chance this is where we're headed very soon, and I can't wait - Google Declares War on the Password http://t.co/lSS6dMRL", "Fri Dec 28 18:13:36 ": "US Soldier Suicides Outnumber Combat Deaths In 2012 - WTF? http://t.co/eyMTwnM7", "Wed Nov 14 19:50:04 ": "@jgleman yeah, that's right...I'm watching you.", "Thu Jul 05 14:36:18 ": "RT @cfbloggers: Screencast: Awesome New Feature In The ColdFusion SublimeText Package. - http://t.co/fBj1g2wg", "Mon Dec 03 22:55:18 ": "Selecting #Cloud Backup Software #aws #CloudBerry @arqbackup @http://techblog.troyweb.com/index.php/2012/12/selecting-cloud-backup-software/", "Thu Jul 05 18:34:01 ": "@TrevorPhillippi please follow @mikepacella so he'll stop whining. He's a twitter virgin, so be gentle.", "Mon Apr 08 19:56:10 ": "@jgleman Photographers cost money, the police do not.", "Sat Dec 29 22:16:24 ": "PDF creation using Apache FOP library is very cool. It makes my inner nerd tingle a little. #java #fop #apache #pdf", "Wed Jan 02 02:31:28 ": "Cannot wait to see World War Z!", "Mon Nov 12 14:10:09 ": "RT @PerryWoodin: Tip for migrating FCKEditor 2.6.4 to #ColdFusion 9+. Hint… it has to do with ColdFusion built-in functions. http://t.co ...", "Tue Oct 09 17:31:20 ": "Treated myself to #starbucks pumpkin spiced latte. Please make this all year.", "Sat Dec 29 21:56:00 ": "I love beer and I love bourbon, so drinking a bourbon barrel beer is such a treat. #snowedin", "Tue Dec 11 19:31:38 ": "Just made #LDAP my bitch!  #openldap #ldapproxy #rwm #ldapchain", "Thu Dec 20 18:00:50 ": "If you aren't using the Joda Data/Time library for Java, you need to do the Google on it. #joda #java #datetimealgorithmsarehard", "Thu Dec 27 14:27:52 ": "Had to relight the furnace today after being cold for hours. Working from home and it's freezing and snowy and I don't have time for this :(", "Fri Dec 14 02:28:55 ": "@PerryWoodin I'll be getting a bottle of this because I make poor decisions. Pappy Van Winkle’s Family Reserve 23yr. Help me drink it?", "Tue Dec 18 14:29:00 ": "@jgleman completely agree. I've been meaning to write blog article on where I believe social media is going.", "Fri Jun 29 22:26:00 ": "@TrevorPhillippi You're  in luck. Student loan rates passed a couple hours ago.", "Thu Jul 05 18:48:34 ": "@TrevorPhillippi He's saying that twitter is hard and he's doesn't know how to do it.", "Wed Jun 06 14:19:14 ": "@TrevorPhillippi even a half ton pickup has it's limits... I might be able to knock her down but maybe not haul her away.", "Sat Dec 29 13:23:56 ": "No milk for my coffee but I just found some old sour cream…a workable substitute? #mmmcreamy", "Sat Aug 18 19:52:06 ": "Dinner http://t.co/7PrZ4cF2", "Tue Oct 16 13:16:56 ": "Happy 10th birthday @troyweb1", "Fri Dec 28 19:39:49 ": "Just ordered a small mountain man. What's up with coffee names? #awkward", "Sat Aug 18 19:50:44 ": "At a wedding with a pig roast http://t.co/fo3JqG1h", "Thu Oct 04 14:42:40 ": "RT @troyweb1: #ColdFusion 10 told me I need an update to install the ColdFusion update.", "Sun Nov 04 22:58:53 ": "@dan_lamanna yeah sort of - main guys in town: cdjdn http://t.co/bYkSHSis but not sure of they're using meetup. Meetings are generally good", "Thu Jan 03 04:16:36 ": "The Internet tells me there are 4 degrees outside somewhere but I cannot find them anywhere. Pretty sure there are none. #cold", "Wed Jun 06 13:13:06 ": "@TrevorPhillippi jay walking is illegal. I think it's time you made a citizen's arrest.", "Wed Dec 12 16:11:12 ": "@dan_lamanna @jaredtomeck @BRomeoDolly @sarahkmueller @talkanatalka haha, yes. Oh Ravi, he's a jolly man. Nice to meet you all!", "Thu Apr 18 17:59:41 ": "@simon you are one of the best presenters here at #awssummit. You're both hilarious and very informative! Thanks :)", "Sat Jan 05 03:04:56 ": "@TWCableHelp perhaps you can do all of your customers a favor and not suck all the time. YOU HAD ONE JOB! http://t.co/PxpdOo78", "Tue Dec 18 12:50:24 ": "#instaport is over capacity and serving 500's from people downloading #instagram photos so they can quickly kill their accounts. Ha! #tos", "Wed Jan 02 03:17:33 ": "Finally! Intel's Going To Destroy Cable Companies By Letting People Subscribe To Individual Channels and Probably Shows http://t.co/2e9A0Y2u", "Mon Oct 22 01:22:41 ": "@katyperry, you are so awesome. #2manystars", "Fri Dec 21 16:17:00 ": "Just told the bagel lady to smear enough butter on it to kill paula dean", "Mon Jun 11 18:05:34 ": "Just got a South African 5C coin in my chain from lunch. It's worth 6/10 of a penny :(", "Thu Sep 13 17:09:09 ": "@TrevorPhillippi before you die, could you just sign my guest book please. Yeah, thanks.", "Fri Jul 06 20:48:05 ": "Rockin out to gangsta's paradise, yes!", "Wed Oct 24 12:48:48 ": "@TWCableHelp why shouldn't I cancel you? New #timewarnercable customers pay $100 and I pay $173 for the SAME service. #notfair #otheroptions", "Mon Dec 17 19:15:55 ": "@dan_lamanna yes, workflow is \"acceptable\" in assembla. I like other more comprehensive ticketing systems better, but eh it works. When?", "Fri Jun 08 00:54:13 ": "@TrevorPhillippi the best part is I learned your mayor's name is Mr. Nutter. And he doesn't want me binging on soda. http://t.co/txsPlT3x", "Fri Aug 17 16:17:05 ": "@TrevorPhillippi ha, yeah. Meanwhile, go like my post on his wall and make ME feel special", "Thu Apr 18 13:39:04 ": "#awssummit just keep getting better! The energy pre-keynote is outstanding!!", "Sun Dec 30 04:48:50 ": "Jerk bowling next to us entered his name as \"faggot Howe\". Some people just don't get it. #notfunny", "Wed Dec 12 19:13:05 ": "@TrevorPhillippi @mikepacella just killed a guy...with a trident", "Tue Dec 18 12:53:41 ": "Instagrams's new TOS is causing some people to delete their accounts. Here's how to download your photos http://t.co/KRsbxmO3", "Wed Oct 24 13:55:56 ": "@jgleman would have been pretty neat to have not been the creepy guy on craigslist for once :)", "Mon Oct 15 11:36:27 ": "Turn off ad tracking in your #iPhone #iOS 6. It's on by default and not configure where you expect. http://t.co/2U2p477n", "Wed Jun 06 13:20:44 ": "@TrevorPhillippi ha, forget the arrest. Run her over!", "Tue Dec 11 22:05:38 ": "@jgleman :(", "Sun Dec 30 02:47:29 ": "Snow storm? 4 wheel drive? Time for bowling.", "Mon Jun 11 17:59:36 ": "@TrevorPhillippi hahahahaha, that's adorable. We need a camera in the office to watch the merge someday.", "Thu Dec 13 14:48:48 ": "spelling is hard", "Tue Dec 11 12:43:22 ": "Looking fwd to the 2012 Tech Valley Developers Holiday Bash tonight in Troy, NY. Register for free http://t.co/QM1WDIiu #techvalley", "Wed Oct 24 13:06:32 ": "Just solid my #iPad 2nd gen to @gazelle_com for $200", "Mon Oct 15 22:35:55 ": "No interpreter exists to understand the code coming out of their mouths so I don't recommend the RomneyRyan lang. We need it to maintainable", "Sat Dec 29 02:06:51 ": "Intermission at Cirque Dreams at Proctors Theater. Wow, unbelievable performance!", "Wed Nov 14 19:05:54 ": "Interesting: Consumers' And Marketers' Response To Digital And Traditional Advertising http://t.co/AxBlJz4R via @mediapost", "Tue Dec 18 01:06:54 ": "Convert a MySQL Database Character Encoding to UTF8 http://t.co/r1gQ7RoY #mysql #utf8 #encoding #latin1 #iso8859-1", "Mon Nov 05 03:59:59 ": "@dan_lamanna let me know if/when you go. Ill join you.", "Wed Oct 24 14:33:21 ": "@varianpowles not getting a new iPad - I don't like technology. Rather do anything else when not at work", "Mon Aug 20 03:03:04 ": "@TrevorPhillippi very awesome! We have some pretty awesome hikes up here. Fun stuff. Where were you?", "Tue Dec 18 14:09:17 ": "Discovered a bug in Amazon Cloud Player Software. I've stumped the amazon aws tech team, Sweet! #cloudplayer #aws #amazon", "Sat Dec 29 22:38:49 ": "Go to Google Finance and search for \"sell\" haha, thanks, Reddit. #googleeasteregg", "Wed Oct 24 13:45:31 ": "@jgleman selling my iPad because I never use it. Not getting a little one either.", "Wed Dec 12 19:32:51 ": "@TrevorPhillippi incorrect", "Sun Sep 02 01:32:22 ": "White house beer recipe. I will be making this. http://t.co/9OxvEPTT", "Sun Dec 30 04:06:04 ": "Just got my ass handed to me in the first game of bowling. #isucktonight", "Thu Aug 23 14:56:45 ": "@jgleman haha connect", "Fri Mar 15 00:24:26 ": "Just a friendly reminder - Support for Windows XP is ending on April 8, 2014 http://t.co/McDjqheauy", "Tue Dec 11 22:03:20 ": "Trevor's my golden follower, that's adorable! https://t.co/lcCqf3Hj", "Wed Dec 12 20:27:44 ": "Apple will love this: GE develops ultra-thin, almost-silent cooler for next-gen laptops and tablets  http://t.co/ZHxi45gB @edisonsdesk #dcj", "Fri Jun 29 16:57:50 ": "@TrevorPhillippi true story.", "Sun Sep 30 14:01:25 ": "Just configured #charles SSL man-in-the-middle for #coldfusion10 #aws #s3 request via #jetS3 and learned a lot. Pure awesomeness.", "Fri Aug 17 16:12:27 ": "@TrevorPhillippi LMAO! I was there when I happened. It happened because I hate how he doesn't Like my posts so he liked yours to piss me off", "Tue Dec 11 21:55:24 ": "#Adobe #Dreamweaver #CS5.5 looks terrible on a #retina display. #terribleness", "Thu Sep 13 17:01:19 ": "@TrevorPhillippi My site is better than yours. Yeah, that background is actually falling and the images are wiggling. http://t.co/IY9oVAT3", "Tue Mar 26 23:32:12 ": "Finally, a geospatial polygon search for #cfmongodb  http://t.co/3WEdZPNaU5 #coldfusion #mongo", "Sun Nov 11 14:08:39 ": "@arqbackup Do I have to purchase a license to use the answer file? I'm in trial mode for my company. I can't start Arq w/o one, it tells me.", "Thu Aug 23 13:32:01 ": "For today's college freshmen, there have always been blue M&amp;Ms, but no tan ones. Not cool, not cool at all...", "Sat Oct 20 00:07:47 ": "About to watch #2016 #Obama's America. Don't unfollow me. I can still think for myself.", "Mon Dec 03 13:22:24 ": "Make #Eclipse IDE Work with #MacBook #Retina Displays http://t.co/lDBZoH03", "Thu Dec 13 14:49:54 ": "@talkanatalka you too! Yes, I'll be around more. I'm looking forward something different.", "Fri Dec 21 04:23:47 ": "instead of drinking two small glasses of bourbon, I'm gonna drink 1 big glass. then i can feel like less of a drunk #notadrunk #:) #umm?", "Wed Dec 12 19:23:31 ": "@TrevorPhillippi you mean your secret love affair with the Dreamweaver? I needed to let the world know.", "Sun Nov 11 14:32:59 ": "@arqbackup Sent and email to support, thanks!", "Thu Jan 03 00:00:09 ": "Waitress just asked me if I wanted extra tomato on my sandwich and then winked. She knows me all too well. Not sure if that's good or bad.", "Thu Aug 23 14:43:31 ": "@jgleman did you dial that on your rotary phone?", "Tue Oct 23 22:05:03 ": "I think it's strange how #Amazon competes with #Netflix but all of Netflix is streamed from Amazon's #aws #cloud. That's sweet.", "Wed Dec 12 19:27:32 ": "@TrevorPhillippi I just added a new skill on LinkedIn. 10 points if you can guess it, 20 points if you endorse me for it", "Fri Jun 29 16:55:53 ": "@TrevorPhillippi Check out books on Single Page Web Applications. All the cool kids are doing it.", "Tue Nov 20 01:19:38 ": "@GEHoliday @GELighting 2 of 3 packages of #xmas lights were half not working. #unacceptable #iwantacoupon #madeinchina #crap", "Tue Jul 17 23:26:01 ": "Almost just got real life defriended by @TrevorPhillippi for saying I use #Adobe #Contribute for all my development!", "Wed Dec 12 04:37:18 ": "@dan_lamanna great seeing you and memorizing your friends names tonight. Quiz me next month at build guild but I get one 8x10 cheat sheet", "Tue Oct 09 19:03:04 ": "Just installed google authenticator for #mfa with my #AWS account. This can be awesome or it can be terrible.", "Thu Dec 13 14:39:42 ": "Fantastic! It's now safe to update your iPhone's OS. Thanks or the Maps App, Google. http://t.co/Mh1DEWEM #googlemaps #iphone #ios", "Thu Feb 21 15:31:34 ": "@cloudhead I may be a little late to the game but less just changed my css life forever.", "Mon Oct 01 20:52:12 ": "Just installed a local #DNS server on Mountain Lion so I can do domain aliasing the super cool way.", "Thu Dec 13 20:23:39 ": "I don't care who you are, this is AWESOME! $853 Quadrillion http://t.co/dEAwQpyl #starwars #deathstar"}