{"Mon May 30 23:43:19 ": "I changed my twitter profile name hoping that a more accurate name would actually lead to me using it. New name hopefully reflects my usage.", "Fri Jul 15 04:05:19 ": "#historyfact Thomas Jefferson's original Dec. of Independence included a clause blaming the King for slavery and suggesting its abolition.", "Wed Jun 01 20:28:48 ": "Spent day Monday grading projects so I could leave today and grade AP Gov exams in FL. Will return just in time to grade final exams.", "Sat Jan 07 22:58:38 ": "Still hoping #jonhuntsman has a good showing in NH debates tonight.  I still think he is a strong candidate.", "Mon Sep 20 00:52:53 ": "Trying to focus on being loved by God and what that means for my life.  Good sermon at Grace DC on Ephesians 3.", "Mon Apr 25 16:33:33 ": "Lack of lunch resources spawns delicious combo: Nathan's Hotdog+English Muffin = Revolution Dog; Add FFries and call it the Allied Powers.", "Wed Sep 29 12:44:57 ": "Col 3:23, work for God and not for man.", "Wed Jun 01 21:33:42 ": "@DeltaAssist I need to try and get on a flight from DCA to Orlando tonight my flight was just cancelled DL5811, my # is DL2682956574", "Sat Feb 25 15:13:25 ": "Commitment to task is not easy, there are always a lot of distractions, but it is a skill absolutely critical to excellence.", "Thu Jun 02 01:25:51 ": "Just read article on Emancipation Proclamation stating that not only did it not free one slave, but also blocked broader Congressional law.", "Thu Jun 10 18:38:42 ": "Proposing a ban Saturday on all Newcastle and Bass taps in the United States. I'll be drinking Bud and sporting a \"Don't Tread on Me\" flag.", "Tue Apr 12 20:12:42 ": "@PiKappaPhi Alpha Sigma (TN) continues roll.  Brother Nick Averwater wins campus' highest honor, Torchbearer.  Congrats Nick!", "Tue Jun 07 01:32:40 ": "#JonHuntsman is a legit candidate for GOP.  With weak field expect him to stick around, do surprisingly well in NH and gain momentum.", "Mon Aug 22 00:31:19 ": "Summer vacation is almost over.   Lot mor work than vacationing, but it has been good.  Excited about starting at TJ.", "Mon Apr 11 20:20:47 ": "@PiKappaPhi Alpha Sigma Chapter at University of Tennessee wins Chapter of Year. Brother Kyle Kuderewski named Greek Man of Year. Congrats!", "Wed Jun 01 21:45:49 ": "Just rescheduled.  Thanks for your help.", "Wed Mar 06 20:08:07 ": "Hope everyone is enjoying the #snowflopcalypse  Weather prediction = #epicfail = more class time tomorrow.  See you then.", "Mon May 30 23:48:05 ": "If you've been following me, thanks! Don't worry about me filling up your twitter feed, although I plan to use it more, more is relative.", "Sun Oct 23 04:01:49 ": "Dooley is likely one of the least-inspiring half-time speakers in coaching.  #iwillgivemyhalfforTNtoday", "Tue Jun 07 01:37:13 ": "I didn't think any Rep had a chance in 2012, but after hanging out w/ polysci geeks this week and seeing economic #'s, mind is changing.", "Thu Feb 10 04:27:37 ": "Go Duke!  I still love you @lee_taft.", "Sat Jul 03 16:45:08 ": "In Rogersville for the world's greatest 4th celebration.  I guess \"world\" is not necessary since we are the only country that celebrate.", "Wed Jan 05 14:29:35 ": "Nothing worse than snatching defeat out of the jaws od victory.  Arkansas pulled one from TN playbook last night.", "Mon Jan 17 23:27:26 ": "As a history teacher Dr. King has always been my favorite. Reading OPEDs today has reminded me of the moral force he was and is. Thanks Dr K", "Mon Apr 11 02:18:33 ": "Praise God for a good weekend and reminder of his goodness and great love for us.", "Sun May 02 02:06:43 ": "Discovered a new favorite album today, Sons of Sylvia.  Probably the best album top to bottom I've listened to since Amos Lee.", "Thu Jun 02 01:22:21 ": "I don't understand why @mitromney is not using Federalism, as his primary defense against MA Health Care Bill #laboratoriesofdemocracy", "Sat Jun 12 18:19:07 ": "Don't tread on me!  Go Yanks!", "Mon Jun 20 02:18:46 ": "Father's Day with Dad at U.S. Open = Awesome #happyfather'sday", "Wed Aug 11 01:52:46 ": "Big day tomorrow.  Start new job in DCPS.  I am excited about this new opportunity.  Praise God for providing.", "Wed Jan 04 00:50:02 ": "#CNNElections 1. Paul, 2. Romney, 3. Gingrich, 4. Santorum", "Wed Aug 24 03:02:24 ": "Strange day.First #Earthquake and #PatSummitt news. Pat is a role model for every coach and athlete,male and female,and will continue to be.", "Thu Dec 30 23:41:55 ": "Tonight is another reason not to like the Tarheels, as if I needed another.  Go Vols!", "Tue Jan 25 00:21:47 ": "I refuse to let \"the man\" win.  Replacing my own garabge disposal rather than shell out $450 to plumber. Onward to Lowes, onward to victory.", "Tue Jul 26 03:00:29 ": "Train is like the Olympics, every 4 years they show up with something amazing, I'm addicted for a month, then it get's old and goes away.", "Thu Jun 23 05:02:46 ": "Probably one of my most productive Mr. Fix-it days in house history - customized closet door and fixed three toilets.  #summerpunchlist", "Thu Jun 10 18:37:20 ": "Had the chick-fil-a spicy chicken sandwich today, and I believe that @lee_taft is a wimp.", "Mon Feb 13 21:03:40 ": "Link to TJ Service Week sponsored by SGA http://t.co/FkPfXj2h : Everyone get involved -", "Thu Jul 07 01:36:47 ": "I used to think CA was full of crazies until we came out here for vacation in SF and Sonoma.  I was crazy, this place is beautiful. #CALove", "Sun Jan 15 19:22:56 ": "@ClayTravisBGID  - See new UT commit - tinyurl.com/7zjwe46 - Big pickup.", "Sun Feb 12 17:01:09 ": "Tips for delegating: http://t.co/c93nxUxT", "Mon Apr 18 21:54:52 ": "Being in LA for the past few days has confirmed how uncool I am.  Good to be reminded of that truth.", "Tue Jan 25 00:23:16 ": "Worst case scenario flooded kitchen and hours lost in frustration.  Best case: money saved, man-card restored, boundless optimism.", "Mon May 02 02:54:50 ": "Obama 2012 looks like a lock right now. Stump speech staple, you will hear this 20,000 times in the next year and half.", "Tue Nov 09 23:27:35 ": "@PTIShow", "Thu Feb 10 03:24:19 ": "@lee_taft Play by play from Lee Taft.  I'm guess the last tweet will read, \"Good game, thought we had it.\" or \"We got robbed!\"", "Fri Jul 01 04:05:30 ": "Just hung out with one of my former studemts, now a college grad working in DC.  I'm getting old.", "Sun Jan 02 14:28:33 ": "Going to try and tweet more in 2011, not because anyone is actually listening, really just to put thoughts together.  Time to de-follow me.", "Fri Sep 09 22:58:52 ": "RT @ClayTravisBGID: One of @theoktc writers is following rural Bama high school all season. Check out series. It's great. http://t.co/g9 ...", "Thu Aug 12 01:58:05 ": "First day on job, good talk from Chancellor Rhee this morning.  Then lots of lesson design stuff.  Signed contract so I'm official.", "Mon Aug 23 11:09:32 ": "Back to school!", "Sun Sep 19 16:19:31 ": "Back on twitter! Been a while.  I appreciate your prayers for my wife Sarah who is in Haiti this week.   God bless.", "Mon May 30 23:46:03 ": "@teachpraythink 3 Goals-Want to put reflections on teaching and history/gov, post meaningful prayers, and put thoughts on life and education", "Thu Jul 14 17:15:24 ": "Been in Philadelphia for the past week at the Presidential Academy on history and Civics #historynerdcamp. Plan to tweet best thoughts later", "Tue Jun 15 23:19:22 ": "Fear of the Lord is the beginnign of wisdom. So when we let fear of man dominate our actions we grow no wiser and waste our life.", "Fri Jul 15 04:07:41 ": "#historyfact - Jefferson hoped that the next generation would be able to free slaves, but thought it more important to win independence 1st.", "Wed Jan 04 00:38:18 ": "Happy B-Day to my beautiful bride and Happy Caucii to the Hawkeyes. Prediction: Paul, Romney, Gingrich, and  Santorum (Gingrich is surprise)", "Fri Jan 14 02:30:57 ": "Trip with students to Supreme Court yesterday was a great experience.  I enjoyed it as much or more than them (probably more).  Sykes v. US", "Fri Oct 28 02:34:03 ": "@TJColonials Great season Freshman Girls VB, 11-4 overall record!  JV Girls too with 8-7 record. Well done. #wecameforthesports", "Wed Jun 08 17:44:14 ": "2000 essays graded and brain is fried.  Going to sit on the beach for a few hours and think very little.", "Mon Mar 12 22:05:07 ": "http://t.co/56ybJlQD\nGreat Article on How to be Creative!", "Wed Jun 23 15:55:54 ": "Amazing!!! USA!  Great finish.", "Fri Jan 07 18:51:42 ": "In Charlotte for PKP midyear, looking forward to it.", "Wed Sep 21 22:01:17 ": "TJ Freshman VB wins at Stuart, 25-11 & 25-12.  Great job ladies!  @TJColonials #wecameforthesports", "Mon Jan 09 01:11:35 ": "#Tebow !!", "Sun Feb 12 16:58:58 ": "Changing again. Failed miserably in the past at keeping Twitter current, so I am going to try again for my leadership students at TJ @tjlead", "Mon May 02 02:50:06 ": "Looks like #Osamaisgona", "Fri Feb 10 03:56:37 ": "Follow @apushhelp if you want to see the collaborative effort of my AP United States History classes trying to share their knowledge.", "Sun Aug 28 00:25:10 ": "#Irene - pic from parents' front yard in Richmond, VA.  No damage to our home in DC as of yet. http://t.co/T0E3ViV", "Mon Apr 18 21:45:26 ": "@wesrucker247 Wes, love historical reference, but know that Wilson was a far bigger trustbuster. Sorry for being a smug history teacher.", "Thu Jun 02 02:38:14 ": "@sulzinator Romney has no chance at those voters anyway, so better to create a logical argument for others. Temporary insanity isn't working", "Wed Jan 19 01:57:49 ": "I love Brian Williams.  Go Vols!", "Fri Apr 29 02:59:10 ": "@wesrucker247 We live in DC now.  Three things to eat.  HalfSmoke-Bens' Chili Bowl, Chicken-n-Waffles- Founding Farmers, Burger- GoodStuff E", "Wed Mar 06 14:50:54 ": "Taylor mali poem - YouTube http://t.co/IxkOZ77ogV - Love this poem and it's message", "Sat Mar 19 20:34:15 ": "DC + Spring = Amazing.", "Wed Aug 24 03:05:28 ": "Reach for the Summit is one of the best leadership books I've ever read.Hopefully it is still required reading for all UT OrientationLeaders", "Tue May 11 23:09:38 ": "I want to #join2010", "Mon Jul 26 18:21:21 ": "Busy couple of weeks.  God is good though.  Praying for focus.  It is easy to get distracted by the little things.", "Thu Jun 16 20:12:56 ": "One of the hardest things in education is looking a kid in the eye and telling him that he failed.  Doesn't get easier with time.", "Tue Jan 25 03:27:57 ": "Victory!", "Sun Feb 12 17:00:24 ": "Great video on believing in people: http://t.co/FNziGwST", "Mon May 02 02:33:41 ": "A little freaked out that President Obama is about to address the nation at 10:30 on Sunday night.", "Thu Dec 20 23:42:09 ": "Credit Mobilier scandal, in which railroad men bribed senators with shares of stock, hurts Grant's presidency #gildedprog", "Sat Jul 10 21:42:58 ": "In Hungary on a Missions Trip Here is the link to keep up with the MBCC Short Term Mission Team: http://mbccstmt.blogspot.com/?spref=tw", "Tue Jul 06 20:32:04 ": "Great win for Dutch.  Haven't seen that many happy people in orange since the 1998 TN football championship.", "Thu Jun 09 00:38:26 ": "RT @lee_taft: RT:: A 15 year old girl with terminal cancer has has put \"trending on twitter\" on her bucket list. RT please #alicebucketlist", "Fri May 06 20:17:25 ": "@lee_taft congrats!!!", "Tue Jun 14 11:21:14 ": "Just could not get my mind or heart into reading the Word this morning,so pulled out the guitar for 1st time in DC an worshiped.Much needed.", "Tue Nov 09 23:28:05 ": "@PTIShow Error on show today.  Tennessee men's game was final exhibition and not season opener.  Love the show day in and day out, thanks!", "Sun Jan 09 13:52:04 ": "Great lunch with Darren Russo yesterday with CC.  We discussed the idea that every man wants to mentor and needs a mentor themselves.", "Thu Jan 06 03:28:57 ": "Vols look good.  Someone must have told them before the game that Memphis was a Big East team.", "Fri Oct 28 02:16:14 ": "@TJColonials TJ Volleyball goes 3-0 at Fairfax HS tonight.  Freshmen, JV, and Varsity with come back wins.  Well done girls!", "Fri Aug 26 00:02:06 ": "We remembered to beat the Titans tonight.  TJVB 2 - TC Williams 1.  Proud of my girls.", "Sun Jul 04 18:13:32 ": "4th of July, in TN, on boat, with family, reading Bible.  The good life.", "Tue Jan 18 11:29:23 ": "Tough/important: Mt. 10:34 - Jesus- \" Do not suppose that I have come to bring peace to earth.  I did not come to bring peace, but a sword.\"", "Fri Dec 21 01:05:45 ": "Former Union general Grant elected president in 1868; presidency marred by scandal #gildedprog", "Thu Jun 10 23:30:28 ": "@lee_taft No fish and chips is ok, but they must be called catfish and freedom fries.", "Mon Jun 14 00:39:28 ": "RT @johncmaxwell: You can't live a perfect day without doing something for someone who will never be able to repay you. -John Wooden", "Wed Jun 16 16:40:40 ": "Hot Chocolate for everyone!  Congrats Swiss, big win.", "Mon Jun 07 00:49:58 ": "In FL at AP Gov exam scoring.  It's been a great week."}