{"Tue Mar 05 01:07:05 ": "@dEEMARiEoOxX I was going to do the same thing and then punk came out he makes it better! But I know what you mean! I'm so mad!", "Wed Sep 07 21:15:24 ": "@jeremypiven we want a movie!!! Jeremy make it happen!!!", "Wed Feb 27 17:58:44 ": "@JonHeymanCBS no one is even close to the mick", "Sun Mar 31 15:57:04 ": "Just so mad right now!", "Wed Feb 20 20:12:32 ": "@Yankees #DerekJeter", "Tue Feb 05 16:49:21 ": "@PatrickWillis52 Patrick, I just wanted to thank you for an amazing season!! Next year will be even better #faithful", "Mon Feb 18 12:24:05 ": "@", "Tue Mar 19 21:43:54 ": "@MaioccoCSN what's our cap looking like now Mr.Maiocco?", "Sat Mar 17 00:23:35 ": "@Buster_ESPN you never do your own work. You just piggy back like the rest of your network", "Sun Aug 26 01:38:02 ": "New York Yankees #noheart", "Mon Mar 18 20:05:54 ": "@AdamSchefter Adam anything cooking with my 9ers?", "Fri Apr 19 02:11:45 ": "@LaMichaelJames you ready to go get that ring #nflschedule2013 #faithful", "Fri Mar 29 20:38:21 ": "@dEEMARiEoOxX me either! I'm so excited! And no problem your my friend don't like seeing you so upset!", "Mon Mar 04 23:26:30 ": "@dEEMARiEoOxX me too! Tired of everyone and their excuses!", "Mon May 14 21:01:23 ": "@Espngreeny no one cares about basketball, try hockey #NHL", "Sun Apr 07 14:36:00 ": "@AskWrestleMania where can we park?", "Sat May 07 07:53:25 ": "@JoeandEvan ev I'm looking for a job in Human Resources anything available there at fan?", "Thu Mar 14 23:52:32 ": "@AlbertBreer Avril can't play the run", "Tue Feb 26 16:35:50 ": "@mark_may your a moron", "Sat Feb 09 16:16:01 ": "@dEEMARiEoOxX wow that is nuts! We got like 30 inches out here this is not fun lol", "Tue Mar 12 01:03:51 ": "@dEEMARiEoOxX this raw has been so much better than last weeks, until cena comes out #boring", "Thu Feb 07 23:34:22 ": "@WWEAJLee it's sad to say but gentlemen are a dying breed", "Tue Jun 07 16:03:24 ": "@JoeandEvan dumb but I understand you wanting to rid your team of reynolds", "Sat Feb 09 16:18:27 ": "@dEEMARiEoOxX  oh I am miserable it's just me and my nutty family! Mania can't get here soon enough #springtime", "Sun Mar 24 16:58:08 ": "#mentionsomebodyyouwanttomeet @AldonSmith @Kaepernick7 @PatrickWillis52 @JedYork", "Mon Apr 15 16:34:47 ": "@Ken_Rosenthal has the Yankee offense impressed you thus far? #bingit", "Fri Mar 15 22:59:08 ": "@49ers #wearethefaithful", "Wed Mar 20 01:31:29 ": "@JedYork some people have no respect", "Mon Apr 16 11:04:25 ": "@Espngreeny who cares!", "Thu Apr 11 11:25:22 ": "@TheRock rock will you come back to the wwe after this? Or was mania 29 your swan song? Please RT", "Wed Jan 25 18:24:31 ": "#idontwanttogotowork", "Wed Sep 21 10:45:50 ": "@Buster_ESPN your dumb", "Thu Aug 30 14:51:12 ": "@PatrickWillis52 hey Patrick how about an RT for a huge 9ers fan who is at home with a concussion!", "Wed May 02 23:00:37 ": "@JoeandEvan no", "Fri Mar 29 20:44:51 ": "@dEEMARiEoOxX no problem :)", "Tue Mar 05 01:25:22 ": "@dEEMARiEoOxX I know mine too!", "Sat Feb 09 16:55:48 ": "@dEEMARiEoOxX lol nice!!!", "Mon Mar 11 17:15:17 ": "@MaioccoCSN should they go and get a corner now Matt?", "Mon Feb 13 12:26:25 ": "@TheRock have an interview this morning rock, could use an RT for luck! Ps its also my birthday!!!!!!", "Tue Mar 05 01:22:18 ": "@dEEMARiEoOxX lol why does she wear dresses that barely cover her lol it's not pleasant! I can't wait for the legends though", "Mon Mar 04 23:51:31 ": "@dEEMARiEoOxX lmao I know! Wait til you see him! Old, fat and can't walk anymore! Some people don't know when to quit!", "Mon Feb 25 03:17:31 ": "@JRsBBQ JR I know the feeling, I too have sit through this! #itswhatwedo", "Sun Feb 24 15:18:22 ": "@SI_PeterKing no but it's also highly likely he won't be a franchise qb. #uscqbsdontreallypanout", "Sun Apr 14 23:14:54 ": "@TheRock I am part of the millions! Would like to thank you for that amazing match at mania! Will you be going back to the ring at any point", "Mon Jul 18 14:54:09 ": "@Buster_ESPN why should we believe you your a hack", "Tue Apr 09 00:39:54 ": "@realmickfoley cactus jack vs John cena #bangbang", "Sun Nov 25 03:00:10 ": "@RealKevinNash but they're not in the sec, so you can't judge em", "Fri Mar 29 18:27:02 ": "@dEEMARiEoOxX you ok dee?", "Mon Dec 12 01:26:25 ": "@JoeandEvan who cares! we want dwight!", "Wed Apr 17 00:03:14 ": "@JerryRice Jerry I am a huge fan! Voted for you over a hundred time #maddencovervote", "Sun May 08 09:49:13 ": "@ShaneHelmsCom how's your girl", "Fri Apr 05 12:59:01 ": "@ProFootballTalk how much cap room do the niners have now with Davis inked up?", "Thu Feb 28 00:19:57 ": "@SI_JimTrotter thank you! #toomuch$$$", "Tue Mar 12 01:09:32 ": "@dEEMARiEoOxX lmao!", "Mon Mar 04 23:30:54 ": "@dEEMARiEoOxX yea, not to mention draining. Life is too short and this is to exhausting", "Tue Mar 05 00:54:30 ": "@dEEMARiEoOxX I just got it, I just rolled my eyes at it, ironic no lol", "Tue Mar 12 01:06:27 ": "@dEEMARiEoOxX great match! And I don't blame you I hate commercials too lol!", "Sun Mar 17 22:38:38 ": "@ProFootballTalk would San Fran be likely to go after freeny, osi or dumervile?", "Mon Apr 01 02:58:58 ": "RT @Retweet__Jesus: Sadly, 97% of Twitter users will not R-T this. \nWhen Jesus died upon the cross, he was thinking of you. \n\n#RETWEET i ...", "Fri Dec 09 12:14:24 ": "@JoeandEvan believe!!!!", "Fri Mar 15 22:43:01 ": "@MaioccoCSN noooooooo he gives up 15 yds a pass! Would rather have Woodson", "Mon Jan 16 22:14:52 ": "@JedYork jed life long niner fan living in new york! Would love to see my favorite team get its 6th nfc title!", "Mon Mar 04 23:57:19 ": "@dEEMARiEoOxX that's he gets Michelle mccool! I never liked him so this is real annoying!", "Mon Mar 04 23:37:46 ": "@dEEMARiEoOxX I hear you! I hope your night gets better! Hour and a half til raw!", "Sat Feb 09 16:44:21 ": "@dEEMARiEoOxX what time do you get  to go home?", "Tue Apr 16 03:11:50 ": "@ShaneHelmsCom it was good overall", "Tue Feb 05 21:04:39 ": "@SI_PeterKing there should be Peter, refs were terrible!", "Mon Mar 25 16:37:24 ": "@JerryRice Jerry your my favorite player I would cherish the jersey always", "Tue Mar 05 01:54:33 ": "@dEEMARiEoOxX lol because he couldn't walk down the ramp", "Tue Mar 12 01:08:23 ": "@dEEMARiEoOxX lol you like it that much?", "Fri Mar 29 18:30:44 ": "@dEEMARiEoOxX I know that feeling all to well!", "Mon Feb 25 00:09:43 ": "@JonHeymanCBS and what do we do when Grandy comes back? Think Jon, just stay the course", "Sun Mar 17 03:07:45 ": "@jerrycferrara Donnie was amazing! Greatest first basemen I have ever seen! #donniebaseball", "Sat Feb 09 16:44:01 ": "@dEEMARiEoOxX no I don't but everyone tells me to watch, so I'll watch some of this marathon as soon as I'm done with shoveling.", "Thu Apr 18 00:37:47 ": "@CMPunk best game in the world! Watched by the best in the world #baseball", "Fri Mar 22 20:37:27 ": "@RossTuckerNFL lol who cares about revis? We all know where he is going! No big deal if is on opening day", "Mon Nov 21 22:24:35 ": "@JoeandEvan ev did you watch survivor series???? rock hasnt lost a step", "Thu Feb 14 18:33:10 ": "@NetsDaily what is this about Dwight haven't been able to find anything on it?", "Fri Apr 12 13:42:14 ": "http://t.co/64iIWFKfNY", "Tue Mar 26 01:19:47 ": "@HLundqvist30 just play better hank please just play better", "Fri Feb 08 20:01:27 ": "@TomCruise it's my birthday next Wednesday and my girlfriend said we can see anything I want #TopGun3D", "Tue Mar 05 01:14:04 ": "@dEEMARiEoOxX I know, it has to get better soon no?", "Sat Feb 09 15:40:37 ": "@dEEMARiEoOxX I guess the snow wasn't that bad by you? Be safe!", "Sun Mar 17 22:13:26 ": "@ProFootballTalk what will the niners do? Corner? Or just go through the draft?", "Mon Apr 16 10:49:02 ": "@Espngreeny would you guys please talk some NHL playoffs, jeez!", "Thu Jan 24 17:00:34 ": "@JedYork I am the biggest 49ers fan living in New York! Never seen the red and gold live and I truly would love to see them win # 6 live!", "Sat Nov 10 21:36:47 ": "@AndrewMarchand you would be horrible that year though", "Tue Jan 08 03:56:40 ": "@JoeandEvan yes he is, it's great too", "Tue Aug 09 15:29:48 ": "@TheRock hey rock its going to be my girl's and I 5th anniversary can I get an RT!", "Tue Mar 05 01:56:30 ": "@dEEMARiEoOxX now that's good tv", "Sun Jan 29 23:30:51 ": "@TomCruise to settle an argument with my friend was tom cruise ever in the boy scouts like knight and day suggested????", "Mon Mar 11 11:46:01 ": "@jerrycferrara @mrdougellin avion so smooth! http://t.co/6avvs6UYgj", "Thu Jan 26 23:54:02 ": "@JoeandEvan what do you think pineada's stats will be this year?", "Tue Jan 17 23:49:55 ": "@JonHeymanCBS", "Tue Mar 05 01:05:55 ": "I can't even begin to tell you how dumb that was #takerneedstogoaway", "Wed Apr 04 18:49:40 ": "RT @MLB: If we get 1,000 NEW FOLLOWERS in the next HOUR, we'll give away an iPad, a PS3 and an @XBOX + 2012 MLBTV subs! RT THIS and use  ...", "Tue Mar 05 01:03:24 ": "@dEEMARiEoOxX I can't believe this!", "Thu Dec 06 00:03:42 ": "@jerrycferrara watching home alone as we speak! Excellent movie!!!!", "Sun Feb 24 22:53:27 ": "@JonHeymanCBS #ace huh? Why don't we just give that term away to every pitcher now. #wowjustwow", "Mon Mar 04 23:46:10 ": "@dEEMARiEoOxX that's because Vince refuses to change, punk better beat taker so at least their is a surprise this year! You know?", "Sat Mar 31 16:26:29 ": "@R_Roddy_Piper thank you so much for autographing my belt! I am so thankful for it!"}