{"Thu Feb 07 18:39:36 ": "Always good to have a new team member - different ideas and perspective, plus keeps you honest on practices you may have let slip slightly", "Tue Apr 02 06:59:14 ": "The new Reading Station over bridge. Shame I have no idea whatsoever where my next train will depart from! http://t.co/r7mOcDZ50u", "Tue Mar 12 18:23:42 ": "Gentle 5k jog today as part of taper for half marathon on Sunday. I beat my first ever 5k race time from August last year.  Training works.", "Tue Apr 02 07:08:34 ": "@mbisty Yes, but so many delayed services at the top that the trains running to time have dropped off the bottom.", "Mon Feb 18 16:53:05 ": "RT @scarynetworkguy: The 6 Stages of Debugging: That can't happen. That shouldn't happen. Hmmm, weird. Why does that happen? Oh, I see.  ...", "Tue Apr 09 16:53:13 ": "Someone just told me they didn’t have time for a cup of tea. I’m afraid that I was totally unable to comprehend this concept.", "Sun Mar 03 11:55:06 ": "At the top of Oxford Castle Tower. http://t.co/7WVWmyQAXX", "Mon Mar 11 11:06:20 ": "RT @thecoda: This is what a #scala programmer sees when looking at your #java code: https://t.co/Fhi03yr7LQ", "Tue Feb 26 10:07:50 ": "“@regvulture: Xyratex thrusts a Lustre cluster knuckleduster at Intel's bluster: http://t.co/CVlmMgd3Jr” Now that’s a good headline.", "Sun Feb 24 10:35:10 ": "The reason UK has lost it's AAA credit rating is not austerity. It's because we are STILL borrowing way too much money each month.", "Tue Feb 12 18:23:25 ": "Surely one of the most dangerous inventions known to man: the small brief case with wheels and handle that tries to trip you up at stations", "Wed Feb 13 07:10:17 ": "RT @PLT_Hulk: ALL PROBLEM OF COMPLEXITY DISSOLVE IN WARMING LIGHT OF CURLY BRACES!!!!", "Tue Apr 09 16:19:28 ": "Hi @Crossrail, just wondering how raising bridge parapet heights in Slough  are linked to your project?", "Wed Feb 20 11:06:11 ": "Waiting in for a delivery when you've no idea what time it's arriving is so frustrating. Can't plan any structure to the day.", "Wed Feb 13 08:10:56 ": "RT @Ionactive: http://t.co/6hWdard9  Waitrose withdraws ‘essential’ range after finding poor people in stores / Could not resist this :- ...", "Sun Apr 07 16:41:08 ": "Yay, the new trampoline is big enough for adults. #bounce http://t.co/3xz1amPsSt", "Mon Apr 01 19:45:57 ": "RT @codemiller: Just registered http://t.co/1aEpoQheNm! If you're a woman interested in functional programming, please join our group. # ...", "Tue Mar 05 08:11:53 ": "RT @mfeathers: The future is now: http://t.co/IuDfWMYPYh /via reddit", "Tue Apr 09 17:30:02 ": "Seems crazy to me that most website/webapp analytics solutions are implemented using client side Javascript calls. Must rectify.", "Sat Mar 02 10:00:35 ": "@drnickyoung Your book is being put to good use as Isobel is doing the history of Francis Baily School as her homework this week.", "Sun Mar 17 15:16:16 ": "Thanks everyone who offered support and encouragement for my #readinghalfmarathon effort. Esp @EdaMeadows for being a great running partner.", "Wed Feb 27 16:05:09 ": "What’s the point of LloydsTSB Verified By Visa screen asking me the same card information I just entered as a way of proving my identity!", "Mon Mar 18 10:14:09 ": "RT @tehbb: This could be good! - New nuke could POWER WORLD UNTIL 2083 http://t.co/dnb7TUOGhN via @regvulture", "Wed Feb 13 07:08:57 ": "Why the obsession of returning to growth rates of pre-2008? These were all fuelled by unsustainable debt. 1/2", "Tue Feb 12 18:04:39 ": "*is flipping pancakes* #shrovetuesday", "Thu Feb 28 09:34:22 ": "RT @Fascinatingpics: On top of the world. http://t.co/hzCGq0xJuN", "Sat Mar 23 10:08:51 ": "Sorting bookcase. Pretty certain I don’t need ‘Core J2EE Patterns’ and ‘J2EE Web Services’", "Thu Apr 04 07:40:14 ": "RT @lemire: Save time and watch all 6 Star Wars movie at once. http://t.co/zKJPNWPnyq", "Sun Mar 17 21:25:14 ": "Official Reading Half Marathon result gives me a chip time of 1:43:39 finishing in 2771st place out of just under 13k finishers.", "Mon Mar 25 21:38:31 ": "Passed 300 miles cumulative running distance for the year on today’s 10k run.", "Sun Mar 17 19:14:02 ": "@_sinistral Yep, got very good shoes plus done loads of knee strength exercises every day as well. It worked.", "Tue Feb 26 11:30:27 ": "RT @EqualExperts: We've #justsponsored Christopher Turner on @JustGiving. Support them &amp; Samaritans @ http://t.co/vYn6SjOA8a", "Wed Feb 13 09:01:01 ": "RT @NewburyToday: #NewburyNews Thatcham’s oldest building to get annual grant from town council: AN annual grant that will help se... ht ...", "Tue Apr 02 13:30:23 ": "RT @wfaler: Headline of the day: \"Church accuses govt ministers of perpetuating myths\".. Yes, about that, what business are churches in  ...", "Mon Mar 18 08:49:07 ": "RT @TheRealSheldonC: Perfect example for the importance of Commas. http://t.co/W0H08DtM5N", "Wed Mar 20 08:25:22 ": "RT @dreid: “What’s your job?” Programming.  “What’s your hobby?” Programming. “What do you do when you’re not programming?” Think about  ...", "Wed Mar 13 17:03:28 ": "The best days are those where you deliver a new feature almost entirely by refactoring existing code into a reusable construct.", "Wed Apr 03 20:57:24 ": "Watched “Legend of the Seeker”. Good programme, but too many changes from the book means it has lost the real essence of the story.", "Tue Feb 19 19:29:52 ": "Anyone know a ballpark cost for replacing the screen in a 15\" MacBook Pro (unibody, high res)?", "Sun Feb 17 15:35:25 ": "RT @DepressedDarth: Dear JJ Abrams,\n\nIf you screw up the new Star Wars movie, I will start calling you Jar Jar Abrams.\n\nSincerely,\n\nDarth.", "Tue Apr 02 14:59:08 ": "@FGW Hi Ollie, are there going to be any trains running Reading to Thatcham? All look cancelled at the moment. Should I arrange alternative?", "Thu Feb 07 13:14:29 ": "RT @r4isstatic: And there was I thinking PRINCE2 certification would enable me to sing Purple Rain without fear of mockery", "Fri Mar 15 15:41:19 ": "OH: “Simon Peyton Jones talked to me. This must be like how Catholics feel when meeting the Pope.” #fpx", "Tue Apr 02 05:36:01 ": "Ominous start to this week’s temporary FGW timetable (due to Reading Station works): first two possible trains cancelled.", "Fri Feb 15 06:55:12 ": "RT @cloud_borat: c-cloud CEO:\"we need figure out how make our product a platform\" Vlad:\"That easy, we remove all UI from product\"", "Thu Feb 07 16:21:01 ": "Instead of building the HS2 rail line on what is basically 150 year old tech, why can't we be more ambitious and visionary? Maglev for eg", "Sat Feb 09 20:24:57 ": "RT @honzam399: traceroute 216.81.59.173\n\nDo. Or do not. There is no try.\n\n/cc @chalkers", "Wed Feb 20 17:36:07 ": "@FGW Thanks for your help Ollie. I can't get hold of them (must be on the underground). Hopefully they will make the 18:06.", "Tue Apr 09 11:03:10 ": "@runnersworlduk “What do you think about when you’re running?” Definitely let my mind wander. Usually solve complex problems while running", "Mon Apr 15 07:27:08 ": "[blog] Some thoughts on agile/developer coaching that I gained from yesterday night’s game of football: http://t.co/kaGeyp5aUk", "Tue Apr 02 20:32:04 ": "RT @BBCSouthNews: First Great Western has announced the timetable through Reading is proving unworkable. Fewer trains will now run for t ...", "Thu Apr 11 06:00:44 ": "@Thomdjones @Crossrail Thanks. Makes perfect sense. Never underestimate the ability of the public to interfere with 25kV electric cables ;)", "Fri Mar 15 14:11:29 ": "Vendor presentations really have no place at a technology conference that I’ve paid to attend. I want to learn things, not watch demos.", "Wed Apr 03 19:43:58 ": "RT @wendydevolder: You asked, we delivered! Soft chairs arrived @skillsmatter today &amp; just in time for #cukeup ! http://t.co/wSrRO6M ...", "Thu Feb 28 09:48:04 ": "RT @robsmallshire: Attention person on train! I can see from 4 m away your functions are too long and your code has too many levels of i ...", "Tue Apr 09 20:59:48 ": "@Thomdjones @Crossrail yes, but they aren’t raising the bridge, just making the wall over the top higher. Just wondered why this is needed", "Wed Feb 27 09:06:56 ": "RT @stilkov: “This is THE correct way to write numeric dates”: http://t.co/uVHbz4ONMD", "Sat Mar 16 16:49:12 ": "Thanks @EdaMeadows and @PlamenB for your support. Looks like it’s going to cold and wet at the moment.", "Sun Mar 17 11:54:53 ": "Just completed a 13.04 mi run - Yay! Ouch! gasp! http://t.co/qEcJq3eJQj #RunKeeper", "Mon Feb 18 15:08:17 ": "RT @obruchez: \"Software is eating the world, endangering almost every job there is\" http://t.co/FW5wp7gY", "Wed Feb 13 07:20:23 ": "RT @awparks: If you want everything else in your life to suddenly seem easier, attempt to put gloves on a toddler.", "Wed Feb 20 17:15:13 ": "@FGW What times are off peak ticket exclusions on trains leaving paddington please? do these apply to stopping services also?", "Wed Feb 20 17:20:27 ": "@FGW Wife and kids going from paddington back to thatcham (via reading). They have off peak tickets and want to know what train they can tai", "Wed Mar 20 18:29:25 ": "RT @mrdaveturner: I'd delete my Facebook account but it's a handy tool for knowing exactly how annoyed my wife is with me at any given p ...", "Wed Feb 13 09:01:50 ": "RT @channingwalton: Our best work machine. http://t.co/zS7nD8Ol", "Tue Apr 02 15:05:08 ": "@FGW Thanks Ollie. Was planning to be at Reading about 17:00, so a bit of a wait, but not too bad if that one is running.", "Tue Mar 12 22:24:37 ": "RT @rossmonstr: CAN WE ALL TAKE A MOMENT TO APPRECIATE MY MOTHER USING A KINDLE AS A BOOKMARK http://t.co/VqEZOdx9Fs", "Wed Feb 13 12:27:56 ": "@drnickyoung Fortunately they didn't implement it. Those new access roads would have been awful.", "Mon Mar 04 09:01:56 ": "RT @channingwalton: \"Mathematics student solves rubik’s cube while juggling, Awesome!\" http://t.co/g84gbYPF7r - recommended via @Prismatic", "Tue Apr 16 07:07:46 ": "Anyone in scala land aware of how I can evidence that two type parameters are not the same type (i.e. I need the opposite of =:=)?", "Mon Apr 08 19:36:09 ": "People may not like some of what Margret Thatcher did, but come on, that was 25-30 years ago. Time to look forward. 1/2", "Tue Mar 19 12:27:09 ": "Configuring a build tool: 15% knowledge, 65% random fiddling, 20% pure luck.", "Wed Apr 03 19:43:33 ": "@wendydevolder soft chairs are the best news I’ve had in weeks. Will have to book in to something ASAP to try them out. #nomorenumbbum", "Wed Apr 03 19:56:34 ": "RT @GSElevator: #1: It's not rocket science. Hong Kong has 95% tax compliance, because it's code is only 4 pages long with a 15% flat tax.", "Tue Apr 02 06:45:18 ": "Thatcham to Reading via Tilehurst station. A most circuitous route. #willweevergetthere", "Thu Feb 28 20:56:09 ": "Excellent evening with the @EqualExperts team talking about functional programming and coding Conway’s Game of Life in Scala.", "Mon Mar 11 20:47:40 ": "Need to re-read git book and GitHub tutorials. Made a right hash of trying to rebase my fork from the upstream master.", "Fri Mar 15 07:18:28 ": "Off up to @skillsmatter for Functional Programming eXchange. Looks like an information packed schedule. Hope there’s biscuits #fpx", "Fri Mar 01 09:40:42 ": "RT @leonaw66: Haha! Another class old fashioned book !! http://t.co/hveoNSLJZJ", "Tue Apr 02 07:07:09 ": "Nice new platforms at Reading Station. They also have A and B ends just to add to the confusion.", "Fri Mar 01 15:49:48 ": "RT @kkovacs: True :) \"Put #Haskell on your resume now. When asked, say your resume is 'lazy' and you'll learn it when results are needed.\"", "Mon Apr 08 19:37:10 ": "Stop blaming decisions of long ago and spend your energy building the society of the future that you want to live in. 2/2", "Tue Mar 05 08:25:17 ": "RT @cryptic_journo: Asda's incest-friendly Mother's Day range. Good effort. http://t.co/mOHlUF7QmU", "Sun Feb 10 15:23:57 ": "What's the point of a catalogue store with thousands of products, none of which you actually want being in stock? #argos", "Fri Mar 15 16:37:43 ": "Reading Half Marathon on Sunday. A gentle jog tonight then taking it easy for  the first part of the weekend.", "Mon Apr 08 13:43:30 ": "RT @Boyseyboy: Whatever your politics are, and I was no fan of hers, you can't deny that as leader of this country she at least had some ...", "Wed Apr 03 15:22:14 ": "Wizard’s First Rule: People will believe a lie because they want it to be true, or because they are afraid it might be true. So correct.", "Tue Apr 02 17:05:42 ": "Despite the delays, cancellations and chaos, it’s a seriously impressive bit of engineering work going on at Reading Station at the moment.", "Mon Feb 11 14:14:35 ": "RT @hseeberger: A New Java Library for Amazing Productivity: http://t.co/sEO0GZUH", "Tue Feb 26 14:17:23 ": "@lancewalton It’s never too cold for a run.", "Thu Apr 04 07:48:05 ": "RT @DeathStarPR: Periodic Table of the Empire Strikes Back #StarWars #Science (via @legobrickboy) http://t.co/SDqNsnXJSM", "Mon Apr 15 14:33:09 ": "RT @bodil: This is absolutely brilliant: \"Ten reasons not to use a statically typed functional programming language\" http://t.co/MZhnLcJlYz", "Thu Apr 04 08:39:24 ": "RT @MattRussellUK: This week's \"Most disturbing class on my classpath\" award goes to... akka.actor.dungeon.TerminatedChildrenContainer", "Mon Feb 11 12:09:53 ": "RT @DeathStarPR: #Pope Benedict XVI is retiring before he gets thrown down a reactor shaft by Darth Vader, like his brother Emperor Palp ...", "Wed Feb 20 17:22:59 ": "@FGW Excellent thanks for your help Ollie. They might miss that one but I guess they can get any later service back then?", "Fri Mar 01 08:48:12 ": "RT @brianclapper: @djspiewak's #NEScala keynote is live: http://t.co/VoBCOIi1dH", "Wed Feb 13 07:09:51 ": "Surely better to have the current growth of about 1% per year built on solid foundations and reducing debt? 2/2", "Wed Mar 20 08:19:49 ": "RT @deficitowl: Bank robbers caught on camera in #Cyprus. http://t.co/pVpmu4Li9A", "Wed Apr 03 15:18:06 ": "RT @sheeshee: THIS IS HOW HASKELL DOES IT. ;) https://t.co/EfyxzmyJGb - it's the funniest thing I've ever read. :)", "Wed Feb 13 07:14:15 ": "RT @evolvable: Are you more productive in Scala? - A short survery http://t.co/u9aKqTpV", "Fri Feb 22 22:12:47 ": "1. Switch on new MacBook. 2. Enable iCloud Sync. 3. Install Dropbox. All files, bookmarks, email accounts synced. Easy as pie."}