{"Sun Sep 26 20:51:55 ": "Eu não tenho o que fazer, então vou informar: Seg - max 24° min 15° Sol com muitas nuvens. Pancadas de chuva à tarde e à noite. #Climatempo", "Thu Oct 21 20:24:51 ": "acabei de descobrir que gosto de café com leite. hihi", "Sun Oct 03 23:18:35 ": "Leve gripe, mal estar, prova amanhã e trabalho pra entregar. Mas é isso aí. http://divulgacao.tse.gov.br/#", "Fri Oct 01 20:38:42 ": "Uhh Lady Gaga!", "Mon Nov 08 00:08:02 ": "catia cananea curtiu o gp brasil de f1.", "Wed Aug 24 15:55:37 ": "Rock N Roll is free if you want it.\nRock N Roll is free so come and get!", "Wed Apr 20 02:26:20 ": "depois das aulas de biobike e power jump eu sei que consigo, cansaço monstrooooo", "Wed Aug 10 15:30:03 ": "super indicada a Coleção Folha Cinema Europeu, eu tenho quase metade dos filmes mas paguei o triplo por eles, ou seja, se vc gosta, vale!", "Thu Sep 22 21:07:22 ": "só 6 meses se passaram. nos próximos 6 eu extermino qualquer possibilidade de intercâmbio. oh no!", "Wed Apr 20 02:27:54 ": "@suchsmallhands_ saudade de vc, pirua freak master!", "Tue Oct 11 01:08:00 ": "democracy crisis, economic crisis, dirtyness. i can see everywhere, even inside my white cube.", "Sun May 20 11:45:21 ": "Evento da Fiat ontem, com os queridos da Europ, para a nooossa alegria http://t.co/cJdAWf3Y", "Fri Nov 26 21:07:56 ": "indique a resposta correta.", "Sun Nov 28 18:53:45 ": "o @luisnassif é o maior freak do twitter. ninguém posta tanto quanto ele... calm down man! hahahahaaa", "Sun Dec 19 12:08:03 ": "vou te contar uma coisa, @suchsmallhands_ : passei a semana INTEIRA falando inglês, advinha por quê... hahahahahah", "Thu Jul 05 03:16:13 ": "@Lullipop Achei o máximo! bem feito!", "Mon Oct 25 19:56:23 ": "a gente faz merda mesmo, a vida é assim. e tem horas que eu queria passar uma borracha no passado e fazer diferente, mas não dá. -&gt; face it", "Sat Oct 09 01:26:43 ": "chego pensando em você e a primeira pessoa que vejo é você. sonho com você mas tenho a difícil missão de não ficar pensando em você.", "Sat Nov 20 20:20:37 ": "@RafinhaSilveir hahahahahahah eu sou pequena? e será que consigo me esconder em tocas? hahahaha - coloquei as fotinhas no face já", "Sat Jan 22 11:27:02 ": "@suchsmallhands_  Vc foi emboraaaaaaaaa? Como assim? É, já vi tudo... quando rolar um feriado que eu NÃO vá trabalhar eu vou praí", "Wed Aug 24 15:56:08 ": "The masters of convention.\nCount on you to never change.\nBut the laws of reinvention knows.\nNothing stays the same.", "Thu Oct 21 00:13:10 ": "a linha nova do metrô de SP, amarela, é fantástica! todas as estações e trens deveriam ser daquele jeito, pena que ainda funciona poucas hrs", "Sat Oct 30 20:59:28 ": "afetação, futilidade e interesses vazios. grande merda, meu bem!", "Thu Jun 09 14:41:28 ": "mais um show do Strokes em São Paulo, please!", "Wed Nov 17 22:53:50 ": "eu tbm caí nessa, mas é engraçado demais :-D", "Sat Jul 02 15:59:26 ": "happy birthday", "Thu Sep 22 21:18:33 ": "copiando 527 vídeos, 40 minutos restantes. uma eternidade. força! o tcc tá aí, vou fazer a melhor edição, a melhor. Belo Monte, bitch!", "Thu Sep 01 14:09:02 ": "http://t.co/uo5aazo", "Thu Dec 02 23:56:13 ": "meu corpo pede uma esteira, minha alma pede musculação. me aguarde, meu bem", "Wed Dec 29 23:44:53 ": "For reasons unknown I trust you. For everything that I can't stop thinking I miss you. For now I just need alcohol and shore. Honey for us!", "Thu Nov 25 19:31:57 ": "@ArianeDonegati será que tem 'felicidade conjugal' do Tolstói? será que você poderia comprar? será que vc é legal? que será, será! hahahaha", "Fri Nov 26 21:05:28 ": "b) se embebedaria demais pra esquecer o quão escrota vc vai estar a noite toda. hahahaha", "Sat Jan 22 11:24:37 ": "o mundo tá cheio de energia e quer mais, eu tou cansadona e quero voltar atrás", "Thu Nov 18 21:07:29 ": "@ccananea por queeeeeee? eu vou ser tia?????? responda sr. cananea n° 3", "Sun Oct 17 22:57:06 ": "@suchsmallhands_ vai melhorar, com certeza! até porque eu estou esperando causar muito com você lá! E vamos também no Equador do mack!? :-D", "Wed Apr 20 02:25:40 ": "quando vc não precisa trabalhar o twitter ele é mais legal... força!", "Sat Oct 09 01:28:38 ": "Q venha feriado prolongado e que venha td o mais. As coisas são muito loucas e eu desisti de tentar entender. Deus quis assim. Honey for all", "Sun Apr 29 05:31:50 ": "eu quero tchu!... http://t.co/Ygbcd4vr", "Tue Oct 19 16:18:05 ": "puta merda...", "Wed Nov 24 22:37:50 ": "O Felipe Massa \"ai ai ai ai ai\" - com medo - e a cara do Alonso  no começo SÃO HILÁRIOS!", "Wed Jun 13 23:29:39 ": "huummm pretty good! congratulations! :-D", "Fri Dec 03 22:47:20 ": "ok, a noite são outros quinhentos. partiu!", "Fri Dec 03 22:46:33 ": "dia maravilhoso hoje não? hahahahaha", "Sat Nov 27 15:48:48 ": "@RafinhaSilveir  já tá rolando uma saudade mesmo... hahahaha", "Sun Jun 10 14:02:05 ": "i miss you... please stop suffering because i can feel too. life is now, was yesterday and will be tomorrow, only the past you cant change", "Fri Nov 26 21:04:35 ": "a) venderia o ingresso enquanto dá tempo, perder dinheiro é foda.", "Fri Nov 26 21:07:18 ": "c) tacaria um foda-se e iria pra festa de qualquer jeito, afinal vc não deve ser a única que deixou tudo pra ultima hora", "Sun Oct 17 22:51:06 ": "@suchsmallhands_ seu background é demais! -&gt; vai na festa da puc sábado que vem né?", "Tue Apr 19 00:31:25 ": "The Strokes, 05 de novembro de 2011, São Paulo, Brasil. =D", "Thu Nov 25 19:06:09 ": "tem ed 34 na feira do livro, srta @ArianeDonegati ?", "Thu Nov 18 21:11:13 ": "o melhor a fazer agora é atravessar o oceano de jet ski. potes de mel para todos", "Sun Nov 14 15:16:08 ": "Bota fora Mack 2010 com maravilhoso open de  RED BULL", "Sat Nov 27 15:47:57 ": "ah @RafinhaSilveir acordar tard no sábado é ótimo, mas só de pensar q a gente ñ vai + aloprar o rodrigo c/ @Lullipop @Stellinhakiss...", "Mon Nov 22 21:24:23 ": "revendo o jesus negão http://www.youtube.com/watch?v=P1sbQ6bDHuA Segundo dados da ceageSP de santa catarina...", "Wed Nov 17 22:37:39 ": "so how could anybody possibly think they know how i feel?", "Thu Nov 18 15:39:54 ": "tentei fuçar uns tutoriais do final cut no youtube, me ajudou pouco. vou lá quebrar a cabeça assim mesmo. Força!", "Wed Nov 17 22:35:55 ": "because you wear a uniform, a smely uniform, and so you think you can be rude to me. but even i, as sick as i am, i would never be you", "Thu Sep 22 21:03:26 ": "\"Dólar sobe e fecha cotado a R$ 1,89; Bovespa cai 4,8%\" FSP, 22.09.2011", "Sun Apr 29 00:42:26 ": "Acabei de publicar uma foto http://t.co/VABqLtl3", "Wed Aug 10 16:05:26 ": "caetano! pronto, acabou, vou ler um livro", "Wed Aug 10 16:04:14 ": "férias acabando, tou sem dinheiro há muito tempo, ôôÔô tristeza http://t.co/tCRlEwX posso não, quero não, minha conta não deixa não hahaha", "Thu Sep 22 21:05:18 ": "\"A Bolsa de Valores de São Paulo opera no azul nesta terça-feira (22). A cotação do dólar seguia em baixa de 0,12%, a R$ 1,665\" UOL 22.03.11", "Thu Jun 21 23:19:43 ": ":-D Surprising, as usual. Lovely, as natural. remember that i will never forget!", "Wed Nov 17 22:53:20 ": "Abra o Google Maps. Coloque o Japão como ponto de partida e a China como destino. Leia o passo 43, e se vc conseguir parar de rir, dê RT!!", "Fri Nov 12 17:22:06 ": "RT @lariviviani Você estuda em uma Universidade conservadora, preconceituosa e que incentiva a ignorância? Eu sim: http://migre.me/29oH7", "Thu Nov 18 15:41:43 ": "@RafinhaSilveir hahahahahahah que que é iiiisso?", "Thu Nov 25 21:57:28 ": "tou de saco cheio de ver essa gente falar que propaganda ou marketing da empresa x é genial. Gênio só o da lâmpada, eles são bons vendedores", "Sun Nov 14 15:19:24 ": "Uhuuulll Sebastian Vettel campeão mundial de F1! merecidíssimo, 23 anos de pura agressividade na pista. Alonso não fez seu trabalho...", "Sun Nov 14 22:25:17 ": "vettel, vettel, vettel. cicélia, vettel denovo. Depois do GP da Coreia e a autosport com a capa \"como se perde um campeonato\"... eis VETTEL!", "Thu Sep 22 21:12:41 ": "@RafinhaSilveir I'm in despair!", "Sat Nov 27 15:53:29 ": "@leilajfreitas ainda bem que fui de C mesmo! foi engraçado demais e tenho que contar q a minha de policial tava muito longe de ser a + zuada", "Sun Jun 10 13:53:48 ": "i am human too, i feel sad too, i do wrong too, but the point is that i know you are not good. that's the hardest part.", "Mon Nov 29 18:36:19 ": "I found this videoclip so nice! the making of -&gt; http://www.youtube.com/watch?v=e0HwID7bRII", "Thu Dec 09 00:16:05 ": "hoje eu descobri algo que muda tudo, e pra muito melhor! sem contar que agora é FÉÉÉÉÉÉÉÉRIAAAASSSS - semestre mais estressante da vida!", "Mon Nov 29 17:33:49 ": "amor e vingança!", "Mon Nov 08 00:13:06 ": "some people think they're always right... http://www.youtube.com/watch?v=pBgVtT3qA2M :-D", "Thu Jun 09 14:36:19 ": "Não consegui ingresso para o Planeta Terra Festival. Pqp! Acho super justo haver outro show do The Strokes em São Paulo.", "Sun Nov 14 15:22:42 ": "Meu preferido, hihi, não ia demorar pra levar esse campeonato mesmo, mas hoje foi surpreendente. O cara tem muito talento, admiração total", "Sat Oct 22 19:27:37 ": "are you happy?", "Thu Nov 18 21:01:16 ": "tou reclamando da vida pra minha mãe e ela escuta tudo. até que ela vira pra mim e diz: e o pulso? eu respondo: ainda pulsa. e ponto final.", "Thu Nov 25 19:01:59 ": "strokes and cigarretes", "Fri Nov 26 21:03:52 ": "se a sua fantasia improvisada estivesse uma merda o que vc faria?", "Sat Oct 09 01:22:33 ": "RT @Foresti: O twitter é o único lugar onde o ser humano tem duas bocas e um ouvido...", "Sun Apr 29 05:27:57 ": "Acabei de publicar uma foto http://t.co/EVkbDron", "Wed Aug 24 15:56:42 ": "Say good bye to tomorrow.\nAnd Hello to today.\nTake a look at your world in a brand new way.", "Thu Oct 21 00:10:14 ": "Semana de comunicação começou fraca #IssoEhMackenzie", "Tue Apr 19 00:01:49 ": "@realwbonner muito bem e vc?", "Thu Oct 21 00:08:38 ": "@mariliamiarelli já a minha de digital signage não me trouxe nada de novo, só falou tdo o que eu já sei... e a \"tia\" da lista era uma bruxa", "Thu Dec 02 23:58:04 ": "todo mundo já deve ter ficado muito, mas muito de saco cheio da faculdade uma vez na vida. eu só queria explodir a minha.", "Sun May 06 15:58:07 ": "Bicho preguiça, meu bonitinho http://t.co/dTKjjr2t", "Sun Sep 26 20:06:24 ": "F1 is not a sport, it's a game. but i like it anyway", "Thu Jul 05 03:14:14 ": "Salve o Corinthiaaaannnnnssss! O campeão dos campeões! taça na mão, LIBERTADORES É DO TIMÃO!", "Wed Nov 24 22:33:30 ": "A Ferrari inaugurou o seu parque de diversões em Abu Dhabi c/ a montanha mais rápida do mundo  http://www.youtube.com/watch?v=Zd9A6X5Fh9I", "Wed Aug 24 16:37:34 ": "Ben Harper - Rock N' Roll is free #TodaysBestSong", "Thu Nov 18 15:47:43 ": "@RafinhaSilveir puta merda viu! vou fazer uma macumba pra sua chefe, ela vai ver só!", "Sun Sep 26 20:03:15 ": "Corrida comum ñ tem graça. O q dizer do próprio Kovalainen dando uma apagadinha no incêndio do seu carro, como se fosse comum, tranquilo...", "Wed Apr 20 02:33:41 ": "@suchsmallhands_ eu quero muito, mas tenho muito trabalho da facú e pouquíssimo dinheiro. tou fudida amiga!", "Thu Jun 09 14:38:59 ": "Quem correu, comprou Mas é foda quando você curte pra caramba a banda e os ingressos acabam em algumas horas enquanto vc estava trabalhando", "Mon Nov 29 18:09:02 ": "hahahah calma @RafinhaSilveir, até porque quem se ferrou foi só ela (ahhh se fodeu! hihi)! e vc não vai ter que atura-la, seja ela quem for", "Fri May 25 18:23:21 ": "Chapoliiiiim colorado! http://t.co/tzZAwCOs", "Mon Nov 29 18:06:04 ": "nooooooossa! @RafinhaSilveir que maldade! que maldade!"}