{"Sun Feb 03 03:13:36 ": "When is #TaylorSwift going to grow up and stop singing about #highschool #relationships?", "Sun Jan 20 23:08:46 ": "Left at home again, no one wants to play with Barbee:( #NoLove", "Sat Feb 23 01:51:00 ": "My locker combo didn't work, I pray to God nobody messes with my stuff this weekend #crossyourfingers", "Fri Feb 01 17:21:40 ": "In journalism watching some short film and the main character is the guy who acts as Anakin in #StarWars", "Thu Sep 01 23:45:03 ": "You look like yo momma with ur moustache, I like that!! (Favorite moment of the day:D)", "Sun Feb 17 22:25:44 ": "Looked at cars today, out of all of the dealerships in Concord and Salisbury, we found absolutely nothing:/ #desperate #dudewheresmycar?", "Mon Feb 04 12:11:38 ": "Listened to red hot chili peppers on the way to school, todays gonna be a good day:)", "Fri Mar 08 19:42:41 ": "Hours game today, wish me luck:)", "Sun Feb 17 03:32:17 ": "I usually find #inspiration in my #shower , but tonight it was to no avail :(", "Fri Feb 15 16:14:01 ": "Lord help me not #chokeabitch. I just hope I can keep this anger until softball where I can beat the shit out of that ball", "Wed Jan 23 01:05:33 ": "The internet is boring me #yawn I guess I'll be off for the rest of the night #hastaluago", "Sat Feb 02 22:26:52 ": "Three 12 year Olds were sitting behind us in the food court and they just made our night:) We laughed so hard #hoopsrinritenow #omgpink", "Fri Feb 15 01:25:43 ": "2 people told me to \"have a nice shower,\" this shower better fulfill their wishes :) #dreamcometrue #waterfall #aquaman", "Tue Feb 05 23:04:26 ": "Just got back from running with Sophie, we walked more than we ran though hahah we've got tryouts next week so #crossyourfingers", "Tue Jan 15 22:57:44 ": "Heading to body pump at the gym #100waystodie", "Sat Feb 16 18:50:16 ": "Finished my SAT:) #theperfectscore", "Thu Sep 01 01:39:57 ": "Wat is it with me and Bobby Brackins?? His songs have been in my head all week! 143 ft Ray J was in my head, but now 180 ft Jeremih is o ...", "Thu Aug 25 10:52:36 ": "I only got 4.5 hours of sleep, and I still got up better than my mom. :)", "Fri Mar 01 11:29:13 ": "It's Friday! Friday! You know what that means? We gotta get down:) #RebeccaBlack #Friday", "Wed Feb 06 23:13:34 ": "I feel awful:'( I hope to #getwell soon, I should take some Nyquil #answer4everything", "Sat Mar 09 01:50:53 ": "We're not going to go see oz :(", "Sat Feb 02 17:13:07 ": "Might go to the mall later with Oronday... #forever16 #star(gimmeyo)bucks #firstlove", "Sun Feb 17 17:37:35 ": "Ahh finished my article, hope the staff likes it, in my opinion: 100x better than the last:) #pumped", "Sat Sep 03 23:20:22 ": "Pretty Girls Jerk Too &lt;3", "Fri Feb 15 01:11:08 ": "Tommy said he would be my Valentine &lt;3 yay!", "Sun Jan 20 20:06:29 ": "It's so nice outside, too bad I can't #longboard :/ left it at my moms...", "Sun Jan 27 15:36:47 ": "My friends little brother has forever had a crush on me..so when he saw me last night, he fainted:) CUTEST THING EVER", "Sat Mar 30 23:38:58 ": "Had a fun day:) saw Tommy #potentialbf", "Fri Feb 15 22:22:13 ": "so fucking pissed, I had a horrible practice", "Thu Aug 25 18:13:16 ": "Idk about u, but I got all the CUTE boys in my classes.", "Wed Feb 13 19:31:59 ": "Softball tryouts, ahh I'm so nervous. I got this though:)", "Wed Apr 17 19:51:02 ": "My knees hurt from crawling around like a hermit crab during theater yesterday #notaho #theatregeek", "Fri Jan 25 23:12:21 ": "School let out early because of #FrozenToes And ice on the roads", "Tue Mar 05 21:56:57 ": "Had a great practice, I'm proud of myself:) #makemeproud", "Wed Feb 13 17:29:52 ": "Tryouts are after school, I hope they're outside because I don't have tennis shoes besides #converse hahah #dontquit #motivation #softball", "Tue Jan 29 15:09:30 ": "My science teacher is making me listen to these awful songs about science. My ears are about to bleed:(", "Fri Feb 15 17:34:16 ": "\"I could tell it was u by Ur butt,\" gotta love La-Nay-Nay :)", "Mon Feb 04 17:14:26 ": "Have to interview some guy, please don't screw this up please don't screw this up hahah", "Fri Feb 01 20:32:08 ": "Math tutoring Kailey and Sophie. If u could think of someone dancing and doing hw simultaneously, that's us", "Fri Feb 15 01:12:02 ": "Today was fun! Had softball practice, and the Valentines dinner. So. Much. Fun. I love all of my friends", "Wed Jan 30 21:54:47 ": "Running errands with mi madre. So far, I haven't almost crashed into anyone today! :)", "Sun Mar 10 02:58:17 ": "Saw #oz the movie was absolutely terrible. The only reason why I didn't walk out of the theater was because I had such great company:)", "Thu Feb 14 02:28:26 ": "If I hum my favorite tune in the shower, is that considered #singingintherain ? #mindmatters #curiosity", "Thu Feb 21 22:58:40 ": "Locker room drama and now I fucking smell like lotion. Thanks girls -_-", "Wed Feb 13 17:24:20 ": "Theatre performances next period, I hope I get that line right hahah #performingarts #aliceinwonderland #crossyourfingers #hope4thebest", "Wed Apr 10 21:54:34 ": "Have u ever combined the aromas of sunflower seeds and popcorn? What would u call that? Popflower seeds, sunflowercorn, cornseeds hahah:)", "Sat Feb 16 02:24:18 ": "I have my SAT tomorrow, oh I need sleep hahah but a shower first! #theperfectscore", "Fri Mar 29 19:20:28 ": "Shopping at #papaya with Kailey:) #girlsnightout", "Sun Feb 03 03:23:13 ": "Is it normal to kiss Ur ex bf? #ghettoPrinceCharming #barbiemeetsKen #wakingwiththeenemy", "Fri Jan 18 22:03:58 ": "I'm so glad somebody invented google #chrome", "Sun Feb 10 01:06:34 ": "On my way to semi with La-Nay-Nay #Cinderella is in her carriage", "Wed Apr 10 02:03:02 ": "Got my braces off today :) #orthofree #freedom #spreadmywings", "Tue Feb 19 02:49:08 ": "I love softball season, I always find these little cuts and bruises that I don't remember getting hahah #sports #PassionForaThrashin'", "Sat Feb 23 01:50:11 ": "Been a dramatic week; might get a car soon, if only I could go get my license -_- couldv'e gone today but my mom was sick", "Wed Feb 27 21:22:09 ": "Lol:)", "Sun Feb 10 06:26:24 ": "Tonight was good! Fun! Tried to impress this guy, dont think it worked he's short anyway so forget about it. Daniel thinks I'm drunk I'm not", "Mon Jan 28 20:56:18 ": "#you'remoreattractive if u have brown eyes", "Sat Feb 09 17:30:21 ": "Tonights semi formal at my school. Need to do my hair, makeup And make alterations to my dress. Wish me luck #Cinderella4anight", "Mon Feb 25 22:15:48 ": "It's so cold, I can literally feel my blood freeze #stupidncweather #coldaf #lickapole", "Wed Feb 13 03:21:33 ": "If Ur horny, let's do it...ride it, my #Pony. Ugh #EdSheeran did a beautiful cover of that #song #gingerwithasoul", "Tue Feb 26 21:28:01 ": "I can't believe I didn't get my license today. I'm thoroughly pissed. I'll go tomorrow morning", "Mon Feb 18 10:51:26 ": "I don't wanna get out of bed :( someone come drag me out, or join me, whichever u prefer ;D", "Thu Mar 28 22:55:42 ": "Didn't think we had practice today, worked out in skinny Jeans :/ #athleteprobs", "Wed Jan 30 01:34:22 ": "Home from the #basketball games at #Robinson Got to hangout with Tommy and Sophie and it was lots of fun:) maybe we can do it again?", "Fri Mar 29 01:43:49 ": "My cars mileage reached 55555 today:) #tear", "Tue Feb 12 22:33:45 ": "Tomorrow is softball tryouts, need to get a physical...hopefully it's not too late #procrastinator #drama", "Sun Jan 20 15:41:41 ": "Going to church #hallelujah #praisethelord", "Thu Sep 01 01:41:39 ": "I hate this 140 character limit. Wat do u expect me to say with only 140 characters?? Hi, my day was great wbu?? #blehh, stupid twitter", "Tue Feb 05 03:48:46 ": "#commonsense isn't so common #WassupWithThat", "Wed Feb 13 21:29:25 ": "Ok those weren't tryouts, that was a meeting hahah so tomorrow will be \"tryouts\" or practice I guess", "Wed Jan 23 17:27:58 ": "Hanging with Sophie and Kailey #2whitechicks #thuglyfe #2skool4cool", "Tue Jan 15 02:58:50 ": "Getting back on here. Someone wanna remind me how this works? #help", "Thu Feb 21 01:33:11 ": "Ughh family issues #babymamadrama", "Fri Apr 12 16:57:45 ": "Theater field trip to see \"Romeo.Juliet\" #backseatthug", "Thu Apr 11 01:22:14 ": "Riding home from the away game at Carson. A fill stomach...and It's dark and quiet, this is so relaxing:)", "Sun Feb 03 03:16:34 ": "If someone says they \"hate Taylor Swift,\" then they shouldn't kno every word to her songs #justsayin #tweenageddrama", "Mon Aug 22 21:35:30 ": "At open house and I see ketchup!! Its in ms.blackwells room", "Sun Jan 27 05:18:51 ": "Having a sleepover with my friends #goofygoobers", "Sun Aug 28 23:49:53 ": "I got a booboo:( its on my leg and hurts like crap.", "Mon Feb 04 01:48:17 ": "Nobody likes cake brownies #fudgeyalltheway", "Mon Aug 29 10:14:14 ": "Its dark outside:/", "Sat Feb 09 22:54:00 ": "Everything is going good so far. My dress is ready, jewelry is picked out, makeup is done. All that's left is my hair. #diva #princess", "Sun Apr 14 16:56:48 ": "Family day, I need to wash my car :/ #dirtybug", "Wed Feb 27 21:26:38 ": "My problem is I'm peaceful", "Thu Feb 07 19:45:27 ": "Got a ton of hw, should hopefully be able to write my article tomorrow:)", "Mon Feb 04 01:47:37 ": "#Beyonce can't help it, she's just so hot she blew the lights out", "Thu Jan 31 01:58:24 ": "Tomorrow is my moms 50th #birthday I hope she has a wonderful day, she deserves it &lt;3", "Sat Sep 03 15:53:49 ": "Softball practice this morning, and let me just say, I. need. help. It was pathetic :/ #smh", "Sat Jan 19 17:38:32 ": "Chillin out, maxin, relaxin all cool #FreshPrince", "Wed Mar 06 17:33:18 ": "I made a #snapchat ! At first I thought it was stupid, now I find it entertaining:)", "Sun Feb 03 20:20:14 ": "I've heatedly debated who was the best singer out of Rihanna, Beyonce, or Alicia Keys. Alicia Keys all the way #SuperSunday #Ravens #49ers", "Sun Jan 20 03:25:29 ": "Eating dinner with my cousins #Beauty&amp;theFeast #FamilyMatters", "Fri Aug 26 18:40:19 ": "I can't believe I got nervous today, Like butterflies and all, over practically nothing! :/", "Thu Feb 21 16:18:36 ": "If u want to listen to music while studying or doing hw, put on some John Legend :)", "Sat Sep 03 00:14:52 ": "Who survived the storm??", "Sun Feb 17 03:29:44 ": "I hate talking to someone when they're sitting down and I'm standing up. It's like #dudewheresmychair?", "Mon Jan 21 16:12:16 ": "Just got back from the gym, went to this kettle bell class, woah my #Cardio was worked! Ran steady pace for 15 mins, #proud of myself:)", "Tue Jan 29 10:58:56 ": "Going to the game today, must verify if there is one first hahah", "Sat Mar 02 18:58:51 ": "Woke up to my car in the driveway:)", "Fri Feb 08 17:20:31 ": "My entire journalism class knows the #Pokemon song! That's so legit hahah #pokiedorks", "Fri Feb 15 19:33:06 ": "\"Can we switch shirts? Cuz I'm not allowed to run around the school without a shirt on, but u are\" ...the things I've heard today:/"}