{"Wed Mar 13 22:27:48 ": "RT @mgadda: White smoke rises from the Gadda conclave in Avignon this evening.", "Fri Mar 15 04:47:42 ": "A Pi-day birthday is already good. Even better spent w/ some close family, and phone calls from kids/spouses, bro, mom, and childhood BFF.", "Wed Feb 13 04:19:42 ": "@kidchamp sorry to hear about your kitty :(", "Fri Sep 07 17:48:39 ": "Who knew? Vanilla extract in cream creates a fractal. http://t.co/MNefZPWD", "Fri Nov 09 19:50:13 ": "All ukulele players should share their laps with an appreciative kitty while they play. http://t.co/tIlMC5uL", "Wed Jan 02 15:51:07 ": "Il neige!", "Mon Jun 25 00:35:32 ": "At ISF, Charlie scanning the crowd on the terrace trying to find someone who might need schmoozing.", "Thu Jun 21 13:26:44 ": "My other car is a Bobcat...dead in the driveway. http://t.co/3HKGv7Dg", "Sat Jan 26 03:20:23 ": "@kidchamp nope...my own creation :)", "Fri Apr 12 21:00:27 ": "My Strbx is playing fantastic blues this afternoon.", "Sat Aug 25 02:28:04 ": "Green show talent. Ashland. You should be here.", "Wed Aug 15 22:04:00 ": "Battered Toyota Tercel, 4 heads bobbing in sync, 2 guitars, a high hat, and an amp piled high. Garage band today, famous tomorrow?", "Fri Jul 20 02:01:03 ": "@lady_gadda Finally made it to the Louvre, I see!", "Fri Jun 29 13:11:01 ": "For everyone who gave a young sib a haircut: RT @corinnepurtill: Thank you for making my morning, @jeffcohenwnpr. http://t.co/y6r0DBmT", "Thu Mar 28 16:18:40 ": "Sitting in the courthouse jury room waiting to find out if I'll be sitting in judgment of someone today.", "Mon Oct 29 03:51:00 ": "Congrats, Giants!", "Wed Jan 30 19:08:38 ": "What will it take?? http://t.co/wqtiwRG4", "Sat Sep 22 23:08:26 ": "One of my extra kids is now a licensed architect with a job. He overcame a lot and made his dream come true. I'm so proud!", "Mon Feb 18 18:30:02 ": "OH at Strbx: \"I want a venti iced coffee with 5 shots, 9 pumps of caramel, and 9 of vanilla syrup.\" Diabetes to follow.", "Sun Jun 10 01:05:01 ": "Fresh snow, again! It's June, Mother Nature.", "Fri Dec 07 13:34:56 ": "Thanks TSA for the back rub, an unexpected bonus after being scanned.", "Thu Apr 04 23:54:46 ": "Now that New Years' fitness resolutions have tanked for many, there is no longer a shortage of early morning parking spaces at my Y.", "Sat Apr 13 21:21:35 ": "It's 51 degrees, but the wind is howling, and snow is falling on my windshield. Normal crazy spring in Idaho.", "Sun Oct 07 18:34:06 ": "5 marathons! Way to go, Jen!", "Thu Nov 22 18:40:19 ": "Henri--sleeping off his Iams turkey dinner http://t.co/xXrhstKN", "Fri Aug 03 05:17:08 ": "Henri's favorite channel--APL http://t.co/7WbsqSK7", "Mon Apr 08 17:44:29 ": "35 years ago today someone wonderful happened to me.", "Sun Jul 15 18:51:43 ": "@lady_gadda (1) Paris, (2) Palo Alto, (3) Boulder...and (4) Boise", "Mon Mar 04 00:09:56 ": "@kidchamp Sounds like a most excellent day!", "Fri Jan 04 02:47:56 ": "Line dancing tonight. Happy feet!!", "Fri Aug 17 16:58:20 ": "Breakfast in Tahoe, lunch in Napa, dinner in Berkeley, bedtime in PA. All with loved ones. A very good day ahead!", "Fri Feb 01 16:09:55 ": "You know it's time for your pilot to retire when he announces that he's using a slide rule to calibrate the aircraft's weight and balance.", "Thu Jun 14 00:02:44 ": "1973. Young and skinny, and we'd just moved 16 miles from a ski area. Like winning the lottery! http://t.co/buDDwUYV", "Thu Feb 14 04:36:46 ": "@kidchamp I'm blown away by your project! It's going to a stunning heirloom when you finish hand quilting it. I cheated &amp; used a machine :P", "Tue Apr 02 01:28:54 ": "Len: \"Andy, you're like a sneeze. You know it's coming, but you can't do anything about it.\" #dwts", "Sun Jan 06 21:31:53 ": "I'm learning Italian with Duolingo. Free, effective, fun! Thanks, @mgadda!", "Tue Apr 16 16:58:38 ": "If you woke up with 2 good legs, take a moment to pray for those in Boston, our wounded soldiers, all w/ mobility problems. #BostonMarathon", "Fri Sep 28 18:23:59 ": "Ira Flatow is broadcasting Science Friday from my hometown today. Very cool!", "Thu Sep 20 00:13:52 ": "A good friend's son has been arrested for grand theft. Stealing high-end golf clubs and selling them on Craig's List. Sad situation.", "Sat Sep 22 21:36:43 ": "Young love blooming between the irrigation boxes in the park", "Sun Feb 10 23:13:01 ": "What is that great burning orb in the sky? Have we sinned?", "Sun Oct 07 01:31:03 ": "@kidchamp a quilt", "Fri Dec 07 20:49:23 ": "Today I achieved invisibility--in front of an audience of hundreds!", "Thu Aug 02 22:48:54 ": "These only grow in Boise http://t.co/K5nzCtLT", "Wed Dec 19 21:59:48 ": "Strumming Christmas carols on my homemade uke at IAH, hoping to start a spontaneous singalong, but I'll settle for coins or smiles.", "Tue Sep 04 15:08:00 ": "RT @corinnepurtill: \"Should I not give him hot peppers? If he spits up, should I have him put to sleep?\" I can't stop laughing. http://t ...", "Fri Jun 29 21:33:20 ": "You play your ukulele while in the car wash, too, right?", "Sat Jan 12 16:01:28 ": "Nope. I'm not skiing today, as it's minus 10 degrees. 10 above? Sure.", "Sun Feb 10 17:08:56 ": "From Wait, Wait yesterday: a dating website for really old http://t.co/C6atoGl2", "Sat Mar 09 18:43:19 ": "@kidchamp Poor kitty. Poor Lauren. I'm sorry the news wasn't better.", "Wed Feb 06 19:16:33 ": "@kidchamp 23", "Fri Dec 21 06:03:14 ": "This guy does it all...and then some! http://t.co/omJjdyUl", "Mon Oct 22 14:09:53 ": "The knot was tied--beautifully!!!--and followed by an amazing party! Best wishes Ben and Jen, and thank you to all who helped.", "Mon Oct 22 18:00:55 ": "Snow line is a scant 100' feet above us", "Sun Mar 31 13:38:30 ": "It can't be Easter, because the wind isn't blowing sheets of rain and sleet at us. Doesn't Mother Nature care about tradition anymore?", "Thu Apr 18 17:10:01 ": "Just in: Due to recent flooding, a high school in Libertyville, IL, sank a foot into the ground, according to the local Fire Dept! Wha?!", "Sat Mar 23 21:02:29 ": "@kidchamp Never was a cat so loved. Chuck's had a blessed life having been adopted by you.", "Tue Dec 18 19:16:05 ": "Your left hand has phone to ear; your right gestures wildly to the caller. So you are steering that veering Lexus with ... what? your knees?", "Thu Dec 20 00:14:43 ": "There's a real air of excitement as we board this brand new type of aircraft! Hope it turns out better for us than those who took Titanic ;)", "Tue Oct 23 15:54:46 ": "When I left, it was fall; one wedding later, I returned to winter.", "Tue Jan 29 16:18:12 ": "My beautiful wintery view this morning http://t.co/mvmDlGU7", "Fri Jun 22 13:10:45 ": "I keep having dreams in which I'm back in Paris, hoping to spot M&amp;C.", "Thu Jan 17 16:19:26 ": "Woke up this morning to a 3-degree-F. hoary wonderland http://t.co/kp4WAdl9", "Tue Jul 24 18:05:02 ": "The one thing worse than a car that's acting up is having the mechanic tell you he can't find anything wrong. Argh!", "Tue Mar 19 02:52:36 ": "@DancingABC We want to see Tom Bergeron as a contestant and Kenny Mayne as emcee next season.", "Wed Aug 01 13:27:20 ": "Rabbit!", "Fri Jun 22 13:21:30 ": "\"Sans la musique la vie serait une erreur.\" (Nietzsche)", "Mon Apr 15 19:45:50 ": "What kind of crazy person sets off bombs at the Boston marathon?????", "Mon Oct 22 14:34:38 ": "Something ugly this way comes...glad to be just east of the Sierras", "Fri Apr 12 21:24:50 ": "Blues and Italian go together well!", "Sat Sep 15 15:05:57 ": "Friendly fox at my feet http://t.co/u7EXyDmC", "Wed Dec 19 21:57:03 ": "OH @ IAH: \"What should I serve at an apocalypse party?\" \"Humble pie?\"", "Sat Jun 23 14:45:42 ": "Happy 100th, Alan!", "Mon Jul 09 04:18:04 ": "Roger's my tennis hero: #1 in the world doesn't use a two-handed backhand.", "Thu Dec 13 02:35:36 ": "Songbirds have found my feeder. Unfortunately, a peregrine falcon perches in my apple tree waiting for its dinner to fly in.", "Fri Jan 18 00:35:49 ": "@lady_gadda Is that Mirabelle?", "Thu Sep 20 18:02:02 ": "Just when I thought the smoke couldn't get any worse, it did. Cough, cough...", "Sun Feb 24 06:02:39 ": "My sweet Henri http://t.co/QAoFabaKqs", "Sun Dec 23 19:54:53 ": "UFO? 8:52 pm PST on 12-19-12 http://t.co/jb6hhzt3", "Fri Oct 26 23:52:51 ": "\"Good Americans when they die, go to Paris.\"  --Oliver Wendell Holmes, 1858 (32 years before Oscar Wilde)", "Sun Jul 08 18:54:44 ": "Well done, Roger!", "Sat Jun 23 19:24:01 ": "One of my favorite restaurants http://t.co/LrblroWT", "Sat Oct 20 05:46:54 ": "@kidchamp Stunning! You're the best! A thousand thank you's.", "Wed Jun 20 02:09:34 ": "RT @mariabustillos: For the ages: David Lowery explains to a college-age DJ why she should pay for music.  http://t.co/VABkxJpV", "Fri Jul 20 12:51:44 ": "View out the bedroom window this morn was a red fox looking in at me--nice!", "Fri Dec 07 22:23:46 ": "All dressed up for the holidays http://t.co/obN0LrxF", "Tue Jul 10 23:04:54 ": "Sitting' on my porch swing, strumming' my homemade uke. Joy! http://t.co/hN3AXQ5q", "Mon Dec 17 20:06:41 ": "RT @claytoncubitt: Instagram's suicide note. http://t.co/qT1p4tqd", "Sun Mar 03 05:41:35 ": "@mgadda Now I understand your work life, haha!", "Mon Jan 07 06:37:40 ": "Nobody touches my F. Scott Fitzgerald! http://t.co/Zbpi1CyX", "Fri Mar 22 01:54:41 ": "Boys in next car headbanging to heavy metal wearing BMX helmets. Sons of helicopter parents?", "Thu Jan 10 05:13:25 ": "Nixon, from 5/20/77 televised interview w/ David Frost: \"When the President does it, that means that it is not illegal.\"\nOh, really?", "Sun Mar 03 07:18:23 ": "Dang it, Duolingo! Why do you have to be so addicting? Another 2-1/2 hours just slipped away!", "Wed Aug 15 22:07:41 ": "@lady_gadda Your political views were showing even then ;)", "Fri Oct 26 22:04:01 ": "Shame on you, John Sununu!", "Sun Sep 16 03:18:26 ": "Bright green, slow-moving object in the night sky over McCall just now!", "Mon Jan 21 19:39:49 ": "Haven't seen so much as a blade of grass in three weeks. We're shooting for a record duration of snow in town.", "Mon Oct 29 15:18:11 ": "@kidchamp Stay safe!!", "Tue Jun 12 17:42:21 ": "Forty-one down, forty-one to go, with luck ... and medical advances yet to be developed.", "Mon Dec 31 05:48:44 ": "My 91-year old mom received a blessing from a passing Tibetan monk today :)", "Sat Jan 26 01:02:38 ": "@kidchamp here's my first, just finished http://t.co/WpXuCl3A"}