{"Thu Jan 10 03:42:39 ": "@saranghaeYANG Talaga! Kaya kayo, masyado na kayong marami, magbawas-bawas naman kayo. LOL.", "Tue Mar 12 06:12:40 ": "RT: \"I dont need a PERFECT ONE. I just need someone who can make me feel that I'm the ONLY ONE.\"", "Thu Nov 08 16:47:29 ": "@Jjaamiiee Yesyesyow! Bakit ganun? Hindi ko pa makita. :/", "Sun Nov 18 16:39:40 ": "Kung ganyan naman palagi ang makikita ko every Sunday (Paulo Avelino) aba mas gugustuhin kong gawing araw-araw ang Linggo. Sooo... :\"&gt;", "Thu Feb 14 04:41:51 ": "@saranghaeYANG, weh? Parang hindi naman, eh. :(", "Mon Nov 12 14:13:09 ": "RP: Ang tubig, lalabo kapag nahaluan ng lupa. Ang love, lalabo kapag may nakisaling malanding hampas lupa. =))", "Sun Feb 03 06:28:23 ": "@Jjaamiiee Nand'yan na si Aling Mataba? Haha.", "Sat Nov 17 17:05:19 ": "LOL RT @ComedyPosts: Did you know if you scream \"bloody marry\" 3 times in the mirror at 3AM your mom will tell you to shut up and go to bed.", "Wed Feb 27 11:32:11 ": "If you're mine, you're only mine. ;)", "Fri Nov 09 18:49:20 ": "Masarap matulog sa piling n'ya. Haay, kung pwede lang araw-arawin. :/ ♥☺♥ :\"&gt;", "Sat Mar 09 09:03:49 ": "Ayon, talo! #UAAP =)))", "Wed Jan 02 15:13:44 ": "Ubusin ang pera ng bangka!!! Haha RT @Jjaamiiee: Lucky 9 with @poreberyoung, Kuya Mike, Ate Beth and EJ! Hahaha.", "Tue Feb 26 03:52:57 ": "I'm a girl. And yes, I hang out with guys because it's less drama. #SaturdayNight, bilisan mo! =))", "Tue Mar 12 06:46:06 ": "@saranghaeYANG Ewan ko. Ikaw na mismo nagsabi na ipaparamdam mo, eh.", "Thu Nov 22 10:28:22 ": "RT @Jjaamiiee: On our way to Bluewave for Paulyn's 10th with the extended fambam. We miss you @nenenjenna!!", "Tue Mar 12 06:38:35 ": "@saranghaeYANG So, meaning dati hindi mo na-iparamdam na ako lang? Ano'ng ibig sabihin nun?", "Sun Nov 18 16:18:05 ": "Ang ganda lang ni @ilovegeorgina. Kamukha talaga n'ya si Leighton Meester. #GorgeousGeorgina", "Sat Mar 09 12:37:56 ": "Saan kaya pwedeng makita si Rowel? Mahanap nga. Nyahahaha! #MMK", "Thu Feb 14 22:54:43 ": "RT: When a #Capricorn is pissed or irritated leave us the hell alone or your feelings will become extremely hurt extremely fast.", "Wed Nov 14 12:44:37 ": "Daig pa bumili ng new housing. =)) RT @krizzy_kalerQUI: lecheng tindera... KWARENTA ang singil sa pagcharge ng cellphone. #InaKapatidAnak", "Sat Nov 17 12:41:00 ": "A GOOD man is hard to find. #MMK", "Sat Nov 10 14:02:03 ": "@imrealDIANNE's birthday. Partey-pertey with @meaceC, @saranghaeYANG, Aaron, Dandan. Waiting for @shammysamsam and @MykaLuna. =))", "Wed Mar 27 16:27:02 ": "Tinamad ng mag-jog. Makapanuod nalang ng Saw. (Anong konek?) Hahaha!", "Wed Mar 27 15:24:01 ": "The game begins in 3...2...1... GO!!! *beer* (y) &lt;=-P", "Mon Mar 04 14:36:54 ": "Alam mo 'yung pakiramdam ng nagsasawa't napapagod (ng sabay)? Eto 'yon eh... &lt;/3", "Sat Nov 17 10:10:33 ": "Never gonna know if you never even try. ♥#3♥", "Sat Feb 16 14:51:23 ": "Eh, 'yung nakita ko si Yeng sa Arena after ng concert ng Fav.band ko? Shet, ka-starstruck ka, @YengPLUGGEDin http://t.co/3Cqu7Fym", "Mon Jan 07 06:54:05 ": "@saranghaeYANG Oo nga, kaunti nalang kaming seryoso. Ahahaha!", "Tue Nov 13 18:11:19 ": "#PatamaSayo :/ RT @rinabels: Sabi mo Mahal mo 'ko.. tapos hindi ka pa pala nakaka-move on sa Ex mo. #AnoBaTalaga", "Sat Nov 17 10:22:57 ": "'Yung lalaking pasikat kapag may magandang kasama. Ipakain na 'yan sa leon. =))", "Mon Jan 07 06:54:50 ": "@Jjaamiiee Buset! Para kung pupunta ka, sabay nalang tayo. Ok?", "Sat Mar 23 18:22:19 ": "@Jjaamiiee Aaaaahhhhhh. Ginutom ako, Eyp. Gusto ko tuloy ng hotdog sandwich. Makapagluto nga. Gusto mo? Ahahaha!", "Thu Feb 14 15:57:17 ": "Nawawala 'yung ticket ko ng Paramore. ☹ :'(", "Wed Jan 16 04:03:01 ": "\"When words fail, music speaks.\" ♫♫♫", "Fri Mar 01 11:02:01 ": "RP: Seeing boys play with little kids is probably one of the best things ever. #TurnOn &lt;3 :''&gt;", "Sat Nov 17 11:49:28 ": "@Jjaamiiee Binuksan naman?! Hindi naman naka log in ang account mo dito. Patawa ba u?", "Tue Nov 13 08:29:54 ": "Sheeeeet!!! Can't wait! ♥.♥ RT @thescript: We're heading to Philippines, Manila, Araneta Coliseum.", "Sun Mar 24 18:16:06 ": "@Jjaamiiee Aba bakit? Shot ka din?", "Thu Feb 07 07:28:43 ": "He's dancing with another girl. ☹", "Sun Mar 24 17:48:48 ": "Shot? =))", "Thu Feb 14 16:58:42 ": "Parathrilla in Manila once again! Woohoo! Excited much? =))", "Sat Mar 23 17:24:03 ": "Kakatapos lang mag-jog with @Jjaamiiee, Breana and CJ. Kapagod pero ang saya lang. Naka-ilang kilometro ba tayo, Eyp?", "Sat Mar 09 12:26:18 ": "Kung ganyan ba naman lahat ng lalaki... :\"&gt; #TurnOn &lt;3 #MMK", "Wed Mar 27 16:24:10 ": "'Wag mong sabihing malungkot ka, kahit alam mo sa sarili mong hindi naman talaga. Good night!", "Sun Nov 18 09:07:33 ": "@Jjaamiiee Oo. Bakit? Hindi ka pa pupunta dito?", "Sat Mar 30 06:56:45 ": "Pagod na nga, masakit pa pati ang buong katawan. Ngayon naman, pati ang paso ko sa braso, sumasabay. Ang hapdi! :( #HomeAlone", "Sun Nov 18 16:29:38 ": "RT @krizzy_kalerQUI: oh gooosh ang noches ni #pantycreamer @mepauloavelino #felixBAKAT #BenchUniverse", "Sat Mar 23 12:40:52 ": "Earth Hour na. Buti at nakisama mga tao dito. Ang dilim, TV at itong laughtough lang ang naka-on, feeling ko tuloy may naka-masid. Hiskeyri!", "Wed Feb 27 15:23:00 ": "\"Na-miss\" ko daw s'ya. Assuming lang? =))", "Sun Mar 10 12:25:32 ": "\"The doors we open and close each day decide the lives we live.\" - Flora Whittemore", "Sun Nov 18 16:34:20 ": "RT: Dear @mepauloavelino, pwede ba next time 'yung kamay ko na lang gamitin mo ha. =)) #BenchUniverse :\"\"\"\"\"\"\"&gt;", "Tue Nov 13 12:15:17 ": "@imSHYGUY8 Done. Followed. :)", "Thu Jan 31 00:35:46 ": "Life is a mirror and will reflect back to the thinker what he thinks into it. \"You are what you think.\" ;)", "Sun Mar 24 19:20:57 ": "Kung kailan patapos na lahat ng ginagawa ko, tska pa... aarrrgggghhhh! Nahihilo na 'ko! Ano bang problema nitong TweeDeck? G-R-R!", "Wed Nov 21 12:22:53 ": "Love is not how much and how loud or how many times you say I love you. But it is how you can prove that you do. ♥ #RT", "Tue Feb 26 05:32:12 ": "RT @Notebook: That awkward moment when your mother compares you to another kid and she has no idea how much worse they are than you.", "Tue Mar 12 06:20:33 ": "@saranghaeYANG Ang alin ba?", "Sat Mar 23 18:43:27 ": "@Jjaamiiee Ayy, oo nga pala. Nawala sa isip ko. Nagluto pa tuloy ako. Mamaya ko na kakainin, kapag ubos na kinakain ko. Grabe ang gutom ko.", "Sat Nov 17 18:43:29 ": "\"Girl, ang swerte mo. Mahal na mahal ka n'yan. Ako pa magpapatunay sa'yo. Mahalin mo s'ya para sa'kin, ha?\" ☹☺", "Tue Feb 26 06:26:19 ": "Sabi nila, masarap daw mahalin ang taong alam mong hindi ka kayang lokohin at pagsinungalingan. Sabi ko; ganoon? Korak! =))", "Sat Nov 10 05:33:29 ": "@imrealDIANNE Bukas ba? 'Kala ko ngayon, sabi ni EJ. Kulang pa ba 'yung bati? Hahaha!", "Fri Nov 09 17:20:42 ": "@imrealDIANNE Happy birthday, tii! Inuman na! =))", "Wed Nov 14 08:13:16 ": "BREAKING NEWS: Girl from #AMALAYER video apologizes to the security guard she had an argument with. Apparently, she said #AMASARRY LOL.", "Sun Nov 25 19:03:39 ": "#MentionSomeoneYouAreAfraidOfLosing @saranghaeYANG :\"&gt;", "Tue Nov 13 18:04:18 ": "RT @iiamjoice: Panay \"I love you\" mo sa kanya pero ang dami mo namang nilalandi.. #AnoBaTalaga", "Wed Mar 27 13:54:18 ": "Wednesday night ay nagkakahulugang alcohol night. Haha. Ligo lang at game na! :D", "Sun Nov 18 14:00:15 ": "Paulo Avelino!!!!!!!!! ♥♡♥♡♥", "Sat Nov 24 18:58:32 ": "That sad moment when your having fun with friends then suddenly your one friend receives a text message saying his grandma's passed away. :(", "Sun Nov 18 18:01:54 ": "@saranghaeYANG Love, parang ikaw lang. Haha. RT: Our generation doesn’t knock on doors. We will call or text to let you know we’re outside.", "Sat Mar 23 17:35:58 ": "@Jjaamiiee Gusto agad-agad? Nikstaym kamo. Buti nga at may kasama s'yang bata eh. Kung wala, malamang mainip 'yan.", "Tue Mar 12 06:23:15 ": "Kapag nagmahal raw ang babae, seryoso. Ayaw nila sa mga manloloko. Dahil kapag sila ang nanloko, asahan mo pati demonyo, sasaludo. =))", "Sat Nov 24 14:52:35 ": "'Yung mga lalaking ka-ugali ni Zoren, #AyyPuta #TurnOn :\"&gt;", "Wed Nov 14 03:54:19 ": "☺ RT @9GAG: If I didn't have a smartphone, I'd be asleep 4 hours earlier every night.", "Tue Feb 05 01:11:42 ": "@ginoboi, bakit ba nakaka-inlove ang boses mo?! Hindi tuloy makawork ng maayos. Haha. Greet mo naman kami dito sa Rosas Garden Hotel. Haha.", "Wed Feb 27 15:05:10 ": "RT: I kinda like someone who gets jealous and protective but still trusts me.", "Thu Feb 14 22:58:11 ": "@saranghaeYANG, ILoveYou more 'noooh?! Haha. Love, kiss mo 'ko, 'yung masaraaap... :***", "Thu Nov 08 10:34:20 ": "May PVL nga, sa TV5 naman ipapalabas. Tss :/", "Wed Nov 14 08:09:16 ": "RT @Pinoy_Humor: #AMALAYER - \"Speaking English in the public doesn't automatically make you a well-educated person.\"\n http://t.co/MlJe29Zj", "Thu Nov 15 05:51:34 ": "'Yung lalaking gwapo, pagdating sa babae ang laki ng respeto. ♥.♥ #AyyPuta", "Thu Nov 08 16:43:16 ": "@Jjaamiiee Ano 'to, Eyp? Bakit January 1, 1970 ang date? Buset! http://t.co/veEKptkm", "Sun Nov 18 13:36:19 ": "Oh God, si Paulo Avelino sa Gandang Gabi Vice. Can't wait.  Shiyeeeeet!!! #GGV :\"\"\"&gt;", "Wed Feb 27 15:32:09 ": "RT: Even if a #Capricorn is pissed at you to the max, if we really care for you we will find it on our hearts to forgive you. Truelaloo!", "Thu Nov 22 13:19:08 ": "Holding hands while walking with my boyfriend-of-the-day, Denzel. ♥ ☺", "Wed Jan 16 00:03:34 ": "@saranghaeYANG Dapat ka lang mahiya 'no?! Akala mo naman kung sino 'tong napakabait kung mag-react. Tsk.tsk.tsk!", "Wed Nov 14 09:26:29 ": "@shammysamsam Awayin ka n'yan. Sisigawan ka sabay sasabihin \"Do u tink #Amalayer?\" Lol", "Sun Nov 18 13:27:55 ": "RT: I'm going to smile, like nothings wrong, talk like everythings perfect, act like it's all a dream and pretend it's not hurting me.", "Mon Nov 12 14:34:28 ": "'Yung ikaw lang daw ka-text n'ya. Instadelete sa inbox, sabay pag-check mo ng sent items, nalimutan n'ya delete messages nila. #HuliKaBalbon", "Mon Nov 12 06:12:46 ": "#OverUsedWords \"I'm sorry\", \"Ok\" and tandadadan... \"I love you\"", "Sun Mar 10 13:18:48 ": "#NP: Bakit Kung Sino Pa. Awts! &lt;/3 :'(", "Sun Nov 18 04:50:59 ": "RT @krizzy_kalerQUI: mukhang ginupit na illustration board lungs yung trophy ng #PPMostLikedAwards. #walangbudget", "Sat Mar 23 18:03:51 ": "@Jjaamiiee Okay lang 'yon. Maganda nga mas mahaba pa ng kaunti ang oras ng takbo natin eh. Oo nga pala, Eyp, pahiram ako ng mouse ha. ;)", "Sat Mar 23 11:59:43 ": "#UAAPStreetDanceCompetition pala ngayon. Hindi ako nakapanuod. :/", "Mon Mar 25 16:26:04 ": "Hindi porket binigyan ka ng second chance, eh aabusuhin mo na. Hindi ako nagpapakasaya para lang lokohin mo! Good luck sa future mo! :D", "Sat Feb 16 19:04:27 ": "RT: Once u lie, u gotta come up with another lie to make your first lie believable. Thats doin too much, just keep it real. ;)", "Thu Jan 17 03:16:34 ": "RT @SoDamnTrue: I go to your page because I miss you, then regret it because of what I see.", "Sat Mar 23 17:27:20 ": "@Jjaamiiee Ayy, awawa naman si Ryz. Itong isa, nanunuod pa ng dibede. Ano, nabitin ba si Brions? Ahahaha!", "Sat Nov 17 14:01:08 ": "=)) RT @jtristeza: Huwag padadala sa negatibong pagdududa. Trust is always be the best to have a great relationship. #MMK #lesson", "Wed Nov 21 17:29:03 ": "@TheScript_Danny @thescript #SixDegreesOUTSunday #SixDegreesOUTSunday #SixDegreesOUTSunday #SixDegreesOUTSunday #SixDegreesOUTSunday Aja!", "Mon Jan 07 06:58:33 ": "@Jjaamiiee Dito sa trabaho ko. Sa Blumentrit ako dadaan. Akala ko nasa school ka, eh.", "Tue Mar 12 06:26:24 ": "@saranghaeYANG Bakit, may magbabago ba?", "Sat Nov 17 13:59:08 ": "Ang swerte naman ni Lyn sa naging boyfriend n'ya. Sana lahat ng lalaki kagaya ni John. Lol. #MMK"}