{"Mon Aug 13 16:42:16 ": "@hamboy7 @555BarcaBoy555 its 2 months early", "Sat Aug 04 17:46:07 ": "@Impolinho @thewranger so instead of focusing on bug fixes you require a member of ea staff to watch every pro game in the world?", "Sat Jan 12 01:34:41 ": "@jswifty250 but why? What can you possibly achieve by having a weapon like that if your not using it to kill lots of people?", "Mon Jul 30 10:38:13 ": "@Opta_Joke second. He's done bale twice now", "Tue Aug 28 21:07:28 ": "@EASPORTSFIFA xbox ut is broken again", "Fri Aug 17 17:19:55 ": "@EASPORTSFIFA 30 pieces of silver #JUDA$", "Sat Mar 16 16:05:48 ": "@RetroGirl hair dye", "Mon Jul 30 20:23:28 ": "@_OllyRiley @TomDaley1994 have you seen the delightful video he has put on youtube? https://t.co/1MInQLix grounds for police action?", "Sat Jan 12 00:55:51 ": "@jswifty250 it was more a point of why do you need an assault rifle? Because that is what piers is asking to ne regulated not hand guns.", "Sun Dec 16 14:47:08 ": "@piersmorgan has nothing to do with video games. Stop distracting from the real issues. It's like saying pedos were children once.", "Thu Aug 02 19:10:05 ": "@ChilledChaos your right its like not the olympics is it.", "Sun Mar 03 15:20:36 ": "#bbcfootball spurs fans saying the exact same thing they said last year. they looked silly then and will look silly again.", "Fri Sep 07 20:58:04 ": "@TheTrout91 both arsenals goals came down his wing last weekend. coincidence i think not?", "Tue Sep 11 13:13:58 ": "@ZerkaaHD put a space between fifa and 13 on bing", "Sat Aug 04 17:44:44 ": "@Impolinho many people do. a separate game mode would be awesome. i think they do it with live season? but its a pay for service so bad", "Sat Jan 12 01:33:23 ": "@jswifty250 no worries. Im a big boy I can deal with people being a bit mean.", "Sun Aug 19 10:02:38 ": "@JOSHFLIP1989 yes", "Tue Aug 14 15:42:29 ": "@Kazooie94 it was only on twitter not anything else", "Sat Jan 12 00:35:43 ": "@jswifty250 because that's what the Dick that is piers Morgan is suggesting. A ban on high capacity mags and assault rifles.", "Sun Sep 02 11:40:45 ": "@Calfreezy he'll probably be a park chu young and not play", "Sat Nov 10 16:37:38 ": "@R9Rai pretty sure they have the 3rd best defense in the league this season", "Wed Aug 01 16:42:02 ": "@Joekelly124 @AntoHo11and but then home advantage should have a much bigger impact. and it doesnt on multiplayer as its unfair.", "Tue Sep 11 14:58:54 ": "@555BarcaBoy555 hold lt to control. It helps", "Mon Jul 30 00:02:13 ": "@Kazooie94 good game man. knew i recognised the name from somewhere when i saw you", "Wed Aug 01 21:58:29 ": "@EASPORTSFIFA OTT buy now with decent bid to allow bidding war", "Sat Jan 12 00:31:27 ": "@Taylor__A @jswifty250 miss 99 times. Then you kinda deserve it to be honest.", "Wed Aug 08 00:24:53 ": "@DavidVonderhaar will the campers be able to use the wall hack scope to make the camping easier?", "Sat Jan 12 00:33:29 ": "@jswifty250 no but you shouldn't need a weapon designed to kill as many people as possible as quick as you can (eg an ar15) for self defense", "Fri Aug 17 15:01:45 ": "@GCIIMessi delightful behaviour for a 40 year old man", "Sat Jan 12 01:21:25 ": "@82ndVet @piersmorgan na you can keep him. Nice arguing btw. You were proved wrong and resorted to insults. That going to solve it.", "Wed Nov 14 11:15:17 ": "@TheRealEboue @Joey7Barton @piersmorgan you can't be a real person. Only trolls respect piers Morgan.", "Sat Aug 04 17:38:23 ": "@Impolinho @TheWranger but then hidden gems wouldnt work. and they would have to restrict it to about 4 leagues to keep up", "Sun Aug 12 19:38:22 ": "@FifaRalle 761", "Thu Sep 06 19:02:05 ": "@DrChiz stepping on a lego brick?", "Sat Jan 12 00:45:00 ": "@jswifty250 I told a joke suggesting it shouldn't take 100 bullets to kill someone. Just because I'm right and you can't handle it.", "Wed Jun 27 21:25:01 ": "@EASPORTSFIFA fail it was nani", "Sat Jan 12 01:18:33 ": "@82ndVet you just said that soldiers wouldn't fire the guns. Answer the question. Who would be firing them?", "Tue Mar 12 15:10:46 ": "RT @budgie: Be glad Papal #Conclave is closed to the cameras. You do NOT want to see the swimsuit round.", "Fri Sep 07 16:56:41 ": "@Impolinho http://t.co/N0WXKa8c there is a new database. makes life easier than chuzzz", "Sun Sep 09 00:44:26 ": "@TheTrout91 class film.", "Thu Aug 30 16:28:34 ": "@KSIOlajidebt big cash boost from the emirates trip?", "Sat Oct 20 16:15:01 ": "RT @Paolo_Bandini: Juventus defender Bonucci - with wife + young son - mugged by thief with gun demanding watch. Bonucci punched him in  ...", "Sat Aug 04 17:46:59 ": "@Impolinho @thewranger i realise they dont seem to focus on it but they should and i would rather they did so than run an unsustainable game", "Sat Jun 23 20:03:45 ": "@Calfreezy he is good with his hands.", "Sat Jan 12 00:37:45 ": "@Taylor__A yer I know. Regret writing that slightly. But a a standard hand gun has what, 8 shots. Should be more than enough.", "Sun Sep 02 11:55:11 ": "@KSIOlajidebt the keyboard warriors will be warming their fingers.", "Sat Aug 04 17:42:06 ": "@Impolinho @thewranger if it was like you suggested it would just become the same teams every week. buying before updates as games finish", "Mon Jul 30 20:53:24 ": "@minda_carter @Rileyy_69 @TomDaley1994 minus the water to land in", "Mon Aug 13 16:41:50 ": "@555BarcaBoy555 werent those in september though so more will probably be incorrect this time.", "Sat Jan 12 00:54:09 ": "@Taylor__A but why do Americans have this desire to own weapons capable of killing 20 people in minutes. Just seems sick to me.", "Fri Aug 17 00:58:51 ": "@bglendenning @Joey7Barton because someone may headbutt him in the chest?", "Sat Aug 04 17:43:09 ": "@Impolinho @thewranger with every person having the team of the week.", "Sat Jan 12 00:58:30 ": "@jswifty250 as I said to someone else this evening the average hand guns shoots 8 rounds-ish. Surely if you miss you gonna get shot back?", "Sat Jan 12 01:11:47 ": "@82ndVet and who would be firing these guns? The politicians?", "Wed Aug 29 22:09:55 ": "RT @arseblog: Song arrives at Barcelona, holes appear between the centre-halves. Coincidence or the Song Vortex?", "Mon Aug 27 00:27:13 ": "@AaronJxD @Calfreezy season 4 picks up big time.", "Wed Aug 15 20:28:38 ": "@Joey7Barton pot calling kettle black?", "Tue Jan 01 15:51:41 ": "@Remiestreete80 mate, you are one of the best defenders on the new FM. class act", "Sun Aug 12 19:38:36 ": "@FifaRalle 765", "Tue Jul 31 00:15:45 ": "@Rileyy_69 @TomDaley1994 you say sorry one tweet then insult in the next. not the best stratergy", "Tue Jun 19 21:51:38 ": "@Rozanneanla @Halo4Promo who the hell is donald?", "Sat Dec 08 16:28:04 ": "@dpgallagher not a chance. his approach is just to resign as soon as things go tits up.", "Wed Aug 15 01:01:35 ": "@Impolinho the players being adjusted with new stats as the game progresses. its that match day thing", "Mon Aug 27 00:09:59 ": "@AaronJxD @Calfreezy the later seasons are where it gets really good. season 4 and 5 are just amazing", "Fri Jan 11 23:51:54 ": "@jswifty250 but that's not the solution he wants. How many bullets does it take to kill a criminal? 1. So why do you need 100 round mags.", "Sat Jan 12 00:40:09 ": "@jswifty250 @Taylor__A right so you can't argue with me in a civilised manner so you resort to child tactics. Grow up.", "Sat Aug 25 13:19:36 ": "@KSIOlajidebt but the shit teams don't park the bus against swansea like they do with arsenal.", "Sun Nov 04 12:12:38 ": "@piersmorgan @IanWright0 its not your club you dont deserve it", "Tue Sep 11 13:13:35 ": "@CurtisMorton bing search fifa 13 with spaces and its on there", "Fri Jun 29 10:12:45 ": "@JOSHFLIP1989 because people like losing?", "Mon Oct 08 10:49:08 ": "@EASPORTSFIFA veloso for breaking the sound barrier.", "Wed Aug 29 20:05:02 ": "@EASPORTSFIFA like you have every evening this week? and in 11 when the servers did the same thing.", "Sat Dec 29 19:51:40 ": "@officialbarnesy nice research. I didn't realise 1 headed goal was \"a lot\".", "Sat Aug 04 17:47:54 ": "@Impolinho @thewranger i can haz that job?", "Sat Jan 12 01:16:04 ": "@jswifty250 so surely if you miss with 6 bullets you are going to miss with loads more. Because people aren't going to stand there and wait", "Mon Aug 13 16:27:59 ": "@Sing2Bucks no one knows. it disgusts me", "Sun Aug 12 10:55:45 ": "@pee_eye @FootballFunnys that's 21 million they've made from transfers. You clearly are not very bright", "Sun Jul 15 01:20:06 ": "RT @IGN: More Comic-Con #SWAG! RT for a chance to win a limited edition copy of The Dark Knight on Blu-ray! #SDCC http://t.co/4LHDQv3F", "Sun Aug 12 19:26:50 ": "@FifaRalle 763", "Tue Aug 14 15:21:18 ": "@Impolinho mate that stuff you were talking that you wanted for UT a couple of weeks ago is in the main game", "Thu Aug 16 12:05:09 ": "@KSIOlajidebt @MrModernGamer7 police think it was Arsene", "Sat Jan 12 01:17:21 ": "@jswifty250 to get shot by the rest of an AR mag. They would either shot you and kill you or hide until you run out then kill you.", "Sat Jan 12 01:00:18 ": "@Taylor__A yer but if a load of marines come for you, you are fucked. They'd kill you before you can draw. Same with any special forces unit", "Wed Jul 11 09:49:51 ": "@Joey7Barton or just not famous.", "Sat Jul 14 19:43:40 ": "@chadwsugg happy birthday. downloading the EP now.", "Thu Apr 04 23:28:01 ": "@FirstAberdeen my current timetable at rgu is 3 days a week. last month 4weeks student days= £38.40 new price £42. your 4 week ticket is £50", "Sat Aug 18 17:22:30 ": "#bbcfootball odds on spurs to be the liverpool of this season? Woodwork kings?", "Fri Aug 10 18:35:33 ": "@555BarcaBoy555 they arent allowed to do olympics they arent maccy ds or pepsi", "Wed Jul 18 17:50:13 ": "@comiXology i cant sign on at the moment. every time i try to purchase it asks me to sign in again. Help!", "Sat Apr 13 15:57:09 ": "#bbcfootball It wasn't a tug on Giroud for the pen. Kamara nearly undressed him. Clearly wanted to get a look at that body.", "Thu Aug 30 15:36:21 ": "@RobHodson_ more gameplay", "Sat Jan 12 01:31:55 ": "@jswifty250 south park style \"dey took are guuuns\" rant. He doesn't want to take all your guns. Just the ones designed for mass murder", "Sat Jan 12 01:30:13 ": "@jswifty250 and what Morgan wants is a ban on high capacity ammo and the AR which use them. You clearly didn't see that in a", "Sat Apr 13 17:46:51 ": "@Bradley4Johnson should the free kick which lead to your goal have been given? no.", "Sat Jan 12 01:28:58 ": "@jswifty250 right ok I just realized I'm getting off topic. The tweet which started this said something about taking all guns away.", "Sat Jan 12 00:48:51 ": "@bradenhosking what tyranical government? You live in the US you have enough nukes to destroy the world. Noone will invade you.", "Tue Sep 25 23:34:18 ": "@BryanSimon win or lose tell them how much better you are than them. 60% of the time it works every time.", "Sat Jan 12 01:13:27 ": "@jswifty250 if there is someone in you house and you use your handgun to protect you. If you miss several times surely they will shoot back", "Tue Sep 04 12:48:18 ": "@RobHodson_ just got banned from the ea forums and there is no reasoning behind it. i have checked the account email and there is nothing", "Thu Sep 13 16:00:17 ": "@RGUAccom where do we collect our student cards from? help would be appreciated.", "Thu Apr 04 23:28:31 ": "@FirstAberdeen your price rises are a joke."}