{"Mon Apr 08 13:59:42 ": "It's Masters week everybody!!! Click \"like\" if you are as excited as we are!! http://t.co/TKF5RgM2Fi", "Fri Mar 29 13:22:24 ": "It's going to be a BEAUTIFUL spring day at Craft Farms, and it's not too late to book your tee time!! Call now!... http://t.co/JueT9Zo6ub", "Mon Nov 05 17:45:34 ": "Its never too early to start your holiday shopping! Purchase a Craft Farms gift card for the golfer in your life!  Call the golf shop at...", "Fri Sep 21 14:57:51 ": "Take advantage of the Honours Golf Double Play while you still can!  For only $139+tax, you can play (2) 18-hole... http://t.co/iQhA2YXn", "Wed Feb 13 15:18:05 ": "Don't forget about your sweetie tomorrow!  \nWe've got a couple of gift ideas for Valentine's Day:\nA Caddyshack... http://t.co/NRIrOdqa", "Fri Mar 15 12:45:03 ": "Good Morning from Craft Farms!  Gulf Coast Athletic Club Tournament today.. Contest options endless.... http://t.co/OXl1iEvDwr", "Tue Apr 02 19:02:59 ": "The new edition of Arnold Palmer's Kingdom magazine has arrived! Come in and pick up your complimentary copy... http://t.co/ZaBKHoukGQ", "Fri Mar 29 18:06:02 ": "Be sure to join us for our Easter brunch buffet this Sunday!\nMenu:  Spring Fresh Salad Bar, Caprese Salad,... http://t.co/oMDWQd1uv0", "Wed Dec 05 19:04:35 ": "We found the perfect gift for your golfer - and we'll mail it straight to your doorstep! Call the golf shop at... http://t.co/Kx2Ah4IX", "Fri Oct 19 14:02:04 ": "Who said there's not room for golf AND football?  Get out and play a round before/after your favorite team plays... http://t.co/JnGgsyyV", "Wed Apr 10 15:44:36 ": "RT @GolfChannel: Check out these #Masters power rankings (http://t.co/OStf28d2Xj) before playing our free fantasy game: http://t.co/tZm9 ...", "Fri Oct 05 17:42:15 ": "Need new golf shoes? We have them!! http://t.co/7mGe1uzj", "Mon Jan 07 16:36:23 ": "We have to ask... Alabama or Notre Dame?? What do you think the final score will be?! http://t.co/YSMOeGyQ", "Thu Apr 11 13:49:30 ": "Grab lunch at Craft Farms and watch the Masters with us in the Restaurant!  What better place to watch the pros... http://t.co/0tK5KNWGgd", "Thu Oct 18 15:22:01 ": "\"I play golf with friends sometimes, but there are never friendly games.\" ~ Ben Hogan\n\n\"Like\" if you agree with Ben!", "Thu Dec 20 20:11:00 ": "Yahoo named America's most popular attractions in 2012, and Gulf Shores made the list! Share with your friends! http://t.co/8RxUHqoX", "Mon Sep 24 16:25:41 ": "Catch the twilight rate while you still can! Play after 3 p.m. at Cotton Creek or Cypress Bend for only $42 ~... http://t.co/wiqhbW4B", "Thu Oct 04 16:35:46 ": "Shrimp Fest is almost here!  Are you coming down to enjoy the fun?! (Maybe even fit in a round of golf or two?) http://t.co/4eOrmu26", "Wed Nov 14 16:12:04 ": "\"I tried real hard to play golf, and I was so bad at it they would have to check me for ticks at the end of the... http://t.co/gS3SM25T", "Thu Nov 22 15:35:10 ": "Happy Thanksgiving from the staff at Craft Farms!  http://t.co/kZbYksNq", "Wed Jan 02 21:08:40 ": "Do you have a New Year's Resolution to get better at golf?  Take a shot at our Get Golf Ready program!  5 Lessons... http://t.co/KIyjm0tf", "Wed Apr 03 15:06:46 ": "Check out the latest buzz in the golf world - What do you think about Bubba's hover golf cart? http://t.co/QsKdswXQ4s", "Fri Nov 09 15:18:31 ": "Today is the last chance to get one of these! Click here for more info:... http://t.co/oPVu1oay", "Mon Nov 19 15:03:46 ": "Start your week off with a round of golf ~ The weather couldn't be more perfect. Call now to book your tee time..... http://t.co/OdNNNhvs", "Wed Mar 20 17:03:29 ": "Forget your golf clubs in a rush to head to the Coast?  We've got you covered! From now until March 31, receive... http://t.co/tC7hsSf4Qp", "Mon Feb 04 18:37:28 ": "Celebrate Mardi Gras at Lulu's this Wednesday night! http://t.co/UWJyaa9r", "Wed Sep 26 18:26:35 ": "Doesn't this look tempting? http://t.co/BunxfENZ", "Mon Apr 15 13:30:02 ": "Happy Monday everyone, and congratulations to Adam Scott!! Great job. http://t.co/8LwWenSNRS", "Mon Nov 19 15:03:03 ": "Start your week off with a round of golf ~ The weather couldn't be more perfect.  Call now to book your tee... http://t.co/FIyH710h", "Mon Feb 04 14:20:57 ": "Come see us at the Snowbird Expo held at Kaiser Realty in Gulf Shores from 10 am - 12 pm today!  We will be... http://t.co/Ndo44v2i", "Wed Apr 10 15:45:02 ": "RT @GolfChannel: Punch Shot: Favorite shot in #Masters history? Here's six takes -&gt; Blog: http://t.co/LRwsvYV13D", "Tue Dec 11 16:44:48 ": "\"The Gulf Coast is banking on a future made golden with gaming and golf.\" - Craft Farms is featured in the 10th... http://t.co/aEdUlWwv", "Fri Feb 22 16:09:59 ": "Sunday Brunch Buffet ~ 9am - 1pm ~ $10.95 per person - Click the link for more information! http://t.co/ljSRwUIOWM", "Wed Feb 27 15:30:46 ": "Catch the last of the winter rates tomorrow!  \n$69 before Noon/$59 after Noon\nCall to book your tee time now! 800-327-2657", "Sun Mar 17 15:01:57 ": "If you aren't wearing green, at least be ON THE GREEN!  Happy St. Patrick's Day everybody! http://t.co/V980Comw4e", "Fri Feb 01 17:29:24 ": "Make plans to join us for our Sunday Brunch!  Served from 9 am - 1 pm, $10.95 per person. http://t.co/i6yF2WcU", "Fri Mar 22 15:44:32 ": "Can we get a TGIF?!  What are in your weekend plans? http://t.co/cv5wPiGFGp", "Thu Mar 07 20:34:05 ": "Come squeeze in 9-holes before the sun goes down! http://t.co/Fk0TEXsANH", "Mon Nov 26 20:59:31 ": "The Craft Farms Christmas tree is up! Have you decorated for the holidays yet? http://t.co/eSDo3yOW", "Fri Nov 30 18:45:17 ": "Decorate your tree in golf! We have several golf themed ornaments in the pro shop - come check them out! http://t.co/baDu3aOy", "Mon Mar 25 16:02:12 ": "Knock out the Monday Blues with a quick 9-hole round of golf this afternoon!  Book your tee time now.  251-968-3002 http://t.co/ZCecf9QoTT", "Thu Jan 24 18:32:05 ": "It's a gorgeous day to catch our twilight rate! Play 18-holes for only $59 after Noon ~ Call to book now 800-327-2657 http://t.co/KlKRvOrd", "Thu Nov 15 18:43:55 ": "It's never too early to start Christmas shopping! Get the golfer in your life a pair of Loudmouth golf shorts from... http://t.co/WVUw2GY9", "Thu Jan 03 20:47:49 ": "Take a swing at Craft Farms!  Play for only $69 before Noon or $59 after Noon - Cart included! http://t.co/vKgQUbV2", "Mon Mar 18 15:22:22 ": "Welcome Spring Breakers!  Show us your valid College Student ID and you will receive 50% off your green fee!... http://t.co/tubeZnmpvs", "Wed Nov 21 16:01:11 ": "With Thanksgiving only a day away, we would like to extend a THANK YOU to all of our valued customers for all of... http://t.co/c9653YZq", "Thu Feb 21 20:17:21 ": "Be on the lookout for exciting spring offers coming March 1!", "Mon Nov 05 14:45:43 ": "Our presale pricing for 6-packs has been extended to Friday, November 9!  Purchase a Craft Farms 6-pack for only $279+tax until...", "Tue Nov 27 14:30:11 ": "Did you see Justin Verlander's tweet about his golfing trip?  Has this ever happened to you? http://t.co/jfxwy3hE", "Tue Nov 20 16:01:37 ": "Looking for a way to keep your kids busy this week while they are out of school?  Take advantage of our great... http://t.co/ucpgCMZ4", "Mon Mar 11 17:41:16 ": "Now available in the Golf Shop!  Caddyshack Tervis Tumblers - Get them while they last!! http://t.co/V2Jts1z6em", "Wed Apr 10 17:35:07 ": "Looks like Bubba is ready.. http://t.co/bAKwRR8YNM", "Tue Dec 18 17:58:46 ": "Only one week until Christmas!  Still have someone on your Christmas list?  Let the friendly staff at Craft Farms... http://t.co/BQJMrcwE", "Sat Nov 24 17:25:09 ": "The Iron Bowl is finally here!  Tell us who you are cheering for.. War Eagle or Roll Tide?", "Fri Oct 26 14:16:06 ": "Spooky Savings!  Purchase a popular 6-Pack from Craft Farms for only $279 BEFORE November 1!  Each 6-Pack includes... http://t.co/E23dS8RH", "Wed Apr 10 13:40:19 ": "An old Master's quote: \"The first time I played the Masters, I was so nervous I drank a bottle of rum before I... http://t.co/16ztUXaBAI", "Mon Apr 15 15:08:20 ": "What's on your child's agenda this summer?  Sign up for our Junior Camps!  Click the link for more information... http://t.co/ttvUpAyo03", "Tue Mar 12 18:24:56 ": "It's not too late to sign up to be in the GCAC Golf Tournament being held at Craft Farms this Friday, March 15!... http://t.co/aBUuxhOo3G", "Wed Nov 07 14:45:14 ": "Come out and play a round of golf today!  Only $79 before noon/$59 after noon! Call 251-968-3002 to book your tee time", "Wed Oct 03 15:31:04 ": "Love the movie Caddyshack? (Who doesn't!) Check out these new paintings we now have available at Craft Farms! http://t.co/hMkaBUsZ", "Thu Feb 14 16:54:46 ": "Happy Valentine's Day!  Tell us why you love golf! http://t.co/jhAisTU2", "Fri Nov 09 17:50:12 ": "Last day to purchase a pre-sale 6-pack for only $279+tax!  Click the link! http://t.co/CxBNsp9M", "Wed Oct 31 16:24:48 ": "Happy Halloween from everyone at Craft Farms! What's your costume? http://t.co/9zu73D9s", "Thu Apr 04 18:05:04 ": "This Saturday, April 6 is the 2nd Annual Pleasure Island Junior Women's Club Bunny Hop 5k &amp; 1 Mile Fun Run in... http://t.co/f0Cxrr0JhM", "Tue Feb 12 15:31:23 ": "Happy Fat Tuesday Everyone! How are you celebrating Mardi Gras? Laissez les bons temps rouler! http://t.co/VwoS3Ys6", "Mon Feb 11 17:10:20 ": "I posted 16 photos on Facebook in the album \"Cotton Ball 2013\" http://t.co/4IyiMOpS", "Thu Apr 11 13:43:07 ": "The Masters has officially started! http://t.co/OlDGSkl4Ko", "Wed Feb 06 22:14:00 ": "Check out the Gulf Shores Golf Association's display in the Welcome Center in Orange Beach! http://t.co/qCSsUqki", "Mon Apr 01 14:49:37 ": "Did you know Juniors play for free at Craft Farms after 1pm with a full fee paying adult?  Limited time offer -... http://t.co/N5u4rhKXbR", "Tue Jan 22 18:40:03 ": "We need your help to vote for Gulf Shores, Alabama to be \"America's Coolest Small Town.\" You can play golf here... http://t.co/QkLI8KUx", "Fri Mar 08 16:04:17 ": "Rise and Shine facebook world!  It is going to be a gorgeous day here at Craft Farms!  Call to book your tee time... http://t.co/9nRteWm8Jq", "Wed Mar 06 18:15:58 ": "Its not too late to plan your spring golf vacation!  Click the link to fill out our Stay &amp; Play Request Form for... http://t.co/J1cMXV6gcn", "Tue Feb 05 15:11:17 ": "Pick up the latest edition of the Mullet Wrapper and look for our ad... HINT:  You may get something for FREE :) http://t.co/eX9vgoa1", "Mon Dec 10 16:23:44 ": "A Craft Farms Christmas..\n\nClick \"Like\" if you love this picture of our Golf Shop decorated for the holidays! http://t.co/241tzphT", "Tue Mar 05 19:55:13 ": "We had a great time at the Golf Alabama booth in Toronto this past weekend!  Next stop.. Dallas, Texas! http://t.co/m5LR9jnm4y", "Tue Jan 08 17:53:19 ": "Are you or someone you know interested in holding a golf tournament or corporate outing?  Check out this new video... http://t.co/nvE3o8Z0", "Tue Jan 15 19:56:15 ": "Our Sunday Brunch is back!! Join us every Sunday until March 31 for an All-American Sunday Brunch Buffet.  Served... http://t.co/8VTtTNn6", "Wed Mar 13 13:12:11 ": "Special thanks to the Cook group for playing Honours Golf!  We look forward to seeing you again soon! http://t.co/aQUoaXv3Pt", "Mon Jan 28 15:56:00 ": "I posted 14 photos on Facebook in the album \"Wedding Reception ~ January 2013\" http://t.co/f4wAEqeZ", "Tue Apr 16 13:08:15 ": "Today is National Golf Day!  Why is golf more than a game to you?\n#iamgolf http://t.co/umcfkEIUY5", "Mon Oct 08 14:29:22 ": "Happy Columbus Day! Are you off work?  Enjoy the beautiful weather with a round of golf ~ Call the golf shop to... http://t.co/Q2QjQXgw", "Tue Dec 04 18:00:12 ": "We have new winter rates!  Play 18-holes for $69 before Noon/$59 after Noon.  By the way, the high today in Gulf... http://t.co/TKzCYQqc", "Tue Mar 19 13:17:35 ": "Look who made it to USA Today's List of Places to Visit!  .... (and play golf of course!) http://t.co/hfMzH4lTNN", "Fri Nov 02 13:43:33 ": "Tee it up this weekend at Craft Farms!  This view is hard to resist.. http://t.co/ZBqBMhxa", "Fri Sep 28 14:10:58 ": "Is anyone up for some golf trivia this morning?\n\nWhere was the Ryder Cup held in the year 1995?", "Tue Oct 02 18:05:03 ": "Who could ask for better weather? Click \"like\" if you'd rather be hitting the links today! http://t.co/u4kGLvZ8", "Mon Dec 17 16:18:26 ": "Did you know you can order a Craft Farms gift card online?  What a great gift for the golfer in your life!  Click... http://t.co/jP61snbQ", "Wed Dec 12 16:52:49 ": "Lots of stocking stuffer ideas! http://t.co/bEuxeQIC", "Wed Jan 09 16:41:57 ": "You don't want to miss out on this offer - 20% Off Collegiate Merchandise!  Get yours today! http://t.co/SOF6vIrG", "Fri Jan 11 16:17:15 ": "72 degrees and sunny here at Craft Farms!  Join us for a round of golf - $69 before Noon/$59 after Noon - Call to... http://t.co/SjEedBwW", "Thu Nov 29 17:01:32 ": "Check out the sunrise at Craft Farms on Monday http://t.co/4LvqY6dG", "Wed Sep 19 15:21:56 ": "This picture was taken yesterday from the Craft Farms clubhouse.  Look closely.. Can you see the double rainbow? http://t.co/IYovB54p", "Wed Oct 17 16:12:19 ": "How about a famous Craft Farms club sandwich for lunch? http://t.co/IvxIK4pz", "Fri Jan 18 23:02:22 ": "Are you around the Cincinnati area? Come see us at the golf show! http://t.co/TErtzPpp", "Thu Jan 31 17:30:09 ": "Purchase a Craft Farms 6-pack today!  Only $339+tax.  Click the link for more information! http://t.co/PO9cQK6h", "Fri Dec 14 20:01:14 ": "\"Golf is a game that is played on a five-inch course - the distance between your ears.\"  ~Bobby Jones\n\nDo you agree?", "Fri Mar 15 19:45:54 ": "Don't forget about Sunday Brunch this weekend!  Enjoy a delicious buffet for only $10.95 per person.  9am-1pm http://t.co/yoG2Mijk65", "Mon Apr 15 19:14:00 ": "Did you know you burn 2,000 calories by walking an 18-hole golf course? More stats like this at http://t.co/xmtyNsieoE #iamgolf", "Thu Mar 14 14:17:31 ": "Get in Spring Break mode with these new shorts from the LoudMouth collection!  Available in the Golf Shop.. Along... http://t.co/wP3Vi4ZjFH", "Wed Jan 16 16:03:11 ": "If you haven't seen the new Nike Golf commercial, you need to!  Tiger and Rory go shot to shot... http://t.co/OWAD8AG9", "Tue Oct 09 14:41:19 ": "Are you an Alabama fan? This pullover would be perfect for game day ~ now available in the golf shop! http://t.co/4BDfXsNQ"}