{"Tue Aug 23 04:38:08 ": "eep 50% off all brands at Harrolds Department Store tomorrow... Savings plan going out the window.", "Thu Apr 28 04:01:17 ": "RT @VogueLiving: NEW blog post w/ video sneak peek: Ilse Crawford guest edits #VogueLiving! http://bit.ly/kZ6fL5. Or watch on youtube: h ...", "Wed Jun 22 02:05:39 ": "Sister heads to NT on an ed. prog. with Youth Challenge Aust today http://t.co/NIHEzz8 Great org. if you ever have an op to support them!", "Thu Aug 18 01:50:45 ": "3rd person view was always my favorite when playing Nintendo64! &gt;&gt; Avatar Machine at MoMA&#39;s Talk to Me: http://t.co/FzQkcr0 via @AddThis", "Fri May 13 05:25:55 ": "@Dave_Prior on the food truck renaissance in the US inside the latest VL http://tinyurl.com/4xqb77f \"Korean Tacos\" would go down a treat ATM", "Thu Jun 30 07:42:05 ": "Petrichor: The pleasant smell that accompanies the first rain after a dry spell.", "Mon Jun 06 00:33:14 ": "Thanks @madhinchy :With iphones/google a hardcopy of the YellowPages seems quite useless, cancel your delivery at http://tinyurl.com/28hzcdg", "Wed Nov 28 23:32:32 ": "Admiring the Infinity bracelet from @georgjensenaus $50 from the $150 bracelet goes directly to the Red Cros http://t.co/j27d3YdC", "Mon Jun 27 03:47:43 ": "ignore this blog unless you want to develop a burning hate for your current wardrobe http://t.co/GkJ7fxr", "Thu Oct 06 02:50:39 ": "Just spelled my last name to the very Italian man at Harrolds \"B for ball, U for unicorn....\"", "Fri Aug 19 00:25:06 ": "New Donna Wilson for SCP @hubfurniture think this one will be on my couch very soon #satindesign http://t.co/BZXznVB", "Thu Mar 10 04:35:05 ": "wishing I made it to this opening; my wall missed out. http://bit.ly/dM1kxs", "Fri Sep 09 06:29:52 ": "http://t.co/qGThM3R", "Tue Jun 21 08:36:05 ": "Pair of red tartan pillowcases from household linens has made my day...and my bed.", "Mon Aug 22 12:25:28 ": "OMG shoes #qanda", "Fri Aug 05 06:48:33 ": "If all goes according to plan this http://t.co/iJklKWv will be on my shelf soon! Shapiro's 20/21 C Design lot can be viewed from tomorrow.", "Fri Jun 10 01:32:58 ": "RT @VogueLiving: We're looking for an editorial coordinator to join our Sydney team! Email your CV to jobs@vogueliving.com.au. Office ad ...", "Thu Aug 25 04:47:50 ": "wearing a white shirt has added a lot of stress to my day, just waiting for a stain! #firstworldproblem", "Mon Sep 17 03:38:01 ": "http://t.co/nIqtWgH0 1882 LTD   Crockery by Max Lamb", "Tue Jul 05 03:25:25 ": "#amazon buys the #bookdepository...No matter what the two are saying decreased competition is never a good thing! http://t.co/DBkLDu8", "Thu Jan 10 12:32:29 ": "Anna Karenina is the musical I've always dreamed of... including the part where there is no singing. #annakarenina #openaircinema #amaze", "Wed Aug 24 01:04:17 ": "working for an invest. bank looked appealing today, well suited corp. types at the counter of Harrolds with multiple Tom Ford items. V.JEL!", "Mon Aug 22 09:05:57 ": "Food at my local just got so much sweeter! Enjoying Hamish's food at the Old Fitz. Come check it out @Barhsurryhills", "Thu Aug 18 03:31:19 ": "Great issue of www.dassuperpaper.com available to dload now; feat. article on personal fave Christian Thompson. Designed by elliottbryce.com", "Mon Mar 21 06:03:24 ": "RT @Broadsheet_Melb: New website GoodFishBadFish shows us where to buy, and how to cook, sustainable fish. http://bit.ly/heBR6X", "Tue Jun 28 02:38:43 ": "Best egg salad sandwich of my life from the new Sonoma HQ in Alexandria", "Mon May 30 06:01:31 ": "@HelloSandwich @VogueLiving @MikeyBuckley one of the rare days I'm not! Not many options considering 70% of my shoes are (pink/blue) suede..", "Fri Oct 07 05:26:15 ": "who says you cant have it all! sunshine and #polroger. thanks @liquidideas @JaredCrouch @winingpom @ShellyHorton1 #champagnefriday", "Wed Apr 20 05:30:36 ": "Michael Jackson & 9/11: Looking forward to Daniel Askill's exhibition tonight at the Christian Science Church http://tinyurl.com/3hqa9ls", "Thu Jun 02 06:21:48 ": "Visiting the new Kaldour wing at AGNSW next late night Wed! RT @VogueLiving Great collection from a visionary Australian http://t.co/EHX6qon", "Thu Aug 25 04:49:10 ": "@liquidideas Perfect day for it, see you soon!", "Mon Aug 15 22:44:33 ": "Breathtaking stage design by David Fielding for andré chénier opera http://t.co/agqZY8O via @designboom ..If that isn't a good use of scale!", "Fri Sep 02 10:07:30 ": "Stockingisthenewplanking.com", "Tue Oct 25 00:30:45 ": "Reese's Peanut Butter Cups in the @vogueliving office....", "Mon Oct 24 00:35:26 ": "Beautiful natural light at Koskela pop up on Macleay St. Potts Point. Such a lovely location for the warmer months. http://t.co/XSizOA9i", "Fri Jun 24 04:12:36 ": "anyone who has been to art school should enjoy this....http://t.co/v4MllB9", "Mon Jun 06 05:01:59 ": "Release of 'Boogie Woogie' @ Paper Mill tomor: limt'd ed print pack from artists who've exhibited at the Rizzeria http://tinyurl.com/3vv2l7f", "Fri Sep 09 00:42:42 ": "Great evening last night: #VFNO &gt; espresso martinis @nespresso Dhjana launch &gt; visited great new bar @HinkyDinks &gt; nightcap @BootlegBar", "Wed Aug 24 06:05:51 ": "@InnerCityChic @VogueLiving Have already made a mental shopping list!", "Thu Jun 23 05:28:45 ": "Heading to @DoTheDip tonight for another taste of the roo burger and lev dog. Guilt free dining it is not!", "Wed Oct 26 01:21:23 ": "@liquidideas @arrassydney looking forward to seeing all the details I've heard so much about. See you this evening!", "Tue Jun 07 02:19:46 ": "Seeing @kylieminogue in concert tonight!", "Fri Jun 10 02:16:02 ": "@AlastairGreen the site is a times new roman/align to left overload! AMAZING", "Tue Oct 11 01:59:06 ": "Excited for people to see the Nov/Dec cover of @VogueLiving Think it is one of my favorites, such great colours!", "Wed Aug 31 06:15:22 ": "my latest obsession: Paola Navone's 'Calligraphy' tea set for Richard Ginori. The shape of the tea pot and that blue!! http://t.co/WEQGnnG", "Mon Oct 10 00:08:34 ": "Charles Fréger's fantastic work in vol.11 'The world of Hermés' @HermesOfficial Reminds me of @MuseumofBritish http://t.co/ASGoS3ak", "Sat Apr 30 06:41:33 ": "A doco on seminal gay venue, the Continental Baths in NY, is at the fund-raising stage. Check the link for info http://tinyurl.com/43eh5he", "Fri Jul 08 05:14:22 ": "very cool website intro! http://t.co/wMJAx2l @WolseyLtd", "Thu Apr 28 13:55:39 ": "pop up head-to-toe dining experience presented by Douglas McMaster & Kym Lenoble: not to be missed! http://www.wastedpopup.com/", "Wed Jun 22 05:42:23 ": "@ashlerouge sounds like my type of place", "Mon Mar 21 04:18:05 ": "Buy the @HelloSandwich gift wrapping zine! It's crutal and all proceeds go to the Red Cross Help Japan appeal. http://bit.ly/g1ruaJ", "Tue Jun 21 11:14:03 ": "#GoBackSBS such a great concept for a show, looking forward to seeing if some of these people will develop a sense of compassion!", "Wed Jan 25 04:55:41 ": "RT @VogueLiving: Sydney concept boutique @CaraCoSydney one-day sale: Thurs Feb 2. Discounts plus coffee, champagne & canapes! This is ho ...", "Mon Jun 27 23:39:45 ": "RIP mac book pro", "Thu Sep 08 05:08:37 ": "DROOL : ettore sottsass at lighting art gallery http://t.co/kRC6znQ via @designboom", "Wed Apr 20 05:43:27 ": "Checking out the line-up for @sydfilmfest; http://meekscutoff.com looks beautiful", "Tue Aug 16 07:30:29 ": "A series of events meant #BobKatter akubra ended up decorating the back windowsill of my 1st car http://t.co/5Fhwa5B throwing it out ASAP!", "Mon Sep 10 07:26:06 ": "@_DLPR thanks Dani, was a treat to be tasting those wines at such great restaurants.", "Sun Jun 19 23:28:13 ": "great close to the @sydfilmfet with 'Beginners' http://t.co/Ho5DBoa A beautiful and sensitive film though left feeling quite melancholic", "Fri Aug 19 01:52:38 ": "Pencils @ the ready, sketch your best interp. Of the Wallace armchair by Marcel Wanders @Poliform to win #satindesign  http://t.co/HYvLj7U", "Thu Dec 08 03:10:30 ": "Unfortunately this super cute Pierre Frey fabric didn't make the cut for today's shoot! http://t.co/IfhMrIt2", "Fri Jun 24 04:48:30 ": "WOW! @ParkAveArmory hosts @TheRSC from July 6: a full scale replica of the Globe Theater is housed in one of the halls http://t.co/rIjZduT", "Mon Mar 14 23:50:54 ": "crutal and needed: http://tinyurl.com/4q6yd5l", "Mon Mar 14 22:47:13 ": "just registered to 'iVote': how very modern.", "Fri Jun 03 03:33:43 ": "via @Dezeen Beautiful & dynamic display of Meissen porcelain designed by NY's SO-IL http://tinyurl.com/3rngynh LOVE the colours.", "Fri Aug 19 07:04:47 ": "veuve clicquot bar @coco republic a nice end to the day, v.impressive instillation with cadrys/David Hicks #satindesign  http://t.co/5uU5Vnd", "Thu Jul 14 05:25:53 ": "Bastille Day - cheese overload!", "Thu Nov 10 00:58:03 ": "Some very cute temporary tattoos. Get applying to your arms/face/legs/neck/hands... http://t.co/v85IJgga via @two_thousand", "Tue Oct 25 22:17:15 ": "Went to @BCNYthemovie last night, very touching and inspiring. Such a kind-hearted and passionate man @madmanfilms Definite re-watch!", "Tue Aug 16 06:08:25 ": "Ferrero flowing in the VL office! thanks @onegreenbean  http://t.co/kxpa89m", "Tue Jan 15 02:43:53 ": "Styling gold leaf chocolate truffles for @vogueliving ...having a #goldfinger moment http://t.co/VmmefJVP", "Thu Sep 06 06:07:23 ": "Lunch at #Apollo restaurant hosted by Global Grapevine http://t.co/jlXjlTgh", "Fri Jun 10 02:04:47 ": "A reminder of what the internet used to look like, courtesy of the movie SPACE JAM http://t.co/JQzK648", "Fri Jun 03 08:25:25 ": "Great short featuring Albert Watson's campaign for Neiman Marcus http://vimeo.com/14162814 Saw his work at Stockholm's Fotografiska recently", "Tue Aug 30 03:47:14 ": "2/3 shots complete. Now looking forward to dinner at the new L6 Westfield with @liquidideas  http://t.co/pfOBPdV", "Thu Sep 08 00:36:39 ": "2 x #fail : the STC production of Brecht's The Threepenny Opera and the Sydney Dance Lounge restaurant", "Mon May 16 00:01:05 ": "eurovision dinner party was a great close to the weekend: bad music http://tinyurl.com/3junvsx the perfect accompaniment to a winter dinner?", "Wed Jun 22 05:38:02 ": "Ch.10's answer to Prime Possum/Big Dog is plain creepy http://t.co/Op0oKSM. Clip is shown in regional Aust @7pm telling kids it's time 4 bed", "Wed Oct 26 06:11:40 ": "weather update for #halloween http://t.co/YEb2NOuw", "Wed Mar 06 11:47:39 ": "Lots of sparkle at the Waterford Crystal furniture launch this eve. 10/10 for glamour,  V.nice. #waterfordcrystal http://t.co/fHuqhes8o4", "Wed Apr 20 06:44:11 ": "RT @dassuperpaper: The Universe at our Feet. ISSUE 18 of Das Superpaper online today. In galleries nationally this week. Download it at  ...", "Wed Oct 03 05:46:06 ": "With 4 million bottles of #ABSOLUT Unique and no two alike, we're struggling to pick a favourite! #absolutun http://t.co/SmtyK3Pl", "Thu Jul 14 05:43:30 ": "@HelloSandwich @zinesmate Mariah Carey 'Fantasy' should be a staple in every DJ set Eb! x", "Tue Jun 14 07:42:46 ": "Great piece from Outlier in Redfern: Attayal tribes of taiwan - mounted beaded ceremonial lap lap. http://twitpic.com/5bcs7r", "Wed Aug 24 03:59:07 ": "RT @blujemz: RT @QtipTheAbstract: NY QUAKE DEVASTATION!!! http://t.co/PRxFCFQ", "Thu Oct 06 02:35:45 ": "Just received a fragrant bunch of rosemary; such a great alternative to flowers. Thanks Mickey! http://t.co/3BbrgnKp", "Fri Feb 08 04:57:48 ": "This makes me incredibly happy! Jay-Z Signs Kylie Minogue To Roc Nation - http://t.co/VE7XBCZd", "Thu Sep 06 06:05:07 ": "RT @VogueLiving: Our inspirational editor-in-chief David Clark is moving on... We'll miss you, @dc_vogueliving! http://t.co/6Ltmrwlq htt ...", "Tue May 31 02:53:33 ": "thanks @_misschu for the delicious phở, arrived just in time for lunch! @InnerCityChic thanks you too :)", "Wed Jul 06 00:36:30 ": "RT @VogueLiving: Celebrating 1000 followers! Tell us your fave #design classic? Best answer wins a Cire Trudon candle valued @ $177 http ...", "Fri May 13 00:36:10 ": "1st dinner party in our new apartment 2nite: steph alexander chicken & leek pie...& lots of red wine. No plans? Do this &gt; wastedpopup.com", "Thu Jul 07 00:47:58 ": "Vintage Wintour http://t.co/PVHh5cK from @AnOtherMagazine", "Fri Jun 10 00:36:27 ": "Long weekend at parents place with friends. Agenda: fireplace/baking/wine/op shops", "Fri Apr 22 02:52:03 ": "Morning filled with multiple cafe visits; utterly full/verging on food coma. Now packing for QLD while listening to @matthewdear", "Wed May 18 05:11:14 ": "looking forward to quelling my hunger pains tonight @DoTheDip The LEV'S DAWG is on my mind...", "Mon Sep 24 20:28:58 ": "Gilbert and George plates at Colette, Paris. http://t.co/17yhcMS8", "Wed Jun 15 01:22:09 ": "Striking images @ http://t.co/m0eCa12 Well worth a look at, especially if you've read the article in the May/June @VogueLiving", "Mon Mar 14 06:07:05 ": "If I wasn't in Europe I'd be here: Designer Adam Goodrum hosts dinner/talk at Bilson's. $85 for 3 courses http://twitpic.com/49cjkd", "Wed Jan 16 11:28:51 ": "@missleetulloch no risk of death, more gloves than body suit.", "Thu Oct 06 23:29:52 ": "Lovely evening @BLACKbyezard , thanks Craig and James for looking after us so well. Beef tartare and the wines were highlights!", "Fri Jul 29 05:24:59 ": "@madhinchy @caromccredie insanely beautiful scent.. think I may finally add a brand other than comme des garcons to my set of colognes"}