{"Mon Feb 18 16:16:29 ": "Enquiry received to develop a website for streaming amateur radio stations.", "Thu Feb 07 16:04:21 ": "Online equine classifieds website with Ecommerce launched for Show Horse Sales http://t.co/FYluZqkN http://t.co/0PyrnYhk", "Tue Feb 05 17:19:42 ": "New enquiry received to provide web development for a classified directory of specialist machinery and equipment.", "Sun Mar 03 10:44:25 ": "New enquiry received to provide Ecommerce web development for a company specialising in parts for classic sports cars.", "Mon Mar 04 14:52:26 ": "New enquiry received to provide CMS web development for an online activity booking business with eVoucher integration.", "Fri Mar 15 10:07:21 ": "New enquiry received to provide CMS web development and logo design for a personal health business based near London", "Tue Feb 05 16:33:22 ": "Google Releases Faster Image Search http://t.co/2nSsnqWC http://t.co/JYSzavbn", "Mon Mar 04 14:50:50 ": "Designaweb has been chsoen as the preferred supplier of Ecommerce web development for a business specialising in pet products.", "Tue Feb 05 18:02:15 ": "New CMS website launched for Integ the specialist stainless and carbon steel tank / vessel manufacturers http://t.co/XI7VuJIQ", "Tue Feb 05 16:20:26 ": "Website launched for the Reptile Fencing Company complete with new logo and SEO http://t.co/OhHX8S06 http://t.co/kZJXFvUM", "Tue Feb 05 17:20:53 ": "New enquiry received to provide dynamic Ecommerce development for a business specialising in DNA testing.", "Tue Feb 05 17:46:37 ": "New CMS website and logo design provided for specialist building company Built 2 Design http://t.co/JgJNSiaF http://t.co/VsLxvPYs", "Thu Mar 07 09:58:16 ": "New enquiry received to provide website support for a UK charity organisation.", "Fri Feb 08 09:46:57 ": "Designaweb client Robert Puzey meets Joe Hart at the England vs Brazil match at Wembley http://t.co/2NSJeHd4", "Thu Mar 07 11:26:41 ": "Designaweb has been chosen as the preferred supplier of website support for a UK charity organisation.", "Tue Feb 05 16:41:00 ": "New CMS driven website launched for Printing Newmarket at http://t.co/jJwRmVdr", "Thu Feb 28 17:44:35 ": "Using Uchek You Can Test Your Urine For Medical Issues http://t.co/342nfI1seF http://t.co/7IFGDxTC31", "Tue Feb 05 17:41:37 ": "New CMS website and SEO campaign launched for The Case Restaurant With Rooms http://t.co/wdhjKbhk", "Tue Feb 05 16:04:47 ": "Facebook Announces Social Search http://t.co/P7elcVAJ http://t.co/vErySlYe", "Tue Feb 05 17:51:25 ": "Bargain! - 500 x Quality Matt Laminated Business Cards available for only £49 from Printing Bury St Edmunds including free delivery....", "Fri Mar 15 09:38:59 ": "New enquiry received to provide CMS web development for an established golf club", "Fri Mar 01 13:10:15 ": "Designaweb has been chosen as the preferred supplier of CMS web design for a Suffolk based pub restaurant", "Tue Feb 05 18:43:43 ": "Just received a new enquiry to provide Ecommerce website development for a London based bridal salon.", "Sat Feb 09 11:47:46 ": "The cookie law to be abolished - http://t.co/uu8NdMQ5", "Mon Feb 18 16:10:48 ": "Facebook Falls Victim to Sophisticated Attack http://t.co/MBfSOI81 http://t.co/Gbp2V2rO", "Thu Mar 21 11:07:16 ": "Designaweb has just received confirmation to move forward with the development of an Ecommerce website and Search... http://t.co/pJ07TMoEMp", "Thu Feb 07 09:12:05 ": "Just received a new enquiry to provide Ecommerce website development for a London based bridal salon.", "Tue Feb 05 17:23:35 ": "New website with Content Management System launched for Printing Bury St Edmunds http://t.co/hitNrUq8 http://t.co/cGke8tAf", "Wed Mar 20 17:06:18 ": "Designaweb has recently been chosen as the preferred supplier of web development services for an NHS related organisation.", "Tue Feb 05 17:46:31 ": "New CMS website and logo design provided for specialist building company Built 2 Design http://t.co/JgJNSiaF", "Tue Feb 05 17:14:28 ": "New enquiry received to provide Ecommerce web development for a company promoting activities.", "Wed Mar 20 17:04:33 ": "Had a successful meeting with another web design company today with a view to us providing back office... http://t.co/FVouS4ksWS", "Mon Mar 25 13:17:22 ": "RT @GloDesign: @designaweb_ You guys rock! Thank you for your help earlier :-)", "Thu Mar 07 11:25:02 ": "New CMS website launched for First Call TM in Newmarket. http://t.co/eg3j9w9dwB http://t.co/U1A5t34AyM", "Tue Feb 05 17:32:29 ": "New dynamic Ecommerce website launched for WeatherWriter that integrates seamlessly with their chosen back office... http://t.co/isQY3ddz", "Fri Mar 15 17:59:37 ": "Designaweb has been chosen as the preferred supplier of web development for a large US based packaging company", "Tue Feb 05 16:44:47 ": "CMS website with Search Engine Optimisation launched for CES Breaker Hire http://t.co/AFdYldip", "Thu Feb 28 16:40:28 ": "Designaweb has been chosen as the preferred supplier of web development and branding for an online wine sales business.", "Mon Mar 25 12:57:23 ": "New enquiry received to provide web design services for a commercial and domestic cleaning business based in Suffolk.", "Tue Feb 05 16:37:02 ": "Check out our new improved website at http://t.co/uUN6P8Zv http://t.co/fv4PSVbl", "Tue Feb 05 16:48:15 ": "Designaweb providing business hosting and SEO services for A1 Tree Services. http://t.co/P7FWWwIH", "Tue Feb 05 16:33:17 ": "Google Releases Faster Image Search http://t.co/2nSsnqWC", "Thu Feb 07 09:58:50 ": "New enquiry received to provide Ecommerce web development for an exclusive wine company", "Tue Feb 05 15:52:24 ": "New website launched for Junior Paintballing http://t.co/tZ4IkHNb http://t.co/wqhYe7hR", "Fri Mar 22 13:02:32 ": "New enquiry received to provide web development and Search Engine Optimisation for a commercial landscaping business.", "Thu Feb 28 16:13:30 ": "Firefox 22 will block third party cookies http://t.co/E7WHmS3kz7", "Thu Feb 28 17:41:38 ": "Designaweb has been chosen as the preferred supplier of web development for an online portal promoting wedding services.", "Thu Feb 28 16:04:17 ": "New enquiry received to provide custom web development for a London based IT company,", "Mon Mar 11 16:42:12 ": "Designaweb has been chosen as the preferred supplier of web development and Search Engine Optimisation for an... http://t.co/mbPRA3VBjY", "Tue Feb 05 18:02:21 ": "New CMS website launched for Integ the specialist stainless and carbon steel tank / vessel manufacturers... http://t.co/6JszMLaA", "Tue Feb 05 15:58:21 ": "New website with CMS and SEO launched for Creation of Nature http://t.co/WaJZvL5a http://t.co/KW7OsCVo", "Fri Mar 15 18:11:07 ": "New enquiry received to provide web design and print services for a specialist home insulation business.", "Thu Mar 07 10:03:32 ": "New enquiry received to provide web design services for a beauty clinic.", "Fri Mar 22 17:23:25 ": "Designaweb has been chosen as the preferred supplier of logo design and branding for a large South African company.", "Thu Feb 28 17:51:16 ": "Designaweb wins new Ecommerce web development project for a South African based company", "Wed Feb 20 12:40:30 ": "New enquiry received to provide web design services for a dental surgery", "Tue Feb 05 17:04:25 ": "New enquiry received to provide website development for a London based communications company.", "Thu Feb 07 11:09:53 ": "New enquiry received to provide web development for an online classified directory", "Mon Mar 25 12:47:38 ": "New enquiry received to provide Ecommerce web development for a business specialising in vinyl products.", "Tue Feb 05 17:00:41 ": "Anglia Firewood chooses Designaweb as the preferred supplier of website hosting and Search Engine Optimisation... http://t.co/Q7tt01Ip", "Tue Feb 05 17:38:09 ": "Designaweb provides Ruby development for an online music portal called SoundShoots http://t.co/N5VX6LNY", "Tue Feb 05 16:54:17 ": "New website launched for Suffolk Web Design http://t.co/wdTGOUwl", "Tue Feb 05 16:04:43 ": "Facebook Announces Social Search http://t.co/P7elcVAJ", "Tue Feb 05 17:00:36 ": "Anglia Firewood chooses Designaweb as the preferred supplier of website hosting and Search Engine Optimisation http://t.co/a6D8gUyp", "Tue Feb 05 16:41:06 ": "New CMS driven website launched for Printing Newmarket at http://t.co/jJwRmVdr http://t.co/d7hQ0ay2", "Tue Feb 05 17:28:08 ": "Which website hosting panel should I use? http://t.co/1oIjNMad http://t.co/gtSQH8l4", "Thu Feb 07 09:36:14 ": "Dynamic website launched for Compare Taxi Fares with mobile app development in progress http://t.co/KZ1lCRPW http://t.co/xQB0OwwP", "Wed Feb 20 12:39:35 ": "New enquiry received to provide CMS web development for a online directory promoting wedding products and services.", "Mon Mar 11 16:39:55 ": "New enquiry received to provide web development for an online business portal", "Sun Mar 03 10:41:34 ": "Designaweb providing CMS web development for a company specialising in portable buildings.", "Tue Feb 05 16:54:21 ": "New website launched for Suffolk Web Design http://t.co/wdTGOUwl http://t.co/EsrvTylU", "Tue Feb 05 17:23:30 ": "New website with Content Management System launched for Printing Bury St Edmunds http://t.co/hitNrUq8", "Thu Feb 07 14:09:17 ": "New website launched for South African company Goo Gone http://t.co/bAUTGE6E http://t.co/vTrHFgsG", "Tue Feb 05 16:44:51 ": "CMS website with Search Engine Optimisation launched for CES Breaker Hire http://t.co/AFdYldip http://t.co/ZMXdUAFI", "Fri Mar 15 11:31:28 ": "iPad 5 and iPhone 5S to Launch Within Six Months http://t.co/i3vWvKgWdm http://t.co/jVFmQjbogk", "Thu Mar 21 11:04:55 ": "Designaweb has been chosen as the preferred supplier of web development for a dynamic Ecommerce website for a... http://t.co/QmAIpRqf4Q", "Tue Feb 05 16:52:21 ": "Setting Up Email Accounts In Outlook And On iPhone http://t.co/I8JMqj7d", "Fri Mar 15 09:42:12 ": "Facebook releases a new design http://t.co/8r0hPzafiL http://t.co/KSeMPqrcXL", "Tue Feb 05 16:42:38 ": "New enquiry received to provide web development and SEO for a Suffolk based landscaping business.", "Tue Feb 05 17:32:25 ": "New dynamic Ecommerce website launched for WeatherWriter that integrates seamlessly with their chosen back office accounts system....", "Tue Feb 05 17:41:42 ": "New CMS website and SEO campaign launched for The Case Restaurant With Rooms http://t.co/wdhjKbhk http://t.co/hk22Goa9", "Mon Mar 18 11:39:39 ": "YouTube API http://t.co/fIZWQVaM7p http://t.co/SO4Gus7HCc", "Tue Feb 05 16:36:52 ": "Check out our new improved website at http://t.co/uUN6P8Zv", "Thu Feb 28 17:02:45 ": "Designaweb welcomes Brett Van Staden as MD of Designaweb South Africa http://t.co/hoLKHqKcME", "Thu Feb 28 16:03:01 ": "How to use CSS3 text-shadow http://t.co/5bdSmAb50J http://t.co/Evi3tA9DPh", "Tue Feb 05 17:38:12 ": "Designaweb provides Ruby development for an online music portal called SoundShoots http://t.co/N5VX6LNY http://t.co/2eqPB5zP", "Mon Mar 25 12:49:15 ": "New enquiry received to provide web design and development for an overseas company specialising in embroidered clothing and badges.", "Thu Feb 07 09:36:09 ": "Dynamic website launched for Compare Taxi Fares with mobile app development in progress http://t.co/KZ1lCRPW", "Tue Feb 05 17:51:29 ": "Bargain! - 500 x Quality Matt Laminated Business Cards available for only £49 from Printing Bury St Edmunds... http://t.co/9zJx6p75", "Mon Mar 04 14:49:56 ": "The Designaweb team are currently developing a content managed website with built in CRM system for a business... http://t.co/hwHl7Nbget", "Tue Feb 05 16:20:20 ": "Website launched for the Reptile Fencing Company complete with new logo and SEO http://t.co/OhHX8S06", "Mon Feb 18 16:07:53 ": "New enquiry received to provide web development for a price comparison website for courier services.", "Tue Feb 05 17:28:02 ": "Which website hosting panel should I use? http://t.co/1oIjNMad", "Tue Feb 05 16:48:19 ": "Designaweb providing business hosting and SEO services for A1 Tree Services. http://t.co/P7FWWwIH http://t.co/gpryy0TO", "Mon Mar 25 13:08:28 ": "New enquiry received to design, build and support an online dating website.", "Mon Mar 25 10:22:45 ": "Google Keep Is Here http://t.co/Mkc3iD8jqY http://t.co/C5iEn7mPWN", "Tue Feb 05 15:58:17 ": "New website with CMS and SEO launched for Creation of Nature http://t.co/WaJZvL5a", "Mon Feb 18 16:14:40 ": "New enquiry received to provide web development for a specialist property portal to be launched in South Africa", "Tue Feb 05 16:52:27 ": "Setting Up Email Accounts In Outlook And On iPhone http://t.co/I8JMqj7d http://t.co/DR9wHQ3T", "Fri Mar 15 09:43:52 ": "Designaweb has been chosen as the preferred supplier of Search Engine Optimisation (SEO) services for a Suffolk based activity park.", "Thu Mar 07 09:59:35 ": "New enquiry received to provide content managed website development for a county council."}