{"Tue Jun 19 20:10:05 ": "RT @ColeenRoo: There's lots of screaming in our house!!!! Yayyyyyy Dadddddyyyy!!!!!", "Mon Sep 03 18:44:49 ": "@jamielynnspears my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Wed Nov 07 19:17:48 ": "@JosephMorgan love a bit of Klaus - guilty pleasures", "Fri Mar 29 15:31:21 ": "RT @AppleOfficiaI: We have 5 more iPhone 5 to give away (White 64 GB). Retweet &amp; Follow @awkwardposts  for a chance to WIN it! #hurr ...", "Thu Apr 11 21:33:32 ": "RT @wisdomsquote: We're blaming 'society' yet we are society. So to make it a better place, we must change ourselves first.", "Thu Apr 11 08:22:03 ": "Has loved having the kids home. Will miss them next week :(", "Mon Sep 03 18:36:51 ": "@TomDaley1994  my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thanks", "Thu Mar 14 21:57:02 ": "@ClaireFilly had enough #pastcaring", "Mon Jun 18 19:56:44 ": "@therealgokwan Lamb&amp;cucumber skewers, beef noodle soup, noodles w/pork&amp;Ginger, chicken&amp;prawn parcels, sfried morn glory w/tofu", "Sun Sep 16 19:22:07 ": "@jackiejcollins What! Ringer has been cancelled??", "Wed Mar 13 12:05:35 ": "@ClaireFilly @michy26 am getting bored of VD at the moment, love Revenge though.  Broadchurch is brilliant as well x", "Mon Sep 03 18:33:03 ": "@alexandramusic My daughter Jess is starting senior school on Wednesday. Could you please wish her luck? X", "Wed Apr 10 08:04:12 ": "RT @Kevin_Maguire: MPs told can claim up to £3,750 each to break holidays for today's Thatcher tributes. What she'd have wanted?", "Fri Mar 29 15:13:55 ": "Dip dying my daughters hair pink - ek!!", "Sat Aug 04 22:20:15 ": "RT @mrJamesGraham: Almost a year ago to the day, London was on fire, &amp; we were told 'this is us'. 'Young, multicultural Britain'. We ...", "Tue Jul 10 19:47:41 ": "@jackiejcollins Are they making a film then? Love that book x", "Fri Mar 29 16:36:24 ": "@ClaireFilly its worked - just not very even but ok for a first attempt", "Wed Jan 09 20:58:49 ": "@CherylCole hey Cheryl, would you please say hi to my daughter Jess - just on my way to collect her from guides. Thanks xx", "Tue Jul 03 11:05:45 ": "@MPSBexley thanks", "Mon Sep 03 06:43:13 ": "RT @HuffingtonPost: 'Next Top Model' judge hospitalized after apparent suicide attempt http://t.co/bJe0z4gQ", "Mon Apr 08 16:11:03 ": "@MPSBexley is this for adults or kids or both?", "Mon Sep 03 18:41:41 ": "@antanddec my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Mon Apr 01 16:55:46 ": "“@rickygervais: “@_tonyferrari:  Today I stop following you. You're kind of an asshole.”\n\nNoooo! Please...I can change!\nTony!!!!” brilliant", "Wed Aug 01 20:24:37 ": "@ThisisDavina so sorry to hear that terrible news :-(", "Tue Sep 18 07:33:44 ": "what does bydhttmwfi mean? #bydhttmwfi", "Tue Jul 10 17:42:34 ": "@therealgokwan Hubby just cooked 'Salt&amp;Pepper Pork Chops' with Singapore Noodles. It was NEARLY as good as Fifty Shades! Lol x", "Wed Oct 03 10:08:40 ": "RT @BBCBreaking: Have you seen this car? Dyfed Powys Police issue image of car in search for 5-yr-old #AprilJones missing in Mid Wales h ...", "Sun Nov 25 14:30:27 ": "@BexleyMinicabs Do you know if they are turning the Christmas lights on in the village today?", "Thu Aug 30 12:04:51 ": "@RufusHound what a shame - u were the funniest person on there.", "Wed Apr 10 09:18:00 ": "The daily requests to join Candy Crush on Facebook are getting reeaalllly boring!!", "Sun Nov 25 14:51:19 ": "@BexleyMinicabs thanks we are on our way", "Sat Mar 23 10:17:52 ": "@ClaireFilly how exciting! Haven't seen this weeks yet. Have u watched Broadchurch yet?", "Wed Oct 03 10:09:46 ": "RT @BBCBreaking: PICTURE of Mark Bridger arrested over missing 5-yr-old #AprilJones in Wales http://t.co/6ISOnfOc http://t.co/lBfkBUTf", "Wed Oct 03 10:08:00 ": "RT @LetsFindApril: EVERYONE PLEASE RETWEET! April Jones aged 5 is still missing. Anyone with any info phone police on 0300 200 0333 #Apr ...", "Wed Mar 13 11:50:56 ": "@ClaireFilly haha it's only a game! X", "Wed Jun 27 13:49:48 ": "@therealgokwan gr8. Hubby has a basket for oils and sauces a la Gok Won!", "Thu Jun 21 09:11:48 ": "RT @jimmycarr: I appreciate as a comedian, people will expect me to ‘make light’ of this situation, but I’m not going to in this statement", "Mon Sep 03 18:37:20 ": "@therealgokwan my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thanks", "Sat Mar 16 18:44:47 ": "@ClaireFilly catch up with Broadchurch on your laptop- u will love it x", "Thu Apr 11 21:40:33 ": "RT @sebroche: #VampireDiaries Exclusive: Check out the first poster for #TheOriginals! http://t.co/81dWXX05UH” so cool!” Looks great, do ...", "Fri Aug 10 08:27:11 ": "@TomDaley1994 ah good luck, ur Dad wld be proud whatever happens :-)", "Mon Sep 03 18:45:39 ": "@ollyofficial my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Mon Jul 30 21:45:09 ": "RT @Kristian_Thomas: So im gna make this ahort and sweet as we r mega busy with interviews!!\nWe r olympic medalists!!! :)\nSo so proud 2  ...", "Mon Sep 10 18:57:19 ": "@davidwalliams whoo hoo, my daughter will be pleased xx", "Fri Mar 29 15:30:39 ": "@ClaireFilly she is wrapped in foil - about to rinse. Never coloured hair before - fingers crossed!", "Wed Apr 10 08:08:47 ": "@ClaireFilly that's the plan, need some sun :)", "Mon Apr 01 16:52:48 ": "RT @AntiJokeDoggy: I thought I was drowning in soda, but it was only a fanta sea.", "Wed Apr 17 08:26:49 ": "@JohnBishop100 well said", "Sat Aug 04 22:24:04 ": "RT @richardpbacon: Boom: \"@robinparker55 A ginger, a Muslim immigrant and a mixed race woman walked into a bar. Everyone bought them a drink", "Mon Sep 03 18:39:33 ": "@louiespence my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thanks", "Thu Sep 27 11:25:38 ": "What has Priscilla Presley done to her face? She used to be so pretty! #TMPresley", "Mon Jun 18 21:25:03 ": "Contests", "Mon Sep 03 18:46:03 ": "@NicoleScherzy my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Wed Nov 07 19:15:13 ": "@rickygervais lovely cheesy grin x", "Mon Sep 03 18:45:14 ": "@JKCorden my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Tue Mar 12 14:57:44 ": "@ClaireFilly sounds lovely. C u tomorrow xx", "Mon Apr 01 20:37:42 ": "RT @UnreaIFacts: Chuck Norris was born May 6th, 1945. And the Nazis surrendered May 7th, 1945. Coincidence?", "Thu Aug 30 11:47:06 ": "I don't think Channel 4's coverage is anyway near as good as BBC - such a shame :-(", "Wed Sep 12 23:04:40 ": "@MileyCyrus couldn't agree more - try massaging the base of ur thumbs. If it hurts when u rub then you have the right place. Good luck x", "Thu Jun 21 09:12:14 ": "RT @jimmycarr: I met with a financial advisor and he said to me “Do you want to pay less tax? It’s totally legal.”\nI said “Yes.”", "Tue Apr 02 07:18:39 ": "What a beautiful morning! Spring is here", "Sun Mar 31 12:26:00 ": "Egg hunt was a BIG success at home :)", "Thu Jun 21 09:12:49 ": "RT @jimmycarr: I’m no longer involved in it and will in future conduct my financial affairs much more responsibly. \n\nApologies to everyo ...", "Thu Jun 21 09:12:39 ": "RT @jimmycarr: Although I’ve been advised the K2 Tax scheme is entirely legal, and has been fully disclosed to HMRC (Her Majesty’s Reven ...", "Thu Jun 07 08:16:52 ": "RT @autocorrects: Remember, Cinderella didn’t have to take off her dress to win Prince Charming.", "Mon Jun 18 21:25:54 ": "@ladywadders Should have read congrats !!", "Wed Apr 03 07:23:29 ": "RT @Cordeliaitv: £36m pay rise for the Queen thanks to windfarms. She owns Britain's coastline incl seabeds.", "Mon Aug 27 19:20:50 ": "@davidwalliams looking forward to it's release. My daughter Jess loves your books and has them all x", "Wed Mar 13 16:47:34 ": "@ClaireFilly saw the first one, is this the second or third?", "Mon Apr 01 20:13:22 ": "Watching Broadchurch - love it :)", "Tue Mar 12 14:45:11 ": "@ClaireFilly hello u - do u want a lift?", "Tue Mar 05 18:36:47 ": "RT @alexandramusic: UK Beasties,want to win an Xbox entertainment package,incl Nike+ Kinect Training? Win a signed console by me. RT mes ...", "Fri Nov 30 10:56:39 ": "@antanddec watching Charlie get her call from Kiki made me cry. Gr8 show :-)", "Tue Sep 25 10:07:58 ": "RT @OwenJones84: Wow, this puts the grief I get from trolls into perspective. Chilling stuff. http://t.co/vwUtyF7n", "Tue Apr 02 11:34:10 ": "@ClaireFilly I know :(  Just been to McDonalds at Crayford and they have iPad style consoles for people to use. Kids had a gr8 time!", "Wed May 23 11:14:53 ": "RT @Queen_UK: Trouble at Downing Street. Mr Clegg's dropped his Etch-a-Sketch in the paddling pool, rendering the Lib Dems virtually par ...", "Sun Oct 28 12:45:28 ": "@MPSinthesky I can hear you hovering over Bexley Village - can you tell me what is happening?", "Sat Mar 23 15:17:36 ": "@ClaireFilly forgot u were having a girlie weekend. Enjoy xx", "Tue Oct 30 15:38:16 ": "@Jennifalconer me too - but it is more likely that some little kid will walk or scooter through it! If I had a pound for everytime ...", "Fri Mar 29 15:24:11 ": "@ClaireFilly very cute x", "Mon Sep 03 18:42:25 ": "@MileyCyrus my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you x", "Mon Sep 03 18:40:46 ": "@davidwalliams my daughter Jess starts secondary school on Wednesday. Could you please wish her luck? Thank you", "Sun Mar 31 10:14:40 ": "@antanddec Brilliant show last night. Watched by all the family from 7 to 47 years old. Xx", "Mon Jun 25 16:33:15 ": "RT @therealgokwan: Calling str8 single men 35yrs plus. I'm filming my new show at Living Room Bar, Manc. 9pm tonight. I've a lovely sing ...", "Thu Sep 27 13:01:21 ": "@tobyanstis did you see her on TM? Think she might have had a face lift (or two)!!", "Thu Jan 03 08:53:40 ": "@tobyanstis You just appeared on Lorraine - snapped kissing Priscilla Presley. If it's romance then hope it goes well :-)", "Mon Apr 01 16:53:12 ": "RT @AntiJokeDoggy: How to wear sparkly Uggs http://t.co/8MsCLF9rXg", "Thu Aug 30 12:07:26 ": "@AlanCarr whoop whoop", "Mon Apr 01 09:16:20 ": "@dragonjones @jessops Happy Easter #4DaysofJessops #ImageisEverything #Jessops", "Wed Apr 10 07:41:20 ": "Want to book a family holiday - where shall we go?", "Mon Apr 01 20:46:39 ": "Broadchurch - shows how press can twist things into something they are not. Brilliant show", "Thu Aug 23 08:38:43 ": "RT @awkwardposts: Some girls need to invest in a diary rather than telling it all to Facebook.", "Tue Jul 03 10:48:54 ": "@MPSBexley where in the borough?", "Mon Sep 03 18:30:29 ": "@rickygervais how do you decide which tweets to reply to?", "Sat Aug 04 20:46:06 ": "RT @richardpbacon: In light of Jessica Ennis's success, EVERYONE, hourly, should re tweet this Daily Mail \"challenge for the organisers\" ...", "Wed Feb 20 08:07:01 ": "RT @Benfogle: Whoever spiked my drink with mind altering drugs and put me in A&amp;E with a psychotic fit. Did you think of the damage y ...", "Wed Apr 10 12:44:13 ": "@ClaireFilly I am forever getting notifications to join - think it's a fb issue as oppose to people keep asking. Drives me mad grrr", "Thu Apr 04 22:44:39 ": "@NiallOfficial BIG ask I know, but wld u plse say hello to my daughter Jessica? She is a huge fan but I cldn't get tickets :(. Thanks", "Wed Apr 03 07:36:38 ": "@jackiejcollins laying in bed with a cup and Chances on my Kindle before the kids get up - heaven", "Thu Jun 21 09:12:24 ": "RT @jimmycarr: I now realise I’ve made a terrible error of judgement.", "Thu Jun 21 09:12:03 ": "RT @jimmycarr: as this is obviously a serious matter."}