{"Wed Jan 23 09:10:32 ": "I thought his waist injury had been recovered, then I was wrong ;__;  please stay healthy bb", "Wed Jan 23 15:05:06 ": "@RaniSyukur lah knp ngasih ini k gw dah?", "Tue Mar 26 12:19:05 ": "@RaniSyukur @PermataLestari exo-k ivy club bts part.1 http://t.co/6QfsPUEGno  ... so f*cking cuteee OMG", "Sat Feb 02 08:42:09 ": "@PermataLestari hahaha exotic emg pd gila2, sebenarnya ada vers full semua member exo ka! malesin bgt deh tp mrk pd jago edit sih", "Fri Jan 18 11:49:19 ": "RT @EXOINDOFacts: An accident happen, let's give our best pray for our Jongin and wish he's okay. #GetWellSoonJongin -s", "Sat Feb 02 09:59:53 ": "@PermataLestari Emmh ka sumpah deh editannya mantep2 bgt.. makanya aku betah bgt d tumblr haha", "Sat Feb 02 08:40:54 ": "@taniatatata ya ampuuunn pun pun.. sabar yah jeung, cpt sembuh, istirahat aja dlu d rumah hehe", "Mon Apr 01 06:02:06 ": "RT @ihatequotes: When someone talks too much about other people, you know you should not trust the person. #iHQ", "Tue Feb 26 07:32:29 ": "Kai is someone else. Kai is someone he needs to be so he can keep pieces of Kim Jongin for himself", "Tue Apr 16 11:38:35 ": "@19940114com i miss your fancam edit tbh ;~;", "Tue Feb 05 02:12:41 ": "Such life ruiner indeed", "Thu Feb 14 14:28:10 ": "@PermataLestari kayanya mending solo konser snsd nya aja deh hehe", "Thu Dec 20 02:26:34 ": "Lol smart SM, smart..\nCan't wait for soshi! \"@SMTOWNGLOBAL: 2012. 12. 21 10 A.M. http://t.co/Zz2K3aHx\"", "Thu Jan 31 10:18:51 ": "I bet they will lip sync again.. just see", "Tue Jan 22 07:17:33 ": "be ladies but we stay girls", "Wed Apr 10 09:44:47 ": "I saw that you were perfect and so I loved you. Then I saw that you were not perfect and I loved you even more. http://t.co/3FWluMNmGt", "Thu Feb 07 04:30:17 ": "I'M FUCKING DONE TT____TT", "Thu Jan 31 09:15:23 ": "i want sushi", "Sun Feb 03 14:46:31 ": "@RaniSyukur emg karis Mau tau bgt?", "Sun Jan 27 08:36:52 ": "I don't even know wth is going on.. sigh~", "Sat Jan 19 10:23:34 ": "and there is a fanart and also killing me ;___; http://t.co/vORLuK5m", "Tue Feb 05 02:11:40 ": "Nasib fangirl ujung2nya udah bisa ketebak", "Fri Feb 08 15:49:24 ": "@taniatatata :*", "Thu Mar 14 17:08:53 ": "i miss you ;~;", "Wed Feb 27 10:05:20 ": "that wolf song is really shit omg im done. u hear me SM? or are u doing it on purpose so they will flop for their first comeback? how mean", "Mon Feb 18 11:14:33 ": "@RaniSyukur hahaha nope! My gift is too good for him", "Sat Apr 13 12:10:47 ": "is it just me or jongin looks quite dark recently? What happen?", "Mon Feb 04 10:06:37 ": "fangirl mode on, ngakak gw! hati2 volumenya http://t.co/Q5iWPvj2", "Wed Feb 27 09:47:30 ": "OMG I CAN'T STOP LAUGHING XDDDDD", "Tue Feb 26 07:33:29 ": "Kai is a bone to throw to the fans so Jongin can escape without teethmarks on his skin. - *cries over jongin feels* this fic omg", "Thu Jan 10 10:49:30 ": "OMG lmao eat you up unnie u are the best! lol this is daebak seriously XD \"@19940114com: Happy birthday dear jongin http://t.co/B6F38qQ5\"", "Thu Jan 31 14:30:44 ": "I just want to punch him in that stupid face pls.. WTH are u doing idiot!", "Fri Dec 14 11:04:57 ": "@PermataLestari btw ka masa kt sepupu aku snsd Mau konser d Indonesia thn dpn, kayanya awal2 bln gtu deh", "Wed Dec 05 14:28:33 ": "@PermataLestari hehehe Koop fans have the loudest fanchant ever!", "Fri Nov 30 14:38:44 ": "@PermataLestari yup2.. tp mrk sering bgt lypsinc ka.. bt\ntp shinee ok bgt! daebak!", "Wed Jan 23 09:10:19 ": "@putiraysha wah Klo ngatur jadwal mereka barengan kayanya agak Susan haha tau neuro kan pd sibuk masing2", "Thu Mar 28 14:48:09 ": "@PermataLestari @RaniSyukur blh2 next time Klo pd bs hayoo aja saya mah", "Wed Mar 27 13:47:17 ": "@amengs yup Ada hikmahnya jg yah.. Klo ga gtu mungkin ga bs rumpi2 kt haha XD", "Fri Mar 29 12:42:02 ": "@PermataLestari @RaniSyukur oia lupa ka.. ok2 kbrin aja kapan bs nya", "Fri Feb 08 15:50:49 ": "Ah ngeles bgt ni padahal XP \"@MarilynMonroeID: Single doesn't mean lonely. Single means you are preparing for the arrival of a better love.\"", "Fri Dec 21 10:56:49 ": "@tyaswarda oh ya? Gw malah gtw kpn mrk bkin mv 3 hr? Btw lo Skr berjilbab yt? Alhamdulillah udh sadar yah Ty.. hehe", "Wed Mar 20 14:42:39 ": "\"its not like that.. maybe my head is bad, but my heart is good.\" :'(", "Tue Apr 16 14:09:57 ": "for all the girls, you should watch this http://t.co/JNOY0zRsb0", "Wed Feb 27 09:15:47 ": "“Strange,\nI barely know you,\nbut yet I feel deeply connected to you.\nCrave,\nI never had you,\nbut yet I feel so lonely without you\"", "Thu Jan 31 13:27:21 ": "@taniatatata ahahaha iyah yaa.. bsk mau ga tan? atau sabtu deh.. bsk gw mau k kampus ngurusin daftar TA", "Fri Mar 08 02:45:14 ": "I'm going to flip table now!", "Wed Apr 10 11:07:03 ": "@RaniSyukur emmmm emg karis Mau tau bgt? Heeeeeh... Sms gw udh d Baca blm neng?", "Fri Mar 08 03:07:33 ": "@PermataLestari I know right ;~;", "Fri Apr 05 01:29:51 ": "GIRLS`GENERATION少女時代__BEEP BEEP short ver: http://t.co/TY9ctDC7b7 via @youtube\ni want the full vers. pls.. but too much pink @_@", "Fri Dec 14 11:01:00 ": "@taniatatata taan lo k ciledug kpn?", "Fri Dec 21 10:17:28 ": "@tyaswarda yup, jd tdnya Mrk Mau release lagu ini thn '08, tp krn Duffy udh release dluan n jd hit, jd gee dh yg d release buat snsd", "Thu Mar 21 05:44:06 ": "@RaniSyukur @PermataLestari haha d.o is too squishy buat gw, plus dy kaya anak umur 12 thn.. pedo bgt gw rasanya", "Sun Feb 03 13:55:41 ": "i really hope u are not the typical guy who i'm just thought of, don't let me down please", "Thu Jan 31 10:00:55 ": "@chiput_cputri aaah kmrn ga jd mkn sushi put haha", "Fri Feb 08 15:48:53 ": "@RaniSyukur @taniatatata heeeh situ sibuk bkn? Itu jg mendadak sehari sblmnya br d plan XP", "Fri Dec 21 11:00:19 ": "OH MY GG feels!", "Thu Jan 10 11:04:42 ": "Noona is freaking rich jongin, u lucky lil whore.. I wish I can give u something ;A;", "Thu Jan 31 10:19:50 ": "@chiput_cputri biasa d cbd, makanya skr msh pgn sushiiiiiiii", "Tue Jan 22 07:15:21 ": "@putiraysha Alhamdulillah ga say.. n jangan sampe lah hehe apa kuabarrr cha? katanya mau nge-sushi kt? eh ga ada kbr nya -_____-''", "Sat Apr 20 08:54:29 ": "LES TWINS - France 2012 World Hip Hop Dance Championship: http://t.co/vpuEPdxuJ0 via @youtube damn awesome dance!", "Wed Apr 10 12:57:27 ": "@RaniSyukur hmm no lo yg mana sih kar yg skr?", "Fri Dec 14 07:13:49 ": "-_______- zzzZzz~", "Tue Mar 12 13:53:22 ": "@RaniSyukur br balik ni saya.. hehe sayang cm sedikit phutu2nyaa with @PermataLestari", "Fri Dec 28 16:20:06 ": "@tyaswarda http://t.co/Fx4PS458", "Fri Dec 21 11:39:40 ": "@tyaswarda Hahaha ah lo mah emg udh dasarnya alim, emg tgl jilbapan aja sih menurut gw hehe", "Wed Mar 27 16:39:51 ": "@showuhow_kr is this sukai fansite? OMG finally!! fghsjakakhhdgdfsgaaaaaaaa~~", "Sat Dec 15 06:13:06 ": "@taniatatata lho tiap Hari? Oh gtu, jln yuuk.. pny whatsapp ga say Atau ym?", "Sun Feb 10 02:54:02 ": "@taniatatata ya ampun tan, ini aja capeknya gw blm ilang T-T. Gw Mau pergi jg sm nyokap hr ini", "Fri Dec 14 07:08:49 ": "@PermataLestari @RaniSyukur hah? Mubank dmn ka? Btw lg mulai bt nih sm loop hahaha", "Fri Dec 21 03:54:58 ": "@tyaswarda tyaaaa! Omgomgomg itu snsd dancing queen bnr2 Dr 2008 kan! Tp untung mrk release gee yaa haha", "Wed Mar 13 08:20:33 ": "@PermataLestari @RaniSyukur aduuh tlg yg udh pny gaji tombokin saya dlu.. msh mahasiswa ini... Hiks XD", "Sat Apr 06 13:29:46 ": "how dare you! how? with that face? no, it hurts", "Thu Mar 21 07:43:06 ": "@PermataLestari @RaniSyukur exo never comeback lol. Eh, tipe2 ka ata kayanya yg rada feminim pretty boy gmn gtu yah haha", "Mon Apr 01 06:00:25 ": "RT @ihatequotes: If you want to get anywhere in life you have to let go of your doubts. Believing in yourself is the first step to anything.", "Thu Jan 31 10:16:30 ": "@chiput_cputri kmrn jdnya nntn aja ga jd k gancit hehe mls jauh2, lagian vindah Jln udh ssh -___-", "Fri Dec 21 12:28:06 ": "@tyaswarda jd mgkn kt bs dpt bocoran Dr sone yg udh liat mrk perform nnti hehe", "Fri Dec 14 11:02:58 ": "@PermataLestari Klo snsd ga dtg full ga Mau ah hahaha.. ih masa d gbk lg sih, kan ga bgt tempatnya ka", "Thu Feb 14 04:01:21 ": "@PermataLestari aww co cweet thank u ata sonbaenim lol amin tp maunya konser snsd hehe", "Wed Mar 20 03:56:06 ": "Cause i'm into you *sobs*", "Thu Mar 21 07:44:29 ": "RT @ihatequotes: Trust before u Love. Know before u Judge. Commit before u Promise. Forgive before u Forget. Appreciate before u Regret. ...", "Sun Mar 03 09:03:07 ": "@RaniSyukur wut? What are u trying to say? lol.. we should meet soon", "Sat Mar 30 07:45:02 ": "@PermataLestari @RaniSyukur oia lupa ka hehe, ok kbr2in aja bs nya kpn", "Wed Mar 27 06:28:23 ": "@PermataLestari @RaniSyukur yeol emg keren tp jongin&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;all of your oppas, my oppa&gt;&gt;&gt;&gt;&gt;&gt;&gt;your oppa.. haha XD", "Thu Dec 20 02:24:37 ": "RT @SMTOWNGLOBAL: 2012. 12. 21 10 A.M. http://t.co/G89S33fb", "Tue Feb 05 11:27:44 ": "@taniatatata ok, kabar2in aja yaah nanti tan..", "Mon Feb 18 04:05:45 ": "@RaniSyukur lo print, lo tempel.. ngapain repot2", "Thu Mar 21 07:45:03 ": "RT @ihatequotes: I love my mom. She's a strong, caring, brave, wise and beautiful woman of God. I'm proud and thankful to have her as my ...", "Mon Dec 24 02:42:55 ": "@tyaswarda sippo, buseh kata sone yg nonton kemaren mrk rekaman sampe 22 jam.. ada special perf. juga dari tiap members", "Fri Dec 21 10:34:44 ": "@tyaswarda SM smart bgt yah, ga Mau rugi n cr untung sebanyak2nya.. haha tp beruntung bgt Mrk release gee n Jd hit gtu", "Tue Feb 26 07:32:50 ": "Kai is a persona he creates from slick, sure moves and every piece of advice he's ever been given;", "Fri Mar 29 10:19:38 ": "@RaniSyukur @PermataLestari blh2 Mau dmn?", "Thu Jan 31 13:45:14 ": "@allaram_dhanis ya ampun jeung... Ap kbr? Hayo gw mah Mau bgt", "Fri Feb 08 12:58:12 ": "@taniatatata http://t.co/ZUGhz9gK", "Fri Dec 21 12:27:00 ": "@tyaswarda 1/1/2013 hadiah tahun baru buat sone haha tp gw dgr ada mbc special snsd comeback, mrk rekamannya tgl 23 des", "Fri Dec 21 10:47:09 ": "@tyaswarda dgr2 sih bocoran Dr oniontaker, mrk bakal dance battle gtu kayanya.. soalnya bakal ada actor jg d mv ini", "Sat Apr 06 13:28:46 ": "nonono... noooooooooo", "Sun Feb 17 06:56:56 ": "@RaniSyukur sm entertainment \nKorean Address:\n대한민국 서울특별시 강남구 압구정2동 521 SM Entertainment\n(Republic of KOREA)", "Fri Feb 01 14:10:22 ": "@taniatatata lho skt apa say?", "Sat Jan 19 10:21:14 ": "OMG crying! waeeee.... jonginnie kid so cute ;___; http://t.co/6XuwSvrK", "Wed Mar 20 02:11:21 ": "@RaniSyukur @PermataLestari yeaay.. sukses! Ga sia2 nongkrong d paparons pizza 3 jam lbh racunin karis lagu2 exo XD", "Wed Mar 20 03:35:29 ": "@PermataLestari @RaniSyukur saya sih ngikut aja deh kaya kmrn hehe, atur aja.. kan yg sibuk jeung2 ini ^^"}