{"Fri Aug 26 18:16:47 ": "#Safari101 recep ivedik facebook ayaga dustu demisti inanmamistim, masaili kabileden facebook arkadasi edindim :) raphael sen cok yasa :D:D", "Tue Sep 13 13:19:26 ": "RT @BorusanContempo: Türkiye'nin ilk ofis müzesi açıldı! @borusanholding http://t.co/Kah0aik", "Fri Feb 10 14:13:18 ": "@DeryaErdogan dimi ama? :P halen gülüyorum :)) Ataşehir günleri aklıma geldi.. bu arada benden iyi takip ediyorsun ya app vs. Helal olsun !!", "Fri Jan 27 06:33:29 ": "Geçen sefer\"kar saat 4de bastrdı arabayla çıkmıştk,diyenler\" inşallah bu sefer kara uygun olmayan araba ve kabiliyetleryle yola çıkmazlr :))", "Wed Sep 21 17:06:29 ": "If people thought of it that way, they’d find happiness a lot more often. :)", "Mon Jul 16 06:28:25 ": "Gunaydiiin :) bi yeri kizaran gerilen ya da sabah aynaya bakip zenci oldugunu gorenler eller havaya haha @OzlemOncel @DeryaErdogan @8cansu8", "Wed Sep 21 17:43:28 ": "@BurcuCaliskan tekrari yoksa digi plus var dvd recorder var ;) bosa caba bunlar :))", "Fri Jan 27 06:26:56 ": "Güne bembayaz karla günaydın demek :) Burası böyleyse yüksek yerlerde ne güzel kar vardır şimdi!", "Mon Oct 24 15:58:28 ": "RT @borusanholding: \"Yüreğimiz Van'da!\" yardım kampanyamızı 5.000'i aşkın çalışanımız da destekliyor. Van'daki depremzede vatandaşlarımı ...", "Sun Feb 05 18:50:27 ": "@OzlemOncel ozleeeem :)) hani bjk alsin diyordun noooldu simdi de sayiyorsun ):/ bir iki ayip olmuyor mu :P sakin 2 demeeee aglicam simdi", "Tue Sep 20 15:57:03 ": "Ya oturdum ananem ile sanki cok bosmusum gibi Esra Erol seyrettim :D ve cok eglendim :) cok renkli ve cok yonlu bir programmis hahaha", "Sun Feb 26 21:09:54 ": "@duyguhan canimm sagol cok da bilindik bir yerde yedim aslinda BK diyim sen anla ama neyse kendime geliyorum simdi.. Opuyorum cok :)", "Sat Dec 24 13:38:48 ": "RT @BorusanContempo: Hafta sonu ne yapsam demeyin BC'de Segment #1A sergisini gezin! Borusan Contemporary Perili Kosk hafta sonlari saat ...", "Sun Apr 29 18:38:57 ": "@suledizdar tesekkurleeer :)))) bizim icinde cok guzel bir gun oldu. Ayaginiza, sohbetinize, mesainize saglik canimmm hehehehe 😃", "Sat Jan 14 19:58:41 ": "Tesekkur ederiiiim ;) batusum benim icin evde duruyor rusvet bir tepsi borek yapiim dedim :))", "Tue Nov 01 09:22:53 ": "RT @BorusanContempo: BC biletini bugün Grupanya’dan alın, sevdiklerinize Perili Köşk'teki ofis müze deneyimini hediye edin! @grupanya ht ...", "Sun Dec 25 21:17:00 ": "Hahahaha Sosyal Medya'cinin annesi iste :)) RT @DeryaErdogan: 92'li kardesim anneme \"Anne sen de sosyal medyaci oldun ya ... Puhaahah\" dedi.", "Wed Aug 31 18:33:28 ": "@DeryaErdogan hahaha hicde bile :P hersey cok taze ve iyi pismisti. nerden anladin dersen devekusunun tuyleri bile ustundeydi :D", "Sun Feb 26 20:12:45 ": "Bi gida zehirlenmem eksikti! Allah'tan doktorlarimiz cokda gozumu aciyorm yavas yavas. Buyuk ders aldim, disardan yemicem artik sozum soz ;)", "Thu Feb 02 21:11:41 ": "@twitburc kova? :))", "Thu Jul 19 08:06:36 ": "Masanin yildizi 3 aydir ozenle yetistirdigimiz domateslerimiz :)) http://t.co/VygqxPQ", "Mon Jan 23 19:50:16 ": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud.. (Bible, \"1 Corinthians 13:4-7\", http://t.co/tnNoeLq )", "Mon Mar 05 11:06:00 ": "Anlam veremedigim bir kulak segirmesi yakami birakmiyor, hani sagda degil sol. O konusani bir bulursam yapacagimi bilirim :)", "Fri Nov 25 14:02:05 ": "@RedBullTR bu akşam için redbull flying bach'a extra bileti olan var mı? tek 1 bilete ihtiyaç var. Ne kadarsa 2 katını veririm :) pls answer", "Thu Oct 06 17:20:00 ": "Bugunku egitim cok eglencelii ve de bilgilendirici. Bize bir pr ajansi gozuyle bakmami sagladi @dilekozkan @suleyucebiyik", "Mon Jan 16 19:03:21 ": "@DeryaErdogan batu geldiii :) metrobus mu yapsaniz :P ama indikten sonra dolmus misali taxi durduruluyorms hahaha daha neler gorcez yarabbim", "Thu Sep 29 12:11:05 ": "u r my sunshine my only sunshine, u make me heeepiiii when skies r grey. u never know dear how much i love yuuuu la laa la laaa @demirkollar", "Wed Jul 18 20:52:44 ": "Deniz yildizi seklinde uyuyan biri nasil bu kadar sirin olabilir kiiii :)))))", "Thu Sep 29 12:21:15 ": "@DeryaErdogan @demirkollar Benim aşkım Gümüşhane'ye Karaca Mağarası'na gitmiiş! Bir de resim yollamış. ♥ ♥ ♥ ♥ ♥ ♥", "Mon Jul 16 12:22:05 ": "@8cansu8 @OzlemOncel @DeryaErdogan civi civiyi soker kaymakcim sen havuza git bu hafta :P", "Mon Jan 16 18:39:43 ": "@DeryaErdogan hanginizn fikriydi acaba kar gorcem demek? otursaniza guzel guzel evinizde, hadi oturmadnz bnm gunahim neydi uhuu geln artk :(", "Tue Feb 14 11:20:27 ": "http://t.co/1l1r7iF - Play'a bas - \"Cold Cold Heart\" :))) çoook şirin.. Ayrıca son karesi de çok başarılı.. Targets everyone's heart..", "Thu Feb 09 16:11:51 ": "hani anladim Twitter 140 karakterde peki  agzindami ole :)) bir iyi aksamlar yada gunaydina cvp veremiosun Sen anladin O'nu :P @NeyranBargu", "Wed Sep 21 17:05:51 ": "We’re always thinking that someday we’ll be happy; when we get that car or that job or that person in our lives that’ll fix everything...", "Fri Feb 10 13:45:58 ": "dun cok ama cok sevdgm biri telini uzatp QR kod scanner programiyla elindeki A4 belgeyi scan etmemi istedi durup durup guluyorum,iyiki varsn", "Fri Feb 10 21:56:30 ": "#1kadin benden guzel seslilerde varmis hahahaha", "Mon Oct 24 16:21:21 ": "@drerolkose Borusan Lojistik,Tuzla Deposu'na teslim edilen tüm yardım malzemesini Van'a bedelsiz taşıyor. Başvuru Osman Kurt 0533 688 5828", "Wed Feb 15 10:22:06 ": "Avrupa Yakası seyredesim geldi :) Şahika Koçarslanlı \"Ben seni var yaaa kalitemle, üslubumla döverim..\" haha Gülse Birsel eline sağlık ALKIŞ", "Mon Mar 05 11:08:53 ": "Elektronik coplugu cok uzakta degil salonumun tam ortasinda oturuyor an itibariyle.. Anladik Kova burcuyum ama bu kadari bana bile fazla..", "Thu Feb 09 15:55:50 ": "Hosgeldiniiiiz ♥☺☃ @DeryaErdogan @gunselierd @8cansu8 @duyguhan sizden once resimlere baktm batu ve skype screen share sagolsun :)) :P", "Sat Feb 04 09:17:00 ": "#benimkucuklugumde 9Taş, Körebe, Yakartop, Yakalamaç, Su tabancası oynar,ağaçlara tırmanırdık TV'de Hacivat ile Karagöz, Susam Sokağı olurdu", "Tue Sep 27 06:31:36 ": "Arabamı park ettiğim Portaxe'de dün bir gelincik bulundu bugünse ordaki amcaya horoz baba dendiğini öğrendim=)) arada 1bağlantı var ama ne=P", "Mon Oct 24 15:58:46 ": "RT @borusanholding: Borusan Lojistik, Tuzla Deposu'na teslim edilen tüm yardım malzemesini Van'a bedelsiz taşıyor.İrtibat:Osman Kurt-053 ...", "Sun Feb 19 21:17:39 ": "RT @twitburc: Balık Burcuna hatırlatma; Gözyaşının bile görevi varmış;ardından gelecek gülümseme için temizlik yaparmış.", "Tue Feb 21 15:12:36 ": "Babam \"bana kotu gunde diil,ii gunde insan lazm\" demisti anlamamstm. ii gunde aramayp kotu gununde sitem eden o insanlr nerde& kiminleydnz!?", "Wed Nov 30 15:56:16 ": "Ben sabaha evde olurum herhalde :( iste bu yuzden sevmiyorum servisleri :/ bir gungoren eksikti oda rotada artik :))", "Sat Feb 04 09:24:49 ": "#benimkucuklugumde Perili Köşk gerçekten perili mi diye konuşur, içinde evcilik oynarken kendi kendimizi korkuturduk :S :D @BorusanContempo", "Thu Mar 07 22:08:39 ": "@crnalpy @DeryaErdogan kiskandiiiiiimmmmm", "Sun Mar 18 12:21:57 ": "Evde pisirdiginiz tugla ustunde koy ekmeginiz himmm :)) komsuda piser size de duser hihi @gunselierd http://t.co/pLycfVN", "Thu Jan 26 18:05:48 ": "End of \"Boring\" Resumes :) Check this out ! A video resume that's so creative and innovative =D http://t.co/bkRJzKi (How I Met Your Mother)", "Fri Feb 10 14:24:22 ": "Facebook timeline iyi mi kötü mü karar veremedim, keşfetmeye devam.. Aldığm duyumlar ise bu geçişin ABD seçimleryle bağlantlı olduğu yönünde", "Mon Feb 13 16:12:21 ": "Kavunici renkli volkswagen tourag gordum offf o ne renk ya :)) ne cirkin bisidi..", "Fri Feb 24 08:27:48 ": "RT @HUYSUZ_AYI: Kova: Naz çekebilir bir Kova ama Kapris asla !", "Thu Jan 19 21:00:52 ": "Ailecek katildigimiz ilk apartman toplantimiz, cok muhimmm kararlar aldik ehuehuehu @derdogan01 ♥ @demirkollar forever", "Thu Oct 27 11:21:25 ": "RT @borusanholding: Jeneratör ve yardımları taşıyan ilk TIR'ımız Van'a ulaştı. 2. TIR'ımız yolda. Yüreğimiz Van'da! #van", "Wed Aug 31 15:00:57 ": "\"@muratbardakci: Bu fenalığı 12 Eylül bile yapmamıştı: http://t.co/MOmzTZQ\" !!!!!!", "Fri Nov 25 14:33:11 ": "Bugün Cuma günü de ben niye hissedemiyorum !! of ağlamak istiyorum =(", "Thu Mar 07 21:36:20 ": "@crnalpy @DeryaErdogan Anlaşıldı kulaklar çınlatılacak, masaya aşk yatırılcak 😄", "Sat Jan 14 17:40:34 ": "Elektrik sorunu,daha neler neler atlattim ve en sonunda @dilekozkan 'in unlu boregini yapabildim :)) http://t.co/5YlfT8G", "Wed Sep 21 17:44:45 ": "Yagmurdan bu kadar keyif alacagim hic aklima gelmezdi, simsek o kadar cok cakiyorki havai fisek sanirsin!", "Sat Feb 04 09:29:02 ": "#benimkucuklugumde @DeryaErdogan kız kuzenlerimizle bir olur, beni evcilik oyununa dahil etmezdi, bende erkek kuzenlerle futbol oynardım! =D", "Tue Sep 20 10:25:15 ": "@duyguhan @OzlemOncel @merve_cansu @DeryaErdogan @8cansu8 haha onu bilmem ama ben unuttum bu aksami butun aileyi teyzm geldi die bize cagrdm", "Wed Sep 28 15:40:03 ": "Of tem trafigi yetmezmis gibi iki kaza var biri beyaz mercedes ve TIR digeri beyaz audi ve kamyon :( arada ise 15m.", "Thu Feb 02 20:06:15 ": "Ne sodexo'ymus ama, hala icinde 20,20 tl var :)) E kullanmazsan hic olacagi bu :P", "Sun Dec 11 11:26:35 ": "#Turklereozgudavranislar USA'de yayınlanan tum dızılerı turkceye cevırıp, dızıyı batırmak :)) greys anatomy, dawsons creek, desperate hous..", "Wed Nov 30 15:23:29 ": "Serviste zipladikca ipad \"undo typing?\" diyor :)) cancel demekten yazamiyorum aaaa", "Thu Feb 02 19:58:01 ": "Affedebilmek guzel bir duygu :) tabii biraz alevin sonmesi zaman aliyor ama hafifliyorsun..", "Wed Feb 01 13:45:06 ": "Egilmem icin epey ugrastirdn beni ama resim cok guzel:))pastada hmmm Tesekkurler @FIDANITA  @NeyranBargu @dilekozkan @tracybaron @DefneBali", "Sun Feb 05 18:31:41 ": "Yazik yaaaa insan kendi takiminin bayragini yakar mi? Bir Besiktasli olarak utaniyorum bu rezillikten!", "Thu Jul 26 20:51:21 ": "@secilkenar gunah cikarmam lazim :)) bugun ramazan pidesine daldim cikamadim.. Bu saat oldu hala da cok acim nolcak bu halim :/ yrn ariycam", "Wed Feb 15 10:27:00 ": "Anlayana sivrisinek saz, anlamayana davul zurna az :D", "Tue Nov 01 09:00:14 ": "@NeyranBargu  Hahahah kıyamam. Benim de her doğumgünümde kar yağar mutlaka tutsada tutmasada. Alışkanlık işte :P", "Thu Feb 16 16:39:52 ": "@duyguhan bende merak ediyorum, sirf bu olasi kar yuzunden 1800 kisilik organizasyonu erteledik :S", "Sat Feb 04 09:22:47 ": "#benimkucuklugumde hafta sonları çiftliğe gider, at, inek, koyun, kuzu.. aralarında oyun oynar, türlü türlü hınzırlık peşinde koştururduk :D", "Tue Sep 20 15:50:39 ": "Artik nedendir ?! bilmem kapida kaldim eve giremiyorum :)) misafirlerin gelmesine ise 1saatten az kaldi AaaaaaaaA @OzlemOncel @DeryaErdogan", "Thu Feb 09 15:43:30 ": "\"@can_bebe:Benm altıma yapmam belki bi isyandı belki bi meydan okumaydı belkide sadece kakam gelmşti emin değilm\" defneden @alptipikahraman", "Tue Sep 27 17:25:23 ": "Çekememezlik ne kötü ne \"aylak\" bir histir.. Başkası ile uğraşcağına işine gücüne baksana. Aşağıya çekmek yerine sen çıkmaya çabalasan ya =)", "Thu Sep 15 18:29:01 ": "@dilekozkan @DefneBali hepimiz gorduk sahidiiiiz :)))", "Thu Sep 15 18:48:29 ": "RT @BorusanContempo: Cagdas olmaya dair hersey bu gece Borusan Contemporary'de.. http://t.co/WRNGoHjg", "Thu Dec 01 15:52:33 ": "RT @borusanholding: Agah Uğur’un Yönetim Kurulu Başkanı olduğu Özel Sektör Gönüllüler Derneği’nin başlattığı “Gönülden Ödüller” töreni b ...", "Thu Feb 09 16:07:53 ": "@duyguhan @deryaerdogan @gunselierd @8cansu8 kesinlikle :)) uber olacak :P", "Fri Feb 17 13:27:29 ": "simplify your life :)", "Fri Jan 13 15:55:21 ": "\"@twitburc: Kalite cüzdandaki parayla ölçülmez yürekteki samimiyetle ölçülür.Günün sözü\" Sunu dusunmeden duramıyorum. Ne kadar samimisiniz?!", "Mon May 14 12:11:46 ": "@LiyuanTheatre Çin işkencesi bu olsa gerek :))", "Fri Sep 09 04:06:03 ": "@dilekozkan @NeyranBargu @FIDANITA @DefneBali @tracybaron al benden de o kadar :) gunaydiiiin", "Tue Sep 20 10:47:39 ": "@OzlemOncel @duyguhan @DeryaErdogan @merve_cansu @8cansu8 evet superim di mi?! oyle hizli gelistiki:) nese bisi ayarlicam bn hepimzn olcagi", "Tue Feb 21 12:12:02 ": "RT @denizmurathan: kendini dunya uzerinde yaratilimis en ustun varlik olarak sayanİnsan yaptiklarinla oyle caresiz ve zavallisin ki.Nerd ...", "Wed Sep 21 17:06:02 ": "But happiness is a mood not a destination. It’s like being tired or hungry; it’s not permanent. It comes & goes but that’s OK.", "Mon Jul 16 06:38:47 ": "@DeryaErdogan @ozlemoncel @8cansu8 o ikiside olmazsa olmaz zaten :) bi de kamarada uyuyup yuzum yandi diyenler var unuttum haha @demirkollar", "Thu Sep 22 18:36:02 ": "Galeria alt gecitte supheli bir paket varmis! Evden nefes aliyim die sinir harbiyle ciktim ve yaptigm secim galeria cookshop :))", "Tue Sep 27 18:58:12 ": "yatakta pizza yiyip ard arda dizi segretmenin keyfi :)) :D amann kocam @demirkollar duymasın ! @alinaksiler (yaramazlık güzel duygu)", "Thu Sep 15 18:46:42 ": "@DefneBali @dilekozkan buda mi yalan :) kanitlari ile karsinizda Defne Bali dans ederken :))) http://t.co/XkEJmc8", "Wed Feb 01 15:18:13 ": "Doğumgünü/saatine bir saat kaldı :) ben ise evde çalışıyorum, gözüm saatte yeni yaşıma çalışırken girmemek için bir yarış halinde! tik tak=P", "Fri Dec 02 15:33:06 ": "inanamiyorum TEMde gokyuzune bakarken yildiz kaydii :))) @demirkollar bil bakalim ne diledim ;) ? coook guzeldi baska goren varmi acaba ..", "Sun Jul 01 00:42:40 ": "Kederle izdirapla ben arkadas oldum sarkisinda ikili dans edenler bu lafim size bu neyin kafasi yaa =D", "Wed Sep 07 07:06:07 ": "#turkcelltribunu güzel düşünülmüş bir uygulama gibi ama birde yayında iken görmeli :)", "Mon Jan 16 18:31:20 ": "Herhalde kisin en cetin ayi Subatta karlarin butun sehri fethettigi bir gunde dogmam buna neden ama kari ayri bir seviyorum:) i ♥ snowflakes", "Sun Apr 29 18:46:46 ": "@iremkisakurek hahahah cevresi aurali destansi ev kizi desek daha dogru :p", "Wed Feb 01 10:23:42 ": "kendimi kar küresinin içinde gibi hissediyorum :D çok zevkliymiiiiş! salla salla, dönsün dünya :P http://t.co/AwcJlLL", "Fri Feb 24 08:31:09 ": "RT @HUYSUZ_AYI: Kova: Asabi değildir bir Kova Melek gibidir aslında... Ama bazı hıyarlar zorla asabını bozarlar!", "Sun Jan 29 17:40:56 ": "Yilmadan 100kez arayip Israrla telefona esimi isteyen ttnet gorevlisi top secret is yaptigini sanio herhaldeki bana bilgi vermio saka gibi!!"}