{"Fri Apr 12 21:54:26 ": "#dooswyn #birthdaybraais #partyhats #fok #Follow @wozzlet @WotzUpDurban @WotzupCapeTown @Wotzuppe #ff #family", "Fri Apr 12 16:21:35 ": "party hats #birthdaybraais", "Sat Apr 20 04:27:56 ": "jacket - check. boots - check. *gonna go sloshing about the farm!*", "Sat Apr 13 06:07:57 ": "coffee. stat.", "Sat Apr 20 15:06:42 ": "YES PLEASE!! Windhoek Beer - Win a Years supply!: http://t.co/vsnJGvtZhy", "Sat Apr 13 09:14:00 ": "the crying game. haibo wena @Cazzyloo", "Thu Apr 11 06:45:18 ": "RT @HelpingRhinos: South African government looks to sign MOU's with more Asian countries to combat #rhino poaching.  \nhttp://t.co/21rZ5 ...", "Sun Apr 14 17:01:46 ": "RT @Laughbook: Sometimes it's easier to pretend you're happy rather than explain why you're not.", "Thu Apr 11 06:04:11 ": "RT @JustPlainTwit: Morning gang! http://t.co/DYGg4tre6n", "Tue Apr 09 09:56:43 ": "If you cant do great things, do small things in a great way - JF Clarke. Must have meant me ;) someone come do me.... In a great way :p", "Sun Apr 14 20:01:55 ": "RT @latie_jonker: Ek het al baie demone gefight in die lewe maar ek weier om te verloor. Ons lewe tog net eenkeer so wat kan erger as di ...", "Thu Apr 11 06:03:39 ": "Jozi or bust!", "Sat Apr 13 08:34:17 ": "your face reminds me of a dirty omelet.", "Fri Apr 12 14:51:16 ": "RT @trevorgumbi: People who've never met you, but, don't like you, can go ahead &amp; eat a bag of dicks !", "Sun Apr 14 19:12:57 ": "@karenryan333 I fear, only when there are none left :(", "Sun Apr 14 05:21:48 ": "i prefer saturday morning hangovers to sunday ones.", "Fri Apr 12 16:33:07 ": "@CandiZN im watching meat burn on the fire. but lo, a'things a'miss with my wine glass. 'tis empty.", "Thu Apr 11 11:08:14 ": "RT @jonnysun: *snugles my pet mouse Philip durimg a thumderstorm bc he is too scared of it to sleep* \ndom't worrey Phillip... lightnimg  ...", "Thu Apr 11 07:39:54 ": "RT @latie_jonker: The worst pain a man can suffer: to have insight into much and power over nothing.\"\n \n- Herodotus -", "Sat Apr 13 09:12:48 ": "RT @WHATNOWUKSTREET: Hope everyone has a great weekend! We sure will...we get to see @WhatNowBand live! #movelikeasinner http://t.co/c9e ...", "Sat Apr 20 04:16:56 ": "RT @SunnyMabrey: I will take you under my wing as long as it doesn't bother you that I have a wing", "Fri Apr 12 14:46:52 ": "insert witty comment here &lt; &gt;", "Sat Apr 20 04:14:33 ": "RT @McNevich: The best part of twitter is that it turns the entire world into that awesome fucking neighbor we always wanted", "Thu Apr 11 13:08:49 ": "RT @MarkOfTheRhino: Pls RT:@Gite_Provence @wozzlet Funding needed to put 24 of our #Rhino on DNA system! Please DM me if you can contrib ...", "Fri Apr 12 16:24:59 ": "@CandiZN is it wrong I'm craving sushi at a #birthdaybraai?", "Sun Apr 14 12:15:26 ": "stress levels through the roof - not a Sunday kinda feeling.", "Sat Apr 13 09:16:51 ": "RT @eluna333: I'm not sure I have the energy to be the level of crazy cunt that I had scheduled myself to be today.", "Fri Apr 12 16:39:06 ": "RT @Paul_Frade: Just once when I order Chinese I wish I'd actually get fried lice...", "Sat Apr 20 04:26:50 ": "RT @MeeganR: I built this... http://t.co/IagwbCTqAx", "Sat Apr 13 09:04:23 ": "I'll drink with u. If u ever need a shoulder to cry on, I'll drink with u. I guess what I'm trying to say is: I love 2 drink! @DevinOBrien1", "Sat Apr 13 08:33:48 ": "swine flu. rotflmao. asseblief tog.", "Fri Apr 12 12:11:55 ": "i can't help liking #bangaran :-/", "Sat Apr 20 04:41:20 ": "RT @sp33dl3ss: Twitter : a place people can say exactly what you say without it being awkward", "Sat Apr 20 04:42:48 ": "@CandiZN #sick #oldladyproblems I can't get out the front door. Rewinds and gets back into bed!", "Sat Apr 13 08:59:57 ": "don't pay no mind to the demons that fill you with fear.", "Sat Apr 13 09:15:53 ": "RT @Globe_Pics: A small fir tree that has become a bonsai is growing at the top of a dead log in the waters of Fairy Lake, Canada http:/ ...", "Fri Apr 12 16:27:48 ": "you think you're awkward? i just told my mates sister she has a \"hot rack\". and im gay :/", "Thu Apr 11 11:09:25 ": "RT @SAFARITALK: Photographic article: Stillborn Tsessebe, how nature is harsh - http://t.co/UlOR23QsFp", "Mon Apr 15 16:20:56 ": "there are so many of you who i would love to RT. and so many of you who i want to kick.", "Sat Apr 20 04:49:13 ": "@sp33dl3ss FB stalking is still considered weird! Twitter stalking, not so much #stalkerish", "Sat Apr 20 05:53:19 ": "RT @CauseWereFellas: *Looks forward to the weekend*  *Doesn't do anything all weekend*", "Mon Apr 15 16:22:59 ": "@chadleclos why Czar Chad? Really? Another corner cafe jol.", "Sun Apr 07 16:10:29 ": "when you're down you can only look higher #allmylife #justjinger", "Thu Apr 11 07:16:20 ": "RT @HelpingRhinos: Busy day for us today at @ParadiseWLPark. A stand in the Park all afternoon and then a talk this evening. Come say hi ...", "Fri Apr 12 16:38:19 ": "@CandiZN i'm drinking from every glass and mug i can find. it says, im here to party, i don't gotta clean this shit up tomorrow.", "Thu Apr 11 06:04:23 ": "RT @MarkOfTheRhino: @KathuGazetteZA Thank you #Kathu for supporting #Rhinoconservation by getting your #Marks;-) http://t.co/qyjGTYPkZA", "Fri Apr 12 21:49:42 ": "beer and popcorn #birthdaybraais", "Fri Apr 12 14:51:35 ": "RT @scalzi: @ChuckWendig Well, no one likes an asshole, basically.", "Tue Apr 09 11:21:26 ": "you are judged by your ACTIONS not your INTENTIONS. you may have a heart of gold, but so does a hard-boiled egg.", "Sun Apr 14 17:50:28 ": "RT @PaulThackwray: This you have got to love .. “@IamInnocentN: MTV NEWS | @ToyaDelazy featured on @DistrictMTV Germany http://t.co/yFLu ...", "Sat Apr 13 08:27:30 ": "i keep saying \"just one more level\". then it turns into 8 more #angrybirds #newseason 2013 strain of avian flu.", "Thu Apr 11 11:10:55 ": "@paigen and \"stuff to sort\" mine's been waiting to be sorted for months. there's a sub folder called \"more stuff\"", "Mon Apr 15 16:21:15 ": "@johndavisbooks bless them. Shame.", "Thu Apr 11 05:59:32 ": "to get something you never had, you have to do something you never did", "Fri Apr 12 22:37:12 ": "camping #birthdaybraais", "Thu Apr 11 06:44:59 ": "RT @purloinedletter: I could write a world for you but I cannot write you for the world.", "Thu Apr 11 11:09:52 ": "RT @RhinoOrphanage: In case of a Rhino Emergency... http://t.co/CTIY42yVE8", "Mon Apr 15 15:22:07 ": "I am not listening to #Aafrikaansmusic. --  promise.", "Fri Apr 12 10:34:08 ": "RT @darktimespoet: my kind of sin \nis \nhighly \naddictive", "Sun Apr 07 16:11:58 ": "RT @GavinProbably: So what you're telling me sir is that there is no such thing as an actual gravy train and I shouldnt have made all th ...", "Thu Apr 11 11:08:36 ": "@jonnysun @Fred_Delicious too bloody cute.", "Sun Apr 07 18:21:37 ": "RT @lizlaughalot: Feeling funny, and keen to win 4 tickets to hilarious Durban improv comedy #WhoseLineIsItAnyway worth R400? GO! ---&gt ...", "Sat Apr 13 09:07:33 ": "blazing up #YESSSSS", "Sun Apr 14 18:09:07 ": "RT @ParisPhilippou: After seeing that footage on #carteblanche it makes me wanna beat a motherfucker at that circus; chain 'em up &amp;  ...", "Sun Apr 07 18:23:41 ": "RT @amyspaulding: @DaveWeasel who the fuck is Dave Weasel?", "Sun Apr 14 04:58:48 ": "RT @AngelaEhh: Trophy wife needs new shelf.", "Sun Apr 07 18:16:43 ": "RT @Ant_Talk: The world needs dreamers and the world needs doers.  But above all, the world needs dreamers who do.", "Sat Apr 20 04:41:08 ": "On second thought, there will be no sloshing in this rain. Fok! Hectic.", "Sun Apr 14 05:20:12 ": "RT @TheGarethWoods: Back home to Cape Town... Nothing funny about that. It's Sunday and its too early. Go steal your humorous tweets som ...", "Sun Apr 14 19:12:52 ": "RT @karenryan333: Another 3 rhinos shot today near Louis Trichardt. When is it going to stop? http://t.co/xbEh1jcr86", "Fri Apr 12 16:23:00 ": "Blake Shelton? Really? At a #birthdaybraai @blakeshelton #footloose", "Sun Apr 07 16:21:15 ": "RT @JDotComma: Unfortunately life isn't an 80's/90's sitcom, and you can't just replace people who walk away with other people who kind  ...", "Mon Apr 15 16:24:30 ": "Fok. Twitter needs a really large \"UNDO\" button. On my face.", "Mon Apr 15 16:23:12 ": "RT @chadleclos: On Saturday, 27th ApriI; I will be celebrating my 21st @ Czar in Durban. Come party with me &amp; my family + friends fr ...", "Fri Apr 12 16:20:00 ": "awesome way to spend a friday evening with friends! #birthdaybraais", "Fri Apr 12 16:30:15 ": "mama warned me; there would be girls like you...", "Sun Apr 14 16:26:46 ": "you give a few stoners a bunch of weed and nothing to smoke out of and they suddenly become engineers. its amazing.", "Sat Apr 20 04:13:38 ": "RT @SAWeatherServic: WARNING: Heavy rain expected over KZN, eastern parts of NW, MP highground, SW parts of LP, GP, extreme NE parts of FS …", "Sat Apr 13 09:02:49 ": "RT @KarenWalkerBot: I'll drink with you. If you ever need a shoulder to cry on, I'll drink with you. I guess what I'm trying to say is:  ...", "Sun Apr 14 17:54:28 ": "RT @GrantNash: OMGooooodnesss :-( thank you @carteblanchetv for once again showing how badly animals are treated at The Boswell Circus # ...", "Thu Apr 11 11:09:17 ": "RT @adiojenkins: What Now on the cover of Muse Magazine with Hurts and Metallica. Lol Metallica Hurts What Now http://t.co/SOOg6cs3Ak", "Mon Apr 08 08:10:05 ": "RT @durbancomedy: Monday Blues can easily be eradicated. Twitter followers, we have 2 x set of tickets for you. #badromance at Catalina, ...", "Sun Apr 07 18:16:18 ": "RT @JacquesBudler: If life is dishing out half measures... Can I have two, please?", "Sun Apr 14 04:57:14 ": "Pls RT! Funding needed to put 24 #Rhino on DNA system! Please DM @KalahariDrey for further details #rhinoconservation  @MarkOfTheRhino", "Sun Apr 14 06:57:22 ": "RT @RichSimmondsZA: Don’t be shy about asking for help. It doesn’t mean you’re weak, it only means you’re wise.", "Sat Apr 13 09:01:30 ": "if my playlist were an animal it would be a duckbilledplatypuss.", "Sat Apr 13 09:08:20 ": "Durbanite in Pretoria #fok", "Thu Apr 11 09:42:12 ": "RT @spoekcookie: oh hey, I'm really hungry. Maybe I should google stomach ulcer.", "Fri Apr 12 17:06:21 ": "RT @ArnoCarstens: luister @valiantswart in Wolsley . forgot what a brilliant writer this guy is. Dis n Rodeo op die maan my kroon.", "Sat Apr 20 04:22:58 ": "waiting for the obvious \"omg its raining so hard\" updates. don't disappoint me twitter.", "Sat Apr 20 04:15:29 ": "RT @macklemore: Work with youth, eat teriyaki, go to Japan, go to India, move to India, do yoga, come home, jack off, bring back cargo shor…", "Mon Apr 15 15:26:02 ": "You won't find anybody like me.", "Sun Apr 14 11:54:18 ": "RT @JemAtkins: #WhoseLine #Comedy Last show 6pm 2night! Buy 2 tickets at door- get a 3rd one FREE!\nhttps://t.co/sR9I3LHsRq http://t.co/6 ...", "Thu Apr 11 07:15:28 ": "RT @PerezHilton: And... pEoPlE wHo TyPe LiKe ThIs ShOuLd Be BaNnEd FrOm ThE iNtErNeT!", "Sat Apr 13 08:00:17 ": "friends are the part of our family that we get to choose.", "Wed Apr 17 13:42:01 ": "RT @Paul_Frade: Doesn't it seem like whenever you speak to someone they always say this year is going to be colder than last year", "Fri Apr 12 22:36:45 ": "stuffed #birthdaybraais", "Sun Apr 07 06:22:20 ": "RT @designindaba: #YourStreet: Pitch your idea for improving life at street level before 17 May &amp; you could win R50 000 to implement ...", "Sat Apr 13 09:15:16 ": "#noneedtoargue", "Fri Apr 12 09:14:04 ": "\"Life aint passing you bye\"??? All this time I thought it was \"that guy wants to touch your behind\" #footloose", "Fri Apr 12 16:40:51 ": "@CandiZN fok"}