{"Mon Apr 08 18:25:07 ": "@vycawood miert hivtal? :)", "Wed Apr 03 08:49:24 ": "De fura visszazokkeni a hetkoznapokba.. Vizsga-vizsga hatan...", "Mon Apr 15 06:04:40 ": "Ilyen koran reggel mar szaguldozok gyorbe.. Csak ennyi : #hatefo", "Wed Apr 17 17:56:50 ": "Vizsga 1/3 felvonas. Meg 2 felvonas hatra van... Bar a holnapi fel7es kezdessel vannak problemaim...", "Tue Mar 26 12:45:48 ": "Nem lattam mar az #edenhotel -t tobb mint 1 hete. Ma vegre eljott az alkalom h nezzem ujbol. Micsoda zuros hetkoznapok..", "Tue Mar 26 10:56:01 ": "Spenotkeremes teszta a'la Szabolcs. Nyammmiii :)) marha finom!! http://t.co/oOckv8vTHd", "Sun Mar 24 20:05:29 ": "38fokos laz, es alig birok nyelni.. Mandulagyulladas imadlak! Holnap igy szep lesz a modulzaro.. Remelem a gyogyszerrel ejjel kiheverem..", "Tue Mar 12 20:46:52 ": "Aazta mi mixet toltottem le.. Imadom Andro mixeit! Egybol jobb az estem :)", "Sat Mar 23 19:57:35 ": "Mi tanc volt ez... Azzzztaa! Gabi a legjobb! :) #szombatestilaz", "Wed Mar 13 14:26:28 ": "Elsosegely. Remelem a jo helyre csekkoltam be :D (@ Bilux ft Bozzai) http://t.co/twOYStAjD8", "Sun Mar 24 15:33:55 ": "Utalom a vasarnapot es egyre inkabb felbasz noverem, ketperc es kb intenzivre teszem. Hahaha. Amugy meg faj a hatam es masszor kerestetik!!!", "Sat Apr 13 17:35:58 ": "@vycawood tudom.. Majd elmeselem miert.", "Mon Mar 11 08:07:30 ": "Marcius 20. - elsosegely vizsga ; marcius 21. - nemet modulzaro ; marcius 25. - gazdasagi modulzaro. #eloretekintek #huhh", "Thu Mar 21 12:33:27 ": "@vycawood en szeretem, erdemes nezni :D de mar mondtam neked :D Lali a legjobb! #ejjelnappalbudapest", "Sun Mar 31 09:02:10 ": "@vycawood az mar jo lesz! szavadon foglak :D", "Sat Mar 23 17:56:58 ": "Gyertyafenyes forrofurdo is the No. 1 !", "Thu Apr 18 04:12:43 ": "Olyan furcsa Gyort igy reggel 6kor latni... Kihalt utcak mindenhol... Nagyonfura mit ne mondjad. #reggelvan", "Thu Apr 18 19:45:32 ": "@vycawood jaja vagy csak szimplan a kiralyra is hallgatok :D:D hahahah", "Sat Apr 06 06:55:47 ": "Akkor is ez vagyok en, enelkul nem megy.. Olyan jo most igy!", "Sat Mar 16 14:36:05 ": "I just became the mayor of Vivien's home on @foursquare! http://t.co/KkjwPhhf9X", "Tue Mar 12 19:19:38 ": "#ejjelnappalbudapest", "Wed Mar 13 12:10:49 ": "Alvas.. (@ Mamus's home) http://t.co/beHcne3kdU", "Wed Apr 03 14:48:19 ": "Annyira szar, hogy cirka 3 het es megvan a szakmam es mar nem csak evszamokban leszek FELNOTT. Meg leirni is fura.. Jesus Christ.", "Sat Mar 09 19:53:33 ": "A Gabi akkorraa arc :DDD #szombatestilaz", "Thu Apr 04 19:17:36 ": "Nemet modulzaro pipa :) annyira jo ezen mar tul lenni.. Tanarno szerint en nagyon jo nemetes vagyok.. #wtf pedig utalom a nemetet :D", "Sun Mar 17 12:40:52 ": "Semmit sem er az elet...", "Sat Mar 16 19:58:40 ": "Gabi egy allat.. Szakadok.. Hajraaa! :D #szombatestilaz", "Fri Mar 08 12:37:41 ": "Imadom az uj telomat :) #csakmondom", "Sat Mar 09 19:43:46 ": "Micsoda szombat esti program.. De azert jooo a musor :) #szombatestilaz", "Thu Apr 18 19:53:02 ": "K.I.T.T.-K.A.T.T.-K.I.T.T.-K.A.T.T.", "Sun Mar 31 08:46:08 ": "Meg 1 ilyen ratyi husvetot.. Jobban mondva idojarast. A tavasz tenyleg bevan allva.. :D de azert kellemeset Mindenkinek!", "Sun Mar 24 19:20:58 ": "RT @IdezetekNeked: \"Lehetőséget kaptál, hogy tanulj a hibáidból, ami ritka madár. És ugyebár, vagy tanulsz a múltból, vagy újra átéled.\" ...", "Sun Apr 07 11:36:42 ": "Mar megertem a noverem, aki terhes, milyen kivanosnak lenni.. 3napja csak falok :D #thatsme", "Mon Mar 18 07:32:47 ": "@vycawood hat olyan sotet van, hideg es nem adok felorat es szakad.. Hat latod, nekunk ez nem jon ossze :D", "Tue Mar 12 15:36:01 ": "Ezert erdemes volt bemennem suliba, hogy mar itthon is vagyok...", "Fri Mar 22 13:27:18 ": "Na suli... De nincs kedvem hozza.", "Sat Mar 16 19:04:01 ": "#szombatestilaz", "Fri Mar 15 18:53:54 ": "A kopteto ivas a sutire, olyan mintha beteptem volna. Aaaaaaaaaa :D", "Fri Mar 15 18:56:31 ": "Amugy a fasz kivan.. Elhiszem + tapasztaltam is hogy szar ido van, de ezt nem a facen kene osztogatni, hanem tiplizni kene segiteni!", "Wed Mar 20 14:11:39 ": "@vycawood ahha, meglett. Yeees :) hallod el se hiszem, alig szolaltam meg :D", "Fri Mar 15 20:27:46 ": "Nagyon jo film volt ez a Tavkapcs. A sok vicc mellett, azert ott volt az elgondolkodtatos resz.. Hmm hat igen.. #gondolkodosallapot", "Wed Mar 20 11:37:59 ": "Istenem csak sikeruljon ezaz elsosegely.", "Fri Mar 15 17:38:50 ": "Esss very good ezaz app. Meg mobilnettel is szaguld. #aprooromok", "Fri Mar 15 18:57:34 ": "Noveremmel is veszekedek, mert egesznap osztogat ilyen faszsagokat es mivel a csaladtagjaim kozott van, jonnek az ertesitesek. Nyomorek...", "Mon Mar 11 11:45:05 ": "Miert nemetbol kell vizsgazni? Miert nem angolbol? Az kisujjbol menne.. De ez a nemet kiejtes.. Waaa. Felbasz.", "Tue Mar 12 09:46:33 ": "I just became the mayor of Mamus's home on @foursquare! http://t.co/bJ2r7wgewK", "Mon Mar 18 16:44:08 ": "Most kaptam az emailt, hogy 2 nap múlva megjön a cipőm.. Elég gyors, ahhoz képest h tegnap rendeltem.. véégre:)", "Sun Mar 17 11:05:35 ": "Requiem for a dream&lt;3 ... :(", "Sat Mar 23 15:20:50 ": "Na most van az a pont, hogy reggel 10 ota \"gazdalkodok\" es annyira megorultem mar, hogy lassan azt se tudom mennyi 1+1..", "Sat Mar 16 09:35:31 ": "Ma egesz ugyes voltam. Nemet pipa :) aber Ich mochte kastanienpuree mit schlagsahne ! nyammm BITTE.", "Thu Mar 28 17:19:07 ": "Nekem ennel kisebb gondom nagyobb. Vagy mar tulerett a gondolkodasom hozzajuk kepest. Ez sokszor tok szar... #elozo", "Sun Mar 10 14:58:27 ": "Durva mennyi ketszínū ember vesz korul...", "Tue Mar 26 14:24:49 ": "Aajjj nincs kedvem sehova se menni.. De itthon ulni sem. Szoooval inkabb go.", "Fri Mar 29 07:48:28 ": "Eletembe eloszor vettem parkolojegyet.. Azert ez mekkora sikerelmeny mar hogy rajottem hogy kell :D #reggelvan", "Mon Mar 11 11:33:50 ": "Ich bin perfekt Deutsch.. Was mochten Sie? #egesznapnemetezek", "Thu Apr 18 19:46:27 ": "Miert is ne? nem lehet cigizni. Kikattanok es almos vagyok...", "Mon Mar 18 16:38:11 ": "Micsoda \"szép\" idő van megint... ez aztán tavasz.", "Thu Apr 18 18:17:10 ": "Na ha a holnapi szobeli is sikerul, akkor jogosan hivhattok waiternek oder kellnernek or pincernek. Hallelujaaaa :D", "Sun Mar 17 20:41:37 ": "@noemypal szepek vagytok igy egyutt! igy tovabb ;)", "Tue Mar 12 15:37:05 ": "I'm at Szabbie's home (Pázmándfalu) http://t.co/f2h56zWgrI", "Sat Mar 23 19:58:05 ": "@vycawood jo szorakozast! :D", "Fri Mar 15 18:52:43 ": "@noemypal igen, azt nezem es szakadok :D jaaaaj.. Nagyonnagy szinesz!! am miujsag?:)", "Thu Mar 21 06:52:16 ": "@noemypal koszonom :) vezetessel hogy allsz ? :)", "Thu Mar 28 17:18:03 ": "Annyira jo az olyan velem egykoru fiataloknak,akiknek az a legnagyobb gondjuk,h melyik hetvegen hol bulizzanak,v kivel mikor talalkozzanak..", "Fri Mar 08 10:21:13 ": "@vycawood blackberry bold 9900 :)", "Thu Mar 21 14:54:57 ": "Sokszor belegondolok hogy tenyleg ilyen depresszivhajlamu vagy szimplan hangulatember vagyok? Ez a hangulatingadozas mar felb@sz...", "Wed Apr 03 14:54:02 ": "Nagyon nem erzem magam felnottnek. Lehet sokszor mar olyan a gondolkodasom, de azert meg elesbe nagyon brutalis lesz...", "Sun Mar 17 07:36:51 ": "Kezdem elveszteni a motivaciomat es egyre inkabb leszarom a tanulast.. Ez igy nem jo...", "Thu Mar 21 12:31:47 ": "@noemypal mar vezetsz is? na de jol haladsz :) na mi a gond vele ? :D", "Sat Apr 13 17:34:53 ": "Sor, chips, cigi, film.. Kell ennel jobb este?", "Sun Mar 10 20:41:38 ": "Komolyan elegem van.. Miert ilyen nehez?? Miert kell mindig valaminek tortennie? Es miert pont velem?! #afaszkivan", "Sat Mar 23 12:57:45 ": "Hetfon gazdalkodasi modulzaro es mar ketnapja elabe, haszonkulcs es aresszintekkel almodok... #whatthefuck", "Sun Mar 31 08:47:31 ": "@vycawood miert iratkoznal ki? :O", "Sun Mar 24 07:30:19 ": "Takaritas pipa. Jojjon a gazdalkoodas...", "Sat Mar 23 20:48:06 ": "Alig birok nyelni.. A kis draga mandulacskaim mar megint nem birnak magukkal.  Valakinek valami tipp mit csinaljak, hogy ne legyen rosszabb?", "Fri Mar 15 17:32:07 ": "Na megtalaltam az elvileg tokeletes twitterappot a telomra. Vegre.", "Sun Mar 10 20:39:44 ": "Annyi dolog maskepp alakul megint.. Sok tervemet es olyan dolgokat kell feladnom, amikrol nem hittem volna hogy megtortenik/kell MEGINT...", "Thu Mar 21 14:15:27 ": "Itt az otodiken cigizgetek.. \"pazar\" a kilatas.. Unatkozoom es ehes vagyok mammuuus! http://t.co/OYN4s86Cqx", "Sun Mar 31 06:04:55 ": "RT @andromusic: Macklamore = VV Olivér és Halott Pénz közös gyermeke :D", "Tue Mar 12 10:19:14 ": "Mamus foztjenel, mar csak az en foztom jobb :) nyaamm", "Sat Mar 09 07:51:39 ": "Mar megszokhattam volna hogy valaki vagy valami mindig keresztulhuzza a szamitasaimat. Fuck eso:@", "Fri Mar 08 20:06:34 ": "Holnaaap de jó lesz! Ezeréve végre eljutunk az állatkertbe. Már most imádom.. Csak legyen jóó idő! :) #iwish", "Sun Mar 17 07:00:48 ": "Morning :)", "Tue Apr 09 10:24:36 ": "Itt a tavasz, dagad a fasz. Hahahahaha", "Wed Mar 13 09:17:48 ": "I'm at Győr (Győr, Győr-Moson-Sopron) http://t.co/OBeXMORX89", "Fri Mar 15 18:25:33 ": "Nekem 8 vagy Tavkapcs? :) #estimozi", "Sun Mar 17 12:39:01 ": "Nem kellett volna megneznem ezt a filmet..", "Sun Mar 10 08:43:37 ": "@imitationpearl egyaltalan nem olyan jo a gyori allatkert. Tegnap voltam es elegge csalodtam..", "Mon Mar 11 13:09:52 ": "Egy kis #edenhotel nezes, piheneskepp.", "Sat Mar 16 07:24:01 ": "Na ismet tanulos nap lesz... Nemet, elsosegely, gazdalkodasi. I enjooooy..", "Mon Apr 15 06:23:23 ": "I'm at Győr (Győr, Győr-Moson-Sopron) http://t.co/wm64eE6ocJ", "Mon Mar 18 06:44:49 ": "Amikor raveszem a lusta testemet a mozgasra, jelen esetben a futasra, tuti hogy szar az ido.. Koszi eso a mai pihit!", "Sat Mar 16 06:32:40 ": "Milyen jo ido lett, igy egyik naprol a masikra.. Mintha csutortokon nem is lett volna ilyen olyan szar ido.. El se hiszem!", "Thu Mar 28 04:16:11 ": "De reg keltem mar ilyenkor.. Most is csak par ora infoert be kell mennem, vicc. De bemegyek, mert mar reg voltam ilyenkor suliba :D", "Fri Mar 08 19:48:46 ": "@vycawood eddig imádom! még pár dolgot nem értek rajta, meg pár dolog még kéne rá, de állitom egy nap után hogy az egyik legjobb telefon! :D", "Fri Apr 19 19:27:47 ": "Ich bin kellner. I'm waiter. En lenni pincer.. Oyeeess. Ez a mai esti lazitas mar nagyon kijart.. :)", "Thu Mar 21 18:11:02 ": "Na hangolodjunk at ...", "Sat Mar 09 06:04:10 ": "Joo reggelt :) legyel jo ido!", "Fri Mar 29 07:38:15 ": "Varom apamat a kocsiba. Siesssssel (@ Győr buszpályaudvar) http://t.co/U2JaT9I3Zh"}