{"Fri Feb 10 08:07:15 ": "Waiting for Dr !!! Annoying", "Mon Nov 28 17:15:09 ": "@LukeDonald can't wait to see u guys play!! Bring it on! As we say GET IN THERE!!!!!!!", "Tue Aug 09 18:05:30 ": "@GarethCliff why is the sound so bad?", "Sun May 06 07:59:36 ": "Another great day to be a South African to achieve under those odds!!! Well done SA mens hockey team", "Mon Jul 30 05:43:11 ": "Congrats@Cameronvdburgh wow what a achievement the whole of SA is proud of u! Enjoy this special moment!", "Tue May 24 15:36:41 ": "@nixinoodle welcome to the twit family", "Mon Jan 23 20:08:33 ": "@Jeffers0034 we have many stories on old Nella !", "Mon Jan 02 07:23:47 ": "@ABdeVilliers17 morning any team news for tomorrow?", "Sun Aug 12 05:54:12 ": "@TrevorImmelman come on Trev make it 2 South Africans in a row! We are all pulling for u here in SA", "Sat Jul 14 19:21:35 ": "2 days in !! On golf tour mmmmm tomorrow will be tough", "Sun Oct 16 05:40:07 ": "@TrevorImmelman well played trev, win it and make SA proud", "Sat Jul 09 20:16:03 ": "@skegpot hey Nick howzit going man? How's the injury coming on?", "Thu Dec 29 15:27:45 ": "Disgraceful performance from SA the choker tag is still there!!! Smith must resign!!", "Sat Feb 25 17:10:31 ": "Congratulations to sa womans hockey team! Stand up and notice sascoc", "Mon Jul 11 18:07:42 ": "@KirstyBisset they do just depends where they from!!?? Tramps maybe!", "Thu Jul 12 04:01:02 ": "One day left before heading on golf tour with mates!!!! Ooooo my kidneys!", "Sat Dec 03 13:30:32 ": "@AndrewColtart see u at the cascades pub later!!! The springs boys and the motherwell Scotsmen", "Sat Feb 11 17:38:05 ": "@SuperSportBlitz yes", "Mon Nov 21 19:49:40 ": "@Graeme_McDowell hey graeme looking forward to seeing u at sun city long overdue", "Sat May 07 05:45:54 ": "RIP Seve", "Sat Dec 29 15:25:50 ": "@langero WTF??", "Tue Jan 24 14:21:00 ": "@KerrynDuRand @ilovewonderbra RT", "Sun Sep 11 06:09:09 ": "RT @langero: @F1sasha 32 - 6 Aus.", "Thu Dec 29 15:32:00 ": "@NeilManthorp any changes? Doesn't feel like we moving forward!", "Sun Jul 10 18:02:09 ": "@natashagladwin hi this is weird I didn't know there were any other gladwins in JHB", "Wed Sep 12 20:13:18 ": "@ackershd hahahaaha I agree, what a chop!", "Sun Dec 30 16:16:45 ": "@pauldalglish in mozambique can't see the footy! Are LFC playing well?", "Wed Jan 25 10:45:41 ": "@KerrynDuRand pretty blue sky :)", "Sun May 06 17:58:56 ": "@albiemorkel @ABdeVilliers17 what a innings!!!", "Thu Jan 03 17:23:42 ": "@langero at the kruger now will be home tomorrow! We will thanks bru", "Tue Jul 31 19:13:08 ": "RT @followthebounce: What a race! Wow that was surely one of the greatest races ever! @LeClos_Swim , that was amazing!", "Thu Jan 03 17:19:32 ": "@langero sad sad news! My sisters mates with his wife and family! Devastated", "Thu May 24 06:07:33 ": "RT @PatSymcox77: @ChristBook: Your past is past! Nothing will change it. You're only hurting yourself with your bitterness.", "Mon Sep 05 18:06:29 ": "@GraemeSmith49 YNWA# fantastic", "Tue Jul 19 18:27:22 ": "Harry's law rocks", "Thu Aug 02 19:24:10 ": "RT @marclottering: Another Gold Medal coming our way people! Jackie Selebi finally home today. The fastest friggin fifteen years EVERRR!!!", "Sun Sep 11 06:09:23 ": "@langero tosser", "Wed Feb 22 13:16:36 ": "@langero having a twit off", "Tue May 24 15:02:00 ": "@TigerWoods hahahahahahahahahahahahahahahahahhahahahahahahahahhaha", "Sun Jul 17 17:08:21 ": "Congrats D Clarke what a victory", "Thu Jun 07 17:35:57 ": "RT @jacqueskallis75: Hello people. Finally given in and joined twitter.", "Wed Mar 20 04:35:23 ": "Long weekend!! Here we go!", "Tue Jan 24 05:26:53 ": "@Jeffers0034 well done twit!", "Fri Jan 20 19:21:06 ": "@JohnSmit123 well said!!!", "Sun Dec 18 17:11:32 ": "@luis16suarez great game from all your supporters in south africa #YNWA", "Sun May 06 17:54:20 ": "@Jeffers0034 are u watching AB devilliers", "Tue Jul 26 12:26:30 ": "@LucasLeiva87 hey Lucas what's this nonsense that u might be leaving liverpool? I hope not #YNWA. Please RT for me", "Wed Feb 22 13:14:42 ": "Nice having a twit off", "Wed Jan 18 04:57:08 ": "@LeighAnnMol duran is right buck probably from benoni country club must have got out", "Tue Jul 10 18:39:41 ": "Congrats and best wishes to @markb46 on a great career u will be sorely missed", "Sun May 06 07:56:58 ": "@ABdeVilliers17", "Thu Jan 03 11:12:18 ": "@JustPlainTwit agreed greatest of all time!! @jacqueskallis75", "Thu Jul 21 12:29:07 ": "@warne888 welcome hope u have a great time! What u here for?", "Sun Nov 06 05:30:22 ": "Great wedding... Hungover", "Sun Dec 16 11:24:42 ": "Silly season is here at full pace!!", "Sun Aug 14 16:59:50 ": "@ABdeVilliers17 agree but Kelly gets my No 1 spot", "Tue May 24 03:54:38 ": "@CaroWozniacki congrats and make this your first slam!!!", "Thu Oct 18 17:55:48 ": "@LukeDonald. Hey Luke its a pitty u are not coming to Sun City this year we are going to miss u here in SA", "Tue Jan 03 19:03:38 ": "@luis16suarez #YNWA# hang in there", "Fri Oct 14 20:05:16 ": "@Francoishougi heard rumours u leaving the bulls? RT please", "Wed Jan 30 13:09:21 ": "I think someone is hacking your twitter account @ash_simon", "Fri Dec 30 05:43:39 ": "@siasduplessis agree with u, and boucher needs a big test!", "Thu Dec 29 15:29:27 ": "@ackershd really disappointing, it doesn't feel like we moving forward! Changes??", "Wed Feb 22 13:16:17 ": "RT @langero: @F1sasha 9949", "Mon Jun 13 18:47:22 ": "@siasduplessis hahahahahahaha I thought u know your sport. He is another Tim ,will crack under pressure", "Sun Jul 22 17:34:18 ": "Well done Ernie u legend", "Tue May 10 09:13:10 ": "@KimSchulze hahaha why", "Thu Dec 08 18:53:55 ": "@AndrewColtart long and low like a barmaids t..s! Have u recovered from sun city and the cascades bar?", "Thu Jun 09 11:05:43 ": "@Locnville hey guys sorry to hear what happened. Looking to book u guys in october any help who can I contact?", "Wed Mar 20 04:37:01 ": "Is it a problem when your 2 sons age 9 and 5 are googling BOOBS on the ipad? Haha", "Fri Jan 13 12:30:48 ": "@warne888 how come SA don't play 4 tests against Eng and Aus?? They should I think, your thoughts", "Mon Dec 26 13:55:33 ": "@NeilManthorp interesting wicket for day1 at kingsmead! Your thoughts?", "Thu Jun 07 17:36:09 ": "@jacqueskallis75 welcome", "Mon Dec 26 16:00:09 ": "@NeilManthorp interesting so by wednesday arvie its gonna be unpredictable SA must bat once !", "Fri Sep 16 07:17:22 ": "East rand rocks music festival great bands 26 nov", "Wed Feb 01 04:23:29 ": "@siasduplessis yip contact rudi bryson events. He will be at st albans", "Sun Feb 03 14:06:56 ": "@jose3enrique3 we are all pulling for u here in South Africa! YNWA", "Mon May 16 18:01:49 ": "@KirstyBisset tie please :)", "Wed Jun 08 07:06:49 ": "@NicoleFlint great to meet u last night keep up the good work", "Sun Mar 31 17:24:24 ": "@dalejackson that's brilliant the boys are doing well! Congrats on turning it around", "Mon Jul 11 18:06:22 ": "What a day and weekend bring it on!!!!", "Mon Jan 23 20:08:02 ": "@Jeffers0034 hahah twit off hey mikey", "Wed May 30 19:39:03 ": "RT @pauldalglish: Brendan Rodgers.....Welcome to the mighty reds. Good luck.", "Thu Apr 12 19:39:26 ": "@Scottmcg73 what the fuck", "Fri May 06 10:44:42 ": "@siasduplessis any idea on the rugby scores at the moment?", "Tue Jul 31 18:57:56 ": "Wow what a race!!!!! Come on Chad u legend", "Tue Aug 09 18:17:45 ": "@KazG5000 hey baby waz up!", "Sat Nov 10 03:48:08 ": "@NeilManthorp has play been called off for the day?", "Fri Jan 06 20:54:30 ": "@LucasLeiva87 how's the knee? From supporters in south africa", "Fri Nov 23 02:14:00 ": "@PatSymcox77 we can do it!", "Fri May 20 08:38:50 ": "@mark_keohane any news on the rugby score? Stormers", "Sun Jan 29 14:11:29 ": "@dannicholl question? How do woman tennis players get the same prize money, when these guys bash it for over 5 hours?? RT please", "Sun Aug 14 02:45:11 ": "@mark_keohane P Div has brought us nothing in 4 years, if he were any other coach he would've been fired!! 2003 all over again! RT please", "Sun Dec 18 17:09:04 ": "@7polly7 errol stewart?", "Fri May 11 11:23:03 ": "Come on the Bulls", "Fri Aug 03 17:55:42 ": "Batman was great", "Fri Feb 17 09:44:31 ": "RT @JackParow: GAUTENG I'm coming your way..come jol with me at FIRKIN, CENTURION - 24 Feb, TANZ CAFE, JOZI - 25 Feb, PRESLEYS, BOKSBURG ...", "Fri Jan 06 20:53:22 ": "@LucasLeiva87 2 - 1 LFC half time", "Fri Jul 13 02:36:19 ": "And so it starts aaaahhh ccooommeee ooooooonnnnnn", "Sun Dec 30 17:51:28 ": "@KevinMcCallum agreed #YNWA#", "Mon Dec 31 14:40:30 ": "@ackershd such a nice message till the last bit! Hahahaha have a good one"}