{"Fri Jul 15 16:56:38 ": "@Beldegrom proč to není na youtube? ;-)", "Tue Sep 04 01:04:58 ": "Dal jsem na, G+ několik fotek z Detroit downtown.. Mrkněte na to.", "Sat Jul 09 20:08:06 ": "RT @kaepora: It's important to remember that both Visa and MasterCard still allow donations to the Ku Klux Klan, but specifically block  ...", "Tue Nov 27 18:29:28 ": "Mr. Hayek is clearly The Winner to me!\nhttps://t.co/Q8NOmSWc\n#Hayek #Keynes", "Sat Jul 09 20:15:52 ": "Piju alkohol a baví mě to...", "Sun Oct 23 17:39:00 ": "I just added my Twitter account into @digsby! http://t.co/WCEsAVsj", "Thu Apr 28 09:35:22 ": "I v lowcost tovarni kantyne muze vypadat jidlo vzhledne... http://yfrog.com/h8cn5hej", "Thu Jun 23 16:29:48 ": "@Beldegrom predevcirem jsem reportoval. Vcera jsem mel volmo...", "Sat Sep 01 13:34:26 ": "@MALION_CZ vyzkoušej hru Spirit. Teda je ve slevě za 1usd. Je to dost podobné Lemmings..", "Sat Oct 13 17:05:33 ": "#volby Nevadí mi CSSD, je to demokratická strana. Proč ovšem voli lide KSCM opravdu nechapu...", "Sat Apr 09 16:18:01 ": "Mam za sebou prvni jizdu na in line bruslich a hodnotim to kladne. Rozhodne je to zabava a relaxaxe...  join us!", "Sat Jan 26 15:27:55 ": "Tiskovka budoucího prezidenta je docela mazec...", "Sun Dec 02 09:08:16 ": "The Austrian Business Cycle Theory Explained: http://t.co/0cpUvI0w přes @youtube", "Tue Jul 05 14:47:00 ": "Aquapark v ceslicich hodnotím kladně. doporučuji..", "Sat Jul 09 19:17:17 ": "Dead man´s burpees: 104 za 10 minut!", "Tue Jul 05 21:26:08 ": "@Milan_Gistr neznám moc pražský slovník. jsou to lidé kteří jsou zde potřeba nebo ti co potřebují pomoc?", "Tue May 03 17:35:09 ": "@Beldegrom  doufam ze jsi si to uzil. Zvrhliku!", "Fri Jul 06 06:21:34 ": "Vajoletky 5.7.2012\nhttps://t.co/GUXnkGqZ", "Mon Apr 18 06:21:26 ": "Hura do germanie!", "Sun Aug 12 06:28:09 ": "Mé méně tolerantní já mě donutilo změnit svoji profilovou fotku! Prý lépe zapadnu do společnosti. Stává se ze mne Ovčan.....", "Fri Jul 01 12:36:21 ": "@Beldegrom hodnotim ten serial hodne vysoko. Dneska si dam posledni dil...", "Tue May 31 04:28:08 ": "Ranni vstavani je peklo a nikdo by k tomu nemel byt nucen... je to zlocin proti lidskosti.", "Sat Jul 09 19:49:11 ": "@Beldegrom My jsme ještě nenaplnili sandbag. Mistress mě deklasuje :(", "Sat Jan 12 15:08:15 ": "Pan Nečas vypadal, ze se nad výsledkem pana Sobotky rozpláče.. #volby", "Fri Apr 15 11:33:58 ": "Vyuctoval jsem nejake diety. Cas jit do baru!", "Sat Apr 09 16:19:10 ": "Ted me napadlo ze je to dalsi sport pro pipinky a pornoherecky v nasi intelektualni panske spolecnosti. Nevim jestli se nemam stydet...", "Tue Apr 12 19:03:31 ": "Dneska jsem se byl na par minut projet Paderbornem. Libi se mi tady.. http://yfrog.com/h45ibnbj", "Mon Aug 08 18:52:33 ": "A to znamená, že tiskárny peněz jedou naplno...", "Sun Nov 04 20:27:24 ": "Jediné co může ODS pomoci jsou tři volební období v opozici. A to i na úrovni regionů... #kongresods", "Wed Jun 22 17:41:30 ": "@Beldegrom Ale no tááák! Tátové jsou taky chlapi! To je heslo dnešních reklam..", "Sat Jul 02 18:51:25 ": "@Beldegrom cool!!", "Wed Jun 22 17:35:47 ": "Již se těším na páteční spářku a Michala do půl těla!", "Sat Jan 12 14:52:59 ": "Karel se dokázal usmát, ale fakt neumí zpívat!! #volby", "Fri Jul 15 14:14:15 ": "@Beldegrom Holt nějakej borec!", "Mon Apr 11 03:40:48 ": "Video games are bad for you? That's what they said about Rock n' Roll!", "Mon Jun 20 12:44:15 ": "@Beldegrom Pomsta bude tva!", "Tue Jul 05 18:59:40 ": "@Beldegrom pořád nemáme žádnou zátěž....", "Fri Jun 24 17:09:56 ": "A tady i s Rafalem!\nhttp://t.co/JS7gRCL", "Sun Jul 31 16:35:08 ": "RT @CERN: #CERN experiment weighs antimatter with unprecedented accuracy: http://ow.ly/5Pj1m", "Mon Jun 20 19:07:39 ": "Dávám do placu výzvu: Sejdeme se a rozdáme si dohromady s Mistress 600 reps workout!", "Fri Jul 06 09:58:14 ": "Úvaha: ACTA padla, vyhráli jsme! Ale oni to nevzdají http://t.co/h81y8EwC via @pctuningcz", "Fri Apr 08 10:08:34 ": "@Beldegrom to jeste jde. Ja koncil se skolou ve svych 34. Jsem jeste zaostalejsi. Nicmene GRATULUJi. Ted uz jen drobnosti jako statnice ...", "Sat Jul 14 19:19:02 ": "Jak bourat stereotypy.... http://t.co/WxWZTaRO via @youtube", "Wed Jun 22 08:57:47 ": "@Beldegrom to pujde. Drzim palce!", "Sun Oct 28 01:01:20 ": "@Ondřej Mališ Ty jsi neveho Bonda uz videl?", "Sun Oct 21 14:50:34 ": "RT @Iloveclimbing: \"Please don't slip before I clip!\" Derek Galloway visualizes a better heel hook in Echo Canyon, near http://t.co/z51x5wsg", "Thu Jul 07 11:10:42 ": "@Milan_Gistr podívám se na to až přijdu domů. Jsem zvědavý!", "Tue Jul 17 17:58:04 ": "Economist Debates: Euro debt - Should the euro zone's debt be mutualised? http://t.co/CX56c313", "Mon Apr 11 19:01:11 ": "Prvni vylet do bazenu na koleckovych bruslich mam za sebou. Brusle jsou kuuul!", "Sat Oct 20 15:08:56 ": "Právě koukam v restauraci na lokální zprávy:\"Shootingspree in Detroit\". Je to tady divokej Stredovychod!", "Tue May 03 15:56:13 ": "@Beldegrom nebo petatricatnik beee", "Thu Apr 04 19:48:04 ": "Povedená vizualizace!  http://t.co/uOkYUKj5xb via @iHNed_zpravy", "Mon Oct 15 02:35:03 ": "@Malion_cz Já si začal znovu cist 1984...", "Tue Jul 05 20:10:14 ": "@Beldegrom to je boží!!", "Sat Jan 12 15:04:31 ": "Poklona Statistickemu uradu. Mame dobrou io nfrastrukturu kdy je za dve hodiny prakticky secteno! #volby", "Tue Oct 09 12:24:09 ": "#livejump @redbullstratos Launch in few minutes. Good luck!", "Thu Jun 02 11:46:50 ": "Konecne. Jdu to hned zkusit! RT @Milan_Gistr: Google dnes v ČR spustil GPS navigaci pro platformu Android!", "Sun Jun 05 14:58:16 ": "Mladik v detskem koutku. Doufam ze do budoucna se v jeho ocich obevi i zablesk inteligence.. http://yfrog.com/h4iaxnuj", "Fri Jul 15 14:16:28 ": "@Beldegrom Vlastně je to můj hrdina. Má motorku, zbraně a jezdí si po Evropě...", "Tue Jun 21 04:46:23 ": "@Beldegrom Čekal bych, že budeš nad nápadem plesat radostí!", "Tue Dec 18 12:03:12 ": "@Malion_cz Jsi zván na expedici Kapelník 2013! https://t.co/k66NS6OA", "Tue Jun 21 18:40:32 ": "Dneska jsme dávali to 100 Dead man burpees.Já 11:40, Petra 14:05. Jsme dost přes limit...", "Sun Apr 17 05:51:20 ": "@Milan_Gistr skoda ze to nema navigaci.  Ale pekny..", "Sun Jul 10 15:42:21 ": "Projížďka v luxusních top sporťácích za úžasných 990 Kč místo 6495 Kč! Aston Martin DB9 Mansory, Por … http://t.co/gCh6EIL. Kdo jde se mnou?", "Mon Aug 08 18:52:03 ": "RT @whitehouse: \"The most immediate concern of most Americans is jobs & the slow pace of recovery coming out of the worst recession in o ...", "Sat Aug 25 02:16:58 ": "@Malion_cz Here you go! http://t.co/LKKzgS4h", "Fri Jul 15 18:05:46 ": "Hrál jsem si s Mistress na \"namořníky\". Pěkná hra. Ale zase vyhrála :(", "Tue May 31 10:59:55 ": "Presovac v kancelari bude moje smrt!", "Mon Oct 29 22:33:06 ": "Jsem kousek od Detrioitu a začíná se zvedat vítr. Snad nevypadne elektrika a internet. To už by šlo pomalu o život  :)   (mám el. topení)", "Fri Dec 21 09:48:33 ": "RT @sheriffjim: WHY IS IT, AFTER A SHOOTING SPREE THEY ALWAYS WANT TO TAKE THE GUNS AWAY FROM THE PEOPLE WHO DIDN'T DO IT?", "Sat Jan 12 14:39:25 ": "Karel for the President!    #volby", "Sun Jul 03 08:35:56 ": "Tak žena má lepší telefon než já. To se opravdu dotýká mé mužnosti!!", "Wed Aug 10 04:36:14 ": "V uk mají docela veselo.....", "Mon Apr 18 07:45:30 ": "Posledni dil Planet Money (o Islandu) je skvela. Doporucuji.", "Tue Jul 05 18:38:50 ": "Tak máme za sebou right  there work out a mám fakt dost. Hranici jí odpouštím ale bičování chci na youtube!", "Mon Jun 20 10:15:06 ": "@ondrejhavlicek  dik. Vecer se na to mrknu.", "Sun Jul 03 16:05:33 ": "Opít se uprostřed dne není dobrý nápad. Bolí mě hlava.", "Mon Jun 20 11:20:26 ": "Nainstaloval jsem si novy twitter klient. Bohuzel pro plnou podporu potrebuje android 2.1..... vecer me ceka flashovani...", "Wed Aug 10 08:15:30 ": "@Michal Vittek tak to je borec.", "Mon Nov 26 17:37:51 ": "@Malion_cz Tohle si zítra zkusíme. Už jsem skoro dal třetí presku.. http://t.co/8bhtWuri", "Fri Jun 24 17:08:20 ": "Možná jsem trapnej eurofil, ale let eurofighteru nad Evropou mě naplňuje pýchou!\nhttp://t.co/SXIsWUv", "Sun Jul 10 18:49:54 ": "Cardio Legs & Core Workout výsledky:  264/73/73/120. Když to srovnám s Mistress, musím se stydět.. Hranici jí odpouštím, bičování požaduji!", "Fri Jul 15 16:38:25 ": "Dneska budu mít rande s Mistress. Již se na to těším!", "Wed Jun 22 12:16:10 ": "@Beldegrom Gratuluji!", "Tue Apr 12 18:59:43 ": "@Beldegrom pekne! Podivam se na to doma. Na mobilu to nezanech nalezity dojem.  To s tim zaseknutim je docela presne..", "Sun Jul 22 09:58:56 ": "Attractiveness discrimination: Hiring hotties | The Economist http://t.co/OuSlgcnJ", "Mon Jul 04 19:53:17 ": "@Beldegrom od pohledu prima usatej mladík..", "Wed Aug 10 11:44:51 ": "Tak jak to vidíte? Twitter nebo google plus?", "Mon Apr 18 16:05:24 ": "Tak za tohle ma u me pochvalu.. RT @Beldegrom: Hustě paní Roithová! Jen tak dál. - http://bit.ly/hlEj61", "Sun Jul 10 16:36:46 ": "RT @clarkekant: Too dumb for science? Try religion!", "Mon Jun 20 19:06:58 ": "Já si dneska s Mistress dal Hot Body workout. Takže žádné porovnání dnes nebude.", "Mon Jun 20 11:35:33 ": "@Beldegrom iphone je dobra volba. Ja chci teda dat sanci jeste nokii a win mobile..", "Wed May 23 07:18:42 ": "@Beldegrom Líbí se mi, že používáš twitter!", "Sun Nov 04 19:14:33 ": "ODS je uplne mimo realitu. Jediny pan Kubera vypadal, ze je pri smyslech. Na jednom cloveku se politicka strana postavit neda...#kongresods", "Sun Dec 16 12:31:50 ": "Docela jsem se u toho zasmal... http://t.co/jwUkJJ7b", "Sun Jul 03 17:37:50 ": "@ beldegrom Nesňižuj to!", "Thu Oct 11 14:23:24 ": "Co dělat abych lezecky nestagnoval?", "Thu Apr 04 19:55:20 ": "http://t.co/tx8FiuoEhs", "Fri Nov 30 16:44:09 ": "Raiffeisen banka vydala bankovní aplikaci. Uživatelským prostředím i funkčností mě příjemně překvapila. #raiffeisen", "Sat Jul 02 18:32:09 ": "Tak jsme si dali ready to sweat. Pekna rozcvicka pro urednicke povalece...", "Sun Jul 10 19:23:20 ": "@Beldegrom No dobrá, pro dnešek by tahání nervů ze zubu stačilo.. Jsem to, ale měkosrdcatej..."}