{"Mon Feb 04 15:45:14 ": "@birtebakker haha so wie so niet!!", "Mon Feb 25 09:57:13 ": "@jonathanvdburg haha goedemorrrgennn jonaaa", "Sun Feb 10 13:28:58 ": "Zondag is een heerlijke dag om op verjaardag te gaan :)", "Sat Feb 09 00:40:14 ": "Met mijn leesje is uitgaan altijd leuk", "Sat Feb 09 14:41:17 ": "Lekker een nachtje met lief bij paps en mams en zusjes in friesland :)", "Wed Feb 20 16:30:40 ": "@MijkeEggink haha. Maar als je ze hebt, wij sparen ze wel. ;) ja, zaterdag zijn we erbij!", "Mon Mar 04 15:10:06 ": "Vandaag is er iets uit Zuid-Hollands in mijn stem ontdekt, ik ben nog altijd een Fries.", "Wed Feb 13 11:01:03 ": "De hele dag bloedprikken, dan heb je pas werk", "Tue Mar 05 19:45:40 ": "@JosFaber heel erg spannend, wel heel erg leuk! Gefeliciteerd", "Tue Feb 05 13:33:43 ": "@passengermusic gotta cry, I can't be with you and I won't listen to you live tonight or tomorrow =(", "Sat Mar 09 21:47:11 ": "Ben toch niet echt met school bezig op deze zaterdagavond? JAWEL ECHT", "Sun Mar 03 20:08:43 ": "@Rickvandermark jaweeeel heerlijk", "Mon Mar 11 19:29:50 ": "Languit op de bank en er alleen nog af om me te verplaatsen naar bed, deze dag was geen goede #vermoeid", "Fri Feb 08 18:14:16 ": "Ik heb echt een hekel aan deze dag", "Wed Mar 06 08:15:26 ": "@Ambervds die tijden ken ik niet eens gwo0n_amberr ;)", "Tue Feb 05 08:26:03 ": "Waarom kan ik op dinsdag niet overdag of 's avonds zwemmen:(", "Sat Mar 02 23:02:53 ": "@Ors0n010 gefeliciteeeeerd!", "Mon Apr 01 13:57:35 ": "Had eigenlijk paaseieren moeten gaan zoeken, nu alleen nog studie en werk. Pasen is niet meer wat het geweest is, goood old days.", "Sat Feb 09 00:38:25 ": "@WilsonH92 happy birthday will!! Miss you at times. Enjoy. X", "Fri Apr 12 17:53:27 ": "Belachelijk, #marktplaats verwijderd en blokkeert constant account, hulp waarom is ver te zoeken.", "Fri Feb 08 09:41:27 ": "@emelisande coming to Aberdeen for u in april while visiting my sister, never stop breaking the law!!! :):)", "Wed Jan 30 22:04:03 ": "Zo'n bufferweekje doet ieder mens goed :)", "Wed Feb 13 10:57:55 ": "@wekjyp ik heb er ook overna gedacht dat misschien te gaan doen!", "Tue Jan 29 12:13:52 ": "@GerjanvdWeg ja was kapot!!!", "Fri Apr 19 10:57:31 ": "Omg, I wish I could go to @emelisande  in Aberdeen tonight, oh well I am going!!! wwwhooopp :)", "Wed Feb 27 09:47:15 ": "RT @PeterRdeV: Vandaag naar http://t.co/xNuXvIRVff forma-zitting zaak Vaatstra. Eindelijk #JasperS. eens in de ogen kijken...", "Mon Mar 04 15:10:30 ": "We zijn trouwens bezig met gebruiken van je stem op school", "Wed Jan 30 22:04:19 ": "Maar de tijd gaat weer eens veeel te snel", "Sat Feb 09 00:41:46 ": "We zijn er nu, straks gaan we kruipen", "Sat Feb 02 18:43:56 ": "Iemand nog geïnteresseerd in indoor bloemendaal feestje in adam? Heb kaarten!!", "Mon Feb 11 15:06:59 ": "@albertheijn dit soort dingen beter aangeven is ook een vak", "Thu Jan 31 12:33:08 ": "Studiedagje in mijn bufferweek?", "Fri Feb 08 18:13:42 ": "RT @emelisande: Wow!! Aberdeen!! Tickets sold out in 20mins!!! #homecoming", "Tue Feb 12 14:28:45 ": "@albertheijn Dacht ik. Doelenstraat in Ede. Het zal vast aangegeven zijn, maar te onduidelijk. En het is belachelijk hoe ze hier mee om gaan", "Mon Feb 11 15:07:49 ": "Schoolbezigheden thuis voortzetten", "Wed Apr 17 17:19:02 ": "@ItsTheAtto heb jij een genotsknots? Mwahhh lol, looook it up ;)", "Wed Feb 06 10:23:43 ": "Lekker ontbijtje van vriendlief :):)", "Mon Feb 11 12:38:23 ": "Vandaag heel veel inlezen voor school,een te fijn weekend gehad, het is weer maandag", "Wed Feb 20 15:58:14 ": "@MijkeEggink sparen jullie de mini's?", "Tue Feb 12 09:04:10 ": "Dinsdag blog dag", "Fri Apr 19 22:59:44 ": "RT @emelisande: wearing my new fave necklace! Thank you houseofhalo here we go, last show! #ovoelive2013… http://t.co/n0p4PMNPkm", "Sat Feb 09 00:40:29 ": "Hoewel we nog even in de stemming moesten komen", "Wed Feb 06 15:49:30 ": "Zojuist is mij verteld dat ik een hatelijke lach heb", "Sat Feb 02 13:46:45 ": "Zojuist wel heen en weer gevlogen voor een nieuw zadel, dat dan weer wel", "Sun Feb 03 18:02:01 ": "Kippetjessss", "Wed Mar 06 21:30:29 ": "@MijkeEggink en live nog beter!!", "Fri Feb 01 23:36:14 ": "Goodnight", "Wed Feb 27 14:19:24 ": "3 uur drama, conflicten uit het nieuws. Rollenspellen zijn best leuk, zo op het einde van de dag:)", "Sun Feb 03 19:47:05 ": "Weer in een nieuw seizoen obese, geweldig!", "Sat Feb 02 13:46:19 ": "Een lichtelijk dode zaterdag met een klussent vriendje die heel snel mijn fiets nieuw maakt :)", "Wed Feb 06 20:45:06 ": "Het is zo leuk, voorbereidingen treffen voor de medaille uitreiking van het vriendje...", "Sat Feb 09 11:06:13 ": "@albertheijn nieuwe managers betekent nieuwe regels, nergens aangegeven dat mijn pup niet meer op de arm mee naar binnen mag... 1/2", "Thu Feb 07 07:42:28 ": "Goodmorning goodpeople", "Tue Feb 05 11:21:39 ": "Toch nog 25 baantjes gedaan :) lunch achter de kiezen, en nu wat mailtjes eruit gooien", "Wed Feb 27 07:22:18 ": "Nog steeds niet helemaal fit maar wel een nacht door geslapen. Vandaag weer even goed aan de slag dus.", "Sun Feb 03 17:05:03 ": "@MijkeEggink nu weten we het wel ;) ha ha", "Sat Apr 20 04:08:46 ": "RT @emelisande: Thank you Aberdeen for a perfect home coming!", "Sun Feb 03 12:10:53 ": "Alleen maar nette mensen!", "Thu Feb 14 14:31:45 ": "Een dagje dingen regelen, opzoek naar werk, pracht cv boekt snel succes ;)", "Thu Jan 31 22:37:20 ": "@Ambervds haha no fun", "Mon Feb 11 12:43:43 ": "De enige drang naar sigaretten is nog te vinden op school", "Sat Feb 02 13:47:38 ": "Laat ik met bailey door het bos gaan rennen, doet me vast goed", "Fri Mar 01 13:06:15 ": "Het niveau debatteren is niet te geloven. Ik dank W. Bosscher, mijn leraar Nederlands op de havo voor het bijbrengen hoe je een debat voert.", "Sat Mar 02 22:47:26 ": "Dat gevoel dat je steeds zin hebt om te stappen, te lui om je te fatsoeneren, ik blijf thuis...", "Sun Mar 10 22:17:29 ": "Ontstoppingstaferelen zo voor de nachtklok. Leukhoor", "Thu Jan 31 19:05:19 ": "@thescript what about \"Give The Love Around?\" #TheScript3USTour", "Thu Jan 31 12:57:22 ": "fight for your right", "Thu Feb 07 12:12:36 ": "Ik ben wel een trots vriendinnetje", "Mon Feb 25 09:44:40 ": "Einde vakantie. Vandaag agenda updaten en alles weer op een rijtje, telefoontjes, telefoontjes...", "Mon Feb 04 15:32:34 ": "En helemaal omdat ik zo eindelijk mijn nespresso bestelling krijg, heeft veel te lang geduurd", "Thu Feb 07 09:00:43 ": "Allemaal leuke militairen om me heen lalalaaa", "Sat Feb 23 16:20:55 ": "Aardig uitgeziekt, bijna in rotterdam. Tijd voor lieve familie!", "Mon Feb 04 21:12:27 ": "4.6 km hophop :)", "Sun Mar 03 19:51:28 ": "@KellyJoan Ooooo heb ik zooo'n zin in", "Tue Feb 05 17:22:15 ": "@Lispetter wij dombo, ons appartement was chilllinngssssss kudadasi bestaat niet btw", "Thu Feb 07 08:14:04 ": "Helaas hebben we nog geen weekend en wordt het een dagje op en neer", "Tue Mar 05 18:26:32 ": "@JosFaber oh????", "Sun Feb 03 14:29:49 ": "@RVN_ wel heeeel slecht haha :p", "Sun Mar 03 19:34:57 ": "@Rickvandermark leuk heeee", "Mon Feb 04 10:25:57 ": "Ik ben blij om weer op school te zijn", "Wed Feb 13 12:53:10 ": "@wekjyp nee, misschien dit jaar! Hangt er vanaf of ik verder kan met wat ik nu doe.", "Sat Feb 09 11:06:51 ": "@albertheijn zonder pardon naar buiten gezet, trouwe klant kwijt !!!! 2/2", "Fri Feb 22 16:36:20 ": "Vriendje weer beter maar mij aangestoken, lekker het weekend in zo", "Sat Feb 09 00:34:37 ": "Deze nacht maakt veel goed van de dag", "Tue Feb 26 09:34:17 ": "Ziektekiemen hebben me weer te pakken", "Thu Feb 07 11:51:54 ": "@fvergouwe hahaha en of :):)", "Mon Feb 04 12:29:56 ": "Vandaag heb ik gedoucht met @thijsq that's that shit", "Mon Feb 04 15:32:12 ": "Verder is het een prettige dag", "Wed Feb 06 15:50:03 ": "That is thattt shitttt. Ik hou van mijn hatelijke lach", "Mon Feb 04 17:24:58 ": "Vanavond dan de 5km lopen?? :):)", "Sat Feb 02 13:37:52 ": "@MijkeEggink dit wekt jaloezie op...", "Thu Feb 07 08:13:48 ": "Inmiddels in zwolle, doorrijden naar leeuwarden trekt mij wel :):)", "Fri Feb 01 23:35:59 ": "You da one", "Wed Feb 06 11:47:54 ": "Mediarecht aaauwwtsss", "Fri Feb 08 18:14:37 ": "Daar drink ik vanavond op, dat is wel lang geleden trouwens", "Tue Mar 05 13:15:37 ": "RT @thijsq: Even 500 foto's geschoten voor een korte shoot met de crew van @ShalomIsraelNl", "Mon Feb 04 15:31:18 ": "Ik mag geen boodschappen doen als ik honger heb maar ik mag ook niet eten tot het avondeten. Ik heb honger en ik moet nog avondeten kopen...", "Thu Jan 31 21:53:42 ": "@Ambervds Ooooo?", "Mon Mar 11 19:53:35 ": "Nadat bailey lang stil was en niet meer blafte, heeft ze nu ontdekt dat ze kan grommen en zeuren ;) opnieuw beginnen :D", "Tue Feb 05 08:26:22 ": "Nou ja, ik kan het wel, het zwembad kan niet", "Fri Apr 12 23:37:21 ": "@ToineJorna hahahaha nooooiit"}