{"Thu Apr 26 12:13:44 ": "@MrPeterAndre thought you bribed the petrol industry! Will be watching you later; sending 'much love' (thankQ terry tibbs) my gorgeous man x", "Mon Nov 08 21:38:05 ": "im outa here, off to bedfordshire zzzz (yeah i know, its early but work tomorrow, boo!) night tweetmeisters xx", "Tue May 01 11:23:46 ": "@MrPeterAndre about time you changed your profile picture, j is getting older and bigger now!!", "Sun Apr 15 18:54:38 ": "@mrmichaelandre can't afford to cum  & see t'show boooooo! &..I'm only 20 miles away!Gutted big time.Have a gr8 shw, hpe 2cu another time xo", "Thu Oct 28 15:19:30 ": "@MrPeterAndre come to Norwich Peter!!!!!!! you never do for a signing yet you came here twice on your tour!!! We miss you xoxo", "Sat Nov 13 18:08:27 ": "been listening to Missy E today, she rocks...been wading though some early 2000 RnB albums, dont you just love montell and ja rule xx", "Fri May 04 18:22:23 ": "@mrpeterandre just watched your TV show from this week, gr8 episode, wishing your brother well my love xx look forward 2 seeing u next wk xx", "Sat Oct 30 20:43:19 ": "oh god, shes crying.... grow some", "Mon Apr 16 12:14:59 ": "@m_shinoda when you coming to UK Mike???? 'lovin your work'", "Fri Dec 09 19:38:07 ": "@MrPeterAndre getting there mega early so make sure you give us lot waiting some extra mc-lovin once we're in! I'll be wearing the mj vest!!", "Sat Dec 10 23:37:32 ": "@MrPeterAndre Fab show 2nt in Norwich, well done 4not getin 2 pisd wit sound probs. You wer gr8. Love ya, I had mj top on if you did notice!", "Wed Dec 01 00:41:24 ": "@MrPeterAndre your show rocked tonight in Cambridge, well done bubba! I had the rhythm nation vinyl !!", "Tue Dec 18 18:26:08 ": "@mrmichaelandre bless your heart and although it may seem hard, I am sure Andrew would want you to think of the good times and smile. Xxx", "Fri Mar 02 13:59:13 ": "@MrPeterAndre Y r yr tickets for Potters on 15 April £129 per person!!! SO expensive... Mere mortals can't afford this! gig only price pls!!", "Mon Nov 08 21:27:38 ": "@MissKatiePrice hope you fall pregnant soon hun,cross fingers for you x ps won a top on your ebay site a couple of days ago, its fab xx", "Thu Nov 25 18:57:28 ": "@GaryMakeUp sounds fab i will email you!!! just had my infills done on my nouveau lashes, i love makeup !!!", "Mon Aug 27 14:32:31 ": "Think I saw @mrmichaelandre driving Bentley today....what a lovely sight xoxo", "Fri Apr 20 17:48:48 ": "@mrmichaelandre have a fantasico night 2nt..rok da haus!!!  see you end of june hopefully for a gr8 nt.. love ya xox", "Mon Apr 23 11:44:25 ": "@MrPeterAndre can i have a RT just becoz everyone else in the world is asking you ha ha! love ya xoxo", "Wed May 23 20:30:42 ": "@mrpeterandre always xxxxxxxx", "Fri Jan 14 21:18:26 ": "@MsElenRivas ps it would be great if you would follow me!!!!", "Wed Dec 07 19:06:29 ": "Canr wait to see @mrpeterandre this sat, I'm sooooo getting to the front this bloomin time! Can't wait to see my gorgeous gorgeous man :-)", "Sat Jun 25 15:49:08 ": "@MrPeterAndre hey.. just catching up on tweets. went to sugarhut a couple of weeks ago, saw mike djing, v coolio x shame missed you there :(", "Sun Jan 16 22:14:44 ": "@MsElenRivas gutted for you, now you go back to being another nobody like the rest of us! Rok on kerrie!!", "Mon Nov 08 21:22:48 ": "@MissKatiePrice little house is good, im watching too.. love your hair katie, anyone you would recommend to get extensions done by?", "Tue Dec 28 17:03:08 ": "@MissKellyO What ever it is that has happened, just think of all you have achieved this year.  Just look at you for 1 thing! Much love xx", "Wed Dec 14 13:07:31 ": "@MrPeterAndre can't watch i'm at work :( have fun gorgeous xx", "Sat Nov 13 18:10:30 ": "signing off ...going to listen to some mmmmmmusic baby yeah!!! xxxx have a good evening all", "Sat Jan 01 14:58:42 ": "@MrPeterAndre Happy New Year to the Andre household. Hope you had a lovely xmas and New Year; maybe its our year, pls god yeah baby!!", "Sat Nov 13 17:50:55 ": "@MrPeterAndre If i was to try to win a date with you, what should my answer be Pete? im still pondering over this v annoying matter!!", "Thu Oct 28 15:17:59 ": "@MissKatiePrice have fun in Derby, come back to Norwich soon!!!!! Will be watching your programme tonight xoxo", "Fri Jan 14 21:10:52 ": "@GarySinise hey, loving csi ny...so when is carmine coming on board the twittersphere?", "Thu Sep 23 17:51:16 ": "@MrPeterAndre HOMBRE!!!! where are you!!!! Miss you Pete you hot momma! Still single? Just thought id ask, you know, err, just in case xoxo", "Mon Dec 10 20:43:43 ": "@MrPeterAndre Just catching upon tweets, heard about andrew, so sorry. lots of love and thoughts with you and family. much love xxx", "Mon Aug 08 16:59:07 ": "maybe its coz im blonde, but this new twitter set up is WAY confusing me! bring back the old school site!", "Sun Apr 08 12:54:05 ": "@MrPeterAndre Happy easter gorgeous!  Have a great day, Barbie day tomorrow for me, love you loads xxx", "Mon Oct 25 11:36:20 ": "@MrPeterAndre good luck on the radio..lets have some airplay this year for you.  have a nice afternoon,keep warm,happy to give cuds if req x", "Thu Sep 20 11:42:50 ": "@MrPeterAndre yes pleassssseee xx", "Sat Aug 25 16:52:32 ": "@mikeshinoda when you guys coming to uk...its crazy!!! we need you over here now!!!!", "Thu Apr 26 12:15:59 ": "@MissKatiePrice Hey Katie, who does your make up now you're not with Gary anymore?\nHope you and Leo are well, good luck with the wedding xx", "Mon Apr 16 16:51:05 ": "this friday 20th april @sugarhut the gorgeous @PamelaDAnderson special apperance!! woo hoo!!", "Mon Nov 08 21:35:34 ": "@MrPeterAndre Be my first direct msg baby!! you know it makes sense..\nI love GOOOOOLLLLLLDDDDD (ok calm down kate)", "Wed Apr 18 11:37:42 ": "@MrPeterAndre COME BACK TO NORWICH!!!!! PLEASE!!!!", "Sat Nov 27 21:31:19 ": "@MrPeterAndre get well soon bubba, everyone is thinking of u and wishing u well x x", "Thu Apr 26 12:17:12 ": "Have bad throat, chest that feels like razor blades inside. Not happy bunny. need lots of sympathy but noone here #noonelovesme", "Sun Nov 07 17:14:43 ": "@MrPeterAndre just downloaded your album..yeah baby!! trying to think of good answer 2 the OK competition to win lunch with you..very hard!!", "Tue May 08 11:20:14 ": "RT @MrPeterAndre: Happy birthday to my big bro @MrAndrewAndre . I know circumstances could be better but WHEN you beat this you will loo ...", "Mon Nov 08 21:29:48 ": "@GaryMakeUp Wish you would come and do my make up Gary, I just love how you do Katies, its 'priceless' (haha, that was terrible) xx", "Wed Oct 20 11:26:31 ": "@MrPeterAndre hey peter, hope u have a nice day,its raining and miserable outside, wish i were lying on a beach with a cocktail instead!!", "Sat Oct 30 20:44:06 ": "danni's foundation looks a bit patchy", "Tue Dec 28 17:04:54 ": "@MrPeterAndre Hey Pete, hope you had a great xmas. I hope 2011 be the year it all fits into place for you (and me both!) love ya x", "Thu Nov 25 18:54:01 ": "@MrPeterAndre comin 2 see u on tue nite can't wait!so excited about seeing you x ps i couldnt work out new twit either!old scol is best!", "Sat Nov 13 18:05:45 ": "watching the old x factor tonight....wagner needs to stay in for comedy value baby!!!!  harry hill must be on soon,love tv burb.eddie sto!", "Thu Aug 12 20:21:07 ": "going to sign off for the night now peeps. sweet dreams to all those who arent following me xoxoxoxoxoxox yawn zzzzzzzzzzzzzzzz xx", "Sat Dec 10 23:40:06 ": "Just bak from mrpeterandre gig, had Fab time, looking fine as always, Chris rocked 2, boy can he play guitar, love you, night night xxoxx", "Sun Feb 10 20:12:02 ": "@ChesterBe when you comin to uk mr?! we miss you here xx", "Tue May 08 11:21:18 ": "@MrAndrewAndre Happy Birthday Andrew.God Bless you &amp; I wish you all the very best.  You have loads of support around, we are all with u xxx", "Sat Aug 25 16:48:59 ": "go to say the bad boyfriend club is not great ...i love peter, i do, but the programme..omw :) #scraping the barrell sorry gorgeous xx", "Sat Oct 30 20:40:42 ": "@louiespence wait for it....Chers about...lets wait for the grinding of teeth and aggressive mouth movements!!!", "Mon Aug 08 16:58:10 ": "@MrPeterAndre hope your papa is OK pete, sending love and hugs your way, love to you and your family x", "Sat Aug 27 09:07:03 ": "@MrPeterAndre see you the races tonight! Can't wait, rock the stage Pete xxx", "Mon Dec 12 13:03:39 ": "@MrPeterAndre hey pete, hows your day going? im at work, wish was in sunny place lapping up the rays and swimming in the sea, with you xoxo", "Mon Aug 27 14:31:14 ": "Had lovely weekend with my lovely fiancée, went to c @mrpeterandre at his home, then @n_y_c_c east grin,then Brighton....fantastic xoxo", "Sun Dec 18 20:21:36 ": "@MrPeterAndre lickable wallpaper has to be the best. One of my fav films ever, defo better then remake x", "Mon Apr 16 11:50:40 ": "@MrPeterAndre lovely picture, wished id been there :(", "Thu Oct 14 19:56:23 ": "@MissKatiePrice well annoyed..just missed out on bidding on a juicy tracksuit from your website, how pants.. show soon katie whoop whoop!!", "Thu Sep 23 17:43:59 ": "@MissKatiePrice PRICEY!! let me know how your eyelashes are doing? I saw you had the fills done on your show and thinking about it myself..", "Sat Oct 30 20:39:13 ": "@MrPeterAndre Lovin new album, esp Under my skin and I love the vocal enhancements on CIP, you did well..jobs a good un' xxxx see you soon x", "Sun Aug 28 12:45:01 ": "@MrPeterAndre loved last night at newmarket, hope i didn't mark the window when I thumped on your car as you left! see you soon gorgeous xx", "Mon Apr 16 16:43:56 ": "how ever many people ask celebrities for a RT for sick children etc..gets my goat it does. #sympathyvote", "Wed Jun 29 17:47:09 ": "@MissKatiePrice blimey, can i have that too??! am majorly skinto,have like £14 til i get paid on 22 july! a freebie would be fab! love ya xx", "Sun Jan 16 22:17:47 ": "@MrPeterAndre where's the support for kerrie!", "Tue Dec 20 13:28:41 ": "@MrPeterAndre you would make my christmas if you did!!  only have 2 followers and i dont know one of them!!", "Tue May 08 11:28:38 ": "@MrPeterAndre Lovin your new housekeeper 'Sir' bless her, sweetness!\nWhen you coming back to Norwich Pete!  We miss you", "Sun Nov 14 18:55:48 ": "@MissKatiePrice you'll look beautiful im sure Katie. Have a great evening. Im watching back to the future!!", "Mon Nov 08 21:33:54 ": "how pleased am i that wagner is still in the running, i let out a little squeal when his name was called out! thats entertainment baby!", "Tue Dec 20 13:25:19 ": "@MrPeterAndre what you saying pete, dont like our picture!! I wish xoxo", "Sat Oct 30 20:45:59 ": "mini cheryl did keep it together, well done girly", "Sat Aug 25 16:46:40 ": "@MrPeterAndre visiting east grinstead tomorrow,may pop into your coffee shop or come c if ur home if you're about!? then off to brighton :)", "Sat Nov 13 17:58:03 ": "@ChesterBe LP rocked at O2!!!! can't wait for you to come back to the UK. Great gig guys, well done xx", "Tue Dec 18 18:33:02 ": "@MrPeterAndre think of the good times, think of the smiles, know that andrew wouldnt want you sad. Sending you love &amp;cuddlesxxx", "Mon Feb 27 18:27:52 ": "@mrpeterandre happy birthday lovely Aussie man, hope you're having a great day with your family xoxo", "Mon Aug 08 16:53:28 ": "RT @ImogenFoxyLocks: WIN a set of Foxy Locks Clip in Extensions from http://t.co/kN0HGvj. RT & follow @ImogenFoxyLocks for a chance!", "Thu Oct 14 20:05:14 ": "@MissKatiePrice loving the nail colour tonight, although alexs nose strip just aint sexy!", "Mon Nov 01 18:51:25 ": "@MrPeterAndre Happy belated Halloween bubs, hope you had a nice evening and if the kids were with you, hope you enjoyed the dressing up xx", "Fri Apr 20 17:46:03 ": "watchin recorded mrpeterandre my life, keep pecker up pet xx spooky..ordered a power balance wristband, then i see he has one! too alike !", "Wed Jun 29 17:37:31 ": "@MrPeterAndre Hope poo bum had a great time with her fantastico dad. Hope one day to meet you both and the other two gorgeous ones too x x", "Mon Apr 16 11:47:54 ": "breivik is smirking at his trial. what a complete loser. i would love to know how his mind works.", "Thu Oct 14 20:01:26 ": "@MrPeterAndre sky+ it too pete, nice episode, althuw how many girlies did you upset by putting in the bit with Ang! surfdude wit attitude xx", "Sat Nov 13 18:06:54 ": "I simply CANNOT believe how much Mr Andre and I have in common. Why we are not together is one of lifes little mysterys..", "Wed May 02 12:17:27 ": "@MrPeterAndre nearly as cute as you honey xx", "Sat May 07 13:29:54 ": "@MrPeterAndre hey peter, hope you're enjoying that arabian sunshine... looking forward to seeing your bro on his decks on the 27th :)", "Thu Sep 23 17:59:18 ": "watched The other guy last night. check out the TLC references for a laugh. Its great to see a actually funny film ..*smiles as remembers*", "Sat Oct 30 20:43:43 ": "it was ok though to be fair.  keep it together love", "Mon Nov 08 21:32:25 ": "@MrPeterAndre hey bubs, hope rehersals went ok, look forward to seeing final outcome on the 30th x", "Fri Jan 14 21:17:39 ": "@MsElenRivas hey elen, if the rumours are true and you & mr andre are an item, for all the girls who love him so dearly...treat him rite x", "Sat Nov 13 21:45:27 ": "@MrPeterAndre check this out Pete, i know you'll love it as much as i do xx  http://www.youtube.com/watch?v=OAwaNWGLM0c", "Sat Oct 30 20:50:19 ": "@MissKatiePrice 2 Questions....When you changing your surname on here!! & Where did you get your eyelashes done? the individual lashes?? xx", "Thu Nov 25 18:58:33 ": "wish i was in NY forf thanks giving, it would be so cool......xxx", "Sun Apr 15 11:32:55 ": "Wish I was seeing @mrpeterandre tonight at potter holiday resort, hopton. But it's sooooooo expensive 69 quid a tik min!", "Thu Oct 14 20:02:07 ": "well i'd like a toilet seat made of gold but it just isnt on the cards now is it......."}