{"Wed Sep 15 06:34:38 ": "Was die overlay-functie er altijd al in Google Analytics? Errug makkelijk!", "Tue Jul 03 07:56:07 ": "Volg @MrOppernet, als je ook wilt weten hoe dat nu zit met die hackende huisvrouwen http://t.co/pZIaDCX6", "Tue Sep 01 21:49:49 ": "@Pitdesign Proficiat!... Eindelijk on-line ;-)", "Tue May 08 06:45:57 ": "Het Twitter account is gesplitst. @MrOppernet gaat voortaan over specifieke Oppernet onderwerpen, en hier blijf ikzelf uiteraard aanwezig.", "Mon Oct 10 08:12:31 ": "Ik begon afkick verschijnselen te voelen, maar mocht gelukkig weer een kwartiertje in échte XML wroeten. Mooie materie!", "Tue Sep 13 10:16:35 ": "@GerkevanZalk Oeps... zullen we dan maar weer aan de gang gaan?", "Wed Aug 10 18:29:38 ": "Het wordt tijd om aan allerlei bekenden te laten weten, dat het afscheid van #Mediabuilders dichterbij komt...", "Fri Jul 15 20:53:35 ": "Mooie plannen maken en intussen met beste vriendin lekker eten bij #openhaard. Het leven is goed.", "Tue Jul 26 12:19:54 ": "RT @ArjenKamphuis: Norwegian Prime Minister: \"if one man can show so much hate, imagine how much love we all can show together\" #statema ...", "Fri May 21 10:56:56 ": "1e Joomla bijeenkomst in Arnhem bezocht. Interessant om te zien op welke uiteenlopende manieren mensen dit cms gebruiken!", "Mon Dec 05 20:15:10 ": "Bandcoach 14 is uit! Dat was ook op de site weer het nodige werk, maar het was de moeite waard. http://t.co/wMXDrge5", "Sun Jun 28 10:51:00 ": "waarom begint die nieuwe telefoon spontaan mensen uit bed te bellen, zodra ik hem op de carkit aansluit????", "Wed Apr 14 22:01:19 ": "Mijn katten scheppen er een sadistisch genoegen in om met uitgezette nagels op schoot te springen bij het bezoek. Welkom  ;-)", "Fri May 27 20:33:16 ": "Bandcoach nr. 11 is er! Ook on-line veel lezenswaardigs voor alle bandmusici! Productnieuws. Tips. Muziekacademie. http://bit.ly/lwG65s", "Mon May 02 19:40:54 ": "Vruchtbare redactievergadering Bandcoach Magazine. Wat is toch een theremin? 28-5 ligt het blad weer in de winkel en kun je het lezen!", "Fri Oct 05 18:12:01 ": "Best diet pill to lose 30 pounds in under-1 month! http://t.co/4rxWMwM3", "Sun Aug 29 21:04:16 ": "@Pitdesign Eigenlijk kun je niet om de iPhone heen, maar zelf vind ik die zwaar over-hyped. Ik ga voor Android, bijv. een HTC bij KPN.", "Mon Sep 14 13:32:33 ": "Een dropping hand, ik had er nog nooit van gehoord. Je kunt dan niets meer met je hand. Ik word er helemaal gestoord van.", "Fri Aug 14 22:00:03 ": "Greenvillagepark.nl is het resultaat van inspirerende samenwerking met Pitdesign. Werken wordt genieten!", "Tue May 25 21:13:48 ": "Op mijn verlanglijstje: een CMS met een gekoppelde output machine. Daar maak je me blij mee.", "Fri Dec 03 23:17:46 ": "Huidige projecten? 'n Webshop. Webredactie BC Magazine. Contentanalyse schoolboeken (B). Wijntje zoeken voor date. Druk, druk, druk.", "Wed Oct 03 10:04:45 ": "De wereld wordt een stukje saaier http://t.co/ZVMj8R8C", "Tue Nov 06 08:25:53 ": "Ik sta nu op de 7e plek in de file. Ook kans maken op een mooie prijs? Vooruit. In de file!  http://t.co/05DREU0c", "Sat May 14 18:47:03 ": "@inhenriesname Veel plezier allemaal :-)", "Fri Oct 05 19:34:42 ": "Best diet pill to lose 30 pounds in under-1 month! http://t.co/lIIzYGIE", "Mon Aug 24 21:40:34 ": "Hoe later het uur, des te actiever we worden. Vakanties voorbij, iedereen heeft er zin in.", "Mon May 23 20:48:55 ": "En toen werd het stil in huis. Minet lag dood op de vloer. Er worden definitief geen vogels en muizen meer gevangen.", "Thu Aug 20 18:22:29 ": "Wow! Thuiskomen na een vermoeiende dag en dan blijkt alles aan kant te zijn en lekker te ruiken. Luxe!", "Sat Feb 19 08:51:10 ": "Op een koude zaterdag is het tijd voor een verwarmende Woudenbergse middaghap.", "Fri Oct 05 15:10:42 ": "Best diet pill to lose 30 pounds in under-1 month! http://t.co/ZsAFKhJ9", "Thu Jul 07 10:39:53 ": "@BCWebDesign Maar uiteraard eerst vanavond #Joomla in Zutphen, toch...", "Fri Aug 21 09:48:30 ": "Klusjesdag bij Oppernet: 2 migraties; wat los spul installeren, de administratie weer helemaal bij.", "Fri Apr 08 07:22:32 ": "En dan zit je opeens bij een optreden van Lebbis. Ik ben verwend!!!", "Sun Oct 07 10:15:38 ": "@inhenriesname tsja... dieetpillen. Niet echt mijn ding. Gelukkig heeft Mijnheer Twitter inmiddels mijn wachtwoord gereset. Thx!", "Wed Apr 13 19:55:04 ": "Use cases maken voor een nieuwe applicatie. Boeiend. Lastig ook. Stug doorgaan.", "Sat Jul 14 08:18:32 ": "@Maaartje_  52 paarden om weg te geven http://t.co/s1vawH2U", "Thu Jul 07 21:59:19 ": "Een avond thuis met de harde kern van #Joomla user group Arnhem #jug026. Vruchtbaar brainstormen over het volgende seizoen.", "Fri Jun 10 12:47:25 ": "Voorjaars schoonmaak op de server. Hmm, dat was hard nodig.", "Thu Nov 11 12:15:00 ": "De bijeenkomst van Joomla gebruikers leverde weer veel tips en ideeën op. Kennisuitwisseling is een groot goed!", "Mon Jun 20 18:56:36 ": "Yes: #Oppernet gaat speedcoach in een Joomla-jasje steken.", "Fri Apr 01 20:16:38 ": "De presentatie speciaal voor de Joomladagen wat aangepast. Heb er zin in! Tot zondag allemaal. #jd11nl", "Sat May 29 21:45:52 ": "Het Geldmuseum in Utrecht bezocht met neef en nicht. Het kraken van de poencode ging ze makkelijk af. Oom Eric is trots op ze.", "Fri Jul 03 08:39:45 ": "Zo! Gelukkig weer eens een dag beschikbaar om me met Oppernet bezig te houden.", "Sun Oct 17 21:21:18 ": "Weer een fraaie site bekeken van Pitdesign. Daar moeten we maar eens een Joomla template van maken.", "Thu Nov 25 06:28:33 ": "1-9-1992 - 23-11-2010.\nHeks is er niet meer. \nwww.ericribberink.nl", "Sun Apr 11 10:37:23 ": "Een leuke dag doorgebracht met neef en nicht in Woudenberg.", "Fri Oct 15 19:48:36 ": "NL vertaling geschreven voor de nieuwe versie van Joomla image editor. Geweldige nieuwe opties!  http://www.phpimageeditor.se/", "Wed Nov 21 22:48:43 ": "RT @MrOppernet: Goed nieuws: D'66 @KeesVee wil #cookiewet verruimen http://t.co/NuWz44sP. Vraag: speciale status voor social media cookies?", "Wed May 04 21:44:59 ": "Use cases klaar, min of meer. Het wordt een unieke web-applicatie. Samen met Pelikaan Innovatie aan de slag geweest met schermen.", "Fri Dec 17 21:46:59 ": "Voor het eerst een Modx site geïnstalleerd. Weer een ervaring rijker! Nu eens kijken of we er iets moois mee kunnen doen.", "Mon Nov 05 20:31:58 ": "@Maaartje_ nee, het is verder geen bekende. Er werd vandaag ook steeds aan jelle gevraagd of het familie is", "Tue Jun 07 07:48:47 ": "Presentaties van Dick en Han op #Joomla groep Arnhem bijgewoond. Dank heren!", "Mon Sep 05 13:52:26 ": "#Oppernet wordt een bv. Klinkt wel stoer eigenlijk.", "Fri May 20 09:46:32 ": "Geweldig! On-line bieden op de veiling van de Zutphense kunstcollectie. http://bit.ly/ih8sA6 Weer een Oppernet-site live gezet!", "Fri Jul 22 17:30:09 ": "@jelleribberink Goed plan slimmerd ;-)", "Thu Sep 29 09:08:11 ": "Gefeliciteerd, Fenny en Jeroen, met jullie nieuwe #speedcoach site van #oppernet. http://t.co/EFOwgBWc", "Sat Oct 02 20:46:10 ": "Yes! We hebben kaarten voor Roger Waters / The Wall in het Gelredome!", "Mon Aug 31 14:17:04 ": "Start en doorkomst van de Vuelta meegemaakt. Gauw de foto's op ericribberink.nl zetten!", "Thu Apr 07 14:44:46 ": "He, jammer... een snoepreisje als webredacteur van www.bandcoach.eu moeten afslaan. Geen Frankfurter Musik Messe voor mij dus...", "Mon Nov 12 12:57:59 ": "Hoe doen @Pitdesign en @MrOppernet dat toch? Een complete site voor 195 euro! http://t.co/xT58qTvW", "Sun Sep 04 18:59:21 ": "Linkedin profiel http://t.co/fWvRZBr aangepast: #Mediabuilders verplaatst naar \"past\" i.p.v. \"present\".", "Mon Oct 17 11:40:13 ": "Excuus aan allen die er last van hadden. Twitter had de deur open staan. Nu opgelost als het goed is.", "Wed Jun 20 21:19:04 ": "Waarom het fout ging met Oranje: Espresso met Arjen Robben http://t.co/C8ag9f2o Hilarisch!!!", "Fri Mar 04 10:19:45 ": "Pop-ups maken voor een MS-Word tool is een aparte tak van sport. Wel leuk ook. Zorgen dat de auteurs er blij mee worden, daar gaat het om!", "Fri May 06 09:52:38 ": "@publihouse Dat is waar ook! Van harte Gerrit!!!", "Fri Oct 05 16:32:07 ": "Best diet pill to lose 30 pounds in under-1 month! http://t.co/RUCCo3Od", "Wed May 04 22:08:15 ": "@robvansteen Een gemis voor Zutphen, maar gefeliciteerd! Overigens: gepeperde sites lijken veel op elkaar. Maar hij is mooi, dat is zeker.", "Tue Sep 13 10:13:25 ": "Gelezen bij #Bandcoach http://t.co/FMSqYQA: Kytopia in #Tivoli!!!", "Tue Oct 12 20:15:51 ": "We mochten twee dagen onze ideeën over manuscriptverwerking tonen in België. Enthousiaste gesprekspartners ontmoet bij uitgeverij Plantyn.", "Fri Oct 05 13:32:27 ": "Best diet pill to lose 30 pounds in under-1 month! http://t.co/w2nCSAbJ", "Mon May 14 09:43:29 ": "Welkom nieuwe volgers! Ben jij hier omdat je geinteresseerd bent in Oppernet? Kijk dan ook @MrOppernet!", "Fri Sep 18 08:12:12 ": "Zometeen naar de neuroloog. Ik ben benieuwd...", "Sun Apr 10 10:40:15 ": "Roger Waters live in Gelredome gezien. Fantastisch!", "Mon Nov 05 17:36:21 ": "@Maaartje_ waarschijnlijk wel ja.", "Mon Sep 05 22:01:14 ": "Geslaagde kick-off van het nieuwe seizoen voor #joomla user group Arnhem & Nijmegen. Veel tips and tricks, Akeeba-demo  en Dr. Joomla.", "Sun Sep 04 19:11:44 ": "5 sept.: #Joomla users Arnhem e.o. http://t.co/YRVRwFl", "Sat Aug 13 09:07:51 ": "Stem uitgebracht op Zaadmarkt 105 voor de Paltsprijs. Schitterend! http://t.co/uP7Njxa \nGoed idee #AdvocaatAleide.", "Fri Jun 11 19:41:49 ": "De beste ideeën liggen op straat. Ga dus straatjutten! Op www.straatjutten.nl wordt in zes stappen uitgelegd hoe dat gaat. Doen!", "Thu Jul 28 15:20:00 ": "Feliciteert #Publihouse met de nieuwe collega. Knap selectiewerk :-)", "Thu Sep 09 09:36:03 ": "@Hanzehof Goed idee om via Twitter te informeren. Plaats ook een Twitter-ikoontje op je homepage, net als op www.ericribberink.nl", "Thu Jun 14 09:13:27 ": "Mijn Oppernet-tweets vind je overigens bij @MrOppernet.  Van alles over #Joomla en natuurlijk over alle projecten.\nhttp://t.co/Zo7DfSOO", "Thu Jul 28 15:22:04 ": "Feliciteert zoon Jelle met de nieuwe baan bij #Publihouse. Goede baas gevonden :-)", "Wed Jul 11 06:38:01 ": "@reclame_dame @Bohemia63 @ElsaSchaddelee Ik heb gewerkt met @OscarNijst, die mooie #360fotos maakt.", "Sun May 15 17:47:03 ": "@inhenriesname Middellandse zee!? Oeps, nieuwe sponsor gevonden?", "Fri Oct 01 05:29:29 ": "Bijna weekend. Met de hele familie de verjaardag van Ma vieren. Morgen al vroeg met Jelle naar Woudenberg.", "Sat Nov 24 14:52:59 ": "@Maaartje_ Kijk, dit is Harry. Hij woont nu bij mij. http://t.co/YZklMXfM", "Thu Aug 18 10:44:38 ": "@publihouse ... En natuurlijk ook bij het pre-press bedrijf in Zutphen!", "Mon Apr 11 20:22:53 ": "Akeeba backup is echt een fluitje van een eurocent. Hadden we veel eerder moeten gebruiken!", "Sun May 01 18:46:09 ": "Uitzicht over het water bij Bronsbergen. Een goede hap, een ferme slok. Mei is mooi begonnen.", "Thu Dec 06 10:22:32 ": "RT @AliBouali: Hey @geertwilderspvv alle marokanen die ik spreek veroordelen wat er is gebeurt..geen haatcampagne voeren over de rug van ...", "Mon Nov 05 15:06:47 ": "Te triest voor woorden #timribberink http://t.co/aXQ0gz6J", "Fri Oct 22 14:01:21 ": "Ook leuk: mijn tweets staan nu ook op de homepage van www.oppernet.nl", "Fri Jun 15 11:52:21 ": "Ooit speelde @MrOppernet zelf eens in @engelenbak. Ze horen bij de genomineerden voor de #Kunstfactorprijs http://t.co/tHOWaTPb", "Fri Aug 21 09:46:22 ": "@GerkevanZalk Voor het eerst een schoonmaakster over de vloer gehad. ;-)", "Thu Jun 14 09:00:18 ": "Eén troost hebben we: #joanfranka haalde meer punten dan #vanpersie", "Tue Jun 19 11:24:07 ": "Grappig afmeldscherm @PietZoomers:een verplicht veld, maar ze zetten er niet bij wat je moet invullen. http://t.co/dOjYjdEZ", "Fri Jul 22 17:31:17 ": "RT @Jackmulder1: RT @tweetmijterug Mijn baas gelooft niet in kracht van #Twitter elke 10 RT krijg ik 1 euro! Kom op iedereen RT dit beri ...", "Fri May 06 08:43:13 ": "Mooi eigenlijk, die clip van Nancy Brick op de site van Bandcoach Magazine: http://www.bandcoach.eu/main/home.html", "Tue Dec 04 21:13:12 ": "Op zoek naar leuke kerstcadeaus? Denk eens aan de @SeriousRequest webshop! http://t.co/drqnZZpE", "Tue Jul 14 18:21:27 ": "Vakantiefoto's bekeken bij Jelle. Hij bracht me op een leuk idee, iets met Google-maps."}