{"Sat Feb 23 13:58:41 ": "RT @TheTumblrPosts: Someone who truly loves you, sees what a mess you can be, how moody you can get, and how hard you can be to handle,  ...", "Mon Mar 25 09:17:52 ": "#Amboring", "Mon Mar 25 04:51:51 ": "RT @LetsQuoteComedy: The less people you chill with, the less bullshit you deal with.", "Mon Dec 24 06:27:46 ": "RT @FreddyAmazin: I listen to music everyday, no matter what mood I'm in.", "Mon Dec 24 06:30:50 ": "RT @AyyTangaLangDre: Sana pwede maging papel yung mga taong plastik, para malukot ko sila.", "Fri Mar 22 05:30:02 ": "Yung fully loaded na, narefresh mo pa -.-", "Fri Dec 28 04:26:25 ": "RT @MgaPatama: FACT: Sa ganitong panahon, isang matinding pag-subok ang ... \"MALIGO\"", "Mon Dec 24 06:43:28 ": "RT @ShitHappensDre: Pagbigyan nyo na, minsan na nga lang magdrama aagawan mo pa ng eksena.", "Tue Feb 26 11:55:34 ": "RT @Banatero101: Pag tumahimik, sasabihing guilty. Pag sumagot naman, defensive.", "Fri Mar 22 09:08:42 ": "Ung kinausap ka lang para manghingi ng pagkain. You don't do that to me !", "Mon Dec 24 09:18:00 ": "RT @MangKepwengPH: Napakalawak ng mundo para idepende ang kaligayahan mo sa isang tao.", "Tue Feb 26 11:57:52 ": "RT @ShitHappensDre: Iba ang manhid sa tanga.", "Wed Mar 06 12:12:28 ": "RT @QuoteNiDoraemon: Yung hinihintay mong kausapin ka niya..kaso wala. Hopia!", "Sat Feb 23 14:03:14 ": "RT @SayingsForGirls: Trust is like an eraser, it gets smaller and smaller after every little mistake.", "Mon Dec 24 06:23:59 ": "RT @DonyaMargaretM: Wow! Ang ganda ng damit mo kaso hindi naman bagay sa mukha mo! #PATHETIC", "Mon Dec 24 06:45:52 ": "RT @SoDamnTrue: Eating chocolate can make me happy and change my mood.", "Fri Mar 22 06:20:24 ": "umuulan nanaman . -.-", "Sat Feb 23 13:56:54 ": "RT @NgaNgaDre: Ang mga babae ay hindi TROPHY na iniipon tapos iiwanan mo lang sa isang sulok para ipakita na nakakarami ka na.", "Sat Feb 23 13:58:17 ": "RT @LaslasNaFriend: Sa sobrang pagmamahal mo sa kanya pati respeto sa sarili mo nakalimutan mo na.", "Wed Dec 26 07:06:51 ": "yung feeling na super o.p ka na gusto m na umalis . #starsareshining", "Mon Dec 24 10:01:41 ": "RT @HiBabeee: When I see you, my HEART beats a little faster. My STOMACH feels a little lighter. My SMILE shines a little brighter.", "Tue Feb 26 11:55:57 ": "RT @jokesatibapa: JUAN:Wala akong kwentang anak para sa inyo!Lahat ng gawin ko mali!D nyo na ako mahal! AMA:Ngkakamali ka anak. JUAN:Kta ...", "Thu Mar 21 03:31:16 ": "TRUST is like an ERASER, it gets smaller and smaller in every MISTAKE.", "Tue Dec 25 11:43:25 ": "ung jwk ka ng jowk pero dumating ung tym n seryoso k pero nd sla naniniwala sayo dahl knina ka pa nd seryoso . #lokohanlng ?", "Mon Dec 24 07:24:17 ": "ung feelng na nagreply nga pero s smunud mng txt, nd n sia nagreply .", "Mon Dec 24 06:27:32 ": "RT @AyyTangaLangDre: Isang pose, sangkatutak na picture", "Mon Dec 24 13:44:24 ": "kapag nd m maintindihan ang cnsb nla . ''k''", "Tue Feb 26 11:58:27 ": "RT @BookofBanat: Ang daling matulog, ang hirap bumangon. Ang daling mahulog, ang hirap mag move-on!", "Tue Feb 26 11:55:44 ": "RT @Friendstagram: \"One moment of strength is worth every moment of weakness.\"", "Tue Feb 26 11:56:03 ": "RT @Banatero101: Yung kaibigan mo nagtanong tapos nung sinagot mo, di naman naniniwala.", "Mon Dec 24 13:29:04 ": "RT @Thought_Emotion: Love is and will always be the best gift to give and to receive.", "Fri Mar 22 06:44:09 ": "RT @AyyyGrabe: Sa babae, Hindi uso ang kumalma lalo na pag kinikilig na.", "Sat Feb 23 14:02:39 ": "RT @AdmirableTxts: sometimes I keep my feelings to myself because I know that no one will understand.", "Mon Dec 24 09:05:34 ": "RT @EFRNNDZ: Sometimes the person you want most is the person you're best without", "Thu Mar 21 11:33:26 ": "Yung feeling na tingin ng tingin sayo ng crush mo, kala mo may gusto sayo. un pala sa katabi mo tumitingin #ouch &lt;/3", "Thu Mar 21 11:29:02 ": "@AyyTangaLangDre : Yung crush mo LAMPA...\nLAMPAkelam syo!", "Mon Dec 24 07:33:29 ": "@missciel0813", "Mon Dec 24 06:46:08 ": "RT @NakssNaman: \"Ang sarap kausap ng taong mabilis magreply.\"", "Thu Mar 21 03:01:19 ": "RT @Heartstagram: Mas Gumaganda Ang Isang Babae Kapag Simple At Walang Arte.", "Thu Apr 04 04:06:12 ": "RT @UnivOfLove: Sometimes you just got to be strong. It may hurt you and you may shed a few tears. But one day, when you wake up everyth ...", "Sat Mar 23 06:35:58 ": "RT @WagKasiMalandi: \"May mga tao lang talagang mas malaki ang bunganga kaysa sa utak.\"", "Sun Mar 24 11:15:24 ": "RT @FemaleTexts: Sorry for caring. Sorry for trying. Sorry for it all. But most of all, I'm sorry I let you in.", "Fri Mar 22 08:23:09 ": "RT @LetsQuoteComedy: I don't hate school, I hate waking up at 6 in the morning.", "Mon Dec 24 13:29:18 ": "RT @TheFunnyTeens: You + Your best friend = Fun and trouble", "Tue Dec 25 06:20:30 ": "yung sb m lang n 5minutes bgo ka bumangon pero paggcng m 20 minutes kna tlog . xD #oops", "Mon Dec 24 06:31:43 ": "RT @MisterBanatero: “Madaling iwasan yung taong gusto mo. Ang mahirap iwasan ay yung nararamdaman mo.”", "Thu Dec 27 14:53:07 ": "RT @TheTumblrPosts: Don't trust words,Trust actions.", "Thu Dec 27 14:54:17 ": "bgal ng net :/", "Sat Apr 06 08:01:06 ": "RT @ShitHappensDre: Learn from every experience.", "Fri Dec 28 04:26:08 ": "RT @NgaNgaDre: Kahit gaano mang katindi ang galit ko sayo, aaminin ko na PANGALAN MO pa din ang iniintay kong lumabas sa INBOX ko. :\"&gt;", "Mon Dec 24 09:05:43 ": "RT @ShitHappensDre: Taray ng heels ah san ang kasal?", "Mon Dec 24 10:01:56 ": "RT @NakssNaman: \"Ung kahit napakasimpleng regalo basta galing sa taong mahalaga sayo, iba ang ngiti na mauukit sa mukha mo.\"\"", "Tue Dec 25 06:16:47 ": "RT @MisterBanatero: Hindi mo alam kung ano iREREPLY sa kanya, pero ayaw mo naman matapos usapan niyong dalawa.", "Sat Mar 23 08:22:08 ": "Cold rainy afternoon ^^", "Fri Mar 22 06:44:27 ": "RT @PinoyKowtero: \"A boy speaks, a gentleman acts.\"", "Mon Dec 24 06:51:51 ": "RT @ShitHappensDre: Kinaganda mo na yang panlalait mo? Wow, pathetic.", "Mon Dec 24 09:06:17 ": "RT @ShitHappensDre: Pag bakasyon, ang hirap maligo ng maaga.", "Mon Mar 25 12:39:25 ": "RT @Heartstagram: \"If you have Jesus in your life, you have more than enough.\"", "Mon Dec 24 14:41:23 ": "RT @MisterBanatero: Si CRUSH yung tipo ng tao na MADALI titigan, MAHIRAP lapitan.", "Mon Dec 24 14:01:48 ": "RT @FSMStweets: Yung nag ggreet ka ng Merry Christmas sa lahat ng contacts mo tapos di ka nakaunli.", "Fri Dec 28 04:25:59 ": "RT @NgaNgaDre: Ang lalaking magaling manloko, masarap pugutan ng ulo.", "Fri Mar 22 12:58:14 ": "Nuod nalang ulet tayo :))\n#inakapatidanak", "Fri Mar 22 06:26:07 ": "RT @NgaNgaDre: BAKASYON = Always nga nga sa bahay.", "Sun Jan 27 09:05:55 ": "RT @NgaNgaDre: Monday na bukas, ready na ba kayo?! Let's do the RUBADABANGO!", "Mon Dec 24 09:06:11 ": "RT @ShitHappensDre: Wow sa pang babusted ah? Haba ng hair. Nahiya naman si Rapunzel.", "Mon Dec 24 06:24:21 ": "RT @ShitHappensDre: Ang tunay na Pinoy tinatawanan lang ang problema.", "Sat Feb 23 13:56:32 ": "RT @PrinceOfBanats: Dear Math, ayusin mo nga yang sariling problema mo!", "Mon Dec 24 06:45:49 ": "RT @HiBabeee: Dear God, thank you for today, yesterday, and tomorrow. My family, my joys, my sorrows. For all that made me stronger. #Me ...", "Mon Dec 24 13:33:56 ": "RT @NakssNaman: \"Hindi naman ang puso ang pangunahing salarin sa pagkabigo sa pagibig, kundi ang matamis na mga salita na hindi naman na ...", "Mon Apr 08 03:20:57 ": "RT @jokesatibapa: RT IF YOU LOVE GOD. ♥", "Sat Feb 23 13:58:04 ": "RT @LaslasNaFriend: Anyone can make you happy by doing something special but only someone special can make you happy without doing anything.", "Thu Mar 21 10:18:31 ": "Act normal #DASNSD", "Mon Dec 24 09:56:43 ": "RT @Friendstagram: Nahiya naman ang pagong sa bagal ng internet connection namin.", "Mon Dec 24 06:25:07 ": "RT @ShitHappensDre: Minsan kailangan mo ring makinig sa iba.", "Mon Dec 24 13:28:56 ": "RT @jokesatibapa: Dear diet, aalisin muna kita sa isipan ko ha! Sa january nalang ulit.", "Mon Dec 24 06:30:22 ": "#deadbat -.-", "Fri Mar 22 06:44:18 ": "RT @IndayBanat: Maganda ka?\n Tama na kase ang kakashabu, kung anu ano tuloy naiisip mo.", "Mon Dec 24 06:59:40 ": "RT @NgaNgaDre: Pritong pako for noche buena! Gusto niyo?", "Thu Mar 21 03:24:04 ": "RT @TagalogFacts: Keep calm and thank God. RT kung ginising ka ni God.", "Tue Feb 26 11:58:33 ": "RT @BookofBanat: Wala kang pera? Bakit di mo subukang ibenta yung mga plastic mong kakilala?", "Sat Feb 23 14:01:00 ": "RT @NgaNgaDre: Mahirap umasa sa itsura. Dapat ugali ang inuuna.", "Mon Dec 24 15:36:52 ": "Merry Christmas to all . :)\n  #christmas #happynewyear .", "Tue Feb 26 11:57:47 ": "RT @Banatero101: Ang panliligaw paisa-isa lang yan. Hindi yan promo na the more entries you sent the more chances of winning.", "Mon Dec 24 13:29:26 ": "RT @AyyShitLang: 'Yung may kaibigan ka palang ahas. Leche.", "Mon Dec 24 06:48:04 ": "speechless dw ?!", "Thu Mar 21 11:49:50 ": "\"@TangaMoSir :❒ Single ❒ Taken ✔Nasa bahay lang. Bored.\"", "Sat Feb 23 14:03:50 ": "RT @PinoyKowtero: \"Ang babae nililigawan dahil gusto at mahal mo siya. Hindi dahil alam mong crush ka niya at madali lang makuha ang OO  ...", "Sun Jan 27 09:04:05 ": "nakapagtweet rn :)", "Mon Dec 24 15:09:09 ": "@MisterBanatero  . yup .", "Thu Apr 04 04:06:18 ": "RT @UnivOfLove: Appreciate what you have, before it turns into what you had.", "Mon Dec 24 07:05:55 ": "RT @MisterBanatero: Wag kang hanap ng hanap ng wala sayo. Maging masaya ka kung anong meron ka.", "Mon Dec 24 09:05:54 ": "RT @MisterBanatero: Hilig manira. Sali ka sa DEMOLITION TEAM! Qualified ka!", "Mon Dec 24 06:22:13 ": "RT @PUSONG_PNOY: Nilandi ka lng ng 10 minutes, Mahal mo na agad? Yung totoo, rush hour teh?", "Tue Dec 25 11:45:04 ": "watchng smurfs :] kht na ilang beses ko na napanuod un xD #bored", "Mon Dec 24 07:12:26 ": "RT @reIationships: 3 words, 8 letters. 3 syllables, 5 vowels, 3 consonants, 2 nouns, one emotion, many meanings, a big lie, a rare truth ...", "Tue Feb 26 11:56:24 ": "RT @JhakevargasJake: NEVER allow others to put obstacles in the pathway of your dreams.", "Wed Mar 06 13:11:45 ": "RT @BestTextMsgs: I need to stop liking you, I have no chance with you.", "Thu Mar 21 03:36:36 ": "RT @LaslasNaFriend: Yung alam mong malabo pero umaasa ka pa rin. #LASLASNAFRIEND", "Wed Mar 06 12:12:17 ": "RT @QuoteNiDoraemon: Yung gusto ni crush si bestfriend. Laslas na! Bigyan ng Hopia!", "Wed Mar 06 13:12:32 ": "RT @LaslasNaFriend: Iwas ASA, para iwas NGANGA."}