{"Thu Apr 04 21:58:20 ": "RT @CNDuk: Cameron has a loose understanding of facts if he thinks it's a 'fact' that N Korea cd launch a nuclear strike on UK: http://t ...", "Tue Feb 26 19:37:57 ": "The bright lights of the Cherry Red Records Stadium. COYG! #pafc http://t.co/fstCQa9pNO", "Mon Sep 24 18:29:15 ": "@SF_England What a joke.", "Sun Oct 14 21:54:16 ": "RT @Chris_Webb1: PLEASE GIVE THIS A RETWEET tweeps. Climbing #kilimanjaro in March for St Lukes. Please donate http://t.co/zBZAoQOw #paf ...", "Sat Sep 15 19:30:55 ": "RT @Dania_rif: Azhar Ahmad was charged with \"sending a grossly offensive communication\" by saying all soldiers should go to hell #Justic ...", "Tue Dec 25 17:22:31 ": "RT @TheArgyleTrust: Wishing a very Merry Christmas to all Argyle supporters wherever you may be. Here’s to a big crowd and three points  ...", "Mon Jan 28 16:36:30 ": "RT @ChristoHancock: @wesstreeting Just written to local Tory MP to urge support for #equalmarriage My followers pls do the same!", "Mon Oct 08 12:39:21 ": "RT @EmmaK67: Instead of taking away housing benefit for under 25s and slashing child credits, why not just ask Vodafone for that 6 billi ...", "Sat Dec 29 20:30:24 ": "RT @SparksyOnRadio: #pafc current form now reads 1 clean sheet in 23 League &amp; cup matches, 7 pts from a possible 36, one win in 11 L ...", "Sun Feb 17 15:44:54 ": "RT @IJN3: My beautiful City. http://t.co/2KS6NVo3", "Mon Sep 24 21:00:28 ": "RT @UKuncut: Last year we embarrassed Dave Hartnett at a tax conference, this year activists ruin his retirement do. WATCH THIS http://t ...", "Wed Dec 26 21:09:32 ": "@ChristoHancock I plead time pressure!", "Mon Oct 22 17:54:24 ": "RT @IJN3: I've won as many Tour De France titles as Lance Armstrong!!", "Mon Oct 29 12:28:10 ": "RT @Dania_rif: Assad is shelling #Douma allover again. What is left of Douma ya ibn el kalb! #Damascus", "Mon Nov 05 16:40:02 ": "RT @ChristoHancock: Boycott @Amazon this festive season! They pay no UK corporation tax. I will be buying through @hivestores", "Sat Feb 09 14:27:50 ": "Looking forward to my first Argyle away game in a while. Confident we can get 3 points from the shots! COYG!", "Sat Nov 10 03:41:23 ": "RT @charltonbrooker: Maybe Newsnight could reinvent itself as a sort of spangly Strictly Newsnight thing with like dancing and stuff.", "Sat Oct 27 13:27:25 ": "In sunny Rotherham today to see the mighty #argyle claim all 3 points! COYG! #pafc", "Sat Nov 10 03:43:04 ": "RT @charltonbrooker: This Newsnight is tragic on about 100,000 levels.", "Wed Sep 12 20:48:25 ": "RT @5LiveF1: So sad to here the news about Prof Sid Watkins... A true gentleman and incredibly generous with his time, experience and kn ...", "Wed Oct 24 18:25:38 ": "RT @nickshaxson: How to stop Starbucks-style tax avoidance  http://t.co/b3vkayqP", "Mon Feb 18 13:21:30 ": "I love seeing the #BBC reporting on its own disruption due to strike action. Proud to be British. :-)", "Sun Oct 14 21:55:28 ": "RT @Queen_UK: Felix Baumgartner. Whatever. Try parachuting into an Olympic Opening Ceremony, moonbeam. #spacejump", "Sun Dec 02 19:33:38 ": "RT @Queen_UK: Have told Starbucks that they do not owe a \"tall\" amount of tax, or a \"grande\" amount of tax, but a \"venti\" amount of tax.", "Wed Jan 02 19:49:22 ": "RT @IJN3: Forgive me Lord for I have sinned, I have posted on Pasoti again. http://t.co/KjsBDeP8 It had to be said, but I get why people ...", "Tue Sep 11 11:47:38 ": "RT @OwenJones84: Never forget the horror of 9/11. Never forget the horror justified in its name", "Mon Oct 01 16:43:45 ": "@josephdancey I know it's so sad...", "Mon Sep 24 18:29:37 ": "RT @SF_England: Pls wait 6 wks after you’ve submitted your application bfore calling to check the status.Log into your online account: h ...", "Tue Jan 01 23:16:43 ": "@josephdancey So much for having faith! We lost 2-1 and Fletcher has been sacked. New Year, new beginnings eh J(H)oe?", "Sat Feb 09 22:16:06 ": "RT @benphillips76: Busted! Observer front page on the British corporation #taxdodging from Africa's poor &lt;- Great @ActionAidUK exposé ...", "Sat Feb 16 14:25:08 ": "It worked last week so here goes: I'm confident we can pick up 3 points today against Oxford! COYG! #pafc", "Sat Mar 16 19:50:51 ": "RT @marcuschown: David Cameron warns that, if we are not nice to our crooked bankers, they'll all leave the country. RT if you are not t ...", "Thu Oct 11 19:06:39 ": "RT @UKuncut: Facebook avoids millions in tax but the govt is going after disabled people to get loads of cash off them instead. http://t ...", "Wed Sep 05 20:45:14 ": "RT @johnprescott: 7% of people in Britain have had a private school education. In the Department of Education's ministerial team, it's 83%", "Sat Oct 20 12:28:38 ": "RT @MilenaBuyum: #oct20 @CNDuk contingent on #afuturethatworks #marchagainstausterity Cut trident! http://t.co/yVYrOVUy", "Sat Feb 16 21:36:22 ": "RT @SparksyOnRadio: 8) \"At home, I don’t know why, but we don’t get going and get the crowd behind us but we’re not giving them anything ...", "Tue Oct 02 19:58:53 ": "RT @OwenJones84: I don't want more \"sacrifices\" in Afghanistan, and polls show neither do the British people. Bring them home #Lab12", "Sat Sep 22 15:57:43 ": "Great comeback by @Only1Argyle today - 2-3. This almost never happens! #COYG! Onward and upward! #pafc", "Mon Oct 29 12:28:56 ": "RT @GeorgeMonbiot: Its continued funding of #Trident makes a mockery of govt's claims that extreme austerity is essential. Pure waste.", "Thu Oct 11 19:06:49 ": "RT @Only1Argyle: Macca and Madjo sign on the dotted line - http://t.co/TY0NLkpf #pafc", "Fri Nov 02 11:00:28 ": "RT @frankieboyle: I think it's vital  we keep Trident to combat the threat our society faces from 1970s Russia", "Thu Dec 27 10:56:01 ": "Just filled up with diesel next to Carl Fletcher at the Esso next to Home Park! Green Army!  :-)", "Sun Oct 21 18:35:04 ": "RT @Dania_rif: We condemn Israel. So why the silence on Syria? http://t.co/rYClXu7k", "Sun Dec 23 08:38:28 ": "RT @wesstreeting: First Christmas for years that I haven't bought from @AmazonUK. Once they pay their fair share of taxes, I'll be back.", "Fri Nov 02 18:22:27 ": "RT @Stutakesphotos: #ff for the campaign group who are bringing the tax dodges to public awareness @UKuncut #thereisanalternative", "Sat Apr 06 22:16:49 ": "RT @paullewismoney: There are two sorts of rich people. The clever ones who know they are lucky. And the lucky ones who think they are c ...", "Tue Sep 25 08:44:33 ": "RT @nickshaxson: UK's former top tax man Dave Hartnett ambushed at Oxford dinner by \"trespassing scum\" giving tax avoidance award http:/ ...", "Tue Jan 01 14:27:24 ": "I was in the crowd last year for the amazing #pafc comeback at rovers. I believe! COYG!", "Mon Oct 22 17:52:22 ": "RT @nickshaxson: UK anger grows over large companies' tax bills as attention turns to eBay and Ikea  http://t.co/f3kAg7pr http://t.co/AE ...", "Sat Sep 15 19:29:56 ": "@SparksyOnRadio According to the postman tomorrow is the new today, don't you know...", "Mon Oct 01 16:46:51 ": "@sianparisxo Try 0141 243 3600 for student finance.", "Wed Oct 03 21:03:36 ": "@SF_England Do you want a round of applause? 4 weeks to read a letter!?", "Wed Jan 02 10:29:28 ": "RT @RichardJMurphy: US votes to increase taxes on rich. France is continuing with increased taxes on rich. UK is cutting taxes on rich.  ...", "Mon Oct 29 19:34:21 ": "RT @FM145: Thanks to @pollytoynbee &amp; @johnmcdonnellmp for their excellent evidence today! They praised @UKuncut's \"creative, effecti ...", "Thu Sep 13 20:35:33 ": "RT @christian_aid: \"We have a duty to shame companies that don't pay their taxes\" Peter Oborne", "Sun Oct 07 08:17:18 ": "@kamui_kobayashi 表彰台おめでとうございます！イギリス人なので普段はバトンを応援していますが、今日はカムイファンになりました！", "Sat Sep 29 12:38:18 ": "RT @SparksyOnRadio: Paul Sturrock #pafc http://t.co/A8UqcI9s", "Sat Mar 30 12:04:15 ": "Just sat through presentation of the plans for the new #pafc grandstand. Eminently sensible proposal. How lucky we are to have James B. ATID", "Thu Sep 13 08:23:00 ": "RT @paullewismoney: HMRC rich folk unit raises £500m in 3 yrs. A start. But what about the £35billion a year missed, on its own reckonin ...", "Sat Sep 08 21:17:34 ": "RT @Chris_Webb1: RETWEET if YOU love Plymouth Argyle Football Club. Best supporters in the land bar none and a Club proudly rebuilding f ...", "Sat Dec 29 11:25:33 ": "RT @david_friio: Big disappointment! No @SparksyOnRadio on the Awards list... #sirgordonspark", "Wed Dec 26 17:41:20 ": "RT @Only1Argyle: TYLER HARVEY, LOCAL BOY, SCORES IN THE LOCAL DERBY! #pafc", "Thu Nov 22 23:26:42 ": "RT @wesstreeting: 140 characters on Israel and Palestine is never enough. Sufficed to say a negotiated 2-state solution is the only solu ...", "Tue Oct 02 20:41:41 ": "Good point for #pafc tonight. Sounded like a good game!  :-) COYG", "Mon Oct 29 19:34:52 ": "RT @CNDuk: \"We have far better things we can be spending money on in terms of defence, than Trident.\" - #BBCDP http://t.co/3DlqCAiK", "Sat Sep 29 12:38:06 ": "RT @SparksyOnRadio: Southend United asst manager Graham Coughlan back at #pafc http://t.co/BUOL0AcB", "Tue Dec 25 11:45:39 ": "RT @Queen_UK: At 3pm this afternoon, your loving Queen and Sovereign Lady will address you on BBC1. Watching on ITV is actually treason.", "Wed Apr 03 17:14:46 ": "RT @LindenWint: Tax havens: not OK.", "Sat Sep 15 16:35:10 ": "Gutted that we lost after taking the lead and dominating the first half. Something's still not right with #argyle... ATID", "Mon Oct 15 07:04:43 ": "RT @Naomi_Fowler: Guess who audits the ANTIsocial networking company #Facebook UK who paid only £238,000 in #tax in 2011? One of the #Bi ...", "Fri Nov 02 11:01:54 ": "RT @Dania_rif: Horrible sounds of explosions and shelling are heard allover #Damascus since early morning. The source is yet unknown", "Tue Oct 30 22:19:26 ": "RT @paullewismoney: #sandy 200,000 homeless in Haiti and 52 dead http://t.co/wMrBLWLT - But Mail reports no cellphone coverage in New Yo ...", "Mon Oct 29 12:28:32 ": "RT @NMSyria: The #Damascus skyline this morning as fighter jets bombard parts of the capital of #Syria http://t.co/QDRbFm4C", "Sat Sep 08 19:45:55 ": "Lewis Hamilton has been very foolish to sour his relationship with McLaren. He will never have it so good elsewhere and will regret leaving.", "Mon Jan 07 16:24:23 ": "RT @Chris_Webb1: Great ticket offer from Argyle for John Sheridan's first 3 home games. http://t.co/oblap6SQ #pafc #fortresshomepark", "Tue Oct 02 20:34:04 ": "@Only1Argyle I believe! COYG!", "Tue Dec 25 09:53:37 ": "RT @UKuncut: Happy taxmas to all and to all a good night http://t.co/8c365iP0", "Fri Sep 28 16:29:21 ": "@SF_England Can you explain why it takes you 6 weeks to read a letter please? Yet to receive a reply to my tweets or complaint...", "Sat Sep 29 22:11:20 ": "2 friends who volunteered with me in Syria are running to raise money for the Red Cross. Show support if you can! http://t.co/zKyn86Dx", "Wed Oct 03 06:53:58 ": "RT @MBrundleF1: Japanese trains amazing.Check arrival time on ticket. One minute before go to an exit. As doors open step off, guarantee ...", "Mon Oct 22 18:39:43 ": "@ChristoHancock T.M.I. bruv...", "Tue Sep 11 07:18:46 ": "RT @wesstreeting: Tuition fees debate in Parliament: don't forget Coalition Agreement gave Lib Dems permission to abstain. They CHOSE to ...", "Fri Oct 05 16:48:28 ": "#ff @Dania_rif - my Syrian friend battling tirelessly for her people...", "Sat Mar 30 15:01:46 ": "RT @Only1Argyle: Btw, we are staying up #pafc", "Sat Sep 22 14:24:14 ": "Dear Student Finance England @SF_England - do you think taking 4-6 weeks  to read a letter is acceptable?", "Wed Nov 14 17:50:16 ": "RT @Dania_rif: #Gaza", "Fri Oct 19 16:51:35 ": "RT @SaveTruroCity: Today we've lost our Club after 123 years. We WILL go again - without the involvement of any of the previous regime.  ...", "Sun Sep 16 08:03:27 ": "RT @Dania_rif: \"Do you prefer to die with an explosion, a shell or a sniper?\" is a social ice breaker question in #Damascus", "Sun Dec 23 08:41:13 ": "@lindaaanderson Hi Linda! Just wanted to say a massive thank you for the beautiful cupcakes! They went down a treat in the staffroom!  :-) x", "Sat Sep 15 13:48:10 ": "\"@Only1Argyle: Home Park has NEVER looked lovelier #pafc http://t.co/MuV7vSwo\" COYG!", "Thu Dec 06 21:40:46 ": "RT @RichardJMurphy: Note to Starbucks: we don’t want token gestures. We want the right tax in the right place at the right time  http:// ...", "Mon Sep 10 17:52:52 ": "@Ben_Nazer Welcome to twitter Bungleman!  :-)", "Sat Oct 20 10:20:33 ": "RT @markthomasinfo: Andrew Mitchell Chief whip has resigned  though he insists he didn't say that.", "Thu Oct 11 19:09:51 ": "RT @tackletaxhavens: Facebook’s UK corporation tax bill last year was less than it pays a single average worker http://t.co/86vhrTij", "Sat Oct 20 12:29:23 ": "RT @Greenarmy1955: Just the type of sunny day for @Only1Argyle to get 3 points. COYG.", "Tue Jan 15 21:55:20 ": "RT @everewilliams: Everything you never knew that you'd want to know about the London Underground http://t.co/6KuKbc3E #TFL #150years #G ...", "Wed Oct 10 21:11:53 ": "@SF_England a picture of efficiency...", "Tue Oct 30 22:20:51 ": "RT @CNDuk: Have you voted yet? 81% are saying No in @Guardian's poll 'Is Trident replacement a good idea?' http://t.co/wNNpPsBv  #CutTrident", "Wed Jan 02 11:21:16 ": "Massive respect and thanks to Fletcher for doing his best through incredibly tough times at #pafc. Great to see that some men still care.", "Tue Sep 04 22:05:13 ": "RT @NigelNelson: David Laws can set the new O level questions. If one Trident sub carries 16 missiles sharing 48 warheads how many peopl ..."}