{"Mon Apr 15 05:09:57 ": "#Gymflow", "Sun Mar 10 12:15:12 ": "RT @Fit_Motivator: There are no shortcuts to any place worth going. -Beverly Sills", "Tue Apr 02 16:06:57 ": "@prudentvuyisile where hve u bin, bt I guess it comes with growing up loooolz", "Wed Mar 13 06:56:10 ": "\"@RevRunWisdom: The longer you wait for anything the more you'll appreciate it.. When you're down to nothing Gods up to something\"", "Sun Jan 13 15:39:13 ": "RT @Sports_Greats: Impossible isn't a fact, it's an opinion.", "Wed Mar 13 04:59:31 ": "Received a call in my sleep, hope I didn't say anything don't mean or everything I said I didn't mean it", "Tue Apr 09 01:43:01 ": "RT @DJSbu: A successful man is one who can lay a firm foundation with the bricks that others throw at him", "Tue Mar 26 15:27:17 ": "I can c it with my eyes closed", "Mon Apr 15 11:09:46 ": "RT @TonyGaskins: Wake up Motivated!!! Grace is a gift that you can't take for granted!", "Sat Jan 12 17:42:28 ": "Had a gud tym last nyt with some of my friends from UIC #MuchLove", "Wed Jan 09 14:24:13 ": "RT @1880Victoria: When guys lie, they say they love you. When girls lie, they say they don't.", "Sun Dec 16 16:32:19 ": "Its funny how much we make excuses for our short comings based on those around us", "Tue Apr 16 05:51:57 ": "#Humility is key", "Sun Mar 10 12:13:16 ": "RT @TonyGaskins: Don't make excuses. Make changes!", "Sat Jan 12 19:00:58 ": "time heals everything,so dey say. The thought of goin thru a day knowing dat u no longer with us is killing me", "Thu Mar 28 06:00:38 ": "With random people, I'm shy. With my best friends, I'm crazy\"", "Tue Mar 12 14:34:28 ": "RT @Inspire_Us: Tell me and I forget. Teach me and I remember. Involve me and I learn. - Benjamin Franklin", "Sun Dec 16 16:35:18 ": "Iv lost so many battles in my life but you can rest assured, the war aint over yet #ItsWar", "Wed Mar 13 08:44:23 ": "\"@RevRunWisdom: No matter what the doctor say, lawyer say, he say, she say, or they say. God will always have the last say #LetsBeClear\"", "Sun Mar 10 12:14:08 ": "RT @TonyGaskins: Love speaks many languages but pain isn't one of them!", "Sun Apr 14 06:24:28 ": "RT @TedOfficialPage: We're all in the same game; Just different levels. Dealing with the same hell; just different devils.", "Wed Apr 03 18:17:50 ": "RT @TedOfficialPage: Big boobs dont count if you're fat!", "Tue Mar 05 20:46:20 ": "how about i do me for a change. #SAWG", "Tue Apr 02 16:01:03 ": "@prudentvuyisile finally!!!!!", "Sun Mar 10 07:45:50 ": "Building castles in my head", "Sun Dec 16 16:12:01 ": "Seeing myself in Gods' point of view #Redefined", "Mon Mar 04 04:35:07 ": "RT @TonyGaskins: If it doesn't take faith to get there then it's not worth going!", "Mon Mar 11 12:20:13 ": "People say things that they think you want hear instead of saying how they feel #DoMeNoFavours", "Sun Mar 10 12:12:09 ": "RT @TonyGaskins: Be better than average. Average is unacceptable!", "Sun Mar 10 12:13:03 ": "RT @TonyGaskins: If you try to take shortcuts you will get cut short. Count the cost before you make a move!", "Sun Dec 30 05:18:40 ": "Know who you are in order to know what you need, keep your integrity in check #Revived", "Sat Mar 09 10:35:48 ": "@prudentvuyisile pirates will bow in the presence of greatness #Khosi4Life", "Fri Mar 08 23:13:56 ": "Look out 4 my artist on idols season 9 in 2 weeks time he'll be auditioning in sandton #MthobisiSmelane", "Sat Mar 30 22:17:16 ": "Late night road trip #Blessed", "Mon Feb 25 04:38:41 ": "RT @CocaCola: We nominate a Coca-Cola bottle opening for Best Sound Design. #Oscars", "Mon Apr 15 08:07:20 ": "RT @prudentvuyisile: A peacefull productive week to each and every one of you friends♥", "Tue Feb 26 05:45:42 ": "Can you please recommend my skills? Thank you! http://t.co/m7LvfmFbl1 via @skillpages", "Tue Mar 19 06:24:09 ": "\"@DJSbu: No place for NEGATIVE energy in my schedule got too many POSITIVE things to do today!\"", "Sun Feb 24 21:19:41 ": "RT @CocaCola: Share a happy Saturday - surprise a friend with a picnic and a Coke!", "Sat Jan 05 16:56:51 ": "Never compromise your integrity #LeaveYourMark", "Tue Mar 12 08:56:35 ": "Sometimes you feel like losing it when you lose your grip, sometimes it feel like its all wasted time", "Mon Dec 31 17:00:42 ": "One needs to do what is goin to benefit him and the greater good.", "Wed Mar 13 08:29:37 ": "\"@RevRunWisdom: Be happy!! In the end, it's not going to matter how many breaths you took, but how many moments took your breath away!!\"", "Tue Apr 16 04:25:01 ": "Family is important #Appreciate", "Thu Mar 28 05:58:17 ": "A girl's laughter is much more cheerful than a boy's, but a boy's tear is much more meaningful than a girl's.\"", "Mon Jan 07 06:55:39 ": "RT @DJSbu: Positive Mental Attitude 24/7 365!! No matter what!!", "Tue Apr 09 01:47:45 ": "restore in me the joy of salvation", "Tue Mar 12 14:34:26 ": "RT @Spilt__Milk: No matter how many set backs you have in life you should never stop trying", "Fri Apr 12 10:42:48 ": "RT @ReadaBookSA: The better educated we are, the better choices we make. The better choices we make, the better people we become.", "Mon Dec 17 15:42:25 ": "RT @chriswebbspeaks: If my memory of scripture was anything like my memory of song lyrics, then I would be like Denzel in the Book of Eli.", "Sat Mar 16 06:27:55 ": "A Gym session never disappoints", "Wed Jan 09 14:08:42 ": "RT @1880Victoria: I have more conversations in my head than I do in real life", "Thu Dec 27 09:11:58 ": "RT @1880Victoria: Worry less. Smile more. Accept criticism. Take responsibility. Be quiet and listen. Love life. Embrace change. Feel go ...", "Wed Mar 13 05:16:49 ": "I'm the type that says a prayer then go get what I just prayed for #SWAG", "Tue Apr 09 01:52:02 ": "RT @Sports_Greats: You're going to lose people in your life and realize no matter how much time you spent with them, it will never seem  ...", "Mon Jan 07 16:24:28 ": "RT @Fit_Motivator: Never let your head hang down. Never give up and sit down and grieve. Find another way. -Satchel Paige", "Mon Apr 15 05:23:36 ": "RT @Fit_Motivator: The principle is competing against yourself. It's about self improvement, about being better than you were the day be ...", "Tue Mar 26 11:25:17 ": "Live every moment of your life #OpenHappiness", "Sun Apr 07 14:28:24 ": "RT @PrayInFaith: Decide today that you won’t give up on your dreams and desires. Keep pressing forward, believing that you are anointed  ...", "Tue Mar 12 14:26:58 ": "We are all slaves to something", "Mon Dec 17 09:07:17 ": "Cooking is an art", "Tue Mar 05 20:43:33 ": "@prudentvuyisile dude wat u tokin bwt, il be drop by soon just dat ive been to hell n back lately", "Fri Mar 22 09:13:21 ": "Sandton tomorrow #TeamMthobisi #IdolsSA9", "Wed Apr 17 23:28:48 ": "To put one's shoulder to the wheel", "Sun Mar 10 09:11:19 ": "It takes perseverance, sweat and tears #SWAG", "Sun Mar 10 12:09:39 ": "RT @TonyGaskins: If it hasn't worked the way you've been doing it then get new knowledge and do it again.", "Mon Apr 15 05:27:25 ": "RT @Fit_Motivator: When in doubt, go workout!", "Mon Dec 17 17:42:26 ": "One can't separate challenges from Christianity", "Sun Mar 10 12:13:12 ": "RT @TonyGaskins: Pray that it comes but not a second before you can handle it.", "Sat Jan 05 12:17:31 ": "RT @Tshokita: \"@ReadaBookSA: RT if you plan to read 1 book a month this year.\"", "Sun Apr 14 07:38:30 ": "#NoSleep attitude", "Tue Mar 12 08:48:30 ": "Haven't met someone worth knowing lately", "Mon Dec 17 15:36:15 ": "RT @Fit_Motivator: PAIN is temporary. Quitting lasts forever.", "Thu Dec 20 10:46:26 ": "Truth is, opportunity may knock once, but temptation leans on da door bell", "Sun Mar 10 15:32:03 ": "RT @CocaCola: Pass it on! Do something good for someone else today #GoodDeedsDay", "Sun Mar 10 12:12:02 ": "RT @TonyGaskins: The truth may hurt before it begins to heal.", "Mon Mar 11 09:20:34 ": "RT @Fit_Motivator: The more you sweat in practice, the less you bleed in battle. -Author Unknown", "Sun Dec 16 18:14:37 ": "RT @Fit_Motivator: If you aren't going all the way, why go at all? -Joe Namath", "Wed Apr 17 08:27:10 ": "Paddle your own canoe #Responsibility", "Sat Jan 12 18:47:27 ": "I wix I can get one last hug, uve shown us so much love,u left ur footprints in our hearts. I miss u, I really do. RIP Ntando lenny Nyoni", "Wed Mar 13 08:40:11 ": "\"@RevRunWisdom: I repeat!! &gt; Being challenged in life is inevitable, being defeated is optional!\"", "Sun Mar 10 12:09:32 ": "RT @TonyGaskins: When you forget where you come from then you've lost sight of where you're going.", "Sun Mar 10 12:54:05 ": "\"If it does not require faith then its not worth it\"", "Mon Jan 07 16:21:01 ": "RT @JeffersonBethke: Pray as someone who is not in control today. Pray as someone who is depending on Someone greater. It's remarkably f ...", "Sun Mar 17 09:20:30 ": "Change happens: they keep moving the cheese", "Wed Jan 02 13:47:19 ": "The trick in going through hell is never to stop", "Sun Dec 30 08:36:52 ": "Throughout all my shortcomings You've shown me mercy just to ensure my homecoming #Grace", "Wed Dec 26 09:26:27 ": "Everything happening in ur life ryt nw can be a sign of what might happen next", "Tue Mar 12 08:42:34 ": "Life is but a vapor, make every moment count #SWAG", "Sun Apr 07 19:03:28 ": "RT @DJSbu: Everytime I watch an old Denzel Washington movie , I get reminded of his greatness &amp; why I admire the man #DeJaVu via @Of ...", "Mon Dec 17 18:48:19 ": "RT @ArmorOGod: Make up your mind that you’re not going to quit until you see the fruit of what God has placed within you.", "Wed Mar 20 14:55:05 ": "#GymFlow", "Mon Apr 15 05:59:31 ": "Overdosed on confidence. #Gymflow", "Sun Mar 10 12:13:27 ": "RT @TonyGaskins: Don't entertain foolishness today! It doesn't pay and you won't win an award for it either.", "Sun Mar 17 09:22:44 ": "Just finished reading \"who moved my cheese\" by. Dr Spencer Johnson- mind blown #Encouraged", "Tue Apr 16 11:47:01 ": "Leading a spartan life", "Sat Mar 23 03:21:03 ": "D-day, sandton here we come bby!!!!", "Tue Mar 12 08:22:57 ": "Its a marathon, pace yourself #SWAG", "Sun Apr 14 05:41:01 ": "@ it again. No pain, no gain. #GymFlow", "Sun Mar 10 12:14:52 ": "RT @Inspire_Us: You can't put a limit on anything. The more you dream, the farther you get. -Michael Phelps"}