{"Tue Apr 16 02:22:23 ": "RT @Ravens: Well done @TheRealJacoby12! #VoteJacoby", "Sun Mar 10 06:30:38 ": "RT @XSTROLOGY: #Gemini is the most misunderstood of them all. They don't wear their heart on their sleeve.", "Wed Mar 13 04:43:14 ": "RT @Country_Voices: I put it in park and grabbed my guitar and strummed a couple chords and sang from the heart. #FloridaGeorgiaLine", "Mon Apr 01 03:49:54 ": "RT @GirIFacts: Don't be afraid to unleash your inner bitch.", "Sun Mar 10 06:39:09 ": "RT @autocorrects: Strict parents create sneaky kids.", "Thu Mar 07 02:12:28 ": "RT @XSTROLOGY: #Aquarius is loyal.", "Mon Mar 04 01:59:48 ": "RT @XSTROLOGY: A #Gemini falls for someone who's intellectual, interesting and full of surprises.", "Sun Mar 10 06:36:54 ": "RT @autocorrects: When you fuck up, own up to it, apologize for it, learn from it and never do it again.", "Thu Mar 14 04:11:49 ": "RT @amandamaylee: I shouldn't cuss so much.", "Wed Mar 13 04:52:16 ": "RT @Brohumour: Disagreeing with someone just to piss them off.", "Mon Apr 08 04:58:14 ": "RT @Country_Voices: Hide your crazy, and start acting like a lady. #MirandaLambert", "Wed Mar 27 01:35:55 ": "RT @XSTROLOGY: A #Gemini wants what it wants and will try anything to achieve it.", "Sun Mar 10 06:26:48 ": "RT @Country_Voices: When I was just a baby, my momma told me son, always be a good boy, never play with guns. #JohnnyCash", "Thu Mar 14 04:26:39 ": "“@ChildhoodRuin: http://t.co/kT49Wgnm7U” @Marquette7987", "Tue Apr 16 02:18:51 ": "“@autocorrects: Taken is the adult version of Finding Nemo.” @Marquette7987", "Thu Mar 07 02:18:45 ": "RT @XSTROLOGY: #Gemini's have the ability to lie and appear they are telling the complete truth.", "Thu Mar 14 04:23:26 ": "RT @Ratchet2English: I want my first marriage to be my only marriage.", "Thu Mar 07 02:11:01 ": "RT @Brohumour: A woman who loves you will get angry at you for so many things but she will stick around you no matter what. #Truth", "Wed Mar 13 04:28:54 ": "RT @autocorrects: *washing your hands* ~ sleeve starts falling down ~ no no no no No NO.", "Thu Mar 14 04:14:15 ": "RT @Country_Voices: I get carried away by the look, by the light in your eyes. #GeorgeStrait", "Wed Mar 13 04:52:27 ": "RT @autocorrects: Flipping your pillow over to get the cold side is one of the best things ever.", "Wed Feb 27 03:29:03 ": "RT @VeryRudeTweets: Research shows the first five minutes of life can be the most risky. Somehow I think that the last five minutes aren ...", "Thu Mar 07 02:14:29 ": "RT @Ratchet2English: I will carry 17 grocery bags or die trying before making two trips.", "Mon Mar 04 01:53:28 ": "RT @VeryRudeTweets: A couple of people have swine flu and everyone starts wearing masks. Millions of people have AIDS and no one wears c ...", "Thu Mar 14 04:28:58 ": "“@ChildhoodRuin: So sad.... http://t.co/K1kMQSmUbY” @Marquette7987", "Mon Apr 01 03:49:37 ": "RT @GirIFacts: Sorry I'm allergic to bullshit.", "Mon Apr 08 05:00:19 ": "RT @Country_Voices: I could have missed the pain, but I'd have had to miss the dance. #GarthBrooks", "Mon Apr 08 05:00:26 ": "RT @Country_Voices: This is where the cowboy rides away. #GeorgeStrait #GarthBrooks", "Wed Mar 13 04:29:14 ": "RT @XSTROLOGY: #Gemini often know what they want one day, and change their mind the next. Always a party with them!", "Thu Mar 14 04:29:17 ": "“@ChildhoodRuin: LILO &amp;amp; Grudge http://t.co/9vZiW7GAKv” @Marquette7987", "Mon Mar 04 01:53:36 ": "RT @retardedmom: Who else hates their recorded voice?", "Wed Feb 27 11:58:40 ": "RT @autocorrects: Have you ever woke up pissed at someone because of something they did in your dream?", "Wed Feb 27 12:02:01 ": "@Marquette7987 thats nasty! Don't put this stuff", "Mon Apr 01 03:50:28 ": "“@GirIFacts: That mini heart attack you get when you're half asleep and you suddenly feel like you're falling.” All the time!!", "Tue Mar 12 04:17:40 ": "RT @Ratchet2English: When a girl is mad, NOTHING is off limits! She'll bring up stuff from an argument you had a month ago just to get h ...", "Wed Feb 27 11:59:49 ": "\"@BestofGemini: #Gemini can be a real pain in the ass sometimes.\" Right @Marquette7987 ?!?!", "Sun Mar 10 06:43:03 ": "RT @XSTROLOGY: #Gemini will not tolerate routine or boring.", "Sun Mar 10 06:28:39 ": "RT @Gentlemenhood: Pay off your credit cards every month. #LifeLessons", "Sat Mar 30 13:18:20 ": "RT @XSTROLOGY: #Gemini's know what they want and how they can get it. Their golden tongues tend to help them a lot there.", "Mon Apr 01 03:44:47 ": "RT @GirIFacts: When a girl really likes you, she's thinking of you while she's busy, not just when she's alone and bored.", "Sun Mar 24 21:01:15 ": "RT @Ravens: Ed Reed's full-page ad thanking #Ravens fans in today's #Baltimore Sun. #ravensnation http://t.co/YPaFWh97G3", "Mon Mar 18 02:43:37 ": "RT @XSTROLOGY: #Gemini's are the most talkative sign but they only talk to who they choose.", "Mon Mar 18 02:48:33 ": "RT @XSTROLOGY: A #Gemini woman will go crazy for a unique, strong-willed handsome man with a go-getter personality", "Sun Mar 10 06:34:23 ": "RT @Ratchet2English: 10 things I don't play about -My Trust💔 -My Food🍝🍔 -My Sleep💤 -My Heart❤ -My Music🎵 -My Phone📲 - My Money 💰 -MyFace ...", "Mon Apr 08 04:55:06 ": "RT @Country_Voices: But she believes in me like she believes her Bible, And loves me like Jesus does. #EricChurch", "Mon Apr 08 04:55:10 ": "RT @Country_Voices: She forgives me when I can't, And the devil, man, no, he don't have a prayer, 'Cause she loves me like Jesus does. # ...", "Thu Mar 07 02:09:56 ": "“@Country_Voices: The taste of love is sweet, when hearts like ours meet. #JohnnyCash” @Marquette7987", "Tue Mar 12 04:16:20 ": "RT @XSTROLOGY: #Gemini women can cook.", "Mon Mar 04 01:59:59 ": "RT @RayRayLewis5: If you don't stand for something... you'll fall for anything", "Mon Apr 01 03:52:22 ": "RT @GirIFacts: If a girl asks you a question, its better to just give her the truth, chances are she's asking you because she already kn ...", "Mon Apr 08 04:52:17 ": "“Wesley Snipes was released from prison this week. Now he can finally begin filming \"Blade 4: Twilight.\" @Marquette7987 haha!", "Sun Mar 10 06:37:00 ": "RT @TheFactsBook: People who understand sarcasm well are often good at reading people's minds. They understand the other person has some ...", "Thu Mar 14 04:19:03 ": "RT @Ratchet2English: Does anyone else wake up in the middle of the night thirsty as hell, and water tastes like it came from God's perso ...", "Sun Mar 10 06:38:25 ": "RT @The90sLife: This always happened! http://t.co/Phjn6qaI2g", "Sun Mar 24 20:53:06 ": "“@DisneyMemory: http://t.co/ZkGezKtcqV” @Marquette7987", "Wed Feb 27 05:06:16 ": "RT @XSTROLOGY: #Gemini gets irritated by slow reactions to anything.", "Tue Mar 12 04:33:09 ": "RT @XSTROLOGY: #Gemini women work hard to achieve their goals.", "Sat Mar 09 17:17:42 ": "RT @XSTROLOGY: #Gemini are freaks.", "Tue Mar 12 04:17:58 ": "RT @autocorrects: Don't ever let your girl talk to another guy about her problems; a shoulder to cry on, becomes a dick to ride on.", "Sun Mar 24 20:55:15 ": "“@autocorrects: That gangsta feeling when you rap your favorite song without messing up.” @Marquette7987", "Mon Apr 08 04:59:00 ": "RT @blakeshelton: Congratulations to Blake and @mirandalambert for winning #ACMs Song Of The Year! -Team BS", "Sat Mar 09 01:38:07 ": "RT @GeorgiaGamedayr: RT if you love football", "Mon Apr 01 03:52:03 ": "RT @GirIFacts: Being single is not an excuse to be a whore.", "Sun Apr 07 19:11:12 ": "@blakeshelton @acmawards I voted!", "Mon Apr 08 04:55:26 ": "RT @Country_Voices: Baby you a song, You make me wanna roll my windows down and cruise. #FLAGALine", "Mon Mar 18 02:50:15 ": "RT @Country_Voices: Somethin' bout a truck in a farmers field, a no trespass sign and time to kill. #KipMoore", "Thu Mar 07 02:10:02 ": "RT @WomensHumor: If you don't like sarcasm, then you should probably never talk to me.", "Thu Mar 14 04:28:09 ": "“@ChildhoodRuin: http://t.co/JmnggA790f” @Marquette7987", "Thu Mar 14 04:27:29 ": "“@ChildhoodRuin: http://t.co/CNQGXYG9Dt” @Marquette7987", "Sun Mar 10 06:43:27 ": "RT @Ratchet2English: #ItsUnattractiveWhen guys wear tighter jeans than girls", "Wed Mar 13 04:49:29 ": "RT @VeryRudeTweets: I will never understand the teenagers of today. They have unprotected sex, but have cases on their phones...", "Sun Mar 10 06:25:29 ": "RT @Ratchet2English: I gotta carry my phone around me 24/7 just incase nobody texts me.", "Sat Mar 09 06:36:27 ": "RT @Shelby_Spera: Fuck a fake friend, where your real friends at?", "Thu Mar 07 02:10:58 ": "RT @autocorrects: If Google can't find the answer, it's not a question.", "Thu Mar 07 02:22:50 ": "RT @Ratchet2English: Started from a text📱, now we here👫💏💑", "Sun Mar 10 06:40:35 ": "RT @XSTROLOGY: #Gemini are often extremely successful because they are extremely intelligent and their brains are constantly working ove ...", "Thu Mar 14 04:29:50 ": "“@ChildhoodRuin: http://t.co/yVtlo2r0t8” @Marquette7987", "Sun Apr 07 00:52:04 ": "RT @autocorrects: Looking at a photograph and wishing you could re-live that moment over and over again...", "Mon Apr 08 05:00:22 ": "RT @Country_Voices: Our lives are better left to chance. #GarthBrooks", "Mon Apr 01 02:37:09 ": "RT @GirIFacts: Short girls are the best girls.", "Thu Mar 14 04:26:20 ": "“@ChildhoodRuin: http://t.co/fLryN3eyqj” @Marquette7987", "Sun Mar 10 06:35:30 ": "RT @autocorrects: There comes a point in your life when you have to realize who really matters, who never did, and who always will.", "Sun Mar 10 06:26:37 ": "“@MadeaSimmons_: That one special person who enters your life and suddenly changes everything you've ever known about love.” @Marquette7987", "Sun Mar 24 21:12:56 ": "#Gemini are loyal when it's someone they truly love and will put in efforts to make a relationship work.” @Marquette7987", "Mon Apr 01 03:50:08 ": "RT @GirIFacts: #ThingsGirlsLike Forehead kisses. Hugs from behind. Cuddling. Surprises. Being called beautiful. Long good morning and ni ...", "Mon Apr 01 03:49:31 ": "“@GirIFacts: THIS is how Siri can cheer you up: http://t.co/jCAggeSg3b” @Marquette7987", "Mon Apr 01 03:50:56 ": "“@GirIFacts: A jealous girlfriend, is a faithful girlfriend.”  ***wife. @Marquette7987   :-)", "Mon Apr 01 03:49:39 ": "RT @GirIFacts: Best memories come from bad ideas.", "Mon Mar 25 02:20:55 ": "RT @XSTROLOGY: #Gemini will not back down in any debate.", "Thu Mar 14 04:25:29 ": "“@ChildhoodRuin: http://t.co/XczUjrEvaJ” @Marquette7987  OMG!", "Mon Apr 01 03:45:12 ": "“@GirIFacts: Cuddling is simply the best thing ever ❤” cuddling now with my 3 yr old...love it! @Marquette7987", "Tue Mar 12 21:29:42 ": "RT @ZodiacFacts: A #Gemini doesn't sweat the small stuff, however they like to be challenged intellectually.", "Mon Mar 04 01:58:34 ": "RT @TeamAthleteLife: Retweet if you played any\nBasketball 🏀\nFootball 🏈\nVolleyball 🙌\nBaseball ⚾\nHockey ❄\nSoccer ⚽\nTennis 🎾\nGolf ⛳\nCheer 🎉 ...", "Thu Mar 14 04:29:34 ": "“@ChildhoodRuin: http://t.co/yqQ3WXGn5y” @Marquette7987", "Wed Mar 13 04:28:02 ": "RT @LifeAsRednecks: #WhereIComeFrom sweet tea is served all day, everyday.", "Sun Apr 07 04:17:54 ": "RT @GirIFacts: The past is behind, Learn from it. The future is ahead, Prepare for it. The present is here, Live it.", "Sun Mar 10 06:27:33 ": "RT @thegooglefact: A girl's kindness if often mistaken for flirting.⁰⁰", "Mon Mar 04 01:58:05 ": "RT @ExtraGrumpyCat: Tomorrows Monday \n😥            😫    😒😣😒\n😒😒       😒  😒         😲\n😩    😢   😲  😪         😠\n😒       😒😒  😞         😤\n😭    ...", "Wed Mar 13 04:27:33 ": "RT @Ratchet2English: How to talk to me when I'm in a bad mood. http://t.co/QQQDRNdell", "Sun Mar 03 15:54:23 ": "RT @XSTROLOGY: #Gemini dislike trends, and anything overrated."}