{"Sat Apr 20 18:19:03 ": "RT @wabster76: Carnt wait to be Mansfield town on FIFA 14 @DeepInClunge @mansfieldtownfc", "Sat Apr 20 15:33:14 ": "A win against Wrexham, or if title-rivals Kidderminster fail to beat relegation-threatened Stockport, would see us lift the league trophy.", "Sat Apr 20 17:09:21 ": "What are your thoughts on the game so far?", "Sat Apr 20 18:09:16 ": "Four minutes of added time...", "Sat Apr 20 17:54:40 ": "SUBSTITUTION: Second change of the game for Wrexham as Mark Creighton replaces Adrian Cieslewicz (75) 1-0.", "Sat Apr 20 18:53:59 ": "RT @RobBotham: I will now be buying FIFA 14, Starting at the bottom with Mansfield once again! Well done @mansfieldtownfc Finally back wher…", "Sat Apr 20 17:45:12 ": "Great individual effort from Briscoe as he takes on two players before his effort is saved by Coughlin (65) 1-0", "Sat Apr 20 18:00:53 ": "ATTENDANCE: 6,394.", "Sat Apr 20 17:22:07 ": "RT @Waynecips: @mansfieldtownfc I have no fingernails left. Starting on toes.", "Sat Apr 20 15:29:46 ": "Mansfield Town subs: Rhead, Howell, Daniel, Sutton, Speight.", "Sat Apr 20 18:56:25 ": "RT @stevva: I am SO GLAD it's back on! @ChesterfieldFC v @mansfieldtownfc Bring it on, we have missed you! It's what football's all about. …", "Sat Apr 20 16:52:28 ": "Chapman's throw-ins keep causing Wrexham problems as #Stags go close once again.", "Sat Apr 20 18:09:34 ": "SUBSTITUTION: Matt Rhead is on for Matt Green (90) 1-0.", "Sat Apr 20 18:47:45 ": "Paul Cox: \"I just love winning and that's what I'm in it for. When you have a team to work with like ours it makes it more pleasurable!\"", "Sat Apr 20 17:36:34 ": "End-to-end football here now with some great passes being made as well as sublime tackling.", "Sat Apr 20 17:00:59 ": "RT @gordongreenland: @mansfieldtownfc Great penalty Matt Green. #Stags #COYS", "Sat Apr 20 17:26:58 ": "Scrappy start to the second half - no real drama as of yet (47) 1-0.", "Sat Apr 20 16:11:42 ": "The atmosphere is really building up here at the One Call Stadium - brilliant noise being made by the #Stags faithful.", "Sat Apr 20 19:15:51 ": "RT @LukeGregzy2010: Great result great atmosphere @mansfieldtownfc #champions #COYS", "Sat Apr 20 17:05:05 ": "Three minutes of added time in the first half. (45) 1-0.", "Sat Apr 20 15:29:07 ": "Mansfield Town starting 11: Marriott, Beevers, Jones, Dempster, Taylor, Briscoe, Chapman, Murray, Meikle, Stevenson, Green.", "Sat Apr 20 16:59:15 ": "The crowd seemed very tense minutes ago but that has all changed now and there is a more relaxed atmosphere around the stadium.", "Sat Apr 20 15:36:18 ": "The Reds have already secured a play-off place and have rested a few of their players this evening.", "Sat Apr 20 18:59:29 ": "RT @mrcpipt: Proud to be a harriers fan today. We have been awesone dis season well done to all the players. Congrats to @mansfieldtownfc f…", "Sat Apr 20 18:05:10 ": "SUBSTITUTION: Lee Stevenson leaves the field to a standing ovation and is replaced by Anthony Howell (86) 1-0", "Sat Apr 20 18:16:03 ": "We are going up say we are going up! #Stags", "Sat Apr 20 16:55:36 ": "35 minutes gone here at the One Call Stadium and it still remains 0-0. Elsewhere Kidderminster and Stockport also remains goalless.", "Sat Apr 20 18:19:50 ": "RT @dinoandpete: @mansfieldtownfc just a thought 'Sir Paul Cox' has a nice ring to it.", "Sat Apr 20 17:23:40 ": "The players are back out for the second half and we’re back underway. #Stags", "Sat Apr 20 17:43:38 ": "Apologies for the delay in updates. In the last few minutes we have almost doubled our lead as Stevenson had his shot cleared off the line.", "Sat Apr 20 14:22:23 ": "RT @beverleybell1: Just waved my boys off to the BIG game @mansfieldtownfc, felt like I was waving them off to battle, Was just missing a h…", "Sat Apr 20 14:24:25 ": "RT @matthalfpenny: Best of luck to @mansfieldtownfc today. One win to be back in the Football League!", "Sun Apr 21 02:23:38 ": "RT @BenTurner_91: Congrats @mansfieldtownfc @Mazza_78 @louisbriscoe league 2 bound", "Sat Apr 20 15:27:52 ": "The Mansfield Town players have just emerged from the tunnel for their warm up and are greeted with a warm reception. #COYS", "Sat Apr 20 18:12:55 ": "FULL TIME: Mansfield Town 1-0 Wrexham", "Sat Apr 20 18:19:19 ": "RT @MrCas24: Congratulations @mansfieldtownfc. Especially to all of the old Eastwood lads. Especially @lee8stevo &amp; @lindonmeikle", "Sat Apr 20 16:18:50 ": "We're underway at the One Call Stadium. Can Stags make history and return to the Football League as champions. #promotionpush", "Sat Apr 20 16:41:42 ": "Free kick whipped in by Murray which is met by Jones' header across goal before Walker almost puts the ball into the back of his own net.", "Sat Apr 20 15:48:23 ": "Our side have won their last nine successive games on home soil – can we make that 10 this evening? #COYS", "Sat Apr 20 15:34:47 ": "Meanwhile, Wrexham player-manager Andy Morrell has made six changes to the side that drew with Braintree Town in midweek.", "Sat Apr 20 18:18:56 ": "RT @MagpieDave: Well done to @mansfieldtownfc - back in the Football League. Well done", "Sat Apr 20 16:47:37 ": "Lovely link up play in the midfield areas from #Stags before Matt Green tries his luck from 25 yards but his effort sails over. (28) 1-1", "Sat Apr 20 09:45:02 ": "Sandy Pate Sports Bar open to Home Supporters only from 1pm today.", "Sat Apr 20 18:09:01 ": "RED CARD: Wrexham's David Artell has been sent off for a reckless tackle on Colin Daniel (90) 1-0", "Sat Apr 20 14:52:56 ": "RT @ratcliffe_19: 90mins till kick off! @mansfieldtownfc Nervous Excited! :) #MTFC #COYS #Leaguefootball", "Sat Apr 20 18:11:32 ": "Mansfield Town fans are all on their feet - we are almost there..", "Sat Apr 20 14:50:14 ": "An hour and a half to go until kick off here at the One Call Stadium and the atmosphere around the ground is starting to build up nicely.", "Sat Apr 20 16:31:47 ": "Throw-in from Chapman is cleared before falling to the feat of Murray who rifles his shot straight at the goalkeeper.", "Sat Apr 20 19:20:04 ": "RT @suzyfluzy: Congratulations to @mansfieldtownfc on promotion to the Football League. Another thing for us to cheer about #stags", "Sat Apr 20 17:07:26 ": "HALF TIME: Mansfield Town 1-0 Wrexham (Matt Green, 40)", "Sat Apr 20 19:16:45 ": "RT @NickBieber93: Very happy to see @mansfieldtownfc - the town I grew up in - back in the football league. Come on you Stags!", "Sat Apr 20 16:51:07 ": "Stevenson tries his luck in a crowded penalty area but his effort deflects for a corner (30) 1-1", "Sat Apr 20 18:57:22 ": "RT @panostano13: Congratulations on winning the blue square premier trophy @mansfieldtownfc", "Sat Apr 20 19:17:39 ": "RT @NickNYR_npihc: MASSIVE congratulations to @mansfieldtownfc on getting back to the Football League. Fantastic!", "Sat Apr 20 18:33:11 ": "RT @ftfc: Congratulations to @mansfieldtownfc on your promotion", "Sat Apr 20 16:57:37 ": "GOAL: Mansfield Town 1-0 Wrexham (Matt Green, Pen, 42)", "Sun Apr 21 01:17:07 ": "RT @Alan_Alger_: Congratulations also due to Matt Green whose goal sealed the #BSBP title and the division's Golden Boot today. #MTFC @mans…", "Sat Apr 20 17:58:49 ": "SUBSTITUTION: Paul Cox makes his first change of the game as Colin Daniel replaces Lindon Meikle (79) 1-0.", "Sat Apr 20 14:51:15 ": "RT @RichardjNUFC: Good luck to @mansfieldtownfc today! Keep my fingers crossed you win promotion!:) #ComeOnStags", "Sat Apr 20 18:32:25 ": "RT @DannyBirch18: CHAMPIONS after 5 long years absolutely amazing well done @mansfieldtownfc", "Sat Apr 20 18:32:05 ": "Adam Murray lifts the Blue Square Bet Premier trophy. Inspirational captain! #mtfc", "Sat Apr 20 17:56:42 ": "Lovely pass played through the heart of the Stags defence but Marriott wins the race against Reid to clear the ball away to safety (76) 1-0.", "Sat Apr 20 15:38:51 ": "RT @tom_b_1988: @mansfieldtownfc good look lads . Do the town proud :-)", "Sat Apr 20 15:37:32 ": "Wrexham subs: Creighton, Reid, Morton, Parle, Royle.", "Sat Apr 20 17:46:18 ": "Seconds later Stevenson climbs up high to see his header clip the cross bar.", "Sat Apr 20 16:35:16 ": "#Stags looking dangerous every time they go forward as another lethal cross is whipped in but cleared away by the Wrexham defence.", "Sat Apr 20 18:06:43 ": "Three minutes to go and there's a lot of nervous fans around the One Call Stadium, Can #Stags hold on... #COYS", "Sat Apr 20 16:03:17 ": "RT @Francesb70: Come on you Stags! Come on you Stags! Come on you Stags! Rooting for you from your Norfolk fans! #league2 #believe @mansfie…", "Sat Apr 20 14:46:22 ": "RT @withinspupdog: Come on @mansfieldtownfc please do it tonight lads put a smile on my dads face please!! #coys", "Sat Apr 20 15:39:17 ": "RT @varneyben: @mansfieldtownfc Good luck to Coxy and M.T.F.C ,.. Will be waiting for the good news from Sarasota, Florida.", "Sat Apr 20 16:58:21 ": "Fantastic penalty from Green who drills his spot-kick into the bottom right hand corner. Stags lead 1-0!", "Sat Apr 20 18:15:29 ": "RT @JackLongstaff31: Massive congratulations to @mansfieldtownfc fully deserved. Nice to see them back in the football league. Top effort! …", "Sat Apr 20 16:51:18 ": "RT @johnlomas: So tense here at Mansfield. All Stags but no goals here or at Kidderminster so so far so good!", "Sat Apr 20 15:37:01 ": "Wrexham starting 11: Coughlin, Cieslewicz, Ogleby, Hunt, Little (c), Walker, Clowes, Colbeck, Evans, Adebola, Artell.", "Sat Apr 20 22:01:09 ": "RT @zoemez1: Well what a great day/night its been. Well done @mansfieldtownfc well deserved. #coys :))))", "Sat Apr 20 18:01:42 ": "SCORE UPDATE: Kidderminster Harriers 2-0 Stockport County.", "Sat Apr 20 18:33:21 ": "RT @ming3mobile: congrats to @mansfieldtownfc on becoming blue square prem champs, going to be nice to see them in the football league agai…", "Sat Apr 20 17:37:03 ": "RT @StickyPalms: Game suspended at Kidderminster. Stockport fans attacked home players. #sadday", "Sat Apr 20 17:59:58 ": "10 nerve-racking minutes left here as #Stags still lead 1-0.", "Sat Apr 20 18:19:25 ": "RT @AgentGovag: Chuffed to bits for @mansfieldtownfc Back in the league where they belong!", "Sat Apr 20 15:23:04 ": "Kick off 55 minutes away. Stay tuned for match updates between #Stags and Wrexham. Will this be the day we return to the Football League?", "Sat Apr 20 18:16:15 ": "RT @khfcofficial: It's all over a Field Mill and its Mansfield who are the Blue Square Premier champions.  Congratulations to them.", "Sat Apr 20 14:51:53 ": "RT @tommarshall418: Good luck to everyone involved in the promotion push! Got a lot of good friends at both @khfcofficial @mansfieldtownfc …", "Sat Apr 20 18:21:33 ": "Stay tuned for post-match reaction from manager Paul Cox and many of the players on their championship winning season. #BSBP #Stags", "Sat Apr 20 15:49:01 ": "RT @Rpikey1001: @mansfieldtownfc come on stags do the town proud and get back into the football league. Yeeellloooowwwws Yeeellloooowwwws Y…", "Sat Apr 20 16:41:59 ": "RT @billyelvis1: Come on MTFC.......", "Sat Apr 20 16:25:49 ": "Ball over the top finds its way to Stevenson but he fires his effort straight at Coughlin. (7) 0-0", "Sat Apr 20 18:14:30 ": "Mansfield Town have done it! They are the Blue Square Bet Premier champions and will be returning to the Football League next year! #mtfc", "Sat Apr 20 18:17:13 ": "Full match report to soon follow on http://t.co/z7MlnNeNU8. #stags #BSBP #footballleague", "Sat Apr 20 17:31:16 ": "Meanwhile Kidderminster have taken the lead against Stockport County. However, the way things stand #Stags are going up.", "Sat Apr 20 21:24:58 ": "RT @Jones_Hannah_: Stags are champions!! @mansfieldtownfc", "Sat Apr 20 18:14:42 ": "RT @NonLeaguePaper: Congratulations to Mansfield Town on winning the Blue Square Bet Premier title #footballleaguebound", "Sat Apr 20 15:44:14 ": "RT @dale0404: @mansfieldtownfc from 17:15 nobody disturb me, I will be a nervous wreck, they better get promoted today!  #mansfieldtown", "Sat Apr 20 17:42:14 ": "SUBSTITUTION: Wrexham make their first change of the game as Ogleby is replaced by Bradley Reid (59) 1-0", "Sat Apr 20 16:15:47 ": "Both teams are out and we're moments away from kick off! A pulsating 90 minutes ahead for the #Stags.", "Sat Apr 20 14:51:03 ": "RT @RichardjNUFC: Good luck to @mansfieldtownfc today! Keep my fingers crossed you win promotion today!:) #ComeOnStags", "Sat Apr 20 16:21:53 ": "Jones goes close after two minutes as his header is palmed away by the goalkeeper.", "Sat Apr 20 16:56:59 ": "PENALTY: Mansfield Town have been awarded a spot kick following Briscoe being brought down...", "Sat Apr 20 15:31:03 ": "Manager Paul Cox has named an unchanged team for this evening’s crucial Blue Square Bet Premier clash with Wrexham at One Call Stadium.", "Sat Apr 20 18:54:18 ": "RT @KeeganB10: @mansfieldtownfc loving it stags lets kick on next season who knows what could happen #classabove", "Sat Apr 20 19:16:33 ": "RT @DannyBirch18: There are no words to express my feeling for this photo @mansfieldtownfc  @aaronsammons7 http://t.co/4uAXPefUQy"}