{"Sun Dec 02 21:33:06 ": "@taylorboguch its a fad, just like everything else here", "Tue Nov 06 15:34:16 ": "RT @Remroum: My name is Barack Obama and I approve this bombing. #Afghanistan #Pakistan #Yemen #Election2012", "Mon Nov 19 21:15:18 ": "@alexa_bordner", "Wed Nov 14 05:21:38 ": "RT @ItsJennaMarbles: I hate pretending to like people who are pretending to like me.", "Sat Dec 08 00:46:11 ": "#liquidoxygen http://t.co/BsLt9Xfh", "Tue Nov 06 15:26:41 ": "RT @YourAnonNews: via @AnonymouSkY: Anons protect police after they almost got rushed for punching protestors  #Nov5 #OpVendetta http:// ...", "Mon Nov 19 21:12:54 ": "@NickSwardson @loganlerman great job at ruining a book? I agree", "Sat Nov 17 03:50:15 ": "Just took a fat dab and @serbianstevie flashed before my eyes,,,\nNot really but that nigga is missed in the fo to cinco", "Fri Nov 30 08:05:48 ": "RT @feets01: F is for friends who do stuff together", "Sat Nov 17 00:06:45 ": "RT @ItsJennaMarbles: \"Freshman are annoying\" - People that were Freshman last year.", "Mon Nov 12 16:55:46 ": "RT @RealMacDre: Dose for dose I love to spit... And boy the dank I love to hit #MacDre", "Mon Nov 19 21:47:08 ": "RT @alexa_bordner: 🙈🙉🙊", "Mon Nov 12 19:09:06 ": "RT @MensHumor: Thanksgiving is like sex. Preparation takes hours &amp; the actual event can be over in minutes, then you argue about who ...", "Tue Nov 06 15:29:25 ": "RT @ukittenme: If you're an actual everyday weed smoker, then you should know why vote NO on 502 #geteducated", "Tue Nov 20 00:40:34 ": "@farleysfinest @alexa_bordner I have no idea how I did that lol", "Sun Nov 11 20:31:30 ": "RT @DoobieDoodette: Political agenda ads have now been replaced with consumer/corporate agenda ads. #Pathetic", "Mon Nov 12 04:40:13 ": "Hey I have a good idea, lets bump our music super loud so everyone notices our illegal activities! #youshouldalearnedthisbynow", "Mon Nov 12 20:39:03 ": "@OhhhKellyy defensive mucho.. I know hella moms who can't live without that shit, homies that had seizures from withdrawls, just a warning", "Thu Nov 22 19:52:05 ": "RT @Chrisbuck_69: It was already snowing at this time last year", "Thu Nov 29 01:36:34 ": "“@Ryhurd12: YOUR LOUD SPEAKER ISNT INFLUENCING ANYONE'S RELIGIOUS BELIEFS” neither is this tweet", "Wed Nov 21 18:29:08 ": "\"you can't have your cake and eat it too\" has been forever replaced in my mind with, \"you can't have a drunk bitch and a full bottle\"👧👩👵👸🙎", "Wed Nov 07 02:47:44 ": "RT @Jlaura69: Election Day? More like ERECTION DAY! #hahaha #immature", "Mon Jan 14 19:41:36 ": "RT @WorldWeedDay: San Diego Mayor Halts Marijuana Shop Crackdown  #p4p #Weed #420 http://t.co/rqFOqYl7", "Tue Nov 06 16:44:22 ": "@NikensToussaint lol nothing I just disagree with you politically", "Fri Nov 30 21:30:22 ": "@feets01 @emmacoen same shit fetus", "Wed Nov 21 06:36:50 ": "@deeznutts69 ej burger is gross as fuckk", "Fri Nov 23 20:59:19 ": "@feets01 I have a shrine to you in my closet hey Arnold style", "Tue Nov 27 20:16:36 ": "@haileypetersonn +10 cool points", "Mon Nov 12 19:20:18 ": "RT @AnarchoAnon: We support #Colorado's petition in hopes #Denver will truly become the #Amsterdam of North America.", "Sun Nov 18 06:36:34 ": "@ByoFosho damn good for you byo", "Sat Nov 24 00:48:02 ": "I don't give half a fuck about football, but I love when a bunch of stuck up douchebags get there own shit handed to them #hahahahahaha", "Fri Nov 30 08:06:14 ": "@feets01 F is for FIRE burning down the buildings", "Tue Nov 06 15:42:07 ": "@NikensToussaint dammmn you nickens", "Tue Dec 11 00:57:28 ": "@feets01 how does this not have 8 million favorites", "Tue Nov 20 00:39:00 ": "RT @RepRonPaul: Secession: Are We Free To Go?  http://t.co/54ubB2kt", "Mon Dec 03 17:59:22 ": "RT @YourAnonNews: SOPA is dead. PIPA is dead. ACTA is dead. Now, we wouldn't want to see the #ITU trying to take over internet governance.", "Tue Nov 20 00:41:12 ": "@feets01 @byofosho grammar nazi", "Fri Nov 09 08:55:09 ": "RT @FillWerrell: Damnnnnnn gurrrrrrrl are you a fire detector?\n\nCuase you are really fucking loud and annoying.", "Sat Nov 10 18:07:34 ": "RT @UberFacts: Studies show that praising children for their intelligence may hinder their progress - Instead, they should be praised fo ...", "Fri Nov 09 08:57:49 ": "RT @YourAnonNews: FBI plans to test by 2014 a database for searching iris scans nationwide using #B12 Technologies http://t.co/ggFkijbH  ...", "Sat Nov 17 07:47:39 ": "@AndyMilonakis @realwizkhalifa that's fucking shit weed, that isn't even close to regs", "Sat Nov 17 20:21:40 ": "@DoobieDoodette for your health, take your oils out of plastic, polymers can seep into the eerrrrlllll :/", "Sat Nov 10 19:11:46 ": "@keedconnor whyyyd they doooo meee dattt wayyyyy", "Tue Nov 13 07:44:15 ": "#blops http://t.co/eGvXKEKr", "Mon Nov 19 21:14:19 ": "@jmonfried somehow I just can see you filling out surveys to make small amounts of cash", "Thu Nov 08 18:37:21 ": "@feets01 well, for example I voted in Washington, but it WAS pointless because Washington always goes democrat", "Fri Nov 16 17:06:22 ": "@haileypetersonn HAIRY******** sorry it's early 😩", "Fri Nov 09 18:53:36 ": "RT @niggerquagmire: Sorry sweetie, but no. Alcohol is not an excuse for being a dirty slut. Nice try though.", "Mon Feb 11 22:37:41 ": "RT @DoobieDoodette: Why don't people ever listen to their own advice?", "Tue Apr 02 16:44:41 ": "@fucktyler BASTARD &gt;&gt;&gt; WOLF", "Thu Nov 08 20:44:04 ": "@feets01 not really.. My vote had zero effect on the presidential election.  If it was popular vote, it would have mattered.", "Mon Nov 12 17:13:04 ": "RT @tgwmfc: Tranzit is terrible.No point in sugar coating it. So many reasons. Hopefully enough voices will be heard and the dlc won't e ...", "Thu Nov 08 22:33:43 ": "@feets01 @serbianstevie you will be double sad when New Years comes... revolution comes every year, Andre n lynch may never happen again.", "Wed Nov 28 01:13:09 ": "@haileypetersonn 👃\n                              🌁📏👌", "Sat Nov 10 18:01:04 ": "RT @_ShitNobodySays: Can this threesome wait until after Wheel of Fortune?", "Mon Nov 12 20:40:26 ": "@ASnorkel I've heard alot of bad reviews.. If it sucks you will break my heart forever", "Wed Dec 19 19:33:52 ": "RT @stonrgrlproblem: #nofilter #stonrgrlproblems http://t.co/hKGF2fHQ", "Wed Nov 21 06:35:44 ": "@ChiefBrew too", "Wed Nov 14 05:31:14 ": "#InMidddleSchool I came back from Disneyland with a custom shirt. The image: a killer whale.  The text: \"Shaemu\" #stillgoingtohellforthat", "Fri Nov 23 19:43:17 ": "@feets01 actually words speak louder because they are actually spoken. A", "Sat Nov 10 18:30:31 ": "“@gregdbennett1: Obama's critics, repudiated at last - http://t.co/JH8SjJZo http://t.co/URygqAuV” some pure unadulterated bullllllshit", "Tue Nov 20 00:42:02 ": "Life's a bitch, and then you die.  Nigga don't want a whole slice, just let me taste the pie.", "Wed Nov 21 08:18:44 ": "@farleysfinest @feets01 boys**", "Tue Dec 11 18:55:07 ": "RT @MissTucci_: I wish it was socially acceptable &amp; economically possible to drop out of school, travel the world with someone you l ...", "Wed Nov 28 00:45:31 ": "RT @haileypetersonn: @farleysfinest I can't differentiate your sincerity from your sarcasm...", "Tue Nov 27 19:14:33 ": "@YourAnonNews now you tell me", "Mon Nov 19 21:18:16 ": "RT @L0renz0_x3: Friends turn to foes like virgins turn to hoes.", "Fri Nov 16 17:02:24 ": "@haileypetersonn Harry....", "Wed Nov 21 09:28:10 ": "@MLG1331PS3 @yoteslaya @youtube stupid question", "Thu Nov 22 19:58:12 ": "RT @ITZZ_DAT_BITCH: Shout out to turkeys. Big ass birds. Fck yuh.", "Sat Nov 10 17:59:12 ": "@MrRoflWaffles Fuuuck you please send me one", "Wed Nov 21 09:07:36 ": "@maeveb113 you have got to explain the logic behind that", "Fri Nov 16 02:09:52 ": "RT @ItsJennaMarbles: Running away doesnt help you with your problems, unless you're fat. Then yeah, run.", "Fri Dec 14 05:39:53 ": "@neh_booboo this weekend perhaps?", "Sat Nov 10 18:16:22 ": "http://t.co/eRZ5yHfa\nDon't say shit about Obama online", "Fri Jan 11 18:26:30 ": "RT @ItsJennaMarbles: My boyfriend broke up with me because I make too many Linkin Park references, but in the end it doesn't even matter.", "Wed Nov 28 00:47:08 ": "@haileypetersonn that's typing for ya, I was 100% sincere 👃", "Thu Dec 13 20:17:37 ": "@neh_booboo neha!", "Sat Nov 17 07:45:09 ": "RT @ThugWhaleShoes: emoji really needs a pot leaf. and a black guy.", "Mon Nov 12 20:31:44 ": "@OhhhKellyy worst addiction there is brah", "Wed Nov 21 09:10:01 ": "@MeredithWildt @youranonnews well that's unrealistic", "Thu Dec 13 00:30:09 ": "RT @MensHumor: Chicks that say, \"a lot of guys are after me\" should keep in mind that low prices always attract many customer.", "Thu Nov 08 22:30:21 ": "@serbianstevie @feets01 go to Nicky and lynch, Zach, Phil, and I are all going", "Mon Nov 12 08:09:51 ": "@AndyMilonakis facepalm philosopher", "Wed Mar 13 19:15:39 ": "@taskrok well thank god for your foresight.  That would be like keeping the Internet for yourself, you never would see its full potential.", "Tue Dec 11 00:57:16 ": "RT @feets01: another thing I'm thankful for #HAPPYTHANKSGIVING http://t.co/QU4ibqux", "Thu Dec 06 20:40:19 ": "@neh_booboo or people could have self control and not blame a soda company for their own unhealthy eating habits", "Thu Dec 06 23:51:21 ": "@SombathChum you can tell a lot about someone's character by the way they treat people they can get nothing from", "Sat Nov 10 18:31:19 ": "@MershallPick jack in the box has more 911 calls per restaurant than any other chain, EVVVERRR", "Sat Mar 16 18:00:57 ": "RT @RadicalRuss: Thank you @BarackObama for pardoning 2 people for cocaine offenses. Could you now take a look at Eddy Lepp, Dr. Mollie  ...", "Thu Nov 08 21:57:41 ": "@feets01 you need to understand the context in which the founding fathers proposed the electoral college http://t.co/0kpPYEDb", "Mon Nov 19 21:47:39 ": "RT @UnspinTheNews: White House \"deputy committee\" changed Benghazi talking points. Deleted references to terrorism. #Exposed http://t.co ...", "Wed Nov 21 06:37:37 ": "@feets01 BUT FETUS I LOOOOOOOVEEEE YOU NOOOOO\n\n- boy's of asu", "Sat Mar 16 22:01:16 ": "@ukittenme yes, because that's what this world needs, more people that don't give a fuck. #fucknegativity", "Mon Nov 12 19:19:22 ": "RT @YourAnonNews: #WhyiFTP #WhyACAB - Few rape kits tested in Colorado; Police say it's not necessary, victims think otherwise | http:// ...", "Sat Dec 15 23:01:43 ": "RT @TorianBrown: @BarackObama is now acting like he supports ending the drug war &amp; legalizing weed but he has been it's biggest impe ...", "Mon Nov 12 20:48:19 ": "RT @OhhhKellyy: My life is ruined. http://t.co/WQyI864K", "Wed Nov 21 08:20:23 ": "@ChiefBrew two", "Fri Nov 23 13:31:45 ": "@feets01 went to az came back with the attitude", "Tue Nov 06 15:54:21 ": "@emmacoen did not see this, we should kick it soon, check it out, prediction: next prez will not be determined until 12/11/12.  Reason: Ohio"}