{"Tue Mar 19 15:14:15 ": "For those of u who wondered what Shk. Zayed road looked like bak in the day, here is a glimpse.. #dubai #birthplace http://t.co/WVg0Mnus9o", "Thu Feb 07 03:32:20 ": "Wagwan tweeps... A day filled with assessments and survey's for me! #security", "Thu Feb 07 03:41:30 ": "Quote of the day!! RT\"@FarOutAkhtar: There are simple solutions to all problems. It's putting them into action that's complicated.\"", "Thu Feb 14 09:12:38 ": "So, my question of the day is... If u don't celebrate V-Day, r u a bad lover??", "Sun Feb 10 18:22:07 ": "RT @devbhatia: 12 points clear ... and the REDS go marching on. #GGMU #MUFC", "Thu Mar 14 16:42:24 ": "Why doesn't it feel like the weekend for me??? #strange", "Wed Feb 13 11:51:04 ": "\"@AlAmeenService: جانب من محاضرة خدمة الامين في دبي العالميه للأمن http://t.co/RPjS06HP\" my work colleagues attending the Al Ameen meet.", "Wed Mar 13 17:47:39 ": "RT @KhalidAlrazooqi: @AkhiNair @GDRFADUBAI excellent this is a new system that will replace the current rate system and it is going to b ...", "Sat Mar 16 07:22:08 ": "@mohamedalzafeen: Salaam BuSaif.. May I know the number to report these crimes?", "Fri Feb 15 10:58:09 ": "@dutweets: I'm sorry, but ur service is horrible!!!! I'm supposed to be a premium customer and I am still given the run! #nothappy", "Sat Feb 16 08:58:31 ": "@nikhilchinapa: hau is the Richie hawtin tour lookin?? Wld it b too early to come back?? :p", "Wed Feb 20 15:20:31 ": "Is losin the plot with the number of 'massage' cards being tucked into my car window..", "Tue Mar 12 21:07:08 ": "@KhalidAlrazooqi @GDRFADUBAI: Thank you Mr Khalid. I used the new scanning system today at the arrivals and it was very easy and helpful :-)", "Wed Feb 13 19:35:49 ": "Gooooo ManU!! Sooo nervous tbh #ManU", "Sat Apr 06 09:25:45 ": "These 'massage' cards r gettin out of hand.. Tecom is the hub for em lot.. #notcool http://t.co/ostE7kS6Ps", "Sat Feb 16 05:24:51 ": "RT @Dubaiinformer: #Dubai Two more Salik gates to be open from April 15 http://t.co/SWQsrDqY", "Sat Feb 09 12:59:16 ": "RT @AbuDhabiPolice: Sheikh Saif bin Zayed reviews a PhD thesis prepared by Security Media Department researcher http://t.co/d7zT3UCR", "Tue Mar 05 09:56:45 ": "This is amazin!! #Dubai http://t.co/9Df5X6RrTi", "Mon Apr 08 03:35:32 ": "RT @JohnSaydam: Emirates flew more persons in and out of India than Air India - http://t.co/GZg38d9SiF @simpliflying @arun4 #avgeek", "Wed Feb 13 11:53:25 ": "RT @AlAmeenService: جانب من محاضرة خدمة الامين في دبي العالميه للأمن http://t.co/5KFLt0W3", "Sat Mar 16 07:17:16 ": "Impt info!! \"@mohamedalzafeen: Doing 200 km/h on the road would lead to a criminal case against the driver.\"", "Fri Mar 01 05:11:32 ": "RT @KhalafAlHabtoor: There is a great buzz in the #UAE these days as everyone works together to achieve our ambition to host World #Expo2020", "Fri Feb 15 13:15:28 ": "Lol.. hau else wld u capture a screen??", "Fri Apr 05 18:38:09 ": "@nikhilchinapa: hahaha! Wot did u eat??", "Fri Feb 15 12:49:11 ": "Will do :-))", "Wed Feb 13 11:53:13 ": "\"@AlAmeenService: خدمة الأمين تواصل سلسلة محاضراتها التعريفية لموظفي دبي العالميه للأمن http://t.co/d8dUhadb\"Part 2 of the Al Ameen Meetin", "Wed Mar 13 03:30:30 ": "@KhalidAlrazooqi @GDRFADUBAI:", "Sat Feb 09 15:11:02 ": "RT @A_AlGergawi: Death tells you that the little argument you and your friend collided over is not worth it.. #lifeishort", "Wed Feb 20 06:04:02 ": "At the @DubaiPoliceHQ Academy for the Security Networking Event.. #dubai #security http://t.co/vCacedzs", "Wed Mar 27 14:49:45 ": "RT @Binthaneya: Lt General Dhahi Khalfan Tameem to introduce the @DubaiPoliceHQ initiative in preventing blindness @noordubai", "Thu Feb 14 17:16:09 ": "Weekend getaway has jus begun! Off to a fab start :-)) #paradise", "Sat Apr 13 18:15:20 ": "@ShaistaCookie @DjTushaar: omigawd.. Thts super cute!!!", "Fri Feb 15 06:39:27 ": "@BobCSD: good luck :-)", "Sat Mar 16 07:04:50 ": "It's a Saturday morning which normally means it's time for IHOP breakie... #jbr #yum", "Sat Mar 02 06:01:36 ": "RT @Dubaiinformer: #Dubai Expo 2020 to boost ports and logistics operations http://t.co/Sw4ha9OXfn", "Wed Feb 13 17:04:55 ": "Massive massive game tonite!!! #ManU", "Fri Feb 15 13:12:35 ": "Anybody usin bb10 here tht cn help me with a screenshot app tht cn be downloaded from the app world?", "Sun Apr 14 12:49:12 ": "Taxi driver by night, artist by day: Dubai cabbie paints RTA official calendar | http://t.co/W2iSGsaqxc http://t.co/lmo8hW1cSS", "Sun Feb 17 03:49:42 ": "@onlyinUAE @mohammedfalasi: gimme the goss :-))", "Fri Feb 15 06:32:42 ": "@Ashplatt1: I've just seen ur tweet mate.. Ofcourse I was supporting the Reds mate.. Good result for us! Cnt wait to meet em at  home!!", "Mon Feb 11 09:24:27 ": "RT @JohnSaydam: “Dubai has approved plans to build an additional three lines for its Metro service by 2030” @RTA_Dubai http://t.co/LtUIQ ...", "Wed Feb 13 19:45:08 ": "@DeanStyles1: u wish :p", "Fri Feb 15 05:11:00 ": "At a beautiful resort in our part of the world... Thr is soo much to explore in the GCC before raving about the rest of the world! #ifeel", "Tue Mar 12 09:46:03 ": "does anybody in here know the official twitter account for Dubai Immigration?", "Wed Mar 27 14:05:26 ": "@pearlofficial on Frisky radio.. Let's go!!", "Sat Mar 02 15:17:28 ": "Watchin the Wasl-dhafrah game and ManU Norwich game at the same time #multitasking", "Tue Mar 05 19:10:35 ": "Nd y is Rooney not in the startin 11?? #shockin #ManU #ManchesterUnited", "Mon Feb 04 06:44:18 ": "@Katie_Fielder: If insurance companies have their own checks before insuring, this wld improve the fire safety in all bldgs in the region.", "Fri Feb 15 13:21:05 ": "@banafsaji: haha! Nt getting into this dangerous debate now :p", "Sat Mar 16 07:07:17 ": "I have just been told that I have an eclectic choice of music.. lol.. depends on the mood I guess... #music", "Wed Mar 27 14:39:04 ": "@djnawed: when do u land??", "Tue Feb 05 03:33:44 ": "Upar and About.... Morning it is :-)", "Tue Mar 05 19:09:21 ": "Massive massive game!!! Fingers crossed tonite! #ManchesterUnited", "Fri Apr 05 18:33:11 ": "RT @ScorpioAreUs: It makes more sense to give a #Scorpio what they want then to resist and piss them off.", "Wed Apr 03 06:19:53 ": "Massive!! \"@UAENews: Dubai World Central to launch passenger operations in October http://t.co/OuIOLlCdwc #UAE #Business\"", "Sat Mar 02 15:40:23 ": "@EmaratiDetails: ther is a place called Bombay Chowpatty opposite Burjuman :-)", "Fri Mar 01 16:19:23 ": "RT @BlackBerry: What sets #BlackBerry10 apart from the rest? Experience for yourself here: http://t.co/rqJPXErutr ^TW", "Thu Feb 07 03:37:12 ": "RT @Catboy_Dubai: #Dubai92TWAFFIC 7.03am - Workers' bus has rolled over northbound on Shk Zyd Rd opposite Mall of Emirates. Take ext 39  ...", "Fri Feb 15 13:35:40 ": "@ME_BlackBerry @BlackBerryHelp: hi guys... hau do I screenshot in bb10?? cbt find a way or an app!", "Sat Feb 16 21:35:55 ": "@NickitaSoni: hey gal... i know, it's been soo long.. shud b there in June! hau r u??", "Fri Apr 05 18:30:42 ": "RT @AlWaslSC: Full time. Al Wahda 1 - 1 Al Wasl. Fahad Hadeed scored for Al Wasl.", "Fri Feb 15 12:51:53 ": "Thank god!!! Get to use the new bb10 now.. first impression is super impressive..", "Sat Feb 16 09:26:16 ": "RT @ChrissieBendle: Go and follow @tracyandmatt", "Thu Feb 07 03:39:59 ": "@Al_Shemsi: Salaam Bro. Is it true that whatsapp is not available yet on the device?? Eagerly waitin for my delivery :-)", "Fri Mar 01 16:35:57 ": "At Blue Marlin- ghantoot (not ibiza in any way)..", "Sun Mar 03 17:11:57 ": "@mohammedfalasi: :-))", "Tue Feb 05 12:34:34 ": "@RajivMakhni: is it true that whatsapp is not available in the Z10??", "Thu Feb 14 12:19:57 ": "Tryin to make the switch to BB10 and it wouldn't restore my bbm contacts!!! Apparently many hv faced the same!  @BlackBerryHelp", "Fri Feb 22 18:31:47 ": "RT @malmarri: @MaryamBinFahad: Please help support Dubai Expo 2020, add a #Twibbon now! http://t.co/eCYD7ZkOIl", "Wed Feb 20 07:00:54 ": "RT @arabiaenquirer: BREAKING: Dubai resident of two months giving out advice to new expats as if he’s some sort of wise old sage http:// ...", "Mon Apr 01 19:43:49 ": "@UAENationalTeam: pls provide the contact details/email. Thank you.", "Sat Mar 23 14:23:56 ": "RT @smccudubai: DYK? An irrigation system (Al falaj) was built by the Bedouins in Al Ain whose canals ran underground transporting water ...", "Tue Apr 16 03:57:39 ": "Havnt had the time to get on twitter in a LOOONG time! I missed ya.. #Twitter", "Fri Feb 15 14:40:13 ": "@dutweets: its sorted now. Thnx for getting bak.", "Tue Feb 05 07:25:08 ": "Y cnt ppl jus lift their legs and walk... The noise of em scrapin the floor makes me pull my hair out!! #annoying", "Tue Mar 12 21:59:02 ": "Epic comeback by FCB.. What a game!! #respect #messi #fcblive", "Fri Feb 22 18:27:46 ": "Curtis is def winning this season of Idol..  Hands down!", "Sat Mar 02 15:43:36 ": "@EmaratiDetails: yup.. While ordering ask them for chai in 'matka' (the traditional word for clay pot)", "Sat Mar 16 12:58:16 ": "@mohamedalzafeen: Thank you :-)", "Wed Mar 13 17:20:49 ": "The best shot I have Eva seen of the Burj Khalifa... fabulous wld b an understatement.. Thnku @mohammedfalasi http://t.co/cGvy2wM6i1", "Wed Mar 27 14:04:01 ": "RT @nikhilchinapa: This is now live on FRISKY!!! Tune in India!! RT @friskyradio: NOW!!! GET IN! @pearlofficial !!! | TUNE IN LIVE: http ...", "Sat Mar 30 14:57:50 ": "Godolphin team all the way!!! #worldcup", "Sat Mar 02 05:53:06 ": "Breakfast at IHOP- JBR... Fav part of the weekend :-)", "Sat Feb 09 15:11:46 ": "RT @KBinhendi: 65 Million visitors to @TheDubaiMall in 2012 which is more than #NewYork &amp; #LosAngeles tourists combined! #Dubai", "Sat Mar 16 07:11:58 ": "RT @nikhilchinapa: As an artist, @arminvanbuuren has been supporting the dance music scene in India much before it became the cool scene ...", "Sat Mar 30 14:57:34 ": "Its time for some world cup fun :-))", "Sat Mar 02 15:45:49 ": "@EmaratiDetails: lemme know after u've had it.. The taste in a clay pot is 'ajeeb' :-))", "Wed Mar 27 14:14:41 ": "@DJShadowDubai: cnt wait to see u wearin em shoes :p  @Pearlofficial @nikhilchinapa", "Tue Apr 16 03:59:07 ": "RT @KhalifaBinhendi: R.I.P. to the 8 year old boy who died in Boston's explosions. #PrayForBoston http://t.co/bEg50Lucnx", "Wed Mar 13 03:33:15 ": "@KhalidAlrazooqi @GDRFADUBAI: excellent sir. Well done to the team for being innovative and pro active. #proud #UAE", "Sat Feb 16 08:54:21 ": "http://t.co/uyp5EzDC\nThis is wot the new BlackBerry 10 has come to.. lol", "Tue Mar 05 22:38:09 ": "@arnoldwilson02: I cannot believe tht decision bro! Was such a lovely game till then..", "Sat Apr 06 08:54:09 ": "RT @Binthaneya: Please support my film Journeyman and the city of pilgrims (2013) at the @GulfFilmFest which documents my 2000km journey ...", "Sat Mar 02 15:51:00 ": "@EmaratiDetails: insha allah", "Wed Feb 20 07:28:57 ": "With @dmarshall_dxb at the networking event in Dubai Police Academy! #security", "Mon Feb 11 06:30:50 ": "Govt Summit is trending heavily in Dubai.. Lookin fwd to it.. #GovSummit #GovSummi", "Sun Feb 17 03:45:54 ": "@onlyinUAE: too many that I might as well write a buk on hau bad it is?!!", "Sat Feb 09 15:31:52 ": "RIP Sir @ThamerSalman. Always enjoyed your tweets..", "Sat Mar 16 14:53:12 ": "RT @DXBMediaOffice: Dubai Police foils attempt to smuggle 24 kilograms of pure heroin into the country\n  #Dubai #UAE"}