{"Mon Mar 11 07:20:47 ": "RT @VenkysBlackburn: Maybe one day Gareth Bale could be as good as Grant Hanley.", "Sat Jan 19 16:07:03 ": "RT @roversfanben: He scores when he wants, he scores when he waaaaaaaaaants, Jordan Rhodes, he scores when he wants.", "Fri Jan 11 18:12:58 ": "RT @VenkysBlackburn: We can confirm the appointment of ex-England cricketing captain Michael Appleton as our new manager.", "Sat Jan 19 16:27:03 ": "RT @CryerRovers: Anyone know who Ewood was booing then and singing cheerio to then?", "Sun Mar 24 11:35:16 ": "Game of thrones season 2 purchased #winteriscoming", "Tue Apr 02 17:00:30 ": "RT @VenkysBlackburn: We were looking at bringing in Paulo Di Canio but he wanted to bring in Adolf Hitler as his assistant so we said 'N ...", "Tue Mar 19 17:32:31 ": "RT @VenkysBlackburn: And the most complex and in-dept managerial search in football starts once again. #NamesInAHat", "Fri Dec 28 22:23:55 ": "RT @Unnamedinsider: Justin Bieber's releasing an acoustic album! The only time I want to hear \"Bieber Unplugged\" is if it's followed by  ...", "Fri Feb 01 03:47:59 ": "RT @MrSiLaw: Currently, I hate my football club... Good night #BRFC #bollocks", "Thu Jan 03 12:23:57 ": "RT @CryerRovers: Bowyer and McPhillips are in charge until the end of January", "Wed Jan 23 22:51:15 ": "RT @stevenreid12: That kid will be on Celebrity Big Brother next year!!", "Sat Feb 02 12:07:18 ": "RT @CryerRovers: I wonder how much stick ill get after game today! Quite a lot if the convincing rovers win I expect to happen happens.....", "Thu Jan 10 06:36:33 ": "RT @AndyBisby: @CryerRovers I feel for bowyer. He has just had all of his hard work thrown back in his face. Horrendous attitude towards ...", "Wed Jan 02 07:20:16 ": "“@Chipdidy: My alarm went off at 6 im only just Getting out of bed now #LazyBast”good effort man! :P", "Mon Mar 25 20:53:23 ": "RT @VenkysBlackburn: Jose says he's not leaving Madrid until at least the Summer. We'll just stick Gary Bowyer in charge till then.", "Sun Mar 24 11:34:21 ": "RT @VenkysBlackburn: So if you see us in your neighbourhood you better duck, 'cos the Venky boys, is crazy as fuck!", "Fri Feb 01 16:59:06 ": "RT @VenkysBlackburn: The transfer window may be shut, but we're going to try and get one or two slags 'over the line' this evening.", "Thu Mar 28 07:40:39 ": "RT @VenkysBlackburn: Is it time for a Jewish manager. A proud one with a little hat and curly side boards? No. Not just yet.", "Sat Jan 19 16:31:35 ": "RT @roversfanben: Venky's, don't just walk away from the ground, walk away from the club! Fuck off back to chicken farming &amp; sell to ...", "Wed Jan 09 22:52:36 ": "RT @CryerRovers: Just think it wd have been manners to mention to caretaker that approach for appy being made before it was.", "Thu Jan 10 20:40:07 ": "http://t.co/tJ1NH5AE", "Wed Jan 16 20:42:28 ": "RT @VenkysBlackburn: We've got to turn Ewood Park into a fortress, so we're going to build a moat outside so no-one can get in.", "Sat Feb 02 15:31:11 ": "RT @roversfanben: He scores when he wants ,he scores when he waaaaaants ,Jordan Rhodes, he scores when he wants.", "Thu Dec 27 15:36:28 ": "RT @VenkysBlackburn: Time for Steve Kean to return. Time for the dark knight to rise once again.", "Wed Jan 23 22:50:50 ": "RT @roversfanben: In fairness that little fucker deserved to be kicked and Swansea should sack him.", "Mon Jan 07 20:15:56 ": "@Bunji81 tempted to get that myself,quality album from wot iv heard of it", "Tue Jan 01 11:40:43 ": "RT @JP_Dupree: I heard that Venky's have scheduled a 6pm game of rock, paper, scissors to decide on the new Rovers manager.", "Fri Feb 01 16:28:41 ": "RT @VenkysBlackburn: Peter Odemwingie is outside of Ewood Park. Do we let him in? He has a strange look to him, like a premature little  ...", "Wed Jan 09 22:52:25 ": "RT @CryerRovers: Just think it wd have manners to mention to caretaker that approach for appy being made before it was.", "Thu Jan 10 19:22:21 ": "RT @VenkysBlackburn: Appleton will become our new manager within the next 24 hours. Just deciding which one now, either Natalie or Nicole.", "Mon Jan 07 20:13:31 ": "RT @CryerRovers: Great Di Canio story on BBC. Offering to pay £30,000 of his own money to keep his loan players at Swindon.", "Thu Jan 10 11:29:26 ": "RT @roversfanben: I'll be 100% behind Appleton if he gets the job, like I always am but we need to accept that not everyone will and nob ...", "Thu Jan 31 13:48:43 ": "RT @VenkysBlackburn: Can we buy players using paypal?", "Sat Jan 05 10:17:54 ": "RT @JP_Dupree: So Steve Kean is paying Big Sam £200k for disparaging comments made on video. Still, a very dignified man obviously.", "Tue Jan 01 16:07:12 ": "RT @CryerRovers: GOAL Rochina", "Fri Mar 22 21:21:56 ": "RT @VenkysBlackburn: Interviews are underway http://t.co/IOkKp1vDpU", "Thu Jan 10 12:47:21 ": "Blackpool fans n media speak of Appleton highly but surely record speaks for itself?...", "Fri Jan 25 09:01:02 ": "RT @VenkysBlackburn: We're going to try and sign that Swansea ball boy. He can hold onto the ball longer than Jordan Rhodes anyway.", "Fri Jan 11 10:48:09 ": "RT @adamhenley2: Come on boys! #Rovers #BRFC #Promotion", "Mon Jan 21 18:27:11 ": "RT @VenkysBlackburn: Which cunt was it who hit us with a snowball then?", "Sat Jan 19 18:44:51 ": "RT @NorrisCole_Not: RT if you have got one!\n╭━━━━━━━╮\n┃　　● ══　　  | \n┃███████┃\n┃███████┃\n┃███████┃\n┃███████┃\n┃███████┃\n┃███████┃\n┃███████ ...", "Tue Jan 01 20:20:02 ": "RT @CryerRovers: I think tonight shd just be a time to give players credit. I've been a big critic in past but last two games have shown ...", "Tue Jan 08 11:45:55 ": "RT @roversfanben: So Nelsen is to become manager of Toronto, I'm sure he'll be a massive success. Good luck, Admiral.", "Thu Jan 10 17:40:57 ": "RT @CryerRovers: So Rovers granted permission to speak to Appleton. Massive conflict of stories from Rovers though. Surely can't not hap ...", "Fri Feb 01 12:07:39 ": "http://t.co/QGMde0TN", "Sat Dec 29 15:47:28 ": "RT @roversfanben: Ruben Rochina! Ruben Rochina! Ruben Rochina! Ruben Rochina!", "Sat Jan 19 09:46:18 ": "RT @CryerRovers: Game is definitely 0N today at blackburn rovers", "Thu Jan 03 15:50:59 ": "RT @Rell_Brennan: Whenever you're pissed off, just remember that it's better than being pissed on.", "Fri Jan 18 21:46:48 ": "RT @RoyChubbsBrown: The Wife is kicking off and claims the Snowman I made for the Grandkids is \"inappropriate\" #YFB http://t.co/lhBwVSy8", "Fri Jan 11 09:29:56 ": "RT @CryerRovers: Rovers will have their fifth manager of the season by the end of the day! Hope gary can sign off with a fourth win a ro ...", "Mon Jan 07 20:13:46 ": "RT @Bunji81: Holy crap !!!! Calvin Harris 18 Months is FAPPING AWESOME", "Mon Apr 08 19:30:29 ": "RT @BenSmithBBC: Blackburn: Venky's summon Bowyer and Shaw/Agnew to India for talks. Story by @andrew_cryer &amp; me http://t.co/NhdwsGj ...", "Sat Jan 19 15:43:43 ": "RT @CryerRovers: Charlton are head and shoulders the better team at the moment, still only 1-0 though", "Wed Jan 09 22:52:05 ": "RT @CryerRovers: Feel gary bowyer and terry have been messed around. Its all politics at the top", "Tue Mar 19 13:01:19 ": "RT @VenkysBlackburn: Stick a fork in Michael Appleton. He's done.", "Wed Jan 09 15:37:06 ": "RT @NorrisCole_Not: Rita farting when I was bumming her was not the one...", "Wed Jan 09 22:52:19 ": "RT @CryerRovers: In tmrws lt - why appleton will probably take the job. Approach was too late for us but 'rovers eye appy move' is close ...", "Tue Jan 15 12:59:19 ": "RT @LewisArcherNot: Just sold Peter Barlow a shit load of HMV vouchers for Simons birthday next week\n#sillybastard", "Wed Jan 09 23:18:46 ": "RT @CryerRovers: I think it is safe to say singh had no idea about the approach - or even the interest. Said it for weeks, club needs to ...", "Tue Jan 01 16:35:11 ": "RT @roversfanben: He scores when he wants, he scores when he waaaants, Jordan Rhooooodes he scores when he wants.", "Thu Dec 27 15:36:41 ": "RT @roversfanben: Don't shoot the messenger, but I've been told from numerous reputable sources that Shebby Singh is indeed a wanker.", "Thu Feb 07 17:54:19 ": "RT @Bunji81: Just wants to get home", "Sun Mar 31 12:46:03 ": "RT @roversfanben: I'd love Martin O'Neill at Rovers, if he's stupid enough to take the job.", "Sat Feb 02 11:45:11 ": "RT @NorrisCole_Not: #TwitterOnTheShitter to start my Saturday", "Sat Dec 29 17:00:52 ": "RT @CryerRovers: GOAL 3-1 Rhodes. Get in", "Wed Jan 09 22:52:04 ": "RT @CryerRovers: So rovers confirm appleton approach past our deadline! Cheers. Fortunately doesn't change our back page tmrw too much.", "Wed Jan 09 22:52:20 ": "RT @CryerRovers: This is definitely paul agnew and derek shaws move. Shift of power?", "Sun Jan 13 13:38:37 ": "http://t.co/RWeG2JCH", "Tue Mar 19 17:32:20 ": "RT @colin_kazim08: Just so you know I would still rather play for Blackburn rovers than down at turd moor #fact", "Thu Jan 03 11:06:29 ": "RT @CryerRovers: Sven open to Rovers role. http://t.co/blL6gfsT. Call me crazy but Id take him. Did the 6-month thing at City as well... ...", "Thu Jan 10 11:44:20 ": "RT @WillWatt: Blackpool assistant manager Steve Thompson has taken training this morning. Neither Michael Appleton or Ashley Westwood ar ...", "Tue Jan 01 16:44:27 ": "RT @roversfanben: Do do do! Gary Bowyer you beauty. Finally some stability. He has to be a serious contender for the job.", "Wed Jan 02 12:33:58 ": "RT @CryerRovers: Rovers have concluded signing of Josh King as expected", "Tue Jan 22 20:05:56 ": "RT @VenkysBlackburn: Balaji's hair is covered with snow. He looks like a stubbed out cigar.", "Sat Jan 05 18:42:45 ": "RT @VenkysBlackburn: Does this mean we've won the FA Cup now?", "Sat Dec 29 07:55:18 ": "RT @TheRealSalgado: Watching what is happening at Blackburn pisses me off. For god sake, stop this madness. I'm really sorry for the fri ...", "Sat Jan 19 18:07:16 ": "RT @MrsBrownNOT: Had a feckin' tesco Burger last night, been up all night with the trots..but in a stable condition. Basterds", "Wed Jan 16 20:46:51 ": "RT @RoyChubbsBrown: Horsey horsey dont you stop or you'll end up in Tesco shop, the tail goes swish the wheels go round, giddy up you're ...", "Wed Jan 16 10:37:03 ": "RT @VenkysBlackburn: It's well below zero outside today. And that's just our bank balance.", "Wed Jan 09 22:57:35 ": "RT @tomEurosport: Michael Appleton has won two of 12 games since being appointed Blackpool manager.", "Sun Mar 24 13:10:10 ": "RT @NorrisCole_Not: Bit of snow and sky movies put jingle all the way on in march, it's not fucking Christmas 🙈", "Thu Jan 24 06:12:04 ": "RT @RoyCropperNOT: It's a good job it was Hazard that kicked that ball boy, Torres would have missed..", "Sat Jan 05 19:18:58 ": "RT @Chipdidy: Oh fuck off united", "Thu Jan 03 22:57:16 ": "RT @VenkysBlackburn: Shebby Singh is threatening to take Jim Davidson's place in Celebrity Big Brother this evening. We haven't seen him ...", "Tue Jan 08 16:07:59 ": "RT @Rell_Brennan: It's good to know i can still stop traffic!! just push the button and wait for the little green man!!", "Thu Jan 10 11:24:25 ": "RT @CryerRovers: Blackpool presser at 12.30 and Rovers at 12.45. Im sure Gary will be delayed as he gets updated from Blackpool end what ...", "Tue Jan 22 21:58:24 ": "RT @CryerRovers: Moment of madness from goodwillie. Fulltime 1-1 after lopez tucks home from spot in 95th minute. Crazy challenge", "Fri Jan 11 09:40:30 ": "RT @CryerRovers: Senior players urged rovers to give bowyer more time - see todays lt. But doesn't mean they don't back new man.", "Sat Jan 19 16:28:48 ": "RT @CryerRovers: So Venky's have left apparently? They might make Splash if they get a move on....", "Wed Jan 09 23:12:42 ": "RT @CryerRovers: I've heard a lot of gd things about appleton tbf and hope he does well if appointed. Just wish rovers acted properly. # ...", "Tue Jan 15 11:51:41 ": "RT @_vickypollard_: #HMV omg i can't believe HMV are going out of business, it was well easy to nick stuff in there", "Mon Jan 14 10:01:09 ": "RT @NorrisCole_Not: fucking get in 2 feet of snow outside http://t.co/om51nYVI", "Sat Jan 19 16:24:28 ": "RT @roversfanben: Shit.", "Sat Feb 09 16:40:47 ": "RT @roversfanben: He scores when he wants, he scores when he waaaaants, Jordan Rhodes he scores when he wants!", "Thu Jan 10 09:49:22 ": "RT @WillWatt: My final point for the night. Rovers make this public quite clearly to unsettle BFC. Poor from a club who are lacking clas ...", "Fri Feb 01 03:50:09 ": "RT @JP_Dupree: Neither Campbell nor Thomas deals were completed then. What an absolute joke. A cynical man would think it may be deliber ...", "Tue Jan 22 21:59:48 ": "RT @CryerRovers: I was surprised by how comfortable rovers were until that. Thought appleton got it right tonight - but a v costly two p ...", "Tue Mar 19 14:15:30 ": "RT @RobbieSavage8: As I said last week it's a shambles at Blackburn", "Tue Jan 22 20:06:14 ": "RT @MrsBrownNOT: Some Feckin Bastard wrote RETARD in the snow on my car window. It took me frigging ages to lick it off.", "Sun Jan 27 18:06:10 ": "RT @roversfanben: Fuck me, all these lower league teams and we get Arsenal!", "Sat Dec 29 03:42:25 ": "RT @CryerRovers: Quite surprised by any suggestions that david dunn involved in set up with bowyer tmrw. As I understand it him and mort ..."}