{"Mon Feb 25 22:06:00 ": "RT @UmbertoBacchi: Enrico Letta has no idea what to say. They managed to lose an election that was already won an year ago #ItalyVote", "Sun Mar 03 18:07:22 ": "What an outstanding evening of sport #Goteborg2013. Lavillenie's brilliance &amp; reaction to DQ was my highlight (+ GBNI 4x4 CR!) #athletics", "Tue Apr 02 19:07:32 ": "Think statute of limitations on praising former Utd players is 10yrs so can almost say it: David Beckham kicks a ball real nice.", "Fri Mar 22 10:01:53 ": "RT @Vitu_E: @jamescharlo Look what happened on Politics yesterday!! #DowngradedChancellor #politics #hashtag http://t.co/PKDOsKWSH7", "Mon Mar 18 23:23:38 ": "I forget which Churchill and Orwell tomes backed Press freedom to lie, cheat, steal and hack #tomorrowspaperstoday #dontbuythesun", "Thu Mar 07 08:52:22 ": "Hats off to the bloke next to me on the train. Dealt with the huge pic of a near-nude @rihanna in the Metro with quiet dignity #neverlinger", "Wed Mar 20 09:59:51 ": "Also, listened to today in parliament last night, and how good is @CarolineLucas ? What a star.", "Wed Apr 10 15:11:59 ": "@EwanGaffney See pic. I haven't for ages. The less involved you are, the less confident you are in your own bullshit http://t.co/4fiulCTA3X", "Wed Apr 10 14:34:50 ": "@EwanGaffney positively athletic, at http://t.co/2OZKbpIknN. If you want to know how many bananas top sprinters eat, I am your man.", "Thu Mar 21 09:53:33 ": "Not sure about Samaranch's Madrid's 2020 logic. Thinking particularly of London 2012 and Valencia F1/tennis/sailing http://t.co/4x9YuYv4PB", "Tue Mar 05 21:56:07 ": "RT @davelee: Chavez dead - AP", "Mon Apr 08 12:30:55 ": "RT @HollyBranson: If anyone has a reason to be embarrassed by their dad - I do!! #hellolittlered http://t.co/0YZs3jplFu", "Mon Apr 08 18:19:59 ": "oh stop it boris: http://t.co/ppzbiDtOp9", "Thu Mar 07 17:57:03 ": "RT @alexmassie: The dumbest literary idea of all time: Sebastian Faulks is writing a \"PG Wodehouse\" novel. We are not gruntled. http://t ...", "Tue Apr 02 19:16:18 ": "RT @Vitu_E: New issue of @AllOutCricket in the can featuring my 24 hr cricket marathon. Here's a snap that didn't make the cut... http:/ ...", "Fri Mar 22 09:30:02 ": "Scotland's independence referendum is in Sept 2014, one month after the brave Scots vanquish England at the Glasgow Commonwealth Games.", "Thu Apr 18 18:30:50 ": "Tonight, I'm paying to poke myself in the eye. One hour in so far, on a ten minute break.", "Tue Feb 26 11:08:44 ": "Just wondering which way to comb my hair for my PHOTOSHOOT later. Just need a comb now #modelife", "Tue Feb 26 14:44:53 ": "Modelling didn't really work out. It was cold and I blink too much (see profile pic). I'm now an ex-model.", "Fri Apr 12 10:47:36 ": "RT @spikesmag: @YohanBlake is already a world champion in his own sport and wants to be a star in another. The cricketing Beast &gt;&gt; ...", "Fri Mar 01 18:18:43 ": "RT @prodnose: This is perfect. Manager Carlos Bianchi is introduced to Boca Jnr supporters. Non football people will dig this too: http: ...", "Thu Mar 28 21:38:46 ": "@MilkChase if you leave me now, you take away the biggest part of me.", "Mon Mar 25 23:05:53 ": "Hunt/Farage should a) check their facts &amp; b) watch sun, sex and suspicious parents. Young Brits love an EHIC card and free healthcare.", "Thu Mar 28 16:26:26 ": "Usain Bolt's racing 150m on this beach http://t.co/a1KI4NRFET. At the copa... Copacabana http://t.co/DWOR6cuRQS", "Tue Feb 26 16:36:12 ": "RT \"@Network_Digital: @jamescharlo marvels at his brilliant colleagues and the eating habits of Yohan Blake http://t.co/eoZnWDz7HZ\"", "Tue Feb 26 11:29:55 ": "Local US news anchor to apparent fun runner Mo Farah: \"Haven't you run before?\" (via @spikesmag) http://t.co/Rp7atKQPDd", "Wed Mar 06 08:53:07 ": "@AndyStoddart96 what do you call a footballer's wife on a bicycle? Wagon Wheels", "Sun Apr 07 14:54:28 ": "@RorySmithTimes is Sebastian Coates", "Mon Mar 25 23:29:22 ": "@TheJakeWarren I am. Although I've heard he speaks very highly of me.", "Fri Mar 22 12:18:57 ": "RT @GeorgeEJ111: If a tree falls in the middle of a forest but no one takes a picture of it and uploads it to Instagram, did it actually ...", "Thu Apr 04 13:16:55 ": "Hey @AdrastusPerkins load your bases, batter up, home run! Meet the Olympic 400m hurdles champ and Pedro Martinez fan http://t.co/FWNsTVNfXs", "Mon Apr 01 19:14:06 ": "I've got so much thyme in my fingernails", "Thu Apr 04 14:02:13 ": "RT @spikesmag: Oi, Britons! You can pre-register now for Olympic Stadium Anniversary Games tickets at http://t.co/p9EYAfdPzR. On sale 19 ...", "Wed Feb 27 14:27:11 ": "The Amazing Adonis planting transport infrastructure acorns all over the place. My hero. http://t.co/6HmjZhP8I7", "Wed Apr 10 15:14:11 ": "@EwanGaffney p.s. Douglas-Home, without a shadow of doubt. First class cricketer and a damn good Eton Fives player, whatever that means.", "Thu Apr 11 10:20:07 ": "@Vitu_E you are very good", "Mon Apr 08 11:30:29 ": "Tumblr funnies http://t.co/xK3FIFD0gR", "Mon Mar 25 22:59:50 ": "Of the four people on #newsnight I can count one trilby (Farage), one tartan scarf and a double-breasted blazer with gold buttons", "Tue Mar 19 17:24:11 ": "RT @spikesmag: Sounds like we've got a ourselves a #race @Statman_Jon. Who's going help us over the finish line first to 2000 followers? ...", "Mon Apr 08 13:11:08 ": "@CathrynMoses I can see a beautiful post-thatcher union developing between the Royals and LFC. Spirit of Charles I and all that", "Sun Mar 10 22:40:46 ": "Got to use EVERYTHING in the fridge before I go away. http://t.co/bf2XbbJDAi", "Fri Mar 22 21:33:54 ": "“@LynsayTaffe: @jamescharlo #epic http://t.co/p7Ug2UF8rQ” &lt;&lt; ode to @GaryParkinson", "Tue Apr 02 16:06:54 ": "Cricket shoes. Now with LUNARDOMINATOR batting technology.  http://t.co/xcrvg0YubQ", "Thu Mar 07 08:41:31 ": "RT @AccidentalP: #accidentalPartridge RT @ThePaulDaniels: The tea is finished and the world has waited for me long enough here I go Twyf ...", "Mon Mar 25 17:18:47 ": "@spikesmag Well, as @usainbolt on Copacabana beach is taken I'll go for the @jarrowarrow on Whitley Bay promenade #streetmeet", "Thu Feb 28 17:02:46 ": "Mind blown by the scientists who can work out so much from so little http://t.co/klYqjSOxkx", "Sat Mar 30 22:47:20 ": "Just been to see the v good This House, a play about the Labour whips office under Callaghan govt. #ballsohard", "Fri Mar 22 15:18:12 ": "RT @MayorofLondon: i am much quicker than you think - i once overhauled a guy who nicked my bike and he dropped it in terror .. #askbori ...", "Mon Mar 25 20:43:16 ": "William Hague in Africa looking every inch the English gentleman. Navy suit, Jolie in tow, sunburnt head, shaking hands.", "Fri Mar 01 10:09:52 ": "Something for the browser: @Euro_Indoors live stream on the beeb http://t.co/vuu5ZfjU28", "Tue Mar 19 17:27:20 ": "\"As a baby, Ashton Eaton was fired from his doomed home planet. Landing on Earth, he developed super-powers\" http://t.co/ohq8Rjjr2c", "Wed Apr 10 21:48:03 ": "RT @HadleyFreeman: http://t.co/dsAu1pZmOT MT @mrianleslie \"Carol showed me her mother’s autobio: 'Love from Mum' followed in  brackets b ...", "Mon Apr 08 15:19:24 ": "you're wrong for saying they're wrong about saying anything. Interesting &gt;&gt; MT “@GuardianUS: Thatcher death etiquette http://t.co/sTjZxIH1Lv", "Thu Apr 18 10:31:12 ": "BBC has curated the best of yesterday's Thatcher supporter/protester tweets. This is my favourite http://t.co/hjz3hfdsh8", "Sat Mar 09 15:38:00 ": "A gig's a gig #liveinthethames http://t.co/6s8tLZU0uW", "Wed Feb 27 20:42:41 ": "You could serve two for under a tenner as well, if you don't need your chorizo to be in a box and posh-looking #paella", "Sat Apr 13 09:15:11 ": "@MilkChase @glewis_88 at least I am consistent in bringing bad luck", "Tue Apr 02 14:19:15 ": "@spikesmag love the Valery Brumel / John Thomas high jump #frival. Impossibly retro YouTube of them competing in 60s: http://t.co/afhvtwZwxE", "Wed Mar 20 09:56:34 ": "Bill Hill offering 5/1 on Boris being next Tory leader. Worth a punt IMHO (via @sharpeangle)", "Sun Apr 07 14:43:51 ": "@RorySmithTimes great goal and plenty of superfluous diving around. Couldn't have asked for anything more", "Wed Apr 17 21:46:00 ": "Read from @margarethodge's committee that NHS has £15bn bill for negligence claims. Then see this ad on NHS leaflet http://t.co/yjXXQlnHjI", "Tue Mar 05 14:55:37 ": "RT @spikesmag: One of the SPIKES team is called James Charlton. Who thinks he should have his own athletics column \"Charlton's Athletics ...", "Fri Mar 29 11:57:55 ": "RT @ECONOMISTHULK: HULK RECENTLY DISCOVER ARGUMENT FOR PIGOUVIAN TAXES UNDERMINED BY EXISTING FACTOR TAXES. TAX-INTERACTION EFFECTS MAKE ...", "Sun Mar 10 22:45:33 ": "Haven't packed but I've made a tasty dressing", "Tue Feb 26 11:40:27 ": "@Matthew_McEvoy cheers. will also do ten press-ups and stick on some tight lycra under armour. #modeltips", "Thu Apr 18 12:51:07 ": "RT @david_conn: Anne Williams death illustrates the double tragedy of Hillsborough: she lost her son Kevin, 15, then 24 years fighting f ...", "Tue Mar 05 21:42:25 ": "Amazing night for football. Halifax beat Hinckley 7-0 in the 6th division. And I bet they shook hands afterwards.", "Fri Apr 12 11:39:08 ": "@david_conn tweeting about what seem like illegal job ads by premiership clubs. Govt really needs to get a grip on minimum wage dodgers", "Fri Mar 22 10:09:10 ": "In honour of @antgaughan's heroics on Sunday, here is a lovely compilation of goals from goalkeepers http://t.co/yhNkCKu3mI", "Fri Mar 22 13:40:23 ": "Is Drake a parody? It's quite hard to work it out http://t.co/FVJXSacohV", "Thu Apr 11 17:29:13 ": "RT @chrishoy: Geoff the photographer forgot to tell me to smile... http://t.co/tiia3uCvZf", "Sat Apr 13 16:18:13 ": "RT @SimmiJuss: @jamescharlo #JFT96 #LFC http://t.co/8mD8ec67Rs", "Wed Feb 27 21:58:56 ": "Really like this Johnny Kingdom guy on beeb4. Worth an iplayering if you've got the time. JK on bear: \"Look at them feet\"", "Mon Apr 08 12:00:32 ": "Tears in the home counties / Cheers in much of the north. #Thatcher unique in the way she's lionised and despised.", "Wed Feb 27 12:41:13 ": "RT @spikesmag: QUICK QUIZ. Is the pic below 1964 Olympic high jump champ Valery Brumel, or Hollywood actor @ChristianSlate4? http://t.co ...", "Mon Feb 25 20:55:22 ": "RT @UmbertoBacchi: “To give back the country to Berlusconi for another six to\n12 months is a crime against the Galaxy,\" #Grillo #ItalyVote", "Thu Mar 28 21:37:35 ": "RT @MilkChase: Just a reminder @nikkiwicks and @jamescharlo Spikes Russia is DONE! #happyeaster", "Sat Mar 23 14:00:27 ": "Enjoying me a lovely @stephenfry peppermint cream and thinking: what a brilliant non-nestle alternative to after eights. #pippatips", "Wed Feb 27 14:35:04 ": "Either me or @TomBage once blurted out \"GOOD AFTERNOON TRANSPORT SECRETARY\" at Andrew Adonis in St James' Park.", "Mon Mar 25 22:52:30 ": "@jezzalee is it as terrible as it sounds?", "Wed Apr 10 09:47:13 ": "@EwanGaffney Las Malvinas son Argentinas. How are you?", "Mon Apr 15 10:38:33 ": "Good news! Minumum wage set to rise by 12p per hour &gt; http://t.co/ohXfVBruto Bad news! It isn't being enforced.", "Mon Feb 25 13:03:08 ": "Really hope John Kerry walks into the foreign office and gives it one of these http://t.co/LZxE6wLGUJ", "Tue Mar 26 10:28:11 ": "Gareth Bale signs for... BT http://t.co/gjPdTOhupp", "Mon Mar 18 16:36:12 ": "RT @spikesmag: Giant #judo champion Teddy Riner: \"Celine Dion puts me in the zone\" http://t.co/Ifv6oC2PoL #music #inthezone #celinedion", "Fri Mar 22 09:38:17 ": "Much like tonal dressing, naked protests are very much in this spring/summer. Interesting stuff from @KiraCochrane http://t.co/N7ZdSshQZi", "Thu Apr 18 13:59:17 ": "Just found out that the ad I tweeted last night would be only for non-NHS claims. Good example of why it's best never to tweet anything ever", "Sat Mar 09 22:22:35 ": "Russell Brand: My life without drugs\nhttp://t.co/nrL9cXcgRE\nvia @guardian", "Fri Mar 08 13:50:04 ": "The cheeky girls on Romanian immigration. Why not? http://t.co/Q2pvPV71oA", "Thu Apr 11 10:09:39 ": "@Vitu_E @Joe6725 It's as if any of us know what we're talking about.", "Fri Mar 29 13:25:16 ": "Radwanska wonder shot | http://t.co/lHqTNIsbUU", "Mon Feb 25 18:11:46 ": "Follow @UmbertoBacchi for all the latest Italian election news... #Italy #elezioni2013", "Tue Feb 26 11:37:28 ": "@LarsB84 You: http://t.co/8N1umaLSqe", "Wed Mar 06 13:31:31 ": "RT @Vitu_E: \"Get the ukelele...\" @Joe6725 https://t.co/W9JkoRt22L", "Mon Mar 25 22:11:21 ": "Ian Bell is 18* from 123. Outstanding #spiritofjoburg", "Mon Apr 08 12:42:04 ": "Reading away on sat gonna be a bit spicy", "Thu Mar 07 08:53:53 ": "It was almost as if he was checking the share index. Very controlled. \"Yep, and there's the arse\"", "Sat Apr 13 12:36:57 ": "Banner for the game today #LFC http://t.co/as2vaTdWJe", "Wed Mar 06 11:21:10 ": "Jodie Williams is really nice and really fast and is here: http://t.co/dMeB5RiCIo", "Wed Feb 27 20:40:51 ": "Tip-top-tip alert. Just made this quick and brilliant paella recipe, here &gt;&gt; http://t.co/Ntij8U7yo0 http://t.co/GGsmfN2blf", "Mon Apr 01 19:19:02 ": "Got garlic hand I can't get rid of it | Tramp Attack - Garlic Hand http://t.co/xTsshB7vJx"}