{"Sun Nov 04 23:58:37 ": "RT @mydevotional_: When u Let Go and Let God then supernatural things will start to happen in your life (end)", "Mon Jan 14 23:46:44 ": "RT @JoyceMeyer: Don't be full of yourself. Instead, be full of God!", "Mon Oct 22 12:40:09 ": "RT @JoyceMeyer: Grace is the power of God coming to you at no cost to you, to do through you what you can’t do by yourself.", "Tue Jan 29 16:39:36 ": "Arigato yaa @erickheriyanto *hugs*", "Sun Dec 02 16:11:09 ": "RT @IndosiarID: 'RASA SAYANGE' @GlennFredly @dr_tompi cs #RumahMusikIndonesia #SaveLokananta @IndosiarID", "Sat Mar 09 00:19:24 ": "RT @GreatestQuotes: \"Not all of us can do great things. But we can do small things with great love.\" - Mother Teresa", "Tue Oct 02 05:57:48 ": "@Kris_lie @ghiangelica @augustprawira I'm wearing batik now :) lebih lengkap klo ada tas kerja dr @myluxo :)", "Mon Nov 05 12:25:13 ": "RT @ARBernard: Your mindset sets your expectations.", "Thu Mar 07 06:06:07 ": "@michaella_p @shellin_p @marisa_sasa @ripculz @siscasteph @mellisagopines @iwanchristiawan @celle_z belummm...", "Thu Apr 11 12:25:20 ": "RT @ARBernard: God's power is not limited by your present conditions.", "Thu Nov 15 14:10:56 ": "RT @ARBernard: Your background and circumstances may have influenced who you are but you are responsible for who you become.", "Tue Mar 12 21:57:01 ": "RT @ihatequotes: As long as you have God in your heart you can let your worries go. Worrying will not fix them.. just give them to God. :)", "Wed Dec 05 06:06:42 ": "RT @BishopJakes: God sees your tears! God sees your circumstances! God sees your situation! God sees your faith ... http://t.co/b5Lm1TW7", "Tue Oct 09 05:35:49 ": "RT @mydevotional_: Everyone should be quick to listen, slow to speak and slow to become angry @Kris_lie ☺", "Mon Nov 26 05:02:56 ": "RT @JoyceMeyer: When you have doubts and questions, choose to say \"Lord, I believe. I may not always understand, but I trust you.\"", "Wed Oct 17 13:13:00 ": "RT @ihatequotes: Respect is earned, honesty is appreciated, trust is gained, and loyalty is returned.", "Fri Feb 08 00:08:49 ": "RT @JoyceMeyer: If you don't have peace about what you're doing or the way you're behaving, then just don't do it.", "Wed Nov 07 13:44:52 ": "@EvelinMG_8 dateng aja... Kapan liburan sekolah?? ☺", "Thu Oct 11 16:48:57 ": "RT @ihatequotes: The most important things in your life are not money and good lifestyle, but honor, respect and love. @Kris_lie", "Fri Feb 08 01:06:32 ": "RT @ihatequotes: Ability may get you to the top, but it takes character to keep you there. #iHQ", "Tue Jan 15 13:08:42 ": "@YanitaChen bbm gw lagi error... Btw thank u, to telatttttt..... Lupa u yeeee", "Wed Nov 21 13:45:52 ": "RT @ARBernard: God's answers to our prayers won't always fit our expectations.", "Fri Nov 30 11:03:35 ": "Good friends never say goodbye, they simply say \"see you soon\" @Kris_lie", "Sat Mar 09 00:17:38 ": "RT @BrianCHouston: God can put you in the good graces of kings and bring Favor from unexpected sources! Ezra9:9.", "Fri Mar 01 01:53:00 ": "RT @PakBondan: Ming de tou zi shi, zhi de xuan ze. The wise man choose the right investment.", "Mon Oct 01 15:51:37 ": "RT @ihatequotes: Sometimes people who want more than they can handle end up losing everything altogether. Greed ... http://t.co/OtsgEsni", "Thu Nov 15 15:02:49 ": "RT @ihatequotes: Laughter is the best medicine for stress. Laugh at yourself often. Find the humor in whatever situation you’re in.", "Fri Oct 19 07:10:01 ": "@marisa_sasa sunny sunny day in surabaya #puanasss di SMG gmn?? @siscasteph", "Tue Jan 22 14:54:49 ": "RT @ihatequotes: God will never give you a test you cannot pass. Have faith and believe, because everything happens for a reason.", "Sun Nov 04 15:02:53 ": "RT @ARBernard: If you believe God is good, then you will give Him a chance to bless your life.", "Sat Mar 02 14:39:43 ": "RT @ARBernard: He who does not love does not know God, for God is love. 1 John 4:8", "Sun Oct 14 09:04:31 ": "RT @AlviRadjagukguk: Pengaruh perkataan seseorg sgt ditentukan dr tempat yg kita berikan kpd org tsb di hati kita • @JoseCarol", "Fri Nov 02 00:09:54 ": "RT @JosephPrince: The Lord's favor is upon you. Expect to experience His protection, healing, restoration and wisdom today.", "Sun Feb 24 12:55:19 ": "RT @konghee: Often when we lose hope &amp; think this is the end, God smiles from above &amp; says, \"Relax, ... http://t.co/2pCiv5f3c9", "Mon Oct 08 02:15:16 ": "@erickheriyanto happy monday :) :)", "Tue Oct 09 14:22:13 ": "RT @AmandaAdriani: Dont start because it's easy. Start because it's worth trying. Dont stop because it's hard. ... http://t.co/UojynCyr", "Thu Jan 03 00:26:23 ": "Gut luck @YanitaChen, pray all the best for u *hugs*☺", "Wed Oct 17 00:04:58 ": "RT @JosephPrince: Good things happen to people who believe God loves them! Today, take time to meditate on how ... http://t.co/xvD5kGAs", "Sun Nov 25 16:27:08 ": "@Kris_lie it depends on our perspective rite .. ☺", "Wed Oct 24 13:08:33 ": "@Kris_lie it's seems... Ga nyampekah bbm gw??", "Wed Oct 10 13:27:30 ": "RT @JosephPrince: God wants you to know today that you are His beloved child, in whom He is well-pleased.", "Sat Mar 09 00:12:25 ": "RT @ihatequotes: The truth always has a way of finding itself no matter how many lies are told to try and cover it up.", "Sun Dec 02 23:33:49 ": "RT @mydevotional_: You have to train your heart, and train your mind to think positively, so that the things that ... http://t.co/D8ksDDTu", "Tue Nov 06 16:19:35 ": "RT @SidMohede: Love life. Enjoy this God-given gift of life and make the very best out of it. We only get one.", "Sat Dec 01 16:08:47 ": "RT @AdaDiskon: Dining at Tarragon Diskon 25% http://t.co/TPxjhyb0 cc: @Kris_lie ☺", "Tue Jan 08 09:53:44 ": "RT @arhambali: Great review of Luxo at @fashionesedaily cc @hanna_aryani @Kris_lie @ingeagustiningr ... http://t.co/7oLlLktt", "Fri Nov 30 11:50:20 ": "RT @ihatequotes: If you’re brave enough to say “goodbye,” life will always reward you with a new “hello.”", "Tue Oct 02 03:03:19 ": "@siswausman kak herman deep condolences for ur brother yaa... Yg tabah ya kak :)", "Sun Mar 03 06:16:47 ": "RT @Kris_lie: @SurabayaJobs : DiCARI Web devloper pengalamn min 1tahun. Mnguasai ... http://t.co/Azgoy8XiVg", "Tue Jan 15 15:53:54 ": "@YanitaChen @erickheriyanto kaliannnn dimaapkan.... Karena begitu besar cinta hanna pada kaliann :)", "Sat Dec 01 00:42:49 ": "RT @JosephPrince: God's blessings and provisions for us are based solely on His goodness and faithfulness, and not on our performance.", "Mon Jan 14 01:06:59 ": "@Anugrahwati thank u tante ☺♥", "Sun Nov 18 13:23:52 ": "RT @AlviRadjagukguk: For every precious future, it will cost us something. Pay the price! • @ricklgodwin", "Fri Oct 19 16:55:10 ": "RT@ihatequotes: Smile defeats pain. Forgiveness defeats bitterness. Trust defeats doubt. Commitment defeats boredom. Changes defeats failure", "Sun Dec 30 09:42:53 ": "@siscasteph @marisa_sasa kapan dulu???? Pas singapore great sale tha???", "Wed Nov 07 14:03:38 ": "@EvelinMG_8 yakkk blajar lah dulu.... Abis itu liburannn ke balii ...", "Wed Jan 02 16:03:04 ": "RT @ihatequotes: Dear God, help me to put aside the things that are breaking my heart, to pray about things that break yours.", "Mon Oct 22 00:07:28 ": "RT @MarkAConner: \"This is the day the Lord has made. We will rejoice and be glad in it.\" Psalm 118:24", "Sun Dec 02 13:49:37 ": "RT @ARBernard: Faith is being moved by a promise to prepare yourself for the unseen.", "Thu Oct 11 13:00:08 ": "RT @ricklgodwin: Forget what hurt you in the past, but never forget what it taught you!", "Sat Feb 16 00:19:13 ": "RT @JosephPrince: In your very area of weakness or failure, God’s grace will superabound to bring you strength and provision (Rom 5:20).", "Fri Mar 01 17:32:06 ": "RT @JoyceMeyer: Keep praying and watch God turn your mess into a miracle!", "Thu Nov 01 01:31:46 ": "RT @JoyceMeyer: God is working in your life right now. Just because what's going on right now doesn't feel good ... http://t.co/WM4BQ2VG", "Sun Feb 10 04:10:18 ": "Never ever judge other people ☺", "Mon Feb 25 07:45:14 ": "RT @AlviRadjagukguk: God believes in you, even before you believe in Him • @JeffreyRachmat", "Thu Nov 08 00:08:56 ": "RT @judahsmith: You can't have God without love anymore than you can have fire without heat!", "Wed Oct 10 13:52:53 ": "RT @iesjakarta: Your faith is not to help you avoid problems but to go through problems with stability.", "Sat Jan 19 12:15:47 ": "RT @ihatequotes: Life is full of challenges, but these challenges are only given to you because God knows your ... http://t.co/H2ZWEYnr", "Thu Jan 24 16:40:02 ": "RT @JoyceMeyer: Our problems are God's opportunities! (Romans 8:28)", "Fri Dec 07 00:18:46 ": "RT @konghee: You never know how strong you are until being strong is the only choice you have ~ Unknown", "Tue Oct 30 14:26:15 ": "RT @ihatequotes: Don’t live a life full of plans. Sometimes the best moments happen unplanned &amp; the ... http://t.co/feomFr02", "Wed Oct 03 13:58:28 ": "RT @hchannacarol: LOVE is when you choose to forgive, regardless...  http://t.co/eALFogvK", "Mon Oct 08 16:25:32 ": "RT @drdavemartin: Don't let your financial net worth determine your self worth. Your finances are easy to turn ... http://t.co/XLLHXyJ3", "Wed Feb 20 00:09:58 ": "Selamat pagi @erickheriyanto ☺", "Tue Jan 15 15:14:27 ": "@erickheriyanto ga ada telp masuk.... Booonggg...", "Sun Nov 04 15:30:11 ": "RT @SidMohede: Yes, your talents, charisma, abilities &amp; anointing can take you to the top, but only your character can keep you there.", "Fri Nov 30 01:01:27 ": "This is it.... Finally... @Kris_lie ☺", "Tue Oct 09 03:01:16 ": "@Kris_lie enough is enough... But must have a big dream too ☺", "Mon Oct 22 00:48:39 ": "RT @ihatequotes: Be brave. Remember that bravery is not the lack of fear but the ability to move forward in spite of fear.", "Fri Oct 19 00:06:56 ": "RT @RickWarren: To get ahead you must get started! \"If you wait for perfect conditions,you'll never get anything done.\" Eccl.11:4 (NLT)", "Wed Mar 13 03:22:16 ": "RT @glollys: Happy bday koko @yudaf ;)", "Sun Oct 21 16:49:33 ": "RT @ihatequotes: Life doesn't change, but people do. So learn to accept that not everybody is who you once knew.", "Thu Oct 11 16:47:23 ": "RT @mydevotional_: Sumtime during our trouble, we struggle a lot to get out, but we found ourselves sink deeper ... http://t.co/aPzOF51P", "Mon Oct 08 15:15:36 ": "RT @drdavemartin: Don't let your financial net worth determine your self worth. Your finances are easy to turn ... http://t.co/2aNh84zL", "Sun Oct 14 15:37:00 ": "@Kris_lie gantian ya lemot nya #bb", "Tue Oct 02 06:13:29 ": "RT @myluxo: Selamat Hari Batik Nasional. Wear Luxo, Be Proud! Please RT. @Kris_lie @ghiangelica @augustprawira ... http://t.co/RCQyW0OR", "Tue Jan 15 15:13:59 ": "@erickheriyanto ga terima..... Huh... Pokoknya hanna dilupakan....", "Mon Oct 01 10:49:15 ": "RT @ihatequotes: Being blessed to see another day and year and having so many people that I love, love me back, ... http://t.co/R4RznAbm", "Fri Nov 02 00:07:27 ": "Dmn?? RT @erickheriyanto: Please help me lord with this psycho test!", "Mon Oct 01 10:51:42 ": "RT @JeffreyRachmat: The beauty of life is about finding new things (ideas). That's why life is hard to those who ... http://t.co/eiiiASAc", "Wed Jan 23 13:06:03 ": "@Kris_lie one more rule \"more shopping\" #happiness ☺☺☺", "Mon Oct 29 01:39:57 ": "Pagi mr. @erickheriyanto, what happen ama bb u??", "Wed Oct 03 13:49:56 ": "RT @JoyceMeyer: If you feel that you have made mistakes and missed the best life that God had for you, remember: ... http://t.co/OjhymJFa", "Tue Oct 09 12:50:30 ": "RT @iesjakarta: Some people are always greedy for more, but the godly love to give! -Proverbs 21:26", "Tue Oct 09 01:48:20 ": "@Kris_lie its all about money or its all about GOD ??", "Tue Jan 15 15:06:47 ": "@YanitaChen huhuhuhuhu teganya dirimu.. Sama kaya @erickheriyanto ...", "Thu Feb 14 01:51:52 ": "@marisa_sasa @erickheriyanto @YanitaChen grouphug... Happy val's day..", "Mon Nov 05 11:16:26 ": "@sayadavid en @reynaldylie congratzzz yaa ☺ kapan @dsoeryon en @arhambali menyusul?", "Thu Oct 25 04:56:43 ": "@Kris_lie congratz ...☺", "Thu Nov 08 00:02:18 ": "RT @mydevotional_: God is in complete control. So be a prisoner of hope. Get up each day expecting His favor~joel osteen", "Sat Mar 16 09:58:05 ": "@siscasteph @marisa_sasa pulkam yooo??? Pgen jalan2.."}