{"Tue Sep 25 06:39:24 ": "@augiesays congrats on the new job man..", "Tue Sep 04 01:15:04 ": "RT @NotCommonFacts: Being able to instantly respond with sarcasm within seconds of a stupid question is a sign of a healthy brain.", "Sat Dec 01 20:45:15 ": "@Isa909 completely agree.. I think we can pull it off.. We have a tough group but I'm confident we can get a good result in each game", "Thu Sep 27 04:37:36 ": "“@OhWonka: What does the NFL and brokeback mountain have in common? The cowboys suck\u0085”lmao!!", "Tue Dec 11 02:32:30 ": "RT @TheRealMattKemp: Welcome 2 LA!!! RT @Dodgers: Zack Greinke, 2009 American League Cy Young Award, will wear No. 21.", "Sat Dec 01 20:04:24 ": "@Isa909 how do you like our chances in our group??", "Wed Oct 31 05:12:11 ": "Please... #firemikebrown", "Sat Jun 30 05:26:47 ": "@lexiieelove03 don't worry.. Not just you.. Mine isn't either.. Thought it was just my phone", "Wed Aug 29 03:11:46 ": "@Brookieee_24 yeah.. I agree", "Sat Feb 09 18:59:13 ": "RT @CH14_: “@iFrasesCitas: En la vida no hay premios ni castigos, sino consecuencias. (Robert Green Ingersoll)”", "Sun Jul 01 19:21:23 ": "@KiMBUHHH kimbo the EUROCUP is on!!", "Fri Sep 28 03:28:17 ": "@erriikaahh how I met your mother??", "Sun Jun 24 19:15:28 ": "@Isa909 who else wants to go??", "Fri Sep 21 04:14:03 ": "“@FunnyFacts: 96% people at some point in their life have tried to close the fridge slowly to see when the light goes out.”I have done this", "Fri Sep 14 05:22:13 ": "@Dodgers if you're not going to do your job then get out and let players who want to play have a chance..", "Sun Jun 24 18:43:28 ": "Its cool that the English love their queen.. But dedicating your national anthem to her???", "Tue Jan 29 08:24:28 ": "@erriikaahh échate un pedo", "Sun Oct 21 21:04:57 ": "RT @lawrencetimmons: Need this W tonight...Let's go!!!", "Sat Nov 10 02:21:06 ": "@ochocinco I challenge you to old school FIFA...foosball!!!! I can't be beat!!", "Sun Jun 17 00:34:57 ": "@z_yvette still working but thinking of what to do tonight already!! Haha", "Sun Jun 24 18:33:23 ": "@Isa909 Italy will win this game but Germany has euro 2012 in the bag!!!!", "Tue Oct 16 19:06:55 ": "@swish41 are you watching?? Your team is scary good!!! 2-0 already not even 20 mins in!!!", "Fri Sep 14 05:22:50 ": "@Dodgers pathetic", "Wed Aug 29 03:08:11 ": "@Brookieee_24 what did they do??", "Wed Jul 11 22:58:58 ": "RT @Lakers: Nash on why jersey #10. \"I'm a huge soccer fan. My 1st word was goal. #10 is the number of play makers in soccer. It's as si ...", "Sun Feb 24 00:36:23 ": "@Isa909 ok thank you!! :)", "Thu Nov 15 04:53:25 ": "@z_yvette lol lets do it!! I love wings and beer!!", "Mon Oct 29 04:05:19 ": "Fuck you San Francisco..", "Thu Mar 14 06:15:31 ": "Congratulations @dahntay1 .. Finally someone from outside Atlanta will know who you are ... #dirtyplayer", "Sun Jun 17 00:28:22 ": "RT @shesbubba: I do some shit just to say \"I did that\"", "Tue Dec 04 22:50:38 ": "RT @cuauhtemocb10: Mi mas profundo y sentido pésame y apoyo a la familia de Miguel Calero QEPD", "Sat Dec 01 19:41:40 ": "“@itsWillyFerrell: \"Coke please.\" \n\"Is Pepsi ok?\" \n\"Is Monopoly money ok?\"”fuck pepsi", "Sun Jun 17 18:48:33 ": "@erriikaahh yeah!!! Go Germany!!!", "Sat Nov 10 02:14:52 ": "“@ochocinco: That'll be another victory for me in Fifa... out of millions of followers I can't get 1 worthy opponent...”haven't met me yet..", "Sun Jun 17 19:08:53 ": "Lukas Podolski!!!!!", "Mon Feb 11 05:24:24 ": "@erriikaahh  hahaha read below!! http://t.co/Eh2ttKod", "Tue Sep 25 06:16:36 ": "Replacement refs have made twitter and interesting place to be #RogerGoodellSucks #refs", "Sun Feb 24 00:05:55 ": "@Isa909 Isabel did you hear.. Mexico's opening game for the gold cup will be at Rose Bowl!!!", "Thu Nov 15 06:12:32 ": "“@erriikaahh: Lol @Edgar417 http://t.co/FuDte8bp” lol cute kid huh??", "Fri Jul 13 07:28:22 ": "RT @iRockaBoy: Can't Even Voice An Opinion Anymore. It's Crazy How \"Honesty\" Became \"Hating\".", "Sat Nov 10 02:14:13 ": "@lexiieelove03 me too!!!!", "Wed Nov 14 06:12:18 ": "@z_yvette lol I've been here!! And nope.. Todavia no.. Pensaba que la casada eras tu!! Lol", "Tue Dec 11 02:32:10 ": "RT @cuauhtemocb10: Muchas felicidades a Juan Manuel Márquez (@jmmarquez_1) por su triunfo y la gran pelea del sábado!", "Sun Oct 07 01:01:08 ": "RT @OverlyManlyMann: Vegetarian? You mean the Indian word for bad hunter?", "Sun Jun 17 00:47:35 ": "@z_yvette lol lets do this!!! I'll hit you up when I'm off work..", "Sun Jun 24 18:37:57 ": "@Isa909 I can't wait for next Sunday.. Should be amazing!!", "Wed Nov 07 06:08:04 ": "RT @BarackObama: Four more years. http://t.co/bAJE6Vom", "Tue Oct 16 19:07:45 ": "Germany is scary good!!!", "Sun Nov 25 20:00:47 ": "RT @Isa909: Life makes sense again, America is eliminated! #byebyeAguilas #liguilla #playoffs", "Sat Feb 09 18:59:29 ": "RT @WhatTheFFacts: In Germany, attempting to escape from the prison is completely legal -- Getting yourself free is considered a basic h ...", "Fri Sep 28 03:31:19 ": "@shesbubba haha take another shot and get your whole body dance!!", "Sun Jun 17 00:28:40 ": "@z_yvette what are you doing???", "Sun Jun 17 00:38:25 ": "@z_yvette me too!! Do you have any plans??", "Thu Sep 20 23:15:03 ": "RT @itsWillyFerrell: So if a red head guy works at a bakery, does mean he's a ginger bread man?", "Tue Jun 19 07:51:49 ": "RT @MadeaSimmons_: I'm only comfortable pooping in my own toilet.", "Wed Nov 07 06:06:10 ": "RT @MikeTyson: Congrats to President Obama for a 2nd term.", "Thu Nov 15 05:17:11 ": "@tiinaxoxo lol hope to see you in the playoffs... :)", "Sat Jun 30 01:04:55 ": "I am craving enchiladas sooo damn bad!!", "Thu Aug 02 06:00:06 ": "“@erriikaahh: i love music in Spanish, it has so much more meaning to it :)”completely agree", "Sat Dec 01 19:41:27 ": "RT @itsWillyFerrell: \"Coke please.\" \n\"Is Pepsi ok?\" \n\"Is Monopoly money ok?\"", "Thu Apr 18 05:28:32 ": "RT @MaurkicePouncey: Lets go LAKERS!! #7thseed", "Sat Dec 01 19:42:25 ": "@NFLJesus the games must go on!!", "Thu Feb 07 04:44:36 ": "👊💢👊💢👊💢👊💢👊💢👊💢👊💢👊💢👊💢👊💢👊💢👊💢", "Thu Oct 18 06:13:46 ": "@erriikaahh lol talking to yourself again??", "Fri Jun 22 02:53:30 ": "“@FillWerrell: If LeBron wins a ring then 2012 is real.”lmao", "Sun Jun 17 00:43:28 ": "@z_yvette lol lets drink!! I'm feeling a michelada tonight!!", "Thu Nov 15 05:25:16 ": "@z_yvette really ok?? A day we don't have to worry bout waking up early the ext day..", "Tue Dec 04 22:50:08 ": "RT @CH14_: Me uno a la pena que embarga a la familia Calero y a todos sus seres queridos, les deseo pronta resignación. QEPD Miguel Calero.", "Mon Jun 18 01:32:26 ": "RT @shesbubba: I'm the friend in the crew that's like \"fuck it, lets do it\"", "Mon Nov 26 19:02:05 ": "RT @OhWonka: I feel bad for kids nowadays who see a toy on TV they want, but have no way of getting, cuz their parents have to be 18 or  ...", "Sun Jun 24 18:51:20 ": "@Isa909 yeah.. Can't wait to sing the national anthem with 100,000 ppl cuz the rose bowl crowd dissapointed in that aspect..", "Sat Dec 01 20:02:22 ": "RT @DiamondPolished: What y'all gotta be fighting for when I'm drunk, bitch don't kill my vibe", "Tue Jun 26 03:47:02 ": "“@FunnyFacts: It's estimated that at any given time 7% of the worlds population is drunk.”5% chance i Know them.. Haha", "Sun Jun 17 19:07:33 ": "“@swish41: Poldiiiiiii”100th cap with a goal!!", "Sun Feb 24 00:23:44 ": "@Isa909 I'm down too!! I hope it's against El Salvador", "Tue Sep 25 06:41:34 ": "RT @TJLang70: Fuck it NFL.. Fine me and use the money to pay the regular refs.", "Sat Jun 30 01:07:04 ": "@ochocinco I've been craving enchiladas all day!! You down??!!", "Wed Jul 11 01:33:45 ": "RT @TheRealMattKemp: First player 2 ever tweet during the 2012 #ASG!!! This experience is incredible!! Have fun watching the game. Go #NL", "Sun Oct 21 21:04:52 ": "RT @LaMarrWoodley: Sorry 2 hear the ravens lost lol  that doesnt matter tho bc WE control our own destiny...  lets get this W steeler na ...", "Tue Jun 26 02:52:16 ": "@Dodgers  please trade Juan Uribe!!!!\n#DefeatSF", "Fri Nov 02 23:15:28 ": "RT @SuperBowl: The Steelers and Giants have won 4 of the last 7 Super Bowls. They are the only teams to win multiple SBs over that perio ...", "Wed Oct 17 01:42:37 ": "Get de nigris out!!!", "Sun Jun 17 20:24:07 ": "RT @erriikaahh: pinche laura!!!", "Tue Nov 06 05:08:47 ": "RT @FillWerrell: Retweet for #Obama2012 favorite for #Romney2012 . \n\nLets see who wins!!!", "Thu Nov 15 04:52:10 ": "“@tiinaxoxo: El America solo a perdido uno d los ultimos 12 partidos k ah jugado :)”y fue contra las chivas!!!!", "Sun Jun 24 19:27:45 ": "@Isa909 lol Jenny is going to get murdered if she decides to wear red white and blue.. I suggest you get her ticket on a different section", "Sun Jun 24 18:46:13 ": "@Isa909 I did!! I really want to go!! Mexico vs USA at azteca is on my bucket list!!", "Wed Jul 11 13:50:14 ": "@MrCheckpoint motorcycle cop with speed gun parked at lambert and puente in brea, ca", "Tue Jan 01 23:51:27 ": "@UnIuckyBrian lmfao!!!!!!!", "Mon Aug 06 17:16:48 ": "RT @NotCommonFacts: First-borns are most likely to have the highest IQ's of all children.", "Sun Oct 28 01:30:55 ": "Did that Detroit tiger have one blue eye and one brown eye??!!", "Fri Sep 28 04:43:10 ": "@erriikaahh she ugly though :/", "Sun Nov 25 20:01:13 ": "Goodbye America!! You're eliminated!!!!!! Hahahhahhhahhahahahah", "Thu Oct 18 06:16:26 ": "@erriikaahh lol oh I see... Carry on then :)", "Sun Jun 17 18:59:06 ": "@erriikaahh smh just say go Germany!! And you like Bastian sweinsteiger , Lukas Podolski, Phillip lahm and Mario gomez", "Mon Nov 12 22:26:01 ": "“@z_yvette: Take you down  ”love this song!!", "Mon Oct 22 03:05:20 ": "#SteelersGamedayPlus #Steelers lets go steelers one more quarter!!", "Wed Dec 26 03:39:31 ": "“@SexFactsOfLife: African-Americans and Hispanics have sex before going to bed more frequently than whites and Asians do.” Not surprised lol", "Sun Jun 24 18:42:54 ": "@Isa909 I seriously do too!! At least  copa America level!!!", "Sun Nov 04 00:06:16 ": "Wow.. It's called #defense Trojans.. You might want to play some"}