{"Thu Jul 21 16:32:23 ": "[Scienze] Le biocose e i biocosi: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/q81hOB", "Fri Jul 23 14:00:20 ": "Oggi alle 17.16, la parola segreta: La parola segreta. Oggi alle 17.16, a 3MSC, verrà detta una parola segreta, ch... http://bit.ly/aNz4o0", "Tue Sep 06 16:46:08 ": "[Geografia & Storia] Haiti: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/WSKnS8v", "Thu Jul 21 12:46:31 ": "Il fatto quotidiano. The great robbery train: Share on Facebook http://bit.ly/rjwFUd", "Tue Jul 13 13:01:00 ": "oggi si parla di tattica, strategia, abnegazione. Waterloo, caporetto, la battaglia di Yorktown e se ci sta l'invincibile armada", "Mon Jul 18 16:59:21 ": "[Scienze sociali] Laicità e religione: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/n0AaP0", "Fri Sep 23 16:46:49 ": "[Niente] Il lungo addio: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/MzUzF3Nn", "Fri Jul 29 16:20:50 ": "[Lettere] Di Erodoto, delfini e anelli magici: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare... http://bit.ly/pyQojh", "Mon Aug 29 12:29:34 ": "I vecchi podcast: Prima di tutto ricordatevi che tutti i podcast di tutte le puntate di questa stagione, più un ... http://t.co/5SSW54R", "Mon Jul 11 16:12:42 ": "Il fiume Congo con Raffaele Masto: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/plbnBJ", "Mon Jul 25 16:45:35 ": "[Scienze] Meloni e dintorni: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/qzjwec", "Fri Jul 22 16:38:22 ": "[Lettere] L’odissea della mitologia: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/n1cOQ6", "Fri Sep 16 16:33:25 ": "[Storia] Il topo col formaggio che fa?: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/hgKFPfhS", "Wed Jul 14 15:03:20 ": "Siamo troppo in onda", "Wed Jul 21 13:08:35 ": "Leopoldo II, il Congo e la Torre Velasca: Grosso modo questi gli argomenti del giorno, se poi volete fare domande ... http://bit.ly/d1MVyb", "Wed Jul 14 16:10:20 ": "@moltogatto ok, capito che bio, aggiornata", "Wed Jul 20 16:22:01 ": "[Storia] L’alto medioevo: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/q8Ks0b", "Tue Jul 20 08:44:02 ": "L’incredibile rompicapo di 3MSC: \nStudia le immagini, disponile nel modo corretto, individua le parole chiave e sc... http://bit.ly/bKKx3i", "Thu Jul 22 09:33:44 ": "Il complicato enigma di 3msc: \nFRASE 13, 3, 12\nScopri l’argomento del giorno di 3MSC risolvendo il sensazionale re... http://bit.ly/aigB1G", "Wed Jul 13 16:28:35 ": "[Lettere & Storia] Archiloco, i suoi scritti, Esiodo e Semonide: Se non ci avete ascoltati ci potete ascoltare. ... http://bit.ly/q4fn5A", "Mon Sep 05 16:35:22 ": "[Lettere] Il Goldoni: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/zmXV3HS", "Mon Sep 06 16:15:45 ": "Il podcast: Chi non c’era, in diretta, si può ascoltare il podcast. Che per lui è come la diretta, non cambia molt... http://bit.ly/cfgkS0", "Wed Jun 29 13:04:35 ": "signori,rieccoci!Tre Metri Sopra il Cepu torna in sella,dall'11luglio.Come sempre cerchiamo docenti da portare in onda tre@radiopopolare.it", "Wed Jun 29 13:03:19 ": "@lalbertini grazie!! ;)", "Tue Jul 12 10:55:03 ": "Il Fatto Quotidiano: Share on Facebook http://bit.ly/p6S1sG", "Fri Aug 05 16:33:40 ": "[Geografia] La Namibia: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/otzPxm", "Thu Sep 22 17:01:41 ": "[Storia] Medioevo, the end!: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/IfNsBBEQ", "Thu Jul 14 09:18:20 ": "Il Fatto Quotidiano: La Guerra del Calcio 14 luglio 1969: Share on Facebook http://bit.ly/p3nP6P", "Wed Aug 04 10:46:48 ": "Oggi a 3msc: Niente, nel senso che non ci siamo e torniamo domani. \nShare on Facebook http://bit.ly/btmwvK", "Mon Jul 12 16:12:21 ": "grazie grazie a tutti i follower che followano in questa nuova sfavillante stagione di 3msc, ricordatevi che c'è pure il podcast", "Mon Jul 19 14:45:06 ": "il Cajelli è qui, se volete fare domande su sceneggiatura, fumetti e tutto ciò di cui si parlerà tra una decina di minuti, iniziate a fare", "Fri Jul 23 10:21:18 ": "Un’altra buona ragione per arrovellarsi: \nShare on Facebook http://bit.ly/9xqBvB", "Mon Sep 06 14:54:17 ": "Tra pochi minuti 3msc, il ritorno: Dopo un mese di studio e pianificazione, torna 3msc in grande spolvero per il s... http://bit.ly/decYhp", "Mon Jul 11 09:45:49 ": "Il fatto quotidiano: Da oggi, ogni giorno, io e il collega Jam vi delizieremo con racconti di cose accadute nel ... http://bit.ly/qYD432", "Thu Jul 07 08:11:01 ": "Oggi registriamo: Pazzesco, oggi registriamo la ventunesima puntata che in realtà, dato che la registriamo oggi,... http://bit.ly/qWMSes", "Tue Jul 19 13:00:12 ": "il podcast su iTunes: \nOk, ci stiamo arrivando, su iTunes dico. Intanto questa è la copertina del podcast, diseg... http://bit.ly/ouNqcL", "Tue Aug 02 16:38:51 ": "[Tecnologie] L’internett e le sue cose: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/nCXjad", "Wed Jul 28 13:24:49 ": "Probabilmente il rebus più pacco della storia: Ma d’altra parte fa caldo per tutti e non vogliamo impegnare troppo... http://bit.ly/ae8yAH", "Wed Jul 20 13:55:48 ": "Il fatto quotidiano. Il pisello odoroso: Share on Facebook http://bit.ly/oKenkm", "Wed Sep 15 13:50:07 ": "Per tutti i fulmini: Oggi a 3MSiC si parla di cose made in Olimpo, che vuol dire che si parla di mitologia greca. ... http://bit.ly/chQEM7", "Mon Sep 05 10:56:17 ": "Votaci ai Macchianera Blog Awards: Lo spot: Share on Facebook http://t.co/wRY0pno", "Fri Jul 16 16:13:23 ": "@moltogatto un po' sì ;)", "Mon Jul 12 16:10:53 ": "@moltogatto grazie!", "Wed Jul 14 14:11:51 ": "oggi a 3msc si parla di rivoluzioni antiche come il cucco", "Fri Sep 02 18:04:26 ": "@Lydya ti capisci eh, mica che non ti capisco, vedi te, poi al massimo ci si aggiusta, in qualche modo", "Tue Aug 03 11:21:53 ": "La nuova intrigante sfida. Peggio di quella di ieri.: \nShare on Facebook http://bit.ly/d63DO9", "Wed Sep 14 16:50:08 ": "[Scienze] The Masters of the Universe: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/Pj0V61J", "Thu Jul 28 16:41:23 ": "[Matematica] I matematici più sfigati della storia: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\n... http://bit.ly/oA8PlQ", "Thu Aug 05 09:55:16 ": "Oggi trasmissione di servizio a 3msc: Oggi si parla di medicina, nello specifico di medicina per le bestie, quindi... http://bit.ly/dzfncO", "Thu Sep 08 16:39:14 ": "[Educazione fisica] Quelli dello sport che loro sono buoni e gli altri no: Se non ci avete ascoltati ci potete a... http://t.co/89h0nKW", "Mon Sep 12 16:36:35 ": "[Scienze] La misura è 33: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/zFsSFGk", "Wed Sep 07 16:44:04 ": "[Lettere] Ce l’ho sulla punta della lingua: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on... http://t.co/Lj2ePIz", "Mon Jul 12 15:00:50 ": "ECCOCI!!!", "Tue Aug 30 16:43:56 ": "[Geografia] Cose sull’Africa: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/m32OO4T", "Wed Sep 21 16:38:21 ": "[Lettere e Storia] Il Capitano di Vascello Marzio torna ad essere Commissario: Se non ci avete ascoltati ci pote... http://t.co/iTLximC5", "Fri Jul 15 10:05:04 ": "Il Grande Concorso di 3MSC: Dato che vogliamo andare su iTunes, dato che serve una copertina per i Podcast, dato... http://bit.ly/q6RbZA", "Thu Aug 04 16:49:32 ": "[Storia] Medioevo e segreti segretissimi: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/qHgj1H", "Wed Aug 31 16:35:03 ": "[Agronomia] Meloni e pere: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/hJX0d8y", "Thu Jul 15 09:39:27 ": "oggi alla trasmissione cui appartiene questo account si parla di architettura, della Milano che sarà e di cesarismo", "Mon Jul 19 17:35:39 ": "Disegna anche tu la 3MSC-Mobile, la batmobile di Disma e Jam: Ha preso ufficialmente il via il più mitico contest ... http://bit.ly/cgBdY0", "Wed Jul 13 13:13:00 ": "Il Fatto Quotidiano: Simone Pianetti 13 luglio 1914: Share on Facebook http://bit.ly/p1ziHW", "Fri Sep 09 16:37:49 ": "[Storia dell'Arte] Brancusi spacchiusi: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/YHG4B2A", "Mon Jul 12 16:11:07 ": "@BigChuna :)", "Tue Jul 20 15:02:00 ": "Pronti a fare a botte con la matematica? In onda ora, su Radio Popolare.", "Tue Jul 19 16:45:37 ": "[Matematica] L’infinito: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/pfjxtO", "Mon Jul 19 15:32:08 ": "In onda! Chi c'è là fuori?", "Mon Aug 01 16:33:40 ": "[Scienze] Energia elettrica e cose del genere: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare... http://bit.ly/mSa0ug", "Wed Jul 21 14:45:51 ": "tra poco in onda, si parla di congo belga", "Wed Jul 27 16:32:13 ": "[Lettere] Archetipi narrativi: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/n3gPMa", "Wed Jul 21 07:03:55 ": "Oggi si parla di…: scopritelo con il consueto rompicapo.\n\nShare on Facebook http://bit.ly/9eAp7I", "Tue Sep 20 16:46:02 ": "[Commercialismi] Di pagare e prendere: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/MKNPb0D9", "Fri Sep 02 10:19:55 ": "Tre Metri Sopra il Cepu ai Macchianera Blog Awards: Ok, non lo sapevamo fino a due minuti fa, ma siamo nelle nom... http://t.co/p9D87xk", "Mon Jul 18 14:16:09 ": "Il fatto quotidiano. La batttaglia del fiume Allia 18 luglio 388a.c.: Share on Facebook http://bit.ly/q6SNUw", "Thu Jul 29 08:55:10 ": "Il rompicapo che non rompe solo quello: \n(cliccare per ingrandire)\nfrase 10, 1, 6, 9\nShare on Facebook http://bit.ly/9ago9Q", "Mon Aug 29 16:17:39 ": "[Chimica] Formule, composti e nomenclatura: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on... http://t.co/KIhocSZ", "Tue Sep 14 16:25:32 ": "Oggi si è parlato di milanese: Ne abbiamo parlato con Marino Zerbin. Sembra però che le genti continuino a non cap... http://bit.ly/drQUQe", "Thu Sep 15 16:42:41 ": "[Matematica] Ma se io faccio così e cosà poi cosa succede: Se non ci avete ascoltati ci potete ascoltare. Col po... http://t.co/Nw3Yems7", "Mon Jul 19 14:45:19 ": "mentelocale (nel senso figurato non della trasmissione)", "Mon Aug 01 12:46:34 ": "3MSC BLACK LIMITED EDITION #1 SOLO SU iTUNES: Ebbene sì, è arrivato il momento di buttare fuori la BLACK LIMITED... http://bit.ly/oWDFmi", "Thu Jul 14 16:40:41 ": "[Storia dell'Arte] il Gruppo T e l’arte cinetica: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nSh... http://bit.ly/oxd7Q9", "Wed Jun 29 13:05:13 ": "http://t.co/wI4aFyE per tutte le info sulla trasmissione", "Fri Jul 15 16:48:54 ": "[Scienze] Genetica e evoluzionismo: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/pYYObX", "Fri Sep 02 17:50:27 ": "votate Tre Metri Sopra il Cepu nella sezione podcast dei Macchianera Blog Awards. Siamo in nomination! http://t.co/Jw9Ez48", "Wed Jul 14 16:08:55 ": "@moltogatto che bio?", "Mon Jul 19 14:28:33 ": "se avete domande inerenti all'argomento del giorno, o per lo meno tangenti all'argomento del giorno fatele qui o su FB o allo 02.33.001.001", "Tue Sep 13 08:45:33 ": "[Architettura] La Maggiolina: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/rz1yuMd", "Wed Jul 14 16:14:37 ": "@ul_Fabius no no, il GR è in network", "Tue Jul 19 13:14:34 ": "il fatto quotidiano. Lo studente Giumbalumbabé: Share on Facebook http://bit.ly/pFBmDn", "Wed Aug 03 16:44:01 ": "[Matematica] Geometria e misteri: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/pD3nF2", "Mon Sep 19 16:33:55 ": "[Matematica] Orecchie da mercante: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://t.co/utl31elm", "Wed Jul 21 15:24:40 ": "CONGO! (si parla di)", "Wed Jun 29 12:05:20 ": "Tre Metri Sopra il Cepu is back: Amici, compagni, fratelli. E’ arrivata l’estate e con essa torna 3MSC. Fermi tu... http://bit.ly/mSq02A", "Fri Sep 02 16:31:44 ": "[Lettere] Di quando si va indietro per andare avanti: Se non ci avete ascoltati ci potete ascoltare. Col podcast... http://t.co/O1kAKUS", "Fri Sep 02 17:56:47 ": "@Lydya cazzo ho già pagato troppe persone, i fondi neri di 3msc sono terminati... magari sta volta fammi credito", "Tue Jul 12 16:36:17 ": "[Scienze] L’atomo e la sua storia: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/pOQAVx", "Fri Jul 16 14:53:08 ": "tra cinque minuti in onda, si parla di Caravaggio e di sesso", "Mon Aug 02 09:38:36 ": "Tre metri, la puntata segreta che non avete mai sentito: Ecco la puntata segreta del 23/7 che non avevo messo su p... http://bit.ly/duRMWy", "Mon Jul 12 16:12:38 ": "http://tremetri.radiopopolare.it", "Thu Jul 15 15:00:36 ": "Si parte. Si parte... ecco, siamo partiti.", "Mon Jul 12 16:11:26 ": "@26deJulio_ grazie Julio", "Wed Jul 27 12:05:56 ": "[Storia] Che succede dal ’45 in poi: Se non ci avete ascoltati ci potete ascoltare. Col podcast.\nShare on Facebook http://bit.ly/qvnuKd"}