{"Sat Jul 28 02:11:46 ": "@pinoymu23 dunno Doc..ders WBC&amp;RBC 4-7/hpf i think in my labresult last tue. :&lt;", "Sun Mar 10 01:55:02 ": "RT @disneywords: If you keep on believing, the dreams that you wish will come true. –Cinderella", "Sat Jul 28 10:52:40 ": "@nayPInay oo nga!!! mas excited ako sa BER-months! how are you? ;P", "Mon Feb 25 12:28:28 ": "@haeLEEchel till next tym again chel with more kwento pa!!! :) \nrt: had a great lunch with @prinsesa_emz", "Wed Dec 26 09:20:44 ": "RT @disneywords: Fly to who you are. Climb upon your star. You believe you'll find your wings. Fly to your heart. –Disney Fairies", "Sat Jul 28 08:38:49 ": "@minavillarroel hello po! :) Is there a link where i can watch the reply of this episode? thanks a lot! More power to SIR!!", "Sat Jul 28 08:33:54 ": "RT @ConeyReyes: \"God invites us to burden Him with what burdens us.\"", "Mon Feb 25 13:30:11 ": "'i'm waiting.......... just waiting...........\nwaiting.............waiting. . . . . . waiting...... outside the line\" #patientlywaiting", "Sun Aug 19 14:11:05 ": "Rock my world into the sunlight, make this dream the best I've ever known!\n#Domino by Jessie J ;)", "Sat Aug 18 11:53:02 ": "Good evening!", "Sun Aug 12 11:37:02 ": "\"hindi ko na sya crush!\" -- =)C", "Sat Jul 21 15:40:11 ": "#FarvoriteLinesInClass -- \"Uwian na!\" haha", "Sat Dec 29 01:40:50 ": "RT @JoelOsteen: God is fighting your battles, arranging things in your favor, making a way even when you don’t see a way.", "Sun Oct 14 06:30:55 ": "RT @JoelOsteen: God is directing every one of your steps. He has already lined up solutions to your problems.", "Fri Jan 25 16:52:49 ": "RT @GFORCE_OFFICIAL: G-FORCE PROJECT 2013 SUMMER DANCE WORKSHOP COMING SOON!!!", "Sun Jul 22 11:15:16 ": "@faithLeria I MISS YOU LERY GARCIA! &lt;3", "Sun Aug 12 05:08:28 ": "@Pinoymu23 Hello Doc! Ok naman po ako. ;) kamusta po kayo during rainy days?", "Sat Jul 21 11:19:58 ": "done cleaning my mail account yahoo!", "Mon Feb 25 13:33:07 ": "@HAnaPPYkim is this a work thingy pi? kamusta na? :)", "Sun Sep 02 09:22:26 ": "not yet ready for this coming week. i need more sleeeeepppp :)", "Sat Jul 28 10:56:45 ": "@nayPInay ;) ako not so good hehehe.. im feeling a bit pain in my body e ;&lt;", "Fri Dec 28 11:57:45 ": "2013 is around the corner.\nHappy New Year tweeps!", "Fri Jul 27 16:26:10 ": "@pinoymu23 Lo Doc! Im tking ciprofloxacin 500mg &amp; trying to drink more than 3L of water a day. My back waist is still painful..Is it normal?", "Sun Sep 16 11:58:00 ": "RT @GaryValenciano1: Come and worship Him as you are. Come into God's presence Jesus-conscious, forgiveness-conscious and grace-consciou ...", "Wed Jul 25 22:01:55 ": "I cast all my cares upon you Lord! Back to office work..  Bless Me. &lt;3", "Wed Jul 25 01:14:00 ": "RT @DavidRoads: You were born to win, although to be a winner, you must plan to win, prepare to win, &amp; expect to win.", "Sun Mar 10 02:34:06 ": "RT @RickWarren: Repeat 3 times aloud for stress relief: God is God and I'm not!\"", "Wed Aug 15 22:00:55 ": "RT @TIME: Why employees leave—and how to keep them | http://t.co/MfInHVWX (via @TIMEBusiness)", "Sun Sep 16 12:19:35 ": "@randelltiongson @wotinsay @fallenangeljone-- oh.. the ASPLI Convention Sir at Waterfront Hotel Cebu ds coming Thurs-Sat :)", "Sun Aug 12 11:13:09 ": "Embarrassing Moment : Kumaway ka sa taong, hindi naman ikaw ang kinakawayan! wahahaha :D @lhudamae -- haha! =)p kamusta na?", "Sat Jul 21 10:48:20 ": "@nayPInay wow real estate co ka pala! masaya ba? sa #Sony Life Insurance ako then navotas pa ko umuuwi haha!", "Sun Sep 02 09:21:32 ": "wondering why i'm thinking of this person lately.. -.-", "Fri Jan 25 17:21:25 ": "Going to sleep! It's already Saturday uh ohh..", "Sun Aug 19 14:57:34 ": "#Goodnight Sunday! -- 195th tweet ^^", "Sun Mar 10 03:20:20 ": "@shinishbeats spaghetti iiii :&lt;", "Sun Aug 12 11:11:54 ": "RT @ogiediaz: \"Hi, Ogie!\" -\"Hello po!\" sabi ko naman sa ale na nakasalubong ko sa elevator. Tapos, pagtalikod ko, \"Maliit pala talaga si ...", "Sun Aug 19 14:40:42 ": "RT @DailyMoveOn: Don't let a bad day make you feel that you have a bad life. Bad times will pass.", "Sat Jul 28 11:07:54 ": "@nayPInay back waist pain dahil sa uti ;P", "Wed Aug 15 22:15:17 ": "RT @RickWarren: Please pray for my longtime mentor Billy Graham, hospitalized today for bronchitis. He's 93.", "Sun Jul 22 09:34:35 ": "RT @ASAPOFFICIAL: Bukas na susugod ang mga paborito niyong ASAP stars as ASAP ATTACKS PUP Sta MAria Bulacan ng 4PM! Kitakits Kapamilyas! ...", "Sun Sep 16 10:20:04 ": "@Nananadjie: @prinsesa_emz Thankyou po sa concern ♥ Love you ate EMZ!! &lt;3 -- you're welcome my dear!! see you sa sunday pagaling k alryt &lt;3", "Wed Jul 25 01:09:53 ": "RT @GodPosts: People may be mean to you, steal your lover, try &amp; break your dreams, or ruin your day, but they will NEVER take away  ...", "Wed Jul 25 21:29:25 ": "@pinoymu23 Mornin Doc! I have UTI po e.. for 2days absent ako..", "Sun Jul 29 00:44:23 ": "RT @zsazsapadilla: Everyday, I cry a little... but I always try to laugh a little harder.", "Mon Aug 27 10:12:18 ": "“They say if you dream a thing more than once it’s sure to come true.” \n#Good evening.", "Sun Oct 14 06:26:59 ": "RT @disneywords: Why worry? If you’ve done the very best you can, worrying won’t make it any better. –Walt Disney", "Wed Aug 15 22:12:11 ": "RT @RickWarren: To grow GREAT FAITH 1) memorize the promises of God, 2) read biographies of people of God, 3) take risks for God.", "Sun Jul 29 00:37:38 ": "@pinoymu23 I'll take ur advice Doc thanks very much!!!:) i ws scheduled to hv an ultrasound ds coming wk.", "Sat Jul 28 11:58:38 ": "Someday il get married. :) @keancipriano--- Amen for you!!! ;)", "Sun Jul 22 06:28:10 ": "@ASAPOFFICIAL Supeeer the best #ASAPForAllSeason!!! Ms. Vi truly shines up to ds generation. kakainspire! :)", "Sun Sep 23 08:03:01 ": "RT @disneywords: Childishness? I think it's the equivalent of never losing your sense of humor. –Walt Disney", "Sat Jul 21 15:21:29 ": "I miss this! &lt;3 wen i was 7yrs old i wanted to become a princess mermaid like Ariel. :)\nhttp://t.co/keq5B0kx", "Sat Jul 21 15:43:00 ": "My God is a MIGHTY God! -- Truly!!! Amen. My Sunday is for you Lord :)", "Sun Sep 16 10:13:39 ": "RT @RickWarren: God reveals, but also conceals.Trust him when he doesnt tell you WHY. \"It's God's privilege to conceal things\" Prov.25:2", "Sat Jul 28 14:07:57 ": "RT @CauseWereGirls: Every morning I look in the mirror and I wonder if the world sees me the same way as I do.", "Sun Sep 16 10:08:20 ": "@Nananadjie yay..inom ka na agad ng gamot &amp; matulog maaga sweetie para di ka absent sa school bukas :p", "Sun Mar 10 02:37:41 ": "@EllieT0215 Following you back Ms. Ellie! :)", "Sun Sep 02 09:17:52 ": "Noisy environment! Pwede naman siguro magbday party ng tahimik. haha\n#KATAHIMIKAN", "Sun Jul 22 11:17:43 ": "\"Do the one thing you think you cannot do. Fail at it. Try again. Do better the second time\"- Oprah", "Sat Jul 28 10:45:19 ": "@nayPInay you're right! ... ;)", "Sat Jan 12 12:54:24 ": "I WANTED: NEW THINGS, NEW LEARNINGS, NEW WOOOOOORLD TO EXPLORE! #2013", "Sun Sep 16 10:23:33 ": "@Nananadjie hnd e, hnd ako nakaabot sa junior worship ;P aral ka bible ha sunday school festival sa sun ;))", "Sun Mar 10 02:50:29 ": "Demand me any kind of work except-- COOKING ://", "Sat Jul 21 15:14:35 ": "RT @randelltiongson: Generally speaking, there are two types of life insurance—term insurance and permanent insurance. Learn more at htt ...", "Sun Jul 22 09:23:26 ": "Gooood Morniiiiing!! Lamiiiiiiiiiiiggg!!", "Sun Jul 29 09:50:57 ": "@dost_pagasa Hello! It is safe to travel via RORO tomorrow-- travel would be from Aklan to Manila? Thank you in advance for ur answer!", "Fri Nov 30 06:26:48 ": "RT @JoelOsteen: Stay focused, ignore the distractions, and you will accomplish your goals much faster.", "Sun Sep 16 12:12:36 ": "@wotinsay @fallenangeljone Mama Bear &amp; Sistah follow Mr. @randelltiongson-one of d speaker po sa convention. He's very good &amp; inspiring :)p", "Sat Jul 28 11:13:08 ": "@nayPInay water therapy ska antibiotics.. kya ikaw u take care of urself drink plenty of water everyday ;D", "Sun Sep 16 11:19:16 ": "@acelvanommen hello po! last thurs ko lang nadiscover ur show s Light TV. I feel blessed &amp; inspired!! :) continue singing for God Ma'am! &lt;3", "Sun Sep 16 11:32:03 ": "\"The greatest being in the universe to complain to is God, there are reasons for our suffering that only God knows about. \"", "Wed Aug 15 22:23:50 ": "wash my transgressions and iniquities for i have sinned against you. -Psalm 51\n#Prayer4today", "Mon Jul 30 12:28:42 ": "meron akong GEGEwin.. di ko SASAbihin..\n=P", "Wed Jul 25 01:59:55 ": "@bevseybevsey oo hehe nilulunod ko nga sarili ko sa tubig. ikw dn wg mo pb2yaan water intake mo :&gt;", "Sun Aug 12 05:04:40 ": "It's Sunday! I feel revived! ;))", "Mon Jul 30 22:00:50 ": "RT @CauseWereGirls: Your relationship with GOD is more important than any thing because you know for sure thats a relationship that will ...", "Wed Jul 25 21:31:50 ": "@bevseybevsey for 2 days absent ako..got to go work na ulit today. Ingat bevs Good morning!", "Mon Aug 27 10:33:58 ": "hayy..time flies! already dark up high..", "Wed Dec 26 09:23:39 ": "RT @mjfelipe: Official MMFF results  - 1st day top 3. 1. Sisterakas - 39.2M. 2. Agimat - 29.5M 3. One More Try - 13.6M 4. Shake Rattle,  ...", "Sat Jul 21 10:43:27 ": "@nayPInay hehe! a talaga wat company mo? ako sa ayala makati medyo malayo lang from home ;P", "Sun Jul 22 11:02:39 ": "\"Follow your instincts. That's where true wisdom manifests itself.\" -Oprah", "Sun Sep 16 10:28:38 ": "@Nananadjie oks lang un.. kahit pala d n mag-aral keri mo lang yun f ano lang tinuro sa sunday sch ;D hihi", "Sat Jul 28 11:19:38 ": "@nayPInaya haha i'll follow ur advice!!! ;)) haha..", "Thu Jan 24 23:02:58 ": "RT @disneywords: People make mistakes. That's what life's about. The key is to learn from them. –Josie (Sky High)", "Fri Jan 25 16:46:12 ": "@mineshaha Dudes, tomorrow's our 30th Anniv issue, hope you all can grab a copy. Thanks. -- sure mommines!!!", "Sun Mar 10 03:14:44 ": "@shinishbeats hehehe! nautusan ako magluto sa bahay hindi ko pa nagagawa hoho! :P", "Sun Sep 23 10:02:31 ": "@BrianMcFadden @ShaneFilan @KianEganWL @nickybyrneoffic @MarkusFeehily - very glad have found your accounts!!! #AmForeverFan &lt;3", "Sun Aug 12 12:15:20 ": "My head is seriously spinning around! 0:\nEarly goodnight!", "Sun Sep 16 10:01:21 ": "@Nananadjie why worry na hindi ka makakapasok bukas dear? :)", "Sun Sep 16 10:43:37 ": "@Nananadjie early goodnight sweetie! God Bless!", "Wed Aug 08 23:34:37 ": "@abeansmarcial ewn ko sau HaHa! Bumenta sau tong post ko pareho ka ngcomment s fb/twitter e noh! prng d tau mgksma.. &lt;3", "Sun Jan 13 01:20:10 ": "@asapofficial i'll definitely tune in to ASAP today ng bonggang bongaaaaaang! #ASAPBonnga", "Sun Sep 16 12:30:33 ": "@wotinsay Good night Mama Bear! &lt;3", "Sun Sep 16 10:34:29 ": "@Nananadjie sus.. hehe rest ka na off na computer ;P", "Sat Jul 21 15:30:26 ": "@randelltiongson Hello Sir! Like ur tweeted facts abt insurance--continue to spread d wonderful truths abt it.. &gt;am working in #Sony Life :)", "Sun Jul 29 09:49:29 ": "@dost_pagasa Hello! It is safe to travel via RORO tomorrow-- travel would be from Aklan to Manila? Thank you in advance for the answer!", "Wed Jul 25 01:32:00 ": "On intensive water theraphy and antibiotics.. Heal me Lord so dt i can get back to work.", "Sun Jul 22 11:14:48 ": "\"What stops a lot of people from doing the things they dream of is other people.\"", "Sun Sep 23 07:53:01 ": "@mineshaha belated happy hatch day last monday my dear mommines!!! God Bless you! &lt;3", "Sun Sep 23 08:53:32 ": "\"There is no graduation in studying God's Words.\"- Dr. Cristina Manabat\n#HappyChristianEducationSunday", "Wed Jul 25 01:44:12 ": "@bevseybevsey Bevssss! Hello! UTI cause ng sakit ko sbi s lab result khpon snbyn p ng tonsilitis..e painful kc.. Kamusta ka?"}