{"Wed Oct 03 10:52:21 ": "Doesn't know anymore :/", "Mon May 14 22:11:24 ": "&lt;3 birthday present from th bf xx http://t.co/MyWOgvED", "Mon May 28 07:56:42 ": "My new blog! http://t.co/JRj98KdH", "Fri Mar 16 12:49:55 ": "CALLING ALL SALON OWNERS! I need some entrepreneurs to interview if you own a SALON or want to start one please msg me if interested!", "Wed Oct 03 10:27:18 ": "@BeckWebber when did this happen?! Im surprised you havent said!!! love you xx", "Thu Jul 19 08:25:49 ": "I Just Want To Eat Cake: Last week http://t.co/9W3zkEtl", "Mon Jan 21 11:13:06 ": "11.5lb down! Another 34lb to go! :)", "Wed May 30 16:35:04 ": "@Grace_Chuckle awww well done gracieeee! :) xxx", "Sat Apr 14 20:51:45 ": "Mine and the bfs cakes http://t.co/jqcaXPu3", "Thu May 03 15:53:18 ": "Its over woo", "Fri May 25 09:59:55 ": "Haha on my way home and this reminded me of you @lukeviner #downwiththetrumpets", "Mon Mar 12 10:49:11 ": "Is looking for male and female business owners to interview for my dissertation :)", "Wed Oct 03 10:26:36 ": "http://t.co/FdYD2mmG", "Fri Mar 09 09:29:29 ": "Listening @BCR1 and @CHRISDJMOYLES at the gym, great start to my day! :)", "Wed Jun 13 19:39:21 ": "New Installment up http://t.co/JRj98KdH", "Wed May 16 18:02:26 ": "@DavidBrown223 oh dear! Don't say that :(", "Fri Apr 13 07:26:16 ": "@one_tim_martin hello! I've only just seen this!! How bad is that? Are you still willing to help? I know its late and short notice! Sorry!!!", "Fri Mar 16 12:51:34 ": "@NorthantsCoC CALLING ALL SALON OWNERS! I need some entrepreneurs to interview if you own a SALON or want to start one please msg me! RT? :)", "Fri Apr 13 07:29:11 ": "Thinks twitter should work properly on her phone/laptop so she actually gets to see the tweets people send her!!", "Tue Mar 13 09:51:47 ": "@ChronandEcho Im looking for some business owners to interview for my disso im looking at gender issues if anyone is interested msg me RT?", "Mon Apr 23 08:59:55 ": "thinks that @BBCR1 and the team is going to help me get through the week of hell! Disso's and various other assignments! 3days to go = bad", "Mon Sep 24 12:26:59 ": "@BeckWebber when did you get twitter?!? Miss and love you xxxx", "Sat Mar 24 14:04:54 ": "Work on day like this = unlucky :(", "Tue Apr 24 05:49:27 ": "is so happy that her dissertation is over and done with! Just time for printing now! :)", "Fri Apr 13 07:27:28 ": "@maughanjohnson hello! I've only just seen this! How bad is that? For some reason its only just appeared :( know its late r u still able to?", "Tue Apr 03 15:15:18 ": "@TescoCareers are there any stock control jobs going in the northampton area at all or team leader positions?", "Tue Jul 24 12:08:44 ": "@Gema210 well done!", "Fri Apr 13 08:14:40 ": "@one_tim_martin a 30 min interview in the next week if this isn't poss i could send over the qs just more effective face 2 face. Thank you", "Fri Apr 13 07:40:29 ": "Is still looking for Small Business Owners in Northampton to interview, I am doing research on gender issues in entrepreneurship! Let me kn…", "Wed Apr 11 13:14:27 ": "would like to thank @The_Last_Hurdle very much for meeting with me last week and taking some time out of her busy schedule! :)", "Thu Oct 18 12:38:36 ": "Sooner this is over with the better!", "Wed Apr 11 10:16:43 ": "Is still looking for Small Business Owners in Northampton to interview, I am doing research on gender issues in entrepreneurship! Let me kn…", "Mon Jan 21 09:49:25 ": "\"@GeorgeMacD: Retailers, do you have 'snow hero' pics like this great Tesco one?  http://t.co/a8ZvtaUv\" @TescoCareers @tescoexpressed", "Thu May 31 10:25:05 ": "so my new blog is really motivating to lose weight, heres the link :) http://t.co/JRj98KdH", "Wed Jun 06 18:27:10 ": "Top of mouth really needs to stop hurting! #horriblepain:(", "Fri Apr 13 09:39:32 ": "will have at least half this dissertation done today! Aim of the day!!", "Fri Sep 07 21:56:35 ": "@alice_ellen me too! Altho won't miss the assignments", "Mon Jan 21 09:48:03 ": "RT @GeorgeMacD: Retailers, do you have 'snow hero' pics like this great Tesco one? Send in and we'll create a gallery on @retailweek htt ...", "Mon Jun 11 19:32:18 ": "I Just Want To Eat Cake: Week 2 (so far) http://t.co/YYUi0iSf", "Thu Jul 12 18:57:17 ": "Is fed up with being poorly and in pain now :(", "Fri Feb 24 14:48:19 ": "We can spend 30 mins with @RichardBranson at #biz2012.  Vote with our lucky link to increase our chances @huddlebuy http://t.co/LebmCccf", "Tue Jul 24 10:37:28 ": "I Just Want To Eat Cake: Hello! http://t.co/FBRDs8hE", "Fri Apr 13 07:40:16 ": "Ronni:Moss http://t.co/GhTTPhMm", "Fri Mar 09 09:55:16 ": "Yes get working @SidneyySmith! Productive day for me too!!", "Mon May 28 08:33:49 ": "@Gema210 :D xxx", "Wed Mar 21 12:18:47 ": "@ChrisMoylesShow @CHRISDJMOYLES  Listening to your chat about The Apprentice made me laugh, a gold plated pool full of money! #giggle", "Fri Jun 22 04:09:42 ": "I Just Want To Eat Cake: Weigh in http://t.co/hVATymGv", "Thu Mar 29 14:47:40 ": "Just wont tickets to see @jessiejofficial and is mega excited for the #BBMParty on Tuesday! Thank you @UK_BlackBerry", "Mon May 28 08:23:05 ": "@Gema210 oh fair enough! Ha and I can imagine, how are you doing your blog? xx", "Tue Jul 24 12:06:33 ": "@SidneyySmith deffo shouldn't complain! Spesh as the weather is nice lol", "Wed Oct 31 13:16:57 ": "is gunna watch some disney films to make herself feel better #feelingsorryforherself #poorly", "Tue Mar 27 08:34:02 ": "Looking at holidays!", "Thu Mar 15 15:46:57 ": "@BBCR1 @gregjames Not all students are doin nout many of us would like to be in the sun but are stuck doing piles of work includin our disso", "Mon May 28 08:25:23 ": "@Gema210 same! Lol! I really need this motivation, too big! Lol!", "Mon Apr 30 08:21:16 ": "has her interview at Head Office today! Wish me luck!", "Mon May 28 08:20:52 ": "@Gema210 Really? You went weight watchers instead of back to SW, how come? and send me the link? :) ly xx", "Mon Apr 30 08:45:33 ": "@grace_chettle thanks gracie! &lt;3 xxxxxxxx", "Tue Mar 13 09:38:33 ": "@NorthantsCoC Im looking for some business owners to interview for my disso im looking at gender issues if any one is interested msg me :)", "Wed Apr 18 06:49:08 ": "Little bit excited! Interview at head office! Don't mind if I do! :)", "Wed Apr 25 06:37:32 ": "Last day of hell! Then my social life returns!! listening to @BBCR1 to get me through today! Ha! @CHRISDJMOYLES show always cheers me up!", "Wed Mar 21 09:29:47 ": "CALLING ALL BUSINESS OWNERS! I need some entrepreneurs to interview if you own a business or want to start one please …http://t.co/zrZ44NsO", "Wed Mar 21 12:11:08 ": "@Lord_Sugar, Mega excited for the return of The Apprentice tonight! :)", "Fri Mar 16 12:52:18 ": "@ChattyStylist  CALLING ALL SALON OWNERS! I need some entrepreneurs to interview if u own a SALON or want to start one please msg me! RT? :)", "Fri Mar 23 11:26:12 ": "Uni work is becoming a bit of a bore now... Oh well 4 weeks to go..!!", "Fri Apr 20 11:03:56 ": "Has a short 5 min questionnaire if any business owners would be willing to help!! Its for my dissertation :)", "Mon Nov 05 15:22:31 ": "Mmmmm hazelnut coffee #possiblybetterthancosta http://t.co/7euMMLk4", "Mon Jul 02 07:48:10 ": "July! Lots of exciting things happening this month! Starting with graduation!! Eeeeek :)", "Tue Mar 13 09:34:46 ": "CALLING ALL BUSINESS OWNERS! I need some entrepreneurs to interview if you own a business or want to start one please msg me if interested!", "Fri Apr 13 09:03:22 ": "today is the day to get motivated! On all aspects of my life at the moment!!", "Mon May 28 08:32:41 ": "@Gema210 Sort something soon! :) xx", "Thu Aug 09 09:39:26 ": "So today has gone bad to good to bad... What next?", "Fri Jul 06 11:11:25 ": "I Just Want To Eat Cake: End of week 4 - Start of week 5 http://t.co/H0vfmIcK", "Fri Jul 20 09:15:59 ": "So today is the day I finally graduate! :)", "Tue Mar 13 19:08:37 ": "@ChristinaMc80 Know that feeling!!", "Fri Mar 16 23:20:09 ": "@ChattyStylist thanks :)", "Mon Mar 19 22:49:26 ": "http://t.co/60a93is5 vote @zolaforever", "Tue Mar 13 09:49:29 ": "@NorthantsCoC  Im looking for some business owners to interview for my disso im looking at gender issues if any one is interested msg me RT?", "Thu Mar 08 12:05:36 ": "@Vanessa_Gold funny that comment. I'm doing my dissertation on gender in entrepreneurship and this is the sort of stuff I'm investigating!", "Fri Mar 16 23:23:43 ": "@NorthantsCoC thank you :)", "Fri Apr 27 08:21:22 ": "Finally over! http://t.co/1XZoHcsS", "Fri Mar 09 12:31:12 ": "I just joined LinkedIn and created my professional profile. Join my network. http://t.co/6MyoJoSS #in", "Wed Mar 21 21:41:01 ": "@Lord_Sugar not in a good way :( bum ba bum ba bum ba bum ba bum baaaaaa #theapprentice", "Mon Apr 30 09:19:51 ": "@SidneyySmith thank you :)", "Mon May 28 08:28:58 ": "@Gema210 haha! Thanks! Lol! I graduate this summer! WOOO! But no return to Southend I'm afraid xx", "Mon Apr 16 15:54:34 ": "@alice_ellen ahh well done! Doing what?", "Tue Jul 24 10:37:39 ": "I Just Want To Eat Cake:  Hello! http://t.co/FBRDs8hE", "Wed Jan 02 20:22:21 ": "RT @IamJayL: Dairy Milk Need To Make A Pack Of Buttons Which Are Mixed With Dairy And White Chocolate!", "Tue May 29 06:32:06 ": "RT @lukeviner: @RonniJane1990 yeah yeah, whaaa?  Haha it's gonna be stuck in my head foreverrrrrr now! :)", "Wed Oct 03 10:58:46 ": "@BeckWebber ill text you!", "Mon May 14 22:11:40 ": "And cake too... http://t.co/Qyf7rmy8", "Mon May 14 22:17:18 ": "Not being away from the bf for nearly two weeks and then sleepin alone equals bad! #cantgettosleepand6amstart", "Mon May 28 08:27:34 ": "@Gema210 I think that would be a good idea! I miss the days where we went together lol! xx", "Tue Jun 12 03:59:33 ": "Is amazed at the fact that people seem to actually be reading my blog... here is the link again guys :) http://t.co/JRj98KdH", "Tue Mar 20 23:19:44 ": "CALLING ALL BUSINESS OWNERS! I need some entrepreneurs to interview if you own a business or want to start one please msg me if interested!…", "Fri May 25 10:23:28 ": "@Gema210 tomorrow! For the airshow weekend! :) miss you xxx", "Fri Jun 29 09:11:11 ": "I Just Want To Eat Cake: http://t.co/3k4ir6fs", "Wed Jul 04 10:00:49 ": "I Just Want To Eat Cake: Update (Mid week - ish) week 4 http://t.co/o3rPMeiE", "Fri Oct 19 15:57:30 ": "Missing university life after watching #freshmeat", "Thu Mar 08 12:05:47 ": "RT @Vanessa_Gold: “@Y3llowtaxi: @dragonjones  why is it that successful females have to broadcast their success?  Very few men do!! #bor ...", "Wed May 23 10:30:40 ": "Today is not the day to be travelling on a train!", "Mon May 28 08:30:51 ": "@Gema210 Working up here, got more contacts and moving in with the boyf! Bad and Good times! We will have to meet up soon I miss your face x"}