{"Sat Apr 13 18:09:45 ": "Feel sorry for Millwall's genuine fans.", "Wed Apr 17 20:19:46 ": "RT @palacefan: So it's coming out that holloways lost the dressing room ...... #cpfc can't we just be pleased we having a good season", "Wed Apr 17 20:17:16 ": "RT @TheGodLight: Every loss is a making of space within you, a space for something new to enter &amp; revitalise your life.", "Thu Apr 11 18:35:14 ": "RT @theroyalfactor: Actually, England performed better at World Cups under #Thatcher: we actually got to '82, 1/4 final in '86 and semi  ...", "Fri Apr 19 20:43:42 ": "RT @Telegraph: Do you want to put the heart back into our high streets? Get involved with our Reinventing the High Street campaign http://t…", "Thu Apr 18 20:40:41 ": "@MeeLuanistyn @mightypalace Good man :)", "Thu Apr 18 19:02:44 ": "RT @TheGodLight: Society, peer pressure &amp; other influences want you to be a set way, you must only change if your soul is in total a ...", "Thu Apr 11 18:23:51 ": "RT @Telegraph: Carbon-dating of an ancient beam from a Guatemalan temple may help end a century-long debate about the Mayan calendar htt ...", "Wed Apr 17 20:09:05 ": "@Garyw_ @CaptMikeYates Please let me know what say. Thank you.", "Wed Apr 17 21:26:46 ": "RT @GoldingNatalie: Once again showing what an incredible job the NHS is capable of. Some nurses/doctors are exceptional. #24hrsAE", "Fri Apr 12 22:06:27 ": "@theroyalfactor Haha brilliant.", "Mon Apr 15 19:13:03 ": "RT @theoriginalwak: What the fuck just happened?  #bostonmarathon http://t.co/Heko9U6r7P", "Thu Apr 18 21:06:08 ": "Replace Jeremy Kyle with 24hours in A&amp;E and the world will be a bit more human again.", "Tue Apr 16 16:43:25 ": "Now that is someone who despite everything still values life.", "Mon Apr 15 19:02:28 ": "RT @TelegraphWorld: #Venezuela facing new turmoil as Hugo Chavez heir Nicolas #Maduro scrapes victory: latest from @pmdfoster http://t.c ...", "Wed Apr 17 19:11:58 ": "Busy at a quarter to nine http://t.co/HDK7yMLgjr", "Wed Apr 17 19:03:29 ": "Pavements will be back to normal tomorrow thank god.", "Thu Apr 18 20:50:18 ": "RT @trutherbot: http://t.co/4H83BuVq59", "Tue Apr 16 20:06:14 ": "Heard that IH left Blackpool because he had an affair. Is that true?", "Fri Apr 19 20:41:24 ": "@ballueder Thank you Volker :) have a nice weekend.", "Tue Apr 16 20:14:35 ": "@DannyInnes80 No mate I swear! I like IH, he needs a chance. Know a lifelong Bpool fan", "Thu Apr 18 18:49:16 ": "@newlandsj Where did you find that?", "Mon Apr 15 19:49:23 ": "Anyone see the meteor a few moments ago? Quite large trail and very bright.", "Thu Apr 18 20:58:03 ": "@HassocksCommute @ballueder You lucky lucky people :)", "Thu Apr 18 20:42:54 ": "@ballueder You've made a positive impact!", "Wed Apr 17 07:24:49 ": "@Garyw_ @Se_Railway and no apology either. Useless scummy company.", "Mon Apr 15 19:15:39 ": "Sad if true and it certainly looks that way.", "Wed Apr 17 19:38:04 ": "@MoJGovUK Get that vermin Jeremy Kyle off our televisions. Mentally degrading, no wonder people don't care. J Kyle makes it acceptable.", "Mon Apr 15 16:28:02 ": "RT @ecfr: Will the #eurocrisis kill the #singlemarket? Experts debate on 22nd April. Join us! http://t.co/oeUabcdl6S", "Tue Apr 16 22:24:04 ": "RT @Se_Raleway: Want to leave some feedback for #Southeastern? Fill out this independent survey: https://t.co/V9ncnqRuEE", "Thu Apr 18 20:03:32 ": "@Merlin_EH_101 Haha  :) well not to me.", "Thu Apr 11 17:12:24 ": "RT @RealClearWorld: Inside the CIA's secret war in #Tibet http://t.co/RQC2gYMO6K", "Sat Apr 20 20:14:14 ": "RT @mouselink: #Florida man facing 3rd degree felony, punishable by up to 5yrs in prison, for releasing balloons for his girlfriend http://…", "Mon Apr 15 19:52:25 ": "@peter_mount Issue?", "Wed Apr 17 19:17:09 ": "@MoJGovUK Hold the parents accountable for those lucky enough to have them. It begins at home mostly.", "Mon Apr 15 20:02:19 ": "@peter_mount Yes be careful! I defo saw a meteor, very fast, faded out with a large trail. Gutted I missed the ISS though, a lovely sight", "Tue Apr 16 16:42:15 ": "Great story. \r\r'@Telegraph: .@h_alexander profiles the #BostonMarathon's cowboy-hatted hero with the tragic past http://t.co/e6fVgtDbFB\"", "Wed Apr 10 09:45:48 ": "@foreignpolicy0 Could not see in the article that Asda is owned by Wal-Mart, an important point.", "Thu Apr 18 18:54:33 ": "@newlandsj Haha well thanks for sharing :)", "Thu Apr 18 19:39:35 ": "@xergal :-) :-) :-)", "Mon Apr 15 19:14:34 ": "WTF just happened? No expert but looks like a bomb to me.", "Wed Apr 17 16:37:31 ": "RT @BreakingNews: FBI says preliminary test indicates poisonous ricin in letter sent to President Obama - @AP", "Wed Apr 10 09:53:36 ": "8 creepy mystery ingredients in fast food http://t.co/mAAKHBEClP", "Fri Apr 12 21:49:14 ": "@meralhece That's our society these days, tasteless.", "Tue Apr 16 20:10:31 ": "@DannyInnes80 Haha not to do him tonights result I must add. To do with Barry Furguson move. Rumours do the rounds in Blackpool.", "Thu Apr 11 07:15:23 ": "@Se_railway I wonder how much you cost already ripped off customers in extra fares? It will cost me a fiver  now.", "Wed Apr 10 08:04:47 ": "I would deploy the army in civvies to fight any trouble makers for Thatchers funeral. That will teach em.", "Thu Apr 11 18:20:23 ": "@VinnyBT Der. I knew that! ok I didn't.", "Sat Apr 13 20:24:17 ": "RT @SPJ91: Thirdly the fans fighting with each other are scum, pathetic people who don't deserve to be at wembley with us #Millwall", "Sat Apr 13 17:59:41 ": "Millwall fans fighting each other? Glad to hear it.", "Fri Apr 12 19:04:02 ": "Colleagues dad was a miner &amp; saw there was no future in industry &amp; quit 2 months before it kicked of. Put that on your coal fire u haters.", "Sat Apr 13 13:28:47 ": "RT @peter_mount: Rail punctuality declines http://t.co/dgS0B8RjhN #southeastern #southern", "Thu Apr 18 20:01:50 ": "@Merlin_EH_101 Bloody hell! Very strange.", "Mon Apr 15 19:17:52 ": "RT @A_Liberty_Rebel: Does anyone remember George Galloway demanding of the Venezuelan state that it should spend no public money on Chav ...", "Wed Apr 10 20:29:37 ": "RT @Telegraph: Iranian scientist claims to have invented time machine that allows users to fast forward eight years into the future http ...", "Thu Apr 18 18:51:18 ": "RT @ukhomeoffice: Ivory, rhino tusks &amp; live birds. See super sleuth Border Force dog Tyke fighting the animal smuggling trade @Anima ...", "Fri Apr 12 19:53:10 ": "RT @Spirit_Fountain: Kindness is the language which the deaf can hear and the blind can see.~ Mark Twain #quote #goodness #selflove #kin ...", "Thu Apr 11 17:01:01 ": "RT @CourtNewsUK: You will NOT believe this one. Guess the sentence. Gym coach abuses seven girls. He gets? http://t.co/D1JTj5ekvn", "Fri Apr 12 22:06:33 ": "RT @theroyalfactor: It happened to me! From The Times. http://t.co/VFfEoBU9ig http://t.co/XFmiaSNcXO", "Thu Apr 18 20:40:04 ": "Watching. 24hrs in A &amp; E - very sad. Gods knows why I'm even watching it. Good old NHS, there to the end.", "Mon Apr 15 19:11:30 ": "Oops. Forgot I cancelled my direct debit to the paedophile/criminal network at the @bbctrust - They'll have to wait.", "Tue Apr 16 20:42:00 ": "@MeeLuanistyn Good luck mate", "Fri Apr 12 20:39:13 ": "@underground1809 I like his voice but he is bloody loud.", "Tue Apr 16 20:03:09 ": "@MPE14 Yes agreed, screw him legend or not.", "Fri Apr 19 11:21:55 ": "RT @richardcalhoun: #BBC Abuse scandal arrest, this time Rolf Harris, u do wonder as to the scale of BBC abuse &amp; how BBC &amp; employee…", "Thu Apr 11 16:25:54 ": "@VinnyBT Probably a stag do or similar", "Tue Apr 16 20:48:05 ": "@MeeLuanistyn Haha that's the spirit.", "Thu Apr 18 19:33:12 ": "@xergal wow thanks. Anything else? I hate cats.", "Mon Apr 15 19:27:38 ": "@JessicaCecena_ Hope you feel better now Jessica.", "Thu Apr 18 20:04:31 ": "@xergal Anyway I was joking, I love cats, they are adorable.", "Sat Apr 20 04:29:58 ": "RT @Telegraph: Boston's terror ends as Dzhokhar Tsarnaev is captured alive http://t.co/h15Rhx99gu", "Tue Apr 16 20:02:15 ": "RT @MPE14: Why do people keep going on about bloody dougie freedman! He walked out on us, he didn't want to be our manager, end of!  #cpfc", "Wed Apr 17 21:28:57 ": "RT @Telegraph: A day when \"abuse was overcome by respect, violence by decency, and hatred by love.\" http://t.co/Ei82BfL9sn by @MichaelPD ...", "Wed Apr 17 07:30:24 ": "@CaptMikeYates @Garyw_ Thanks Yates! They'll probably just delete it anyway because they are good at distorting the truth @se_railway", "Wed Apr 10 10:05:11 ": "@ballueder Haha lovely.", "Mon Apr 15 22:42:33 ": "@CBers @peter_mount It was about that time, heading in the NE direction.Glad she witnessed it. Great photos Peter!", "Thu Apr 11 19:50:20 ": "RT @kentpoliceroads: Driver's unfinished text is warning to others. #donttextanddrive http://t.co/HNGitkYSBp", "Wed Apr 10 09:30:56 ": "I would tear gas the little shits on front of todays maill.", "Thu Apr 18 20:25:10 ": "@shellrobinson Night night", "Sat Apr 20 19:02:01 ": "RT @dr_davidson: #Bahrain Feb14 opposition group's video 'Don't Race on Our Blood' - in advance of tomorrow's disputed #F1 Grand Prix  http…", "Fri Apr 12 19:56:59 ": "RT @benjameslong: This time next week!! 19th April,REMF charity match @ Lewes FC,19:45 ko, cpfc fans v bhafc fans #cpfc #bhafc #Revenge  ...", "Thu Apr 11 07:55:04 ": "@KentishExpress Is this good journalism? Some people get very scared by this stuff.", "Tue Apr 16 20:01:39 ": "RT @archangelolill: Yesterday #NHS charging was floated as POSSIBILITY and today its changed its now a THREAT if economy doesn't pick up ...", "Sat Apr 20 20:43:37 ": "@cgi365 Thank god you are all safe.", "Wed Apr 10 09:24:44 ": "If only the government gave our police the tools to do their jobs properly and safely.", "Sat Apr 20 19:01:43 ": "That Jordan (the one on BGT, not the big breasted one) was incredible.", "Wed Apr 17 11:45:39 ": "RT @CityPolice: Thanks for all the compliments today on our uniforms. #welldressed", "Mon Apr 15 08:15:57 ": "Great prep work for Margaret Thatcher's funeral, barriers up already meaning norrower pavements. Very efficient.", "Wed Apr 17 19:22:23 ": "Pleasant enough atmosphere though. http://t.co/BCBTuPvANi", "Thu Apr 11 07:31:34 ": "RT @kentpolicemaid: APPEAL: Police appeal for info from clubbers after nightclub assault on 7 April. http://t.co/8Fsig03blO", "Thu Apr 18 20:37:46 ": "@MeeLuanistyn @mightypalace Mate get her out of your life.", "Thu Apr 18 19:59:39 ": "@Merlin_EH_101 How many have you lost?", "Tue Apr 16 20:37:07 ": "@Gav1905 Not sure to be honest. On telly he said he had no regrets about leaving and he had no emotion on his face.", "Sat Apr 13 11:10:59 ": "RT @BBCRADIOKENT: Calling all Kent #southeastern commuters! Sarah Boundy from the rail firm will be in our hot seat at 0830 mon. Use #tr ...", "Thu Apr 18 19:44:24 ": "@xergal Now this is a cat video.\n\nDistraction: Cat hugs kitten http://t.co/qNj0cPCIxS via @youtube", "Fri Apr 19 08:11:28 ": "@wahootie Worst program ever", "Fri Apr 19 07:47:38 ": "@MeeLuanistyn Thanks Chas!", "Sun Apr 14 18:19:33 ": "RT @kent_police: UPDATE: Officers searching for missing soldier in Rochester want to speak to driver of small black car http://t.co/BV6w ...", "Thu Apr 11 07:06:59 ": "@Se_railway Thanks tossers! 0751 arrives @0802 @PDW with the 0807 cancelled train not held? Few people from MDW made it. Pure scum.", "Mon Apr 15 19:04:57 ": "@RealPengy Didn't Sir Olly sat that this morning?", "Thu Apr 11 19:30:34 ": "@MrHface Certainly is. He's cool the advert isn't."}