{"Sun Dec 23 21:31:42 ": "Got my Honeybaked ham. Christmas is complete.", "Tue Feb 12 15:44:54 ": "Got serenaded by the barista at Tulley's. Not embarrassing at all.", "Tue Jan 08 18:36:37 ": "Just saw Saving Private Ryan for 1st time. I hate movies where Tom Hanks dies.", "Fri Jul 13 21:44:53 ": "Sam's Club messed up the cake and I'm stuck at ghetto city...I mean Party City. Oh please don't let me catch anything.", "Sun Jun 03 18:12:55 ": "It's a beautiful day and I want to be out in it!", "Thu Oct 11 16:14:03 ": "Thought my sprinklers came on early but my car was sprinkled too. Tut tut...looks like rain...", "Wed Nov 28 03:28:18 ": "RT @azcentral: She probably won't like it, but Grumpy Cat will make an appearance Saturday @joesfarmgrill in #Gilbert. http://t.co/OlPuez1c", "Sun Mar 10 16:52:52 ": "New study says caffeine shot in nectar improves honeybees memory. What do they need to remember? They live for what...a month?", "Tue Sep 25 18:44:50 ": "I say older but we're probably the same age. I just have more teeth", "Wed Nov 28 03:08:58 ": "Why put up a Christmas light display next to the freeway? Look at the pretty lights! Look at the collision!", "Sat Nov 24 16:05:11 ": "It's Small Business Saturday.  Shop local!", "Tue Jun 12 04:33:44 ": "RT @KTAR923: Lake Mead tunnel collapses, possibly trapping crew - http://t.co/WZfwO7eC", "Tue Sep 25 18:44:07 ": "An older woman just shoved her cell phone down her shirt into her bra.", "Tue Jun 12 05:37:04 ": "Why is it so much easier to run other people's lives?", "Sat Oct 06 21:14:03 ": "Whoever is on the afternoon KTAR show today is an absolute idiot", "Tue Aug 28 03:57:11 ": "RT @KTAR923: Bill Nye bashes creationism (VIDEO) - http://t.co/P3MWnip2", "Sat Nov 10 20:17:41 ": "RT @MarthaStewart: Recycling is a good thing! Trade broken/used xmas light strings for $3-$5 coupons for new LED lights @HomeDepot! Offe ...", "Mon Dec 24 23:24:36 ": "There's horse poop on the sidewalks. Did we have a parade?", "Thu Nov 08 01:56:08 ": "RT @azfamily: More than 602,000 ballots in Ariz. still uncounted http://t.co/zXw652Gk", "Wed Jun 06 06:16:34 ": "I want a knight in shining Armani", "Sat Sep 01 00:44:52 ": "Avon Rhinestone Day to Night Ring w Gift Box Sz L 10/11\n\nThis ring is covered with three vertical rows of... http://t.co/sLTowlAg", "Tue Sep 25 18:36:33 ": "Screaming babies at MVD...it just doesn't get much worse", "Sat Apr 20 00:13:28 ": "NZ MP's hilarious gay marriage speech: http://t.co/InaJCIXqBv via @youtube", "Tue Aug 28 04:03:56 ": "RT @azcentral: Earthquake damage reported on Navajo Nation near Blue Gap, #Arizona. Photo by Astel Benally: http://t.co/nKRnM1bS", "Wed May 30 13:29:01 ": "Oh what fresh hell is this? Save me @themeagan.", "Fri Jul 06 17:58:11 ": "Watching original Star Trek. William Shatner was a hottie!", "Wed Nov 14 18:43:20 ": "Teaching a class today. Walked into classroom to find SEX written on chalkboard. Yep this is my class.", "Sat Sep 01 00:05:53 ": "I have lots of great deals today! I'm am clearing out my Avon inventory. This is your time to take advantage of... http://t.co/zfHCErB3", "Tue Nov 06 15:47:39 ": "Just saw a guy buckle his cell phone into the childs seat of a shopping cart. I haven't been that concerned about my phone's shopping safety", "Fri Dec 28 13:05:17 ": "It's the last Friday of 2012. So excited for the new year!", "Thu Sep 20 16:37:26 ": "RT @andymboyle: Your HOLY SHIT story of the day, featuring a woman who discovers her dead husband was her dad: http://t.co/CbRHa1nq", "Fri Aug 03 23:55:05 ": "My latest post: http://t.co/yvl2lBTJ", "Sun Aug 05 04:49:54 ": "My latest post: http://t.co/mummeoyG", "Sun Sep 30 05:09:07 ": "RT @azfamily: UPDATE: Police identify man who killed himself following high-speed chase. @CrystalCruz3TV talked to his family. http://t. ...", "Sat Nov 24 16:41:24 ": "Check out my friends small business at http://t.co/8RxtP73g. There's even a coupon good for today!", "Sat Sep 01 00:17:42 ": "RECORDABLE TRAVEL ALARM CLOCK\nKeep loved ones close, even while on the road, with the help of this unique alarm... http://t.co/SufTMiaJ", "Wed Oct 10 01:18:29 ": "I've been home all day and went to the grocery store after 5pm. What was I thinking??", "Tue Aug 28 06:12:13 ": "\"@azcentral: Police: Florida man called 911 for sex. http://t.co/dZtopptT\" 911...what are you wearing?", "Mon Jun 18 04:26:26 ": "@storkmankmk you know it's true. Ha!", "Wed Jun 13 04:32:06 ": "Ever look at a fb profile photo and thought...really? You think you look good in that picture?", "Mon Jul 02 04:56:13 ": "Magic Mike \"Channing Tatum\" Official Clip [HD]: Dancing While Cody Horn Watches http://t.co/8LSpwPKy via @youtube love this song &amp; this boy", "Thu Aug 02 17:50:11 ": "Megachurch Pastor Admits To Affair With Teen #aolon http://t.co/INm1Qhae via @AOL  He was 53 and she was 16.", "Fri Feb 08 14:33:49 ": "@myfoxphoenix Negative Ghost rider. The pattern is full.", "Sun Jul 01 13:55:27 ": "Bad day already. No Sunday paper and I was attacked by a cricket on my front porch. Not sure if I'll recover. Vicious creatures", "Wed Apr 03 22:48:40 ": "A friend sent me this. I would look soooo good in this car! http://t.co/SqRi90D58A", "Tue Aug 28 15:04:00 ": "RT @HuffPostParents: What does it mean to live within your means? http://t.co/br4gI0um", "Thu May 31 06:31:49 ": "RT @azfamily: Will water supply lead to death of Tombstone? http://t.co/CwHneFvg", "Fri Oct 05 19:29:36 ": "RT @azcentral: #AZFactCheck: Number of pregnancies due to rape: http://t.co/GzJV23hS", "Sat Sep 01 00:50:51 ": "TRINITY OF ANGELS KEYCHAIN\nSilvertone keychain with simulated gem features three guardian angel charms... http://t.co/acMXzOqT", "Sun Mar 10 15:03:20 ": "Woke up an hour early thinking I was late. My whole day days is off. I need more coffee.", "Fri Oct 05 19:20:33 ": "RT @CBLDF: Children's author Robie Harris discusses the frequent banning of her books:... http://t.co/Re4B6hU2", "Sat Oct 20 13:48:54 ": "RT @HuffPostParents: WATCH: This baby REALLY doesn't like cats http://t.co/NcOjdM3C", "Mon Jul 02 17:13:04 ": "Tell my ugly stepsister to stand by. Cinderella is fightin back!", "Mon Aug 13 20:58:44 ": "My latest post...it's MANic Monday! NSFW! http://t.co/L1mt3sKl", "Sat Jun 16 18:13:45 ": "People! The officer is not drunk!  It's called a traffic break!", "Wed Jul 25 18:15:52 ": "Just bought a car. What a wonderful experience at Nick Mayer Kia in Phx! Love those guys!", "Fri Sep 07 19:23:54 ": "RT @azfamily: Scammers are taking advantage of unsuspecting Facebook users. @GaryHarper3TV has more info - http://t.co/j5ExsQQR", "Fri Jun 08 19:15:58 ": "What's with Gossip Girl? How do high schoolers drink in bars &amp; clubs? Are things that different in the Big Apple?", "Fri Sep 07 19:21:25 ": "RT @KTAR923: DPS officer investigated in sex case kills self - http://t.co/8NfEVlG6", "Tue Jul 03 04:55:05 ": "RT @KTAR923: MCSO stop leads to feds taking custody of suspects - http://t.co/ZgHTsFcg", "Mon Aug 27 16:16:03 ": "Chris Matthews is an idiot", "Tue Aug 28 03:56:43 ": "RT @azcentral: #Flagstaff police supervisor placed on leave after dog's death: http://t.co/FYu8pgML", "Wed Mar 06 05:25:51 ": "@storkmankmk awwww...thank you so muches!", "Fri Oct 05 19:21:45 ": "RT @RealDuncanHines: #BakingTip Add pumpkin pie filling to your cake mix for fall flavor.", "Thu Jun 28 06:13:08 ": "RT @WomensHealthMag: #sexpositionoftheday: The Seashell. It's beach-weather, after all!  http://t.co/ymaKUzkh", "Sat Jun 16 14:32:10 ": "Oh I love java sweet and hot...whoops Mr Moto I'm a coffee pot...", "Sat Jun 09 04:19:06 ": "Ooooh I love me some Big Willy #MIB3", "Tue Jun 19 20:57:32 ": "Waiting to check in at the doctor behind a woman who sounds more like she needs a shrink than a cardiologist", "Thu Aug 02 17:51:26 ": "One church member said only God can be the judge.  Well...and a jury of his peers.", "Fri Aug 03 23:56:24 ": "RT @RealSheriffJoe: Celebrated the anniversary of my Tent City today. Its the start of its 20th year.", "Wed Feb 06 15:29:19 ": "Went to Kimberly Ann's Tea House. There's an experience I don't ever want again. Definitely do not recommend it.", "Sun Jun 10 06:27:32 ": "I don't do well with narcissists.", "Fri Jun 08 23:29:18 ": "Why would anyone settle for a life of mediocrity?", "Sat Jun 02 15:11:47 ": "RT @myfoxphoenix: Sex toys now sold at CVS http://t.co/l71MtDmo #fox10az", "Fri Aug 31 17:50:16 ": "Bought new beds for my kids. They've overslept 2 days in a row.", "Sat Aug 04 03:02:28 ": "RT @azcentral: #Arizona death-row inmate's clemency rejected: Daniel Wayne Cook set to be executed Aug. 8. http://t.co/socm1qgs", "Fri Sep 07 22:30:55 ": "RT @azcentral: #Arizona groping victim wants apology for judge's comments: http://t.co/LIA4hoq3", "Sat Nov 24 23:15:34 ": "RT @FortuneMagazine: Why Avon is no longer a takeover target: http://t.co/II0WLZSQ", "Sun Jul 01 04:48:19 ": "Can't get Magic Mike out of my head. Love a man who can dance", "Sat Jan 05 13:27:44 ": "RT @WomensHealthMag: NEVER date a guy who sends an email like this! http://t.co/f7f1nSFS Stay far, far away.", "Sat Oct 13 23:18:16 ": "Just got bumrushed by a pack of 3 foot tall Cub Scouts at the grocery store", "Mon Jul 30 02:00:47 ": "I HATE crickets!", "Wed Sep 12 13:38:44 ": "Fun fact for the day and totally irrelevant to anything...snails can sleep for 3 years. Lazy gastropods", "Wed Jun 20 18:19:15 ": "Reading 50 Shades of Grey. Really hard to get into. Like it's written by a 12 yr old", "Fri Dec 28 22:33:17 ": "OMG! I've discovered Sprouts!", "Fri Mar 29 04:56:47 ": "RT @JillianMichaels: This sucks. Why bother with \"Let's Move\" when this is happening behind closed doors? http://t.co/TqgzspCee0", "Mon Apr 15 02:40:06 ": "@JillianMichaels Just got home from Comerica theater in Phx. I see a new path before me. Thank you!", "Wed Jun 13 12:26:13 ": "LOVE Sheriff's deputies in cowboy hats", "Mon Jun 18 02:51:40 ": "Had to put my bi**h hat on. I love it when I play the roll I was born to play :-)", "Thu Feb 07 12:14:26 ": "Did y'all see that sliver of a moon this morning?  Looks like it's on fire.", "Tue Nov 13 04:55:01 ": "Win a $25 Lowe's Gift Card via @SavingSense  http://t.co/Qq1XEmjN #Giveaways #blackfriday http://t.co/kELRWpUS", "Fri Aug 31 13:09:35 ": "RT @azcentral: Today in #Arizona history: In 1936, an enraged burro attacked a woman near Ash Fork, knocking her down, then pawing and b ...", "Mon Oct 15 16:23:02 ": "Bakin cupcakes for my @WiltonCakes decorating class. Funfunfun!", "Mon Jun 04 22:16:34 ": "Just spent a glorious uninterrupted hour in Hobby Lobby. Love shopping without the kids!", "Wed Jul 04 13:32:07 ": "Happy 4th of July!", "Mon Jun 04 16:10:10 ": "I love it when people think I actually know what I'm talking about.", "Sat Nov 24 16:06:28 ": "For a great gift idea check out http://t.co/WKmQWeYE", "Thu Nov 08 01:25:34 ": "Light up the holidays. Christmas Presence Heritage® Scented Candle - NEW: https://t.co/kyMv3t1n", "Mon Aug 13 19:37:39 ": "RT @Real_Simple: When you're out of paper liners, use a large square of parchment paper to line each cup of a muffin tin. http://t.co/NT ...", "Sat Jun 02 04:58:42 ": "So great to be able to borrow my neighbor's husband.", "Sat Feb 16 14:50:58 ": "RT @azcentral: Fugitive killed in 100+ mph crash with child in car http://t.co/vLOnEVNQ"}