{"Wed Sep 19 04:56:45 ": "@DinosThirdTwitt It's cool. Your doing God's work son.", "Tue May 15 21:11:44 ": "I REALLY need to start carrying around a water bottle on these long runs. Almost didn't make it to the fountain.", "Mon Jun 06 18:01:45 ": "Can Microsoft find anymore ways to fail worse? #e3", "Thu Nov 17 19:17:03 ": "@dcwomenkicknass can not into solo female books with X-23 and Ghost Rider getting cancelled.", "Sun Aug 14 03:20:14 ": "@Coelasquid The relaunch will have a cool variation that combines both aspects though.", "Tue Sep 18 04:43:23 ": "@DinosThirdTwitt 3 minutes now", "Sat Sep 15 04:45:44 ": "@DinosThirdTwitt I got ya.", "Fri Apr 29 11:37:19 ": "Can't believe I actually watched this. Swore myself I wasn't gonna be one of those foreigners. #royalwedding", "Fri Apr 29 23:01:37 ": "RT @GuySoft: Mass recruit to the new #anonymous Twitter hive, join from here to RT automatically messages! http://bit.ly/frshVF", "Sat Apr 30 04:19:43 ": "@buenothebear She doesn't look like shes digging that hug.", "Mon Apr 25 05:06:40 ": "@TheDisneyBlog Feels too much like a \"Marvel\" film. (Though as a comic book reader, this is a good thing.)", "Fri May 04 17:29:59 ": "Damn. R.I.P. Adam Yauch. You helped inspire a generation to fight for their right to party.", "Sun Oct 23 20:53:48 ": "@JamesDRobinson Stop applying your sound English logic to us 'mericans. Contorting meanings to our agenda is a famous pastime around here", "Sun Aug 14 03:19:15 ": "@Coelasquid Barry Allen's was made out of a special fabic. Wally West learned to make his clothes out of speedforce.", "Tue Apr 12 20:40:04 ": "@MrMuto Susan Strong!", "Thu Oct 13 20:28:50 ": "@dcwomenkicknass http://t.co/FzZdzZlI There is already an interview up with her hand future plans. It's a good read.", "Fri May 04 03:27:53 ": "Half hour until the Avengers! SSSSSSOOOOOO PPPPPPPUUUUUUMMMMMMPPPPPEEEEDDD!", "Thu Jun 02 07:05:10 ": "@jimlee00 So I gotta know, how are you guys going to announce which characters stay/go or are you going to let the books explain?", "Thu May 12 01:04:49 ": "@bryanQmiller You dare post this fact and NOT TELL US THE CHANNEL??", "Thu Feb 02 04:01:17 ": "I really need to start paying attention to where I'm painting. No damn ventilation in this building right now.", "Sun Feb 12 08:02:18 ": "Blah blah blah life blah blah blah death blah blah whatever", "Thu Jul 12 00:36:23 ": "Holy crap, the drive through for Dairy Queen is pretty much composed of nothing but fat people. I feel disgusting just being here now.", "Tue Nov 08 22:43:58 ": "@beatonna You should totally create a spinoff of them. I'd enjoy the shit out of that.", "Sat Jun 16 22:23:43 ": "@MeggzVaranese you didn't remind us.", "Sat Apr 30 16:00:19 ": "RT @GuySoft: RT @anon2060 China Police website defaced http://www.wfaic.gov.cn/home.html or http://imagebin.org/151000 Join #opIran #Ano ...", "Fri Jul 29 09:42:35 ": "@Paul_Cornell Stwitch the 'd' and 'b' in Scott's last name", "Thu Nov 03 08:11:40 ": "@KyleDHiggins Nonsense. Being able to stay up this late is a proof of our youth! Embrace it!", "Sat May 05 17:12:14 ": "It's Free Comic Book Day! Head to your local comic store for some free fucking comics!", "Thu Jun 09 04:42:12 ": "@neilhimself http://bit.ly/j606Uj apparently it isn't that exclusive. Not that hard to see all the rooms w/o even loging into twitter.", "Sun Jan 29 18:44:33 ": "Had a nice time at Ohayocon. Now it's time to head back home and deal with reality.", "Wed Oct 26 20:43:48 ": "@pattonoswalt sadfrog.jpg", "Sun May 06 04:03:56 ": "@hazelvaranese well invite me up sometime when you're not busy and I just might", "Wed Nov 16 21:35:53 ": "@JamesDRobinson Haven't been to my LCS  yet, but if thats true that sucks. Looks like Shade is the first delay for DCnU.", "Mon Apr 30 21:10:30 ": "@granulac in a skeleton band!", "Mon Jul 30 20:47:43 ": "Now arriving in Columbus on my first leg of my trip to Ireland!", "Fri Apr 15 03:52:49 ": "@bryanQmiller Praising time? Because I can't thank you enough for making such a stellar Batgirl book.", "Fri Jun 08 01:32:46 ": "I have seriously had my fill of farmland for my life. Always going to be a city boy.", "Mon May 02 03:22:23 ": "@amandapalmer CHACK THE NEWS! YOU MIGHT WANT TO DOUBLE THAT HASHTAG", "Sat May 19 19:25:30 ": "The little ducklings are out to play. http://t.co/xwmBwVR3", "Sat Jun 16 14:55:19 ": "Cedar Point super fun time haaauuuuu!", "Sun Jul 01 04:00:27 ": "This is totally safe http://t.co/alkQ23hs", "Mon May 02 03:57:53 ": "@dcorsetto I think it's okay to take tonight off. Nobody's gonna hold it against you. Tonight is one for celebrating.", "Sat Dec 01 12:35:25 ": "RT @adultswim: Dexter's Lab fans: is there still interest in seeing the lost unaired episode? Let us know. #DextersRudeRemoval", "Tue May 24 23:42:39 ": "@peprally Well, as one who enjoyed Dragon Ball immensely (much more than DBZ) I don't mind that at all.", "Thu Sep 20 04:46:13 ": "@DinosThirdTwitt Now!", "Sun Mar 18 23:38:52 ": "Join the #KorraNation movement! Like #TheLegendofKorra to unlock the premiere online before it airs: http://t.co/cyHzXqZB", "Tue Aug 02 06:21:33 ": "@GailSimone BECAUSE WE ARE SSSSSSSSHHHHHHHHEEEEEEEEEPPPPPPPPP!", "Wed Jun 15 13:31:44 ": "@GailSimone You see, it would help if DC told us there are other books planned besides the initial 52. Might help qualm some nervousness.", "Sat Apr 30 07:58:28 ": "@nickspencer http://bit.ly/j8zmHP Should let you know your story has been leaked. So I would start preparing for the fallback now.", "Sun Jun 05 12:48:09 ": "RT @DoctorWhoTweet: RT if your River Song theory did turn out to be correct.", "Mon Aug 22 17:01:46 ": "@GailSimone Obsidian from DC. I always found him pretty interesting.", "Wed Jun 15 05:44:53 ": "RT @jimlee00: But if you want a quick personalized Green Lantern avatar--RT \"FOR THE CORP #GreenLanternMovie\" & I will knock out 3 of em ...", "Fri Apr 29 11:07:13 ": "If you can't beat them, inseminate them.#arthurcurrysfishsack", "Wed Jun 15 05:45:15 ": "@jimlee00 Gonna give it a shot!", "Tue Jul 26 08:24:06 ": "@JamesDRobinson big wrench into your Starman run where the JSA legacy it held was a major piece.", "Wed Nov 09 10:25:05 ": "@GailSimone Too bad the higher ups keep treating all aspects of the industry as a competition and limiting their resources.", "Wed Sep 19 04:55:30 ": "@DinosThirdTwitt little bit but we're almost there", "Thu Jun 14 14:32:27 ": "Decided to go to the Cleveland Zoo today. http://t.co/bs93riRO", "Fri Jun 03 05:58:43 ": "@jimlee00 I trust you on the costumes man they're looking pretty good. Just don't pull something like OMD on us please. I wouldn't take it..", "Tue Jun 07 23:24:06 ": "Truthfully, I'd like to see a team with Cass as Black Bat, Steph as Batgirl and Barb as team leader/mentor. #mychoiceforbatgirl (team)", "Tue May 17 01:07:20 ": "@neilhimself Link to this and just say \"All the above\". http://en.wikipedia.org/wiki/Neil_Gaiman_bibliography", "Tue Jul 26 08:22:52 ": "@JamesDRobinson Hey James, when can we find out where Shade fits into continuity? Since the JSA are \"benched\", this kind of move thows a -", "Mon May 02 03:33:57 ": "RT @AyeQue: “@HeyItsLiam: FOX NEWS' TAKE: \"African American Male in Washington Confesses to Murder of Elderly Man.\"” #fb", "Fri Aug 19 03:35:48 ": "@Scott_DeWitt Scott, do it for our imaginary babies!", "Tue Apr 10 15:54:53 ": "God damn sleet. At least it gets me off of landscaping early.", "Sat Jun 25 18:49:42 ": "@KurtBusiek New one is a she form the looks of the previews.", "Thu Oct 20 03:35:43 ": "http://t.co/pPFqfd71 - @beatonna I&#039;ll take 20!", "Sun Aug 14 03:15:00 ": "@BillWillingham You obviously don;t read the Expanded Universe's awesome explanation.", "Mon Jun 06 20:34:28 ": "@dcwomenkicknass http://bit.ly/jlVSOt when american political corectness goes borderline idiotic.", "Thu Jul 21 03:17:11 ": "RT @Wendys: RT for a good cause. Each retweet sends 50¢ to help kids in foster care. #TreatItFwd", "Fri Feb 17 18:49:20 ": "@beatonna I'd fund a Kickstarter of that", "Wed Nov 02 03:17:05 ": "@brubaker I see them. Can't wait!", "Tue Nov 08 05:17:35 ": "@pattonoswalt Ha. Comic book reference.", "Thu May 12 01:07:53 ": "@bryanQmiller Ahh, doesn't matter anyway. Damn my college dorm's basic cable hookup...", "Thu May 19 19:54:40 ": "RT @GuySoft: http://bit.ly/jh29x1 #Anonymous #OperationFreedom now LIVE on @AJEnglish @AJstream: http://bit.ly/mNSqw2", "Thu Nov 17 19:16:21 ": "@dcwomenkicknass Wow, I'm real happy you didn't seriously do that switch to Marvel when the nu52 was still brewing. They again prove they-", "Wed Sep 19 03:46:22 ": "@DinosThirdTwitt You got an hour", "Sat Sep 15 04:46:11 ": "@DinosThirdTwitt Opening starting now", "Wed Apr 20 15:59:55 ": "RT @NessunoAnon: In case you live under a rock or something ED is back: http://www.encyclopediadramatica.ch #Anonymous #ED #Encyclopedia ...", "Wed Feb 08 00:38:30 ": "WHY IS TAXI BELL SO DAMN ADDICTING?!", "Mon May 16 19:44:14 ": "@dcwomenkicknass I say late 2012. They still haven't even started Gates of Gotham yet.", "Sat Mar 17 23:51:36 ": "THIRTY MORE FUCKING DAYS", "Sun May 06 03:08:02 ": "I seriously need to learn about what bars to go to around here.", "Mon Feb 06 00:39:03 ": "AVENGERSSSS!!! Welp my reason to care for the rest of the night just expired.", "Mon May 02 02:53:27 ": "RT @andersoncooper: Cnn reporting bin laden is dead.", "Sun Apr 01 06:23:08 ": "@buenothebear No. Draw Tom please. In commemoration for tonight. Just tonight man.", "Thu Sep 08 06:16:30 ": "@steven_moffat YOU BASTARD! HOW DARE YOU ENJOY LIFE?! YOU GET BACK TO YOUR DESK AND ENTERTAIN US NOW!", "Sun Jul 08 23:14:34 ": "Grillin on the beach like MEN.", "Mon Apr 11 21:21:42 ": "@Paul_Dini The fact that we haven't even gotten freaking Metallo or Bizarro kind of dims the chances. Guess we can only hope and wish.", "Sat May 12 20:17:12 ": "Holy FUCK is it beautiful at the park today. http://t.co/0yodHtAK", "Wed Sep 19 04:46:26 ": "@DinosThirdTwitt Theme starting", "Tue Sep 18 04:46:17 ": "@DinosThirdTwitt Nice bump", "Fri Oct 21 20:54:35 ": "RT @GuySoft: #Anonymous retaliates #OccupyWallstreet http://t.co/pNZieLow Intl Assoc Police and others hacked http://t.co/T8C66c3A #anti ...", "Sat Jun 25 19:48:53 ": "@KurtBusiek ....But...FLAMING BOOOOBIES!", "Fri Apr 22 02:52:22 ": "@peprally Same for me on Chrome and there is nothing about it in the news.", "Mon Jan 23 00:40:50 ": "RT @GuySoft: NEW #Stratfor hacked mails. teaser No 3. #Occupy Movement http://t.co/88pawExb #Anonymous #AntiSec #OWS #Megaupload #WikiLeaks", "Wed Apr 20 01:29:20 ": "@beatonna \"Yer a hero, bub.\" YOU MUST NOW WRITE THIS.", "Mon Feb 06 01:31:04 ": "Next Superbowl halftime should be Clint Eastwood and Morgan Freeman telling America that it's going to be okay. That's how you save a nation", "Wed May 16 21:29:31 ": "WHAT A GLORIOUS DAY TO BE ALIVE. #ToonamisBackBitches http://t.co/VJ70XVlj", "Tue Sep 11 04:59:13 ": "@DinosThirdTwitt Who came up with the pants falling down gag? Always got me.", "Mon Feb 06 01:15:50 ": "Betty White you making everything just swell"}