{"Sat Oct 31 04:01:20 ": "it's not a race, you gaiz. gaiz, it's not a RACE!", "Sun Nov 15 10:23:48 ": "super productive pyjama day ftw! finished ssc, bibliography and all. No one can ever again doubt my powers of doing shit at the last minute.", "Thu Oct 08 07:02:23 ": "internet's screwing up!", "Sat Oct 31 01:42:23 ": "dad has a friend over.", "Sat Oct 24 07:50:41 ": "@makintoshable I think it may be too short notice for my darling mother, but I'll see.", "Sat Oct 10 10:26:52 ": "I want to learn the banjo. really, really badly.", "Sat Oct 10 09:44:19 ": "i REALLY need to tweet more :P", "Mon Oct 19 07:20:33 ": "okay assignment= done. black and white portrait= done. all that's left is colour.", "Sat Nov 14 06:59:57 ": "@haylzajayn btw, what's your translation? I got a rough one, but not too sure it's right.", "Sat Oct 24 06:31:07 ": "@makintoshable I've been meaning to check them out for AGES!", "Sun Oct 03 00:13:47 ": "It was still the holidays so you could do what you liked but it never seemed that great because you knew tomorrow you'd be be back at school", "Sun Oct 11 04:34:31 ": "@xtian95 uhm, music website, where bands post music and gather a fanbase. it's free, so that's always good :P", "Sun Nov 22 01:04:52 ": "hahaaa someone put some crazy religious book in our mailbox. Our theory is they saw dad working on a sunday", "Tue Sep 15 09:14:35 ": "@nikOleey I'm Michelle Obama! we should get married!!", "Sat Oct 31 03:56:48 ": "@rebeccarenton YOU WERE IN AMERICA!!!", "Thu Oct 15 07:51:05 ": "WTH WTH I KEEP KNOCKING OVER STUFF T-T WHAT IS THIS?", "Sun Dec 06 05:54:31 ": "gorgeous is such an ugly word, to describe something beautiful.", "Fri Dec 17 08:33:16 ": "so, who's on the train tomorrow?", "Sat Oct 31 11:12:35 ": "that was the creepiest thing I have ever seen. I won't be able to look in a mirror for WEEKS!", "Thu Oct 08 08:04:43 ": "@nikOleey what?what?what?what?", "Fri Oct 16 12:03:39 ": "D: AGAINST MY WILL,  I AM GETTING OFF THE COMPUTER. GOODNIGHT EVERYONE!", "Sat Oct 10 08:00:52 ": "I agree with @makintoshable 500 Days of Summer was awesome!!", "Mon Oct 05 10:03:41 ": "@rebeccarenton which side were you on?", "Sat Oct 10 02:04:07 ": "guys, I am deffs coming to chermisde. where we meeting?", "Sun Oct 11 03:27:31 ": "#HappyBirthdayGabe", "Sat Oct 31 02:49:03 ": "@rebeccarenton I concur.", "Sat Oct 24 07:50:04 ": "@makintoshable I knew we were eventually going to see a movie, but didn't realise it was still on for this weekend.", "Sat Oct 17 08:38:14 ": "worries herself. I went to the kitchen and mum said hello. I didn't say anything, because I forgot who she was.", "Sat Jul 17 04:01:55 ": "@CocaKolee when you get back from lunch, could you just reply to my email? pretty please c: I can't type enough on twitter :&lt;", "Sat Nov 14 06:44:21 ": "@haylzjayn hoppa ni, chisan tamago ga, arimashita. PON! Tamago kara, aomushi ga, umaremashita.", "Mon Oct 19 06:21:23 ": "I am at 700 words. This is a five minute speech. shiitt.", "Wed Dec 02 05:53:08 ": "ready for Lyd's graduation mass, two hours early. I'm getting better at this.", "Wed Jun 23 01:54:30 ": "@HaylzJayn Hey! just tweeting to confirm I shall be at your house today, should it still be on.", "Tue Sep 15 09:13:07 ": "@NikOleey yeah, probably. lol. It said I was Hannibal Lector :P", "Tue Sep 15 09:07:08 ": "which reminds me. for no reason. @haylzjayn have you taken the personality test?", "Sat Oct 31 03:55:28 ": "@rebeccarenton GO! BEFORE IT'S TOO LATE.", "Tue Dec 15 04:48:50 ": "I am loving all this rainy weather!", "Sat Oct 24 07:44:23 ": "@makintoshable ... we were going to the movies tomorrow?", "Sat Oct 10 02:04:45 ": "@makintoshable my sister's in your pc!!!!!", "Sun Oct 18 08:04:39 ": "Dad got some little bats for halloween. I'm excited.", "Sat Oct 31 11:14:35 ": "and now, for something COMPLETELY different, Dusk Till Dawn and then Interview with the Vampire", "Mon Oct 19 10:48:09 ": "@rebeccarenton did we have to discuss colour in this?", "Tue Sep 15 09:09:13 ": "@haylzjayn yeah, that's normal. because we're still developing personality or something. what did you get?", "Thu Oct 29 09:41:27 ": "watching Glee. that Terri's sister NEVER fails to make me laugh", "Sat Oct 31 03:54:30 ": "@rebeccarenton for serious.", "Wed Oct 28 02:10:32 ": "It feels like friday.", "Sun Oct 11 04:31:41 ": "the weather's so nice today &lt;3", "Fri Dec 17 08:44:55 ": "@AgentAmplified Mak! Cool, I shall dm you for more. and digimon. oh my god. nostalgia, right there.", "Fri Oct 16 11:06:16 ": "@rebeccarenton it's like the RULE of movies!", "Sat Oct 31 11:16:08 ": "@rebeccarenton Room 205 Holy shit. There was this woman who died, and her soul got trapped in the mirror in her bathroom -shudder-", "Sat Oct 31 04:01:49 ": "I &lt;3 Ashleigh. for serious", "Sat Nov 14 07:11:06 ": "@haylzjayn haha, cool! here's the fixed version: happa ni chisan tamago ga arima shita. PON! Tamago kara aomushi ga umare mashita.", "Sat Oct 31 02:44:14 ": "@rebeccarenton we sound like middle aged mothers with their seven year old sons :/", "Sun Oct 18 08:59:13 ": "@rebeccarenton .... I would not go into that room if you paid me.", "Sat Oct 31 11:21:17 ": "@rebeccarenton also, so you can't say I never tell you when good things are on, Interview with the Vampire is REALLY good, not scary.", "Sun Oct 03 00:09:47 ": "Colin Thompson sums up my feelings about today exactly.", "Mon Oct 05 10:32:46 ": "@rebeccarenton I would!!", "Sun Oct 11 06:06:40 ": "is in one of those moods where you want to do something, but can't figure out what", "Fri Oct 16 11:03:28 ": "WALKS OUTSIDE TO WATCH LOVE ACTUALLY. DAD WALKS IN. SEX SCENE COMES ON.", "Sat Oct 31 03:47:59 ": "@rebeccarenton I saw this beatles documentary called A Hard Day's Night, thought of you and smirked.", "Sat Oct 10 09:46:09 ": "looking through indie bands on myspace. I should do this more often.", "Fri Oct 30 09:10:10 ": "@makintoshable really? haha, that sounds so weird even though it's normal. I've always been like, HOLY SHIT IT'S A BUG HOW CUTE. lol", "Sat Oct 10 10:31:37 ": "@rebeccarenton I'm totally going to do it. not even kidding. I'll get an el crappo one while I'm learning. I am determined.", "Sun Dec 06 06:05:55 ": "@makintoshable get well soon, Mak!", "Sat Oct 10 09:50:20 ": "dancing as badly as I could in the kitchen, singing all the single ladies. mum crashed my party.", "Mon Oct 12 06:29:47 ": "@NikOleey for serious!? I forgot my planning sheet at school. last minute draft, here we come!!", "Fri Oct 30 06:32:49 ": "Why am I such an idiot?", "Tue Sep 15 09:16:38 ": "@nikOleey @haylzjayn you two may have your sights set high, but I'm happy with UQ", "Sat Oct 31 09:35:20 ": "watching a danish horror film with dad, to make up for my sad lack of trick-or-treating", "Sat Oct 31 03:59:45 ": "@rebeccarenton and have been able to defy time.", "Sun Nov 15 10:24:12 ": "and it's actually pretty good (Y)", "Sun Oct 11 06:11:12 ": "@makintoshable -hand up-", "Tue Dec 01 08:13:49 ": "sad realisation: I use my free time to look up cat videos", "Sun Oct 11 04:28:27 ": "@xtian95 you could get a purevolume. good exposure, there.", "Mon Oct 19 05:36:02 ": "@rebeccarenton it's due tuesday; we have to hand it in during house group", "Fri Oct 30 06:16:51 ": "... I left the things I need to study at school. exam's on Monday... fuuuuck", "Sat Oct 17 07:45:40 ": "stabbed her hand with a compass. owwww!", "Fri Oct 30 09:05:07 ": "In my household, my job is to re-introduce beetles back into the wild after they come into the house.", "Tue Sep 15 09:13:33 ": "@haylzjayn you're one letter different to me! I'm INTJ", "Sun Oct 25 02:08:45 ": "I have a chocolate muffin. You are jealous", "Sat Oct 31 11:14:54 ": "I love Halloween :D", "Sat Oct 31 03:01:13 ": "I could be convinced to do anything, provided you have enough chocolate milk", "Sat Oct 24 06:10:53 ": "People, I need some new music. Open to all suggestions.", "Tue Oct 13 07:03:49 ": "update:massive fucking storm. lightning hit house 1 street away. power went out. assignment to do no computer in five minutes and counting.", "Fri Oct 16 12:03:50 ": "why do i keep all-capsing?", "Mon Nov 09 11:02:31 ": "@rebeccarenton no way josé", "Sat May 08 01:52:21 ": "HELLO PEOPLE. WATCH NINE OR SEVEN NEWS TONIGHT. MY HOUSE IS ON TV!!!", "Tue Sep 15 09:31:27 ": "@rebeccarenton I know. my favourite: \"who needs kids when we can adopt cats from the alley behind our house\"", "Sat Oct 17 07:55:26 ": "@rebeccarenton has anyone ever told you that you're really creepy?", "Mon Oct 05 10:33:06 ": "and that's my last tweet. Night all!", "Sun Oct 11 05:51:47 ": "figuring out formspring. its confusinggg, but I'm gettting there", "Sun Oct 11 06:17:49 ": "@rebeccarenton high five! tis vairrr frustrating, no?", "Fri Oct 16 11:53:15 ": "I'm in the mood to stay up all night, and act really, really stupid.", "Mon Nov 09 09:55:03 ": "on twitter! but not for long. just thought I'd share that I've finished designing my mask for art. yayay", "Sun Dec 06 05:49:51 ": "Beauregard hates his toothbrush", "Sat Oct 31 03:53:31 ": "@rebeccarenton you have to see Help. I'm not even a big fan of the Beatles and I think that movie wins life.", "Sat Nov 14 06:57:37 ": "@haylzjayn I just proof read it and I spelt LOTS wrong. but yeah. no problemo!", "Sat Oct 10 10:30:40 ": "American dad! fuckyeah!!", "Wed Jun 23 06:47:21 ": "Have finally checked my emails and would like to thank everyone here for the lovely birthday messages! I know I'm a *tad* late but ily all!", "Sat Oct 31 03:41:22 ": "Back from the video store with An Inconvenient Truth and A Crude Awakening for english.", "Sat Oct 31 08:57:47 ": "my sister has gone trick-or-treating and I am here at home, because I have no one to go with. sad face."}