{"Mon Apr 15 11:37:29 ": "RT @MikeScanlanLPGA: My wife @j_scanlan has titled this playoff \"Angel vs. Angel Face.\" I think she is cheering for Angel Face but canno ...", "Tue Apr 02 20:21:07 ": "RT @BBCBreaking: Football's governing body Fifa awards contract to provide goal-line technology to German firm GoalControl - via BBC's @ ...", "Tue Mar 26 18:48:59 ": "@lbshaw @AISTS_Sport Nice profile Bradshaw! Thanks AISTS for pulling this together, it looks terrific! :)", "Mon Apr 15 17:53:11 ": "RT @bencranegolf: Popular question: What would an ave golfer shoot at Augusta? I'd say an 8 handicap would shoot 100. Fine off tees but  ...", "Mon Mar 11 11:08:38 ": "RT @dougferguson405: Tiger has 40 wins on seven courses: Torrey (8), Firestone (7), Bay Hill (7), Muirfield Village (5), Cog Hill (5), D ...", "Tue Mar 19 18:52:15 ": "RT @BBC_TopGear: F1 legend Juan Manuel Fangio’s actual 1954 race-winning Mercedes F1 car is coming up for auction... for around £5m http ...", "Sun Apr 14 08:25:08 ": "RT @GolfChannel: #Masters Quotes -&gt; Bubba Watson: \"If I see somebody do a rules infraction, I don't know which number to call.\": http ...", "Sun Mar 31 17:50:50 ": "Thanks @vizify for your wonderful tool, I love my online bio and the #vizcards are wicked! https://t.co/iCpgsPcWOJ", "Mon Mar 25 11:49:19 ": "Funny how fickle we are, suddenly the golfsphere is all about Tiger Woods (again) while #anchoredputting and #antlerspray remain unresolved", "Mon Apr 15 10:43:54 ": "RT @PGA_com: A Lesson Learned: PGA's @MichaelBreed explains what you can take away from the #Masters: http://t.co/e60q1Qr2ge #pga #golf", "Mon Apr 15 20:20:51 ": "RT @bostonmarathon: There were two bombs that exploded near the finish line in today's Boston Marathon. We are working with law... http: ...", "Wed Apr 10 16:59:53 ": "RT @AISTS_Sport: #MSA2013 taught by @DrSportSante directly in Lausanne Hospital (CHUV) today. Topic: Physical Activity Promotion, VO2 ma ...", "Tue Mar 12 20:44:35 ": "A must see: they're at it again! Golf Boys - \"2.Oh\" (Official Video): http://t.co/RU36Pqh5nU via @youtube #golf #golfboys", "Wed Mar 27 12:32:43 ": "RT @GolfDigestMag: Winning can take care of many things, but some are questioning the wording of Nike's newest Tiger ad: http://t.co/SoO ...", "Fri Apr 12 11:50:26 ": "RT @GolfDigestMag: Jack: \"I never really had a conversation with Tiger that lasted more than a minute or two, ever.\" | http://t.co/rerfw ...", "Fri Mar 01 16:23:46 ": "RT @PGATOUR: Updated: Rory McIlroy's statement about his WD from the #HondaClassic - http://t.co/WnVeTe5S0D #pgatour", "Thu Feb 21 11:54:36 ": "RT @IanJamesPoulter: It's now snowing again... It's very pretty. That's it. Not very constructive or productive for golf.", "Mon Apr 15 11:34:20 ": "RT @SkySportsGolf: Adam Scott says caddy Steve Williams \"was my eyes\" for his winning putt. Williams said it broke \"at least two cups\".", "Mon Feb 25 22:01:46 ": "RT @IanJamesPoulter: Ask any players that's played for 3 or 4 spot. Once you can't win it the tournament is over. Or they're lying. Anti ...", "Sat Apr 13 06:23:38 ": "RT @bubbawatson: Made the cut! But over 5 hours to play golf the 1st day and 5 &amp; half hours on 2nd day!! #SlowPlayIsAProblemInGolf", "Fri Mar 08 09:33:22 ": "RT @LETgolf: Latest news - Celebrating the mums on tour for International Women’s Day. Full story here:... http://t.co/qXb2YkfYeR", "Fri Apr 12 21:59:33 ": "RT @SkySportsGolf: Fred Couples was asked how come he's so cool. Said: \"I'm cool but can be a jerk too. I'm a cool jerk.\"", "Fri Apr 05 14:29:26 ": "@rachelamevans It's all good thanks -- but when are you coming to visit? Bring your golf clubs :)", "Wed Mar 27 12:34:22 ": "RT @TheDailyShow: #TDSBreakingNews Tiger Woods' new ad says, \"winning takes care of\neverything.\"Americans forced to swallow anger, admit ...", "Sat Apr 13 15:15:03 ": "RT @PGATOUR: [OFFICIAL] Tiger Woods assessed a 2-shot penalty for taking an improper drop on No.15 in Round 2. Now stands at -1, 5 shots ...", "Tue Feb 26 14:21:46 ": "Currently reading up on Tim Finchem's comments on the anchored putting ban: http://t.co/ujgkKymlVv #golf", "Wed Mar 20 12:25:10 ": "RT @KellyTilghmanGC: 2014 Ryder Cup captain Tom Watson is changing US selection process to 9 automatic spots, 3 capt.picks (it's been 4  ...", "Mon Apr 15 17:39:14 ": "RT @ConservationOrg: If you see a tweet that says #EarthDay is in a week, don't believe it. Earth Day is every day.", "Tue Feb 26 10:03:30 ": "RT @coursera: Learn more about Coursera's 4 new Asian Universities: http://t.co/VOHN0b3fFj @Univ_of_Tokyo, @NUSingapore!", "Mon Apr 15 20:26:51 ": "Thoughts are with all our friends at #Boston #Marathon, #shocking #speechless #PrayforBoston", "Wed Mar 13 21:26:42 ": "RT @bencranegolf: Golf Boys \"2.Oh\" went over 3 million views in its 1st week. Thanks for having fun w it and THANKS for supporting @char ...", "Wed Mar 13 21:23:12 ": "RT @BBCBreaking: New #Pope shows \"strength &amp; vitality\" of Americas, says President Obama http://t.co/9GYUHFCXEA - Pope Francis profi ...", "Tue Mar 26 12:15:00 ": "RT @BBCBreaking: Scottish government approves wind farm development off Aberdeenshire coast in face of strong opposition from US busines ...", "Thu Mar 14 19:03:18 ": "@AISTS_Sport @michaelrpayne1 thanks for all the candid insights, a fascinating view into the inner workings of the IOC #olympics", "Mon Apr 01 08:39:40 ": "RT @PGA_com: Henrik Stenson, Fredrik Jacobson + Richard Sterne get into Masters, no matter how Houston Open finishes http://t.co/1BrFk69 ...", "Wed Mar 13 21:28:17 ": "RT @j_freedland: Brilliant RT @jonnygould: The new Pope's an Argentine. Clearly the hand of God was involved.", "Tue Mar 26 18:46:25 ": "RT @AISTS_Sport: New AISTS #MSA2013 Participants Profile Brochure Out! Brochure available online at http://t.co/tk0C57Euyc #futuresportm ...", "Sat Apr 13 15:12:48 ": "RT @43BH: A lot of talk about the TW 2 shot ruling . What do you think ? Should he WD himself ?", "Wed Apr 10 16:57:36 ": "@DrSportSante explains as @lluiscantarell is the guinea pig doing a VO2 Max test part of the #MSA2013 #sportmed class http://t.co/LwsfF4PR6G", "Fri Apr 05 14:27:08 ": "@jeffcutlerstamm @vizify Personally I am looking for work in sports management, so some sports vizcards would be great! :)", "Sat Apr 13 06:23:56 ": "RT @Graeme_McDowell: What message are we trying to send out to the world giving the 14 yr old kid a shot penalty today? It was a 6 hr ro ...", "Sat Apr 13 06:24:19 ": "RT @IanJamesPoulter: First missed cut in 20 months. First missed cut at Masters. Drove it terrible for 2 days &amp; didn't hold any putt ...", "Tue Apr 09 10:53:19 ": "RT @DrSportSante: #AISTS physical activity promotion lecture tomorrow please watch '23.5 h video' #PApromotion http://t.co/TpTpkXnuef", "Thu Feb 28 10:46:45 ": "RT @lbshaw: Physics of Sport! #AISTS #MasteringSport #MSA2013 http://t.co/rj6WT28YvC", "Mon Feb 18 12:12:17 ": "Currently reading: \"Where Golf's Growth Model Went Horribly Wrong\" http://t.co/tCXpI8Cn #golf", "Tue Apr 09 10:40:35 ": "@rachelamevans Very cool :) Didn't know you were a cycling fan! ;)", "Sun Apr 07 19:32:46 ": "RT @DrSportSante: Pls RT: prezi on NCDs and what we need to do about it, globally http://t.co/sqbw7Utydf @sandrodemaio #action #NCDs #do ...", "Mon Feb 25 21:50:38 ": "RT @LETgolf: Find updated Women's World Golf Rankings here: @suzannpettersen best EU player #7 followed by Catriona Matthew... http://t. ...", "Tue Apr 02 20:25:47 ": "RT @TIME: William Shakespeare was a ‘ruthless’ businessman, a study claims | http://t.co/4Udsw3oICR (via @TIMENewsfeed)", "Tue Mar 26 10:05:54 ": "RT @AISTS_Sport: #MSA2013 participants @ Geneva event 'Grande Soirée Russe' where #sport dev &amp; youth involv discussed w/ sport legen ...", "Mon Apr 15 16:38:59 ": "We are at the \"Preparing for a Digital Future\" conference by @AISTS_Sport #MasteringSport #MSA2013 #AISTS http://t.co/pVPOLKpiQn", "Thu Apr 04 16:29:10 ": "RT @JesperParnevik: Just received an invitation from the Swedish King and Queen to attend Princess Madeleines wedding this summer.VERY H ...", "Fri Mar 08 09:25:23 ": "RT @Olympics: Happy International Women's Day! RT this to spread the word. #women #olympics http://t.co/S32fV166sT", "Sat Apr 13 15:18:29 ": "RT @KellyTilghmanGC: Bottom line: Tiger Woods broke rule unknowingly, not intentionally. Rule change protects player from DQ if scorecar ...", "Tue Apr 09 09:12:57 ": "RT @GolfChannel: Anchoring Update: No imminent news to report on proposed anchoring ban -&gt; Blog: http://t.co/wonIpm8CgU", "Fri Apr 05 14:27:51 ": "@NikitaTMitchell @vizify See https://t.co/UZhwrwUHrS :)", "Mon Apr 15 17:25:00 ": "@luefkens Thinking about your wisdom as I attend a conference on #digitalmedia in sports organisations! :)", "Mon Apr 15 16:59:31 ": "“@GlobalGolfPost: No LPGA event last week, but Stacy Lewis lost her #1 rank to Inbee Park. http://t.co/oV4JW5j1sk” Weird!", "Fri Apr 12 19:48:59 ": "RT @garywilliamsGC: After that interview, there's a new favorite player in golf.", "Sun Apr 07 19:32:29 ": "RT @DrSportSante: #AISTS Sports medicine class to begin tomorrow: global health topic in intro, students have a look at this http://t.co ...", "Sat Apr 13 06:24:55 ": "RT @KellyTilghmanGC: 53 YO Fred Couples in final group for 2nd straight year at #Masters. 14 YO Tianlang Guan makes cut on number #ageis ...", "Mon Apr 01 08:36:21 ": "RT @henrikstenson: Thanks for all your nice messages! So happy with my game this week. Great to be back in the top 50's and to play The  ...", "Tue Mar 19 19:00:31 ": "I absolutely love this article and couldn't agree more on the Range Rover and why I want one, but the old version: http://t.co/Y3O7eBvjQp", "Sat Apr 13 17:41:51 ": "RT @IanJamesPoulter: Not commenting on the incident. The Game we play is played with #Honor #Respect #Dignity #Honesty &amp; a Rule Book ...", "Tue Mar 26 18:47:41 ": "My awesome classmates and I are in the #MSA2013 brochure which just came out today: http://t.co/8ICj89fZGQ", "Wed Apr 10 16:58:51 ": "RT @DrSportSante: #AISTS students exhausted me with great Q&amp;debate from PAprom to VO2m testing. Love #sportsmedicine. Thanks guys! h ...", "Wed Apr 10 16:59:46 ": "RT @AISTS_Sport: We already know our #MSA2013 participants are fit, we just like to give them an extra bit of knowledge in #sportmed. ht ...", "Fri Mar 08 09:34:07 ": "RT @IanJamesPoulter: Great days work at Doral. -4 nicely in position. Game feels great, putts feel like they have a chance on every hole ...", "Fri Mar 08 09:37:25 ": "Reading: Why career women need sponsors. #HowWomenSucceed | http://t.co/uBuSahTj33 via @TIMEIdeas #InternationalWomendsDay", "Mon Apr 15 10:54:14 ": "Everyone should read this &amp; plan accordingly: What The Most Successful People Do With Their Weekends http://t.co/SYieoAMN9Q via @HuffPostOWN", "Sun Apr 07 19:44:45 ": "RT @NickGerman1: Massive thanks to @Coelsss for working with @SkySportsGolf today. Future presenter without a doubt #nowwinthemasters ht ...", "Mon Apr 15 20:17:12 ": "RT @AISTS_Sport: Fantastic atmosphere this evening for  AISTS Open House on #DigitalMedia opportunities for IFs w/ speakers @YouTube @AF ...", "Tue Apr 02 20:24:24 ": "RT @AISTS_Sport: Congratulations to our #MSA2013 participant Toni Wilhelm with his recent win at the #ISAF Sailing World Cup in Palma! h ...", "Mon Feb 25 21:51:14 ": "RT @EuroTourNews: European Tour likely to back R&amp;A and go against American players on belly-putter ban http://t.co/aT67h4divb", "Wed Mar 20 11:37:43 ": "RT @MrJamesMay: A very charming Italian woman drove into the back of my Rolls-Royce yesterday. #MonumentaleAggravatione", "Tue Mar 05 12:56:52 ": "@afduran hey thanks, http://t.co/jmmsvTaJc6 if you're interested! :)", "Fri Mar 15 22:06:49 ": "RT @MichaelRPayne1: #AISTS gave the annual lecture to 50 aspiring sports management students.Very sharp, focused &amp; challenging quest ...", "Mon Apr 15 20:17:22 ": "RT @BBCBreaking: Two dead in #Boston #Marathon explosions and more than 20 injured, police say http://t.co/AVL28ZcPe4", "Wed Mar 27 12:23:01 ": "'Ogooglebar' and 14 Other Swedish Words We Should Incorporate Into English Immediately http://t.co/WiZyYeWYmL", "Sun Apr 14 08:22:15 ": "RT @GolfChannel: You Oughta Know: Only 3 times in the last 22 years has the #Masters winner not come from Sunday’s final twosome: http:/ ...", "Tue Apr 09 09:17:32 ": "@rachelamevans What?! You're there?? No way!", "Sat Apr 13 06:26:24 ": "RT @GolfChannel: Economics: Tiger Woods’ impact on golf equipment industry may be overstated, according to TaylorMade-Adidas CEO: http:/ ...", "Tue Apr 09 09:51:49 ": "Loved this! #biathlon #jamesbond http://t.co/Y0bV1osO76", "Sat Apr 13 06:25:47 ": "RT @plarrazabal: cant say that the penalty to Guan was unfair. The only thing i can say is that many of the people out there are slow an ...", "Sat Apr 13 15:18:15 ": "RT @GlobalGolfPost: Reactions are mixed on Tiger ruling. Favoritism for Tiger or fairness of the rules?", "Wed Feb 27 20:11:15 ": "RT @GolfChannel: [Update] Tiger stands firm on position against anchoring -&gt; Blog: http://t.co/P0os13rM3u Video: http://t.co/9xhhHRXWnE", "Mon Apr 15 11:34:00 ": "RT @KellyTilghmanGC: With Masters win Adam Scott vaults to no.3 in the official world golf ranking, behind Tiger Woods (1) and Rory McIl ...", "Sat Apr 13 17:42:02 ": "RT @StuartAppleby: If Masters chatted to Tiger before signing his card and the evidence at the time suggested no Penalty then that's fin ...", "Fri Apr 12 19:49:10 ": "RT @PaulAzinger: The last time a player was penalized for slow play on the PGA Tour was 1995. Guan was born in 1998.\n#Espn\n#Masters", "Tue Mar 19 12:17:56 ": "Timely for class on sponsorship agreements: Golfer Garcia Ordered to Pay More Tax on Endorsements http://t.co/wvbbltumpl via @BloombergNews", "Wed Apr 17 07:03:57 ": "RT @BostonMarathons: For each RT this gets, $1 will be donated to the victims of the Boston Marathon Explosions. #DonateToBoston", "Mon Mar 11 11:08:24 ": "RT @PGATOUR: WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW #TigerWoods", "Fri Mar 08 09:34:58 ": "RT @TIME: Don't hate her because she's successful: An exclusive interview with Sheryl Sandberg of Facebook | http://t.co/WE0TQAOeQ2 #How ...", "Tue Mar 19 12:30:45 ": "Currently reading @GlobalGolfPost http://t.co/e0BtYqAWMe #golf #doping", "Wed Feb 27 20:09:49 ": "RT @CadillacChamp: It's official - all 50 of the WGR Top 50 players in the world have committed to the @CadillacChamp. #WGCDoal #Cadilla ...", "Mon Apr 01 08:37:04 ": "RT @ANordqvist: Happy to see fellow swede @henrikstenson finish good and make it to the Masters!! #gosweden", "Mon Feb 25 21:50:22 ": "RT @GolfDigestMag: PGA Tour, about USGA's proposed anchoring ban: \"We feel strongly that going down that road would be a mistake.\" http: ...", "Mon Apr 15 20:41:38 ": "@luefkens @StephNass75 My key takeaways: dedicate resources to content curation &amp; track audience demographics #digitalmedia #masteringsport", "Wed Mar 27 12:03:03 ": "RT @GHeinen_LHF: Last year: almost no vacation, next year: certainly no vacation. This year: only one week and its in 2 days :-D :-D", "Tue Apr 09 14:07:55 ": "Thanks for this article! Simon Veness is baffled by the eagerness of pundits to hand Tiger Woods another green jacket http://t.co/feTx0iwT9A", "Tue Apr 09 13:32:19 ": "RT @henrikstenson: For those of you who speak Swedish...... http://t.co/R1wXFm4wZo"}