{"Tue Oct 16 16:18:06 ": "RT @edyong209: @ChuckWendig Wait, I survived Monday and my prize is... fucking TUESDAY? This is BULLSHIT.", "Sun Apr 25 17:43:40 ": "Taste:Smoke and Liquor, Smell:Smoke and Liquor, Feel: Thump of Musik, Hear: Talking and Musik! See: SUCH PRETTY LIGHTS!", "Sat Jun 19 04:41:03 ": "My teeth are numbed, this is most curious a feeling.", "Fri Apr 29 22:36:26 ": "RT @AndrewWK: PARTY TIP: Make out with the inside of your own mouth.", "Thu Apr 29 23:11:53 ": "They say I set the status in 1952.", "Mon Jul 26 21:04:34 ": "Maybe it's easier to do without words.", "Fri Jan 08 03:56:51 ": "My curtains are lined with electricity.  Just in case.", "Thu Apr 22 18:05:14 ": "Seventeen glorious days of this psychosis left.", "Tue Jun 08 01:09:51 ": "Here's my heart, kthnxbai.", "Mon Nov 02 06:55:20 ": "I have a handful of silver screws.", "Thu Jan 07 05:03:39 ": "Deadmans winking at me through the window.", "Tue Sep 04 23:43:04 ": "@MLanzalott A mans work is never done.", "Tue Nov 02 23:39:42 ": "@swimbunny eastern standard, what about you?  Also you can do it!", "Tue Sep 04 23:40:14 ": "@MLanzalott You can afford something so shiny on a wal-mart wage?!", "Wed Jun 30 23:45:05 ": "Woke up without Pants, not completely sure why.", "Tue Apr 09 19:19:55 ": "bastard.", "Sat Jan 08 03:27:28 ": "RT @AndrewWK: PARTY TIP: It's Friday night. Let's get blasted. It's completely party hard time.", "Tue Mar 16 08:51:26 ": "Boozlabam.", "Mon Oct 19 11:33:59 ": "So this is what it's like to wake up in the morning, instead of staying up to it.", "Sun May 16 10:15:17 ": "I want a girl that I can call Wolverine after a night of good sex.", "Mon Aug 30 10:39:15 ": "Have we already deteriorated to the level of dumb beast?  Hard to say.", "Fri Jun 25 22:24:58 ": "I'm on merry mound road!", "Mon Mar 15 07:50:55 ": "Insomnia isn't the same without my best mates to enjoy it with.", "Fri Jun 11 21:44:26 ": "So, sitting in the middle of a twelve mile traffic beast, consodering peeing in a bottle just to see if I can do it while driving.", "Mon Mar 15 07:08:04 ": "@AcinarSun You should of actually been on the futon at the time.", "Thu Jun 03 21:33:37 ": "Sat staring at the sky in the rain today for about fifteen minutes, still no sign of god.", "Tue Oct 27 19:13:07 ": "that didn't last long", "Tue Jun 01 20:50:03 ": "Siting in one of the most highbrow offices I've seen, fuck they're even playing classical music, not Bach or Beethoven.  I'm so screwed.", "Tue Nov 02 19:20:57 ": "#nanowrimo 3k!", "Mon Jul 12 02:35:07 ": "grapes, delicious omega brain foods.", "Thu Jul 15 00:13:22 ": "Eat Bitches, Fuck Money.", "Tue Nov 10 19:10:34 ": "?", "Thu Feb 24 02:15:01 ": "RT @AndrewWK: I'm buying you + your friends a round of drinks. Retweet this message and I'll send the winner $40 cash to spend on partying.", "Tue Nov 02 18:19:13 ": "#nanowrimo Daft Punk, if listening to you makes my story come out with robots I'm gonna be very displeased.", "Mon Jan 18 04:11:17 ": "goodbye forever.", "Thu Oct 08 22:16:46 ": "Planet Hulk?  Should of called it The Incredible Sulk.", "Mon Jul 12 20:59:48 ": "You know, you're kind of beautiful, in a way.", "Thu Dec 17 19:15:29 ": "I've gotten pretty good at unscrewing things.", "Wed Oct 14 08:59:12 ": "Itsy Bitsy Spiders.", "Sun Jun 06 17:13:05 ": "Nearly dropped my grandmother, I never would have been able to live with myself if I had.", "Thu Feb 17 03:29:43 ": "Do something.", "Tue Nov 02 23:00:10 ": "@swimbunny Still 3710, I'm calling it a day for now.", "Tue Jan 05 09:06:30 ": "Some Hebrew bitch once said something of importance, I'm sure of this.", "Sun Aug 26 00:58:34 ": "The shower head in my new apartment has two settings.  One is off, the other is fuck you I wanted to be a fire hose.", "Fri Jan 18 19:46:05 ": "@MLanzalott http://t.co/HMM9cAAt\nHere is a cinematic gem, that nobody should miss.", "Tue Aug 28 00:09:20 ": "I wonder how many people would still be my friends if I changed my auto correct to make me sound more like Thor...", "Mon Apr 26 17:12:09 ": "#dearsummer I miss you very much.  I hope to see you very soon, so I can turn my perception of the world inside out.  Love nick.", "Tue Apr 09 16:46:17 ": "@MLanzalott Awesome about the rehab!  I'll be heading back out your way this summer.", "Thu Jun 24 02:01:10 ": "Sometimes standing up and getting a blistering dizzying sort of headrush is all I need to pass the day away.", "Tue Apr 09 04:43:15 ": "@MLanzalott Have you been watching Game of Thrones?!", "Fri May 28 21:03:20 ": "Kill me now, and I will love you forever.", "Sun Nov 15 21:13:54 ": "Zebras are natures scene kids.", "Thu Jul 01 08:04:32 ": "I'm swimming in my own head!", "Fri Mar 26 08:02:07 ": "Will I be remembered for the awful things I've done, or the wonderful things I tried to do?", "Mon Jan 04 21:13:05 ": "#bewareof Assholes using all the hot water, and then leaving you none.", "Mon Feb 18 03:44:49 ": "@MLanzalott Have you read any of Ultimate Fantastic Four?  The first couple arcs are outstanding, and as always Doom is amazing.", "Fri Oct 09 18:52:02 ": "I've come to chew bubblegum and kick ass, and I'm all out of gum.", "Thu Oct 08 09:16:40 ": "Going, Going, GREEN!", "Wed Nov 03 21:08:58 ": "@swimbunny #nanowrimo #motivation 4440 now, easier then I thought it would be!", "Thu Nov 05 06:34:45 ": "ALL HAIL HER MAJESTY!", "Tue Nov 02 21:02:09 ": "@swimbunny I need a #nanowrimo buddy!", "Thu Apr 15 01:17:16 ": "The time for maturity, is fucking gone.", "Mon Nov 01 22:09:37 ": "#nanowrimo Nearly to 1k.", "Wed Sep 15 10:15:47 ": "You know, it surprises me you're the moon to my own sort of peculiar lycanthropy.", "Wed Nov 03 20:00:41 ": "#nanowrimo trying hard to find the motivation to write right now.", "Fri Apr 30 18:10:15 ": "I haven't been this excited since I lived on Elm Street!", "Sun May 09 18:58:00 ": "Be Someone.", "Sun Aug 26 01:13:12 ": "End Wal-Mart before it becomes an intergalactic menace.", "Sat Jul 17 10:23:27 ": "Partied for your sins last night, you are welcome.", "Tue Sep 04 23:40:34 ": "@MLanzalott I also may have sprained my hand.", "Wed Dec 02 18:08:55 ": "@murphymachine To Crush your Enemies, See them driven before, and hear the lamentations of their women.", "Sun Jun 20 12:25:59 ": "Noticing a severe lack of electrical outlets here, especially three pronged ones.", "Fri Apr 02 08:19:31 ": "They call me the Bearrorist, and I just released ninety two grizzly bears filled with deadly explosives in an orphanage near you.", "Tue Jun 15 19:46:21 ": "I'm happy my shoes didn't set off that metal detector can't say the same for that ladies tits.", "Fri Mar 01 17:26:53 ": "@MLanzalott @EdDcolon \nhttp://t.co/PK1pFMKU4l", "Tue May 17 00:46:20 ": "Worse than China? Government wants to censor browsers and results of Internet searches. More here: http://t.co/xrWASmf via @demandprogress", "Tue Dec 22 17:53:17 ": "My CD drive is about as useful as a flacid penis.", "Tue Aug 24 00:10:48 ": "#partytip Go gay for @AndrewWK", "Mon Nov 19 07:30:24 ": "Can one simply swagger into Mordor?", "Thu Oct 08 09:16:17 ": "@GraphiK Yes, A spider!", "Mon Nov 30 09:17:36 ": "Caliope.", "Tue May 11 17:50:59 ": "Feeling there is a true lack of integrity in the world we live in today, as an attempt to rectify this I have am affixing duct tape to all.", "Tue May 18 17:44:28 ": "Is my timing that flawed?  Our respect run that dry?  Yet there's still this appeal, that we've kept through our lives.", "Sat May 01 18:00:29 ": "Sex and Violence! Gimme Rock and Roll! Gimme Something Fun!", "Sun May 30 20:14:24 ": "What's there left to do now... I guess seppuku.", "Thu Jul 01 07:41:06 ": "Note to self:hit on cute gas station worker next time.", "Mon Jun 14 16:48:53 ": "About to go adventuring into New Jersey again, praying the air outside isn't suffocating like yesterday, felt like I was boa constricted.", "Mon May 24 02:22:28 ": "The only thing keeping my sanity is the thump of this bass.", "Tue Jun 01 01:22:20 ": "Now that I have something to sleep on, the things that lurk on the floor have to be afraid of whats in the bed.", "Wed Jun 30 08:12:08 ": "Words of Wisdom:STOP.  It's on my wall.", "Tue Nov 02 21:48:18 ": "#nanowrimo 3710, im calling that a day.", "Fri May 13 03:03:14 ": "Worse than China? Government wants to censor browsers and results of Internet searches. More here: http://t.co/xuhVuqf via @demandprogress", "Tue Jun 22 02:56:01 ": "Oops, I", "Thu Dec 17 01:58:49 ": "Boom! Yummy.", "Mon Jan 11 01:02:55 ": "Jesus fuck, I've been to the Imaginarium and back.  What the hell was that?", "Wed Jun 16 10:12:30 ": "Heard something bout Katy Perry and Lady Gaga in a twitter battle, next thing you know I'm going to be hearing about rapper twittrr beefs.", "Mon Dec 21 05:37:13 ": "I find your lack of faith disturbing.", "Wed Apr 21 16:46:14 ": "fed up with this school bullshit, time for summa.", "Thu May 13 12:15:55 ": "Woke up feeling surprisingly like P-Diddy, hung over and washed out.", "Fri Jun 11 13:55:35 ": "Watching old people frantically pace and look around at nothing because they're too afraid to sit by me.   Amusing, but why?", "Tue Jan 12 08:44:36 ": "Rock and Roll Hello, Rock and Roll Goodbye."}