{"Sat Apr 06 04:28:47 ": "@Taylor_Whitee hahaha what is that a joke?", "Sun Apr 14 19:03:13 ": "@jessicabrowwn call me", "Thu Apr 11 03:57:26 ": "Just got off work! Work at 9 am goodnight till the morning world", "Wed Apr 17 20:45:04 ": "@brennanfoley9 No i haven't! I am starting from season one.. i've already watched a couple episodes and I love it", "Fri Apr 12 20:24:48 ": "Weeeeow work then playing with my bebe @ChristyFrrank", "Mon Apr 01 17:37:54 ": "RIP to Shane! God bless your soul", "Thu Apr 11 05:06:06 ": "I can't fall asleep why I am tired", "Wed Apr 10 18:46:29 ": "Just did way to much shopping! Clothes are my drugs", "Sat Apr 06 20:07:57 ": "These boys just asked Ethan if he was Mac Miller haha", "Sun Apr 14 16:23:43 ": "I'm so over people who go out then the next day tweet about how they can't handle them selfs from the night before. Grow up bitches", "Fri Mar 29 15:18:39 ": "RT @fucktyler: IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY IFHY", "Mon Apr 15 05:35:24 ": "@savannahlparker love you baby girllll", "Mon Apr 15 05:36:02 ": "I'm crazy fuck you all", "Sun Apr 07 21:47:25 ": "Ugh pollen.....", "Sun Apr 07 04:03:50 ": "Why won't Christy take me to the bar wahhhh!!!!!!!! @ChristyFrrank take me now", "Tue Apr 09 02:51:59 ": "Ray J really went on a track saying I hit it first dissing Kim K and Kanye #WOW", "Sat Apr 13 04:27:10 ": "My feet hurt if I wear any type of shoe besides Jordan's.", "Sat Mar 30 04:35:34 ": "@EmilyWatsonnn what's wrong?", "Mon Apr 15 05:38:18 ": "Pause to all the ppl in my business. If you talk about my man then no. Your gonna be handled. Ps to all men, of your girl isn't like that..", "Tue Apr 02 02:58:38 ": "Just off work! $$$$ super tired but my braves brought home that W tonight! #BravesCountry #atlien", "Sat Mar 30 22:24:34 ": "@MIKsnMatch me turn up let's go", "Sun Apr 07 04:37:30 ": "Sober bitches... Ain't got time for that", "Mon Apr 15 05:36:01 ": "Hahahaha people talking bout gun play", "Sat Apr 13 03:34:57 ": "I need @EmilyWatsonnn to come home from Cali like jet settin lil girl!", "Sat Apr 13 14:41:30 ": "Going to pamper myself this beautiful morning", "Sat Apr 13 03:34:02 ": "Why do people feel the need to blast their music at the gas pump? Like we hear ya honey", "Sat Apr 06 04:45:02 ": "@Mariiamanjarrez @taylor_whitee that's some black market shit. Are they even allowed to sell animals on Craigslist?", "Sat Mar 30 17:20:57 ": "Without @emanskeeman I wouldn't be able to do what I'm doing today! I'm grateful for having him! #dreamteam", "Tue Apr 16 04:27:11 ": "Just got off work too tired court on the morning! #fuck", "Wed Apr 10 19:52:54 ": "@jessicabrowwn me too! There's to much going on in there", "Wed Apr 17 16:13:56 ": "Starting Weeds on Netflix!", "Mon Apr 15 16:56:09 ": "RT @jbosley93: Whose going to Sweetwater 420 fest this weekend???", "Sun Apr 07 18:30:01 ": "Just made homemade nachos  YUM", "Sun Mar 31 03:11:50 ": "RT @ShakespeareSong: Consumed a Molly, I doth perspire.", "Fri Apr 05 02:32:22 ": "Wings yummy!", "Sat Mar 30 12:48:47 ": "This is a beautiful morning in the A! Working until 2 but I am in the best mood ever!", "Mon Apr 15 05:39:02 ": "I'm never drunk", "Wed Apr 10 18:50:46 ": "I fucking hate you", "Sat Mar 30 22:48:46 ": "@MIKsnMatch okay baby girl I see you turning up early!", "Mon Apr 15 05:35:06 ": "RT @savannahlparker: Any one else miss @youloveSMD drunk tweets every weekend? No just me?", "Mon Apr 08 01:32:15 ": "I need help! Trying to do some casual pictures with Ethan and I, In a studio any ideas of some good photographers? Let me know! Atl area", "Thu Apr 04 04:10:08 ": "I don't really like wearing vans that much. They make my feet hurt! Jordan's &gt; Vans", "Sat Mar 30 03:34:05 ": "So tired! Off work and going to sleep! Opening in the morning but tomorrow I'm off!", "Sun Apr 07 21:47:59 ": "Work then dinner date with my boo @emanskeeman", "Thu Apr 04 04:09:11 ": "Diamond x huff colab  &gt;&gt;&gt;", "Mon Apr 15 19:15:27 ": "My mom said \"Sarah don't make a vine people don't need to know how you act or your business!\" Hahahaha #crazy #lala #bow", "Sat Mar 30 22:46:10 ": "@MIKsnMatch you know I'm down! What's the move tonight?", "Thu Apr 11 23:52:04 ": "@tali_ms id say pretty damn awesome!", "Fri Mar 29 16:48:17 ": "Beautiful day in the A! Working on some store things before work....", "Mon Apr 15 19:18:17 ": "I love @ChristyFrrank and @s_robzz7424 so much!!!! 😘😘😘", "Fri Mar 29 19:31:35 ": "Ready to eat fish and chips cause its Good Friday!", "Tue Apr 09 18:18:49 ": "Wow! This world is something else another violent attack at a school! 14 people stabbed...", "Wed Apr 17 20:46:25 ": "RT @EmilyWatsonnn: hahaha RT @GAFollowers Gucci Mane is not always the bad guy. http://t.co/22e9v55v3m", "Sat Mar 30 04:18:50 ": "@Taylor_Whitee I do! Where are the classes at?", "Sat Mar 30 22:23:40 ": "RT @Th3Peanut: Oh for the non urban ppl \"butter\" are wheat timbs", "Sun Mar 31 19:49:26 ": "Taught church this morning with @emanskeeman now off to the rope swing with mocha Ethan and my baby cousins!", "Thu Apr 11 19:58:29 ": "Just got off work. Going on a shopping spree", "Wed Apr 10 18:50:49 ": "But I love you", "Fri Mar 29 15:09:51 ": "RT @THEBLVCKGOD: Waka &amp;&amp; Gucci beefing over Selena Gomez lol bullshit ion believe that...", "Sat Apr 06 04:52:39 ": "@Mariiamanjarrez @taylor_whitee Do you think they get along with pitbulls? They're so purrrty haha get my joke?", "Thu Apr 11 19:58:59 ": "I'm mad as hell that everyone shops at Wish now... Y'all ain't bout that life", "Sat Apr 13 04:25:36 ": "Rihanna's a bitch! She tried up Kendall Jenner", "Sat Mar 30 16:26:57 ": "Can't wait to open The ATLien with @emanskeeman !", "Wed Apr 10 14:32:43 ": "@EmilyWatsonnn I'm always here if you need me sista!", "Sun Apr 07 02:57:17 ": "Glen wood shawty zone 6 niggas", "Fri Mar 29 17:11:38 ": "Just bought the bred 11's muahahaa", "Sat Apr 13 03:34:28 ": "Just got off work so tired need a drink", "Mon Apr 01 17:51:03 ": "@BabyBootyBri from Buckwild!", "Thu Apr 11 19:57:56 ": "You'll wanna be high for this", "Thu Apr 11 19:55:59 ": "RT @mikebanks93: Juug around the city", "Fri Mar 29 15:17:18 ": "RT @fucktyler: IFHY IFHY IFHY IFHY IFHY IFHY WOLF WOLF WOLF WOLF WOLF WOLF WOLF WOLF WOLF IFHY IFHY IFHY IFHY IFHY IFHY IFHY http://t.co ...", "Mon Apr 15 05:38:27 ": "She isn't gonna ride for you ever!", "Mon Apr 15 19:11:33 ": "@jbosley93 only if you promise to kiss me when you see me", "Sun Apr 07 04:16:08 ": "I'm the line leader to the bar! http://t.co/25QNYWQnW1", "Sat Apr 13 04:34:01 ": "I need inserts with super cushion for my heels and flats I just can't bartender for 6 hours and not sit and have those shoes with no support", "Mon Apr 01 02:59:27 ": "Car shopping tomorrow because why not? @emanskeeman deserves a new car and I can always have two :)", "Wed Apr 10 19:55:19 ": "@jessicabrowwn I went shopping today too!!!! Twinzzz 👯", "Mon Apr 15 05:38:43 ": "I'm so drunk haha", "Wed Apr 03 03:59:55 ": "I am not a Lakers fan but Shaq, you go!!!! You deserve this foreal #34 #LA", "Sat Mar 30 04:47:28 ": "RT @TheAtlTwins: Hater- A person that simply cannot be happy for another person's success. So rather than be happy they make a point of  ...", "Sat Apr 13 14:45:46 ": "Fuck that shit, I wanna tote guns and shoot dice", "Wed Apr 10 18:47:54 ": "She dancin like she...", "Sat Apr 13 03:29:00 ": "RT @wizkhalifa: Im finna teleport https://t.co/6XEJpDeaBT", "Tue Apr 16 13:38:29 ": "Otw to court", "Sun Apr 14 18:00:34 ": "Just got my teeth whitened! Now going to get some margaritas!", "Mon Apr 15 16:56:17 ": "@jbosley93 bitch u know it", "Mon Apr 01 19:14:10 ": "RT @Taylor_Whitee: This weather makes margaritas irresistible...🍹😋", "Mon Apr 08 16:42:20 ": "Gimme the loot gimme the loot!", "Sun Apr 14 18:59:52 ": "RT @itsdominobitch: I'm so pissed everyone is at coachella. I wanna go 😒", "Mon Apr 15 19:24:34 ": "When I'm having fun I'm still getting paid! Come get half price drinks from me tonight bitches :)", "Fri Mar 29 16:49:29 ": "Do you ever stare at people's shoes?", "Tue Apr 16 04:26:51 ": "So much tragedy In this world. Prayers go to that little 8 year old angel who lost her life today! Your a princess watching over us all!", "Fri Apr 12 01:15:06 ": "Menace to society", "Thu Apr 04 04:04:40 ": "Just got off work! Working so much this week! Grocery shopping in the am and then work at VS!", "Tue Apr 09 18:23:43 ": "@sofia_manjarrez in Texas! A college a campus there..", "Mon Apr 15 05:36:44 ": "Fake ass peeps tryna start shit", "Fri Apr 05 19:49:17 ": "Found a lady bug on me today,today's gonna be a good day :)", "Mon Apr 01 19:14:48 ": "@Taylor_Whitee I know I want one so bad! I was thinking of you when I ate lunch at cazadores today", "Fri Mar 29 15:21:48 ": "I want sushi and egg drop soup!", "Tue Apr 02 17:04:55 ": "Pineapple juice 🍍"}