{"Tue Aug 31 14:31:21 ": "RT @nytimesbits: Have a Free Flight to Mexico With Your Taco? http://nyti.ms/b0wjuz", "Thu Aug 26 19:04:41 ": "RT @DJD_EGO: Ciristian Castro pensaba que la CORREGIDORA era una aplicación de office WORD #meapendejocomocristian", "Sat May 22 04:35:56 ": "@NiloLumbre aquí andamos mi hermano un abrazote, saludos.", "Thu Dec 09 19:46:47 ": "@jeisy un voto para @kArEliTa5 #juevesdepiernas", "Thu Sep 09 18:09:46 ": "RT @Es_asi: 4. No confíes en una mujer que no se sabe masturbar.", "Thu Dec 23 18:54:05 ": "RT @Compayito_TD: lamaestra: Quiero que responda una de las sritas de adelante A ver, ud! y la chica dice. yo no, xq no soy srita de ade ...", "Thu Oct 28 18:58:51 ": "@alf_santiago jajajaja tienes razón y aun así tienes mas que yo, hay que dosificarlo que ya llegue la quincena, no?", "Fri Oct 15 18:59:17 ": "Nueva banda de NY, llamada Atomic Tom, improvisando con sus iPhone 4, Jeje buena canción http://nyti.ms/9xKbAC", "Fri Jun 04 14:28:08 ": "RT @dabidson: ¿Fuiste de los ingenuos que registro su celular en el RENAUT? ¡Felicidades, tu número ha sido registrado con exito! http:/ ...", "Wed May 05 23:25:17 ": "Work is taking over me!!", "Fri Oct 15 18:57:08 ": "RT @nytimesbits: A Subway, 4 iPhones and a Little Serendipity http://nyti.ms/9xKbAC", "Wed Jun 02 20:08:04 ": "RT @ruleiro: Ojala que funcione el altar a San Cuau que pusieron mis compitas de @nacoeschido en TJ: http://bit.ly/9e4R2d", "Fri Nov 26 22:47:47 ": "@sarisima2010 eso haré porque no se me quita, no hay de otra gracias!", "Fri Aug 13 15:20:09 ": "RT @pauuchis: Hoy es #ViernesDeChichis (. Y .) #BuenosDias", "Mon Oct 11 15:25:14 ": "Buen día!!, que las metas de esta semana se cumplan, saludos.", "Wed Jun 02 20:18:29 ": "Chequen esto!, es real jajjajaaj\nhttp://bit.ly/9e4R2d @PanMelis, @CesarThor, @NiloLumbre, saludos amigos!", "Mon Jul 19 17:01:11 ": "RT @PanMelis: Me convocaron a junta con la jefa.... =S", "Tue Jun 15 16:27:46 ": "A lot of work for this week, i wanna be on week end.", "Wed Aug 04 21:57:11 ": "RT @ParaPepeto: Mamá, mamá, en el colegio me dicen Twitter -¿Y qué haces tú? -Nada, les doy unfollow", "Thu Nov 18 17:14:50 ": "@jernesto619 tiene razón @panmelis necesitas un perro, por mi casa hay uno callejero, cuando pasas por el?", "Wed Dec 15 16:20:27 ": "Yo voto por el escote de @_m_ay para #miercolesdeescotes cc @_mina @jeisy", "Wed Dec 15 16:08:19 ": "Yo voto por el escote de @Chicazombie  para #miercolesdeescotes cc @_mina @jeisy", "Wed Jun 30 20:52:06 ": "Foto con Jessy http://tweetphoto.com/30035372", "Tue May 11 03:21:05 ": "It's time to work out! Again new goals step by step!", "Mon Nov 08 16:16:28 ": "Buen día y Buen inicio de semana, nuevos objetivos por cumplir!! Que todo salga bien y no sea una clásica semana pesada.", "Fri Jun 04 14:32:15 ": "RT @CesarThor: @osvmuc que tal Osvaldo como estas, ya hay que organizar algo con em Master, saludos", "Thu Aug 26 15:50:51 ": "RT @wera_supernova: Los 4 Beatles fueron José, María, Morelos y Pavón #meapendejocomoCristian", "Mon Sep 13 15:33:15 ": "RT @YordiRosado: La obesidad es un desbalance entre el consumo y el gasto de energía( alimentos) ,hagan ejercicio,todo lo q no gastas se ...", "Thu Aug 19 21:35:59 ": "@PanMelis claro uno que si sabe twittear, no se trata de quien mande mas twits ;)", "Sat Oct 09 02:31:24 ": "Gracias nuevamente a @PanMelis es una experta en twitter, Facebook, hi5 y cualquier red social que le quite el tiempo en el trabajo jajaja", "Tue Aug 24 20:43:39 ": "RT @Es_asi: Si tus recuerdos no te ayudan a masturbarte, es hora de crear nuevos recuerdos.", "Sun Jun 03 14:02:40 ": "@karenoss tan temprano y ya estas en línea, duermete :)", "Fri Jun 11 17:58:21 ": "Ahora si les hicimos sandwich a los africanos en lugar de goles, en su recreo inagural #hazsandwich", "Thu Oct 07 17:45:04 ": "RT @CesarThor: Y la frase del día de una chava del Facebook es \"No soy celosa, sólo soy detectora de zorras\" XD", "Sat Oct 09 02:39:03 ": "No @PanMelis ahora si me fallaste y eso que no sales de esto!! #fail", "Wed Dec 08 20:44:56 ": "@jeisy MI VOTO de #miercolesdelabios es para @Chocolatito_xo", "Wed Dec 08 20:24:15 ": "@PanMelis jajaja te lo dije así es tu cabello, siempre!!!! Jajaja saludos diviertete y FOFF!!", "Sat Oct 09 23:22:31 ": "@jimenaofficial si que pena que nuestras Chivas anden tan mal, pero un favor como va el partido.", "Wed Sep 22 14:32:59 ": "RT @jimenaofficial: Buenos dias!!!! Muaaaaas.... http://yfrog.com/n054395044z", "Wed Apr 21 21:50:14 ": "Recuerdo Foro Sol Muse http://tweetphoto.com/19371346", "Sun Sep 05 00:18:13 ": "RT @nomaslapuntita: #conelvarodelabarbie Le pagaria unas clases a Celia de manejo, a Cristian de Historia y a Paulina de.. de..esa creo  ...", "Thu Aug 19 14:30:29 ": "Un dia mas de clima raro!! Frio-calor-lluvia", "Wed Aug 04 22:14:44 ": "RT @AeroMexico_com: Retwittear el siguiente mensaje: ¡Aeroméxico te regala una entrada doble al partido México vs España! ¡Síguenos!", "Wed Sep 08 14:15:22 ": "Buenos Dias a todos, ya escucharon el tributo a caifanes?, bueno en general, Aunque sorprendio la q interpreta la banda limon, no es mala.", "Mon Dec 13 17:13:40 ": "RT @stormtrooper_mx: Vaya.... la cara \"oculta\" de facebook : http://twitpic.com/3fm31t y hay quien dice que es una red social.", "Wed Aug 11 15:58:14 ": "RT @AdrianneCurry: My facebook http://www.facebook.com/pages/Adrianne-Curry/117861419034", "Thu Aug 26 19:01:26 ": "RT @sopitas: Insisto, imposible no reirse con esto... si han tenido un mal dia, solo denle play y listo  :P http://bit.ly/bkq4ha", "Fri Aug 13 17:31:27 ": "@PanMelis @adrianitafabian asi es Pam melis imaginate para quemar esas calorias tendrias q correr aprox 5km, eso (cont) http://tl.gd/34155c", "Wed Dec 15 19:19:29 ": "@PanMelis Salud!!! Aquí, provecho allá, jajajaja", "Wed Oct 13 14:36:10 ": "RT @auriazul83: #SiLosMinerosFueranMexicanos simplemente no cabrían en la cápsula! Somos el Pais #1 en sobrepeso! Cc @CarlosLoret", "Wed Aug 11 21:23:59 ": "RT @pauuchis: Este tatuador es cabrón.  http://tweetphoto.com/38272637", "Fri Oct 15 15:25:59 ": "Feliz vierneees!!, lo disfruto mucho por ser el preámbulo del fin de semana aunque el fin dura muy poco, jejeje siempre me falta un día mas.", "Thu Aug 04 18:12:04 ": "El twitter de @PanMelis es aburrrrrido, sobre todo cuando yo lo uso jajajajajaja, no te enojes pame yo no tengo la culpa jajajajaja", "Fri Aug 27 16:08:01 ": "RT @mgonsen: Un diputado le dijo a otro: \"¿Viste? Que para el iPad necesitas cuenta iTunes?\". Y que se lanzan a comprar atunes  #usosdel ...", "Thu Sep 23 03:23:10 ": "RT @SoyDeLoPeorcito: ¡Felicidades Ibero, ULSA, Anahuac, UDLA, del Valle, ITAM, Tec, Unitec, ULA, UNUM, UNILA, UIC! ¡Hoy su mamá cumplió  ...", "Wed Aug 04 22:24:01 ": "@PanMelis asi es son 3 comidas \"fuertes\" y 2 colaciones, dependiendo la cantidad de calorias por que (cont) http://tl.gd/2u3jsg", "Mon Oct 11 03:19:13 ": "RT @FrasesEinstein: \"Por cada minuto que pasas enojado pierdes sesenta segundos de felicidad.\" #FrasesEinstein", "Wed Sep 29 03:01:48 ": "RT @mariocampos: RT @HanniaNovell: Para los que preguntan: Cuenta oficial de Twitter de Gustavo @cerati desmiente rumores sobre la muert ...", "Sun Sep 19 04:56:30 ": "RT @adrianitafabian: RT @fanultra: Las 50 chicas geek más sexys http://post.ly/yP4P", "Mon Oct 11 14:47:44 ": "RT @marilink: Impresionante la intro de Banksy para Los Simpsons http://www.youtube.com/watch?v=DX1iplQQJTo Y la 20th Century FOX qué op ...", "Thu Aug 26 15:52:56 ": "RT @_Talancon_: @wera_supernova: Sor, Juana y Nes de la Cruz son las chicas que se paseaban con José, María, Morelos y Pavón? #meapendej ...", "Mon Jul 19 17:02:17 ": "@PanMelis por fin vas a trabajar Pam, aunque te la pases tweeteando.", "Wed Aug 25 14:26:17 ": "RT @sallesino: Dice Paulina Rubio que le da mucho gusto que México haya ganado Miss Universal Stereo.", "Wed Apr 21 21:48:45 ": "I just voted for this photo, check it out http://tweetphoto.com/19370285", "Wed Oct 13 14:36:24 ": "RT @alemondragon: @CarlosLoret #silosminerosfueranmexicanos tal vez preferirian quedarse abajo...estarian mas seguros de las balaceras!", "Wed May 12 20:34:04 ": "Definitivo @PanMelis es muy mal pensada! Jajaja, ni un dulce se le puede ofrecer ;)", "Thu Jun 24 18:36:45 ": "RT @jessybulbo: RT @ ScRoberto #insultosguarros El gótico. Por que ando con pura gargola", "Mon Oct 11 14:52:07 ": "RT @petezin: La suciedad puede romper el iPhone4. Tras los problemas de cobertura llega un posible fallo de diseño. http://cort.as/0FNT", "Wed Feb 22 05:48:17 ": "@misden no por nada, al contrario ;) saludos", "Thu Nov 25 15:06:57 ": "Que gripa!! Ni ganas dan de trabajar, bueno sin gripa también jejeje, algún remedio? Llevo dos días y no veo como :(", "Mon Dec 10 19:47:48 ": "@viri_SD que bueno ojalá siga así.", "Thu Jan 06 22:21:53 ": "Se acabaron las vacaciones buu! De vuelta a la realidad, al menos no me toco muñeco en la rosca, jajajaja", "Wed Jul 14 16:50:07 ": "@PanMelis no tienen trabajo vdd?, se la pasan en juntas ahora entiendo, por que nunca esta en tu lugar jajajajaj", "Wed Aug 11 15:59:45 ": "@pauuchis yo si te adopto con todo gusto ;)", "Tue Aug 24 20:46:28 ": "RT @abejaconmiel: Photo: #belleza #encamable http://tumblr.com/x5qgm8lhn", "Wed Dec 08 20:10:58 ": "RT @TomCruise: Our favorite #MissionImpossible related clip of the week;) http://bit.ly/MissionImpossibleSquirrel", "Thu Jun 24 18:38:19 ": "#insultosguarros El Power Ranger por que se revuelca con puros moustros...", "Thu Oct 07 14:21:48 ": "Días, que feo es el olor a café y mas el sabor lo odio, seré el único? Y mas por las mañanas que toda la oficina huele así guacala!!", "Thu Jul 22 18:17:42 ": "@CesarThor donde y cuando? No es mala la idea.", "Tue Dec 14 19:27:15 ": "RT @LuisHdz33: Vieron ayer la lluvia de estrellas???... Insisto, que bonito las estrellas #arrimartesdepolopolo @polo_polo", "Thu Dec 09 04:42:59 ": "@princesaland vale la pena desvelarse contigo, esperaremos la foto saludos", "Thu Dec 09 15:34:02 ": "@jeisy mi voto es para @princesaland #juevesdepiernas", "Tue Jul 20 19:12:44 ": "RT @sopitas: ¿Que hoy es dia del amigo?  Pues venga esa mano amiga!! A mi ga....", "Thu Dec 09 19:47:02 ": "@jeisy un voto para @jeisy #juevesdepiernas", "Sun Sep 09 04:58:48 ": "@sandyviolenta Mira está liga te conviene este y está muy bonito. http://t.co/RKRHuEZA", "Fri Aug 13 15:24:26 ": "@adrianitafabian si no sigas esos malos habitos de @PanMelis, recuerda que no hay que hacer malos habitos, solo un gusto de ves en mes.", "Thu Feb 10 23:43:56 ": "RT @record_mexico: Especialistas RÉCORD. @JavierSolorzano analiza por qué Chivas es el equipo más polular de México http://bit.ly/gCqLBN", "Thu Dec 09 19:18:57 ": "@jeisy voto por @Kuanike #juevesdepiernas", "Fri Jun 04 14:35:52 ": "@CesarThor que tal cesar estaría bien es cuestion de ponernos de acuerdo, el master tiene twitter?", "Fri Jul 23 19:03:25 ": "RT @CesarThor: mezclar con dos ipad's  http://bit.ly/9V4BBz", "Tue Aug 16 15:22:14 ": "RT @RIETE: Sale #NinelConde del Cine y dice: Que bonita la peli de los Pitufos ya todos creciditos! Le dice su amiga: Pendeja, vimos Avatar.", "Thu Nov 04 20:10:18 ": "RT @HuracanConFalda: Llega AMLO a un restaurante y le preguntan, y qué quiere tomar señor? y contesta POSESIÓN!!! #chiste", "Sat Jul 10 04:44:31 ": "@PanMelis que Barbara espero que no hayas visto partes de la peli por q se te cayeron las palomitas o si?", "Mon May 16 05:40:59 ": "@yarifu irónico!! http://t.co/iq9xKHT", "Fri Dec 17 17:07:36 ": "A continuar haciendo ejercicio, que no se convierta en un propósito del siguiente año, si no en un propósito (cont) http://tl.gd/7i223d", "Tue Aug 16 15:13:31 ": "@PanMelis dirás siempre estas enojada", "Fri Jun 04 14:31:53 ": "Solo en México!!! http://bit.ly/d7H0bV\n@CesarThor @PanMelis @NiloLumbre", "Mon Sep 27 22:29:12 ": "RT @nadia_molina: Muere dueño de Segway ¡en una Segway!  http://t.co/GcgjbhG   &lt;--Joder!", "Wed Aug 18 16:39:19 ": "My Twifficiency score is 32%. What's yours? http://twifficiency.com/", "Wed Dec 15 16:09:59 ": "Yo voto por el escote de @Kuanike  para #miercolesdeescotes cc @_mina @jeisy"}