{"Sun Dec 09 12:34:29 ": "I really enjoyed playing for SSO at yesterday's Christmas concert. Liked the 15.00 start! Got home and and enjoyed the evening afterwards", "Fri Mar 01 09:16:00 ": "@MatthewStadlen You really missed something very special there Matt.  I think it was the best of the R3 focus on one composer seasons", "Mon Nov 12 22:19:08 ": "@PNovelistGale Not nice!", "Tue Oct 09 21:43:29 ": "@Schafernaker Tomasz, you really are a breath of fresh air whatever weather you forecast. Thank you for being on our TV screens.", "Sat Oct 27 14:25:03 ": "RT @MatthewStadlen: We must not lose our #Ash trees to disease. Would be a national tragedy. Please retweet", "Sat Sep 01 17:09:46 ": "Brilliant - well done Elle Simmonds", "Wed Aug 29 21:15:01 ": "Goodness me, those welcome to the teams dancers at the Paralympics must be very fit to keep dancing for so long!", "Wed Aug 29 17:36:05 ": "@NeilKBrand Excellent - Enjoy!", "Tue Nov 13 21:51:32 ": "@MrGeorgeClarke It must be strange watching yourself on TV?", "Tue Oct 09 21:40:00 ": "@Danielledeniese I listen time and time again, and never get tired of it. Just amazing music!", "Sat Oct 13 19:16:30 ": "Robin and Lisa to win!", "Sun Nov 04 20:18:35 ": "@Schafernaker No let's bypass winter and go straight to spring", "Sun Nov 11 16:36:44 ": "I have just planted 40 daffodil bulbs! Better late than never. I mowed the lawns 2 days ago! I have now put my garden to bed for the winter.", "Mon Dec 03 19:50:08 ": "I created this little Christmas decoration today. I am quite pleased with the result. Not naff at all! http://t.co/8b9jciha", "Thu Feb 28 19:50:59 ": "@MatthewStadlen Tasmin Little would be interesting!", "Fri Mar 01 09:10:58 ": "@MatthewStadlen I am still having withdrawal symptoms from BBC R3 'Spirit of Schubert' season, and this was broadcast nearly one year ago!", "Sun Mar 03 16:50:22 ": "@MatthewStadlen Thanks Matt. I am getting there - -I need to as I am duty at Glyndebourne all this week!", "Fri Dec 21 15:33:44 ": "@andrewCDmcg I love playing the 1st Viola part in that, and the C major when I am brave enough!", "Thu Sep 13 09:47:03 ": "RT @davidwalliams: @StephenMulhern Hi Steve, I can't wait to see you at Cadogan Hall today at 6pm for the launch of 'Ratburger'. Please  ...", "Wed Jan 30 15:28:56 ": "Anyone remember the old BT catchphrase 'It's good to talk'?  Well my version is 'It's good to walk'", "Mon Dec 03 19:15:20 ": "I was getting restless, ............so I put up my Christmas decorations. I am so pleased I did this!", "Fri Apr 05 13:12:05 ": "Its a beautiful day here in Glasgow botanic gardens http://t.co/i4p2rym4gP", "Sun Nov 04 20:13:49 ": "@ssomusic looking forward to playing. Sorry could not be there today", "Tue Oct 09 21:44:48 ": "@zebsoanes Bless him", "Mon Feb 11 11:36:07 ": "@PNovelistGale Nice one!", "Sun Nov 04 20:26:08 ": "@RevRichardColes I expect you will be invited to take part now!", "Fri Dec 21 15:24:46 ": "@andrewCDmcg That is wonderful. Thanks for sharing", "Sat Oct 13 18:58:18 ": "@Schafernaker - er, did you say quick?Rather longer in Polegate!", "Wed Feb 20 13:48:03 ": "@andrewCDmcg Brilliant!", "Wed Feb 20 13:41:52 ": "@Schafernaker It's great to see you back on national television again.  That gorgeous orange tie should help stave off those cold winds!", "Wed Dec 12 08:45:30 ": "Enjoy 12/12/12 - it is another 89 years before 01/01/01", "Wed Jan 30 09:48:14 ": "@mrjakehumphrey Probably! Try Radio 3 Jake - enjoy really superb music. It takes a while to fully understand but the journey is worth it.", "Wed Aug 29 12:56:44 ": "@vilsrip Will do!", "Sun Dec 09 12:24:48 ": "@Robinwindsor It is also wonderful on ice cream!", "Thu Feb 21 11:35:21 ": "Just played the whole of Bach's 1st cello suite on my viola. I only intended to do the Prelude! My friend plays this suite on the clarinet!", "Thu Oct 04 11:34:44 ": "Good to be back at Glyndebourne again. Rusalka is amazing - get to see it as it tours the country. Figaro tonight - equally good!", "Wed Feb 13 20:09:10 ": "@Schafernaker Cold not good - get thyself warmed", "Thu Feb 21 11:38:16 ": "@MatthewStadlen @EllieSimmonds1 Looking forward to your 5 mins with Ellie", "Tue Sep 11 11:05:18 ": "Enjoying looking round Cardiff city centre before catching train home. Very impressive. Currently in Welsh College of Music and Drama", "Wed Jan 30 20:15:29 ": "@MatthewStadlen Agreed. Haydn's keyboard sonatas are often more original than Mozarts!  But the concertos are a totally different matter!", "Sat Mar 09 09:09:10 ": "RT @StPaulsCamb: #Camberley Connections week starts TODAY!  Mums head to @LadidaCupcakeCo http://t.co/OVuHx7Fwp6 #CamConX #Camberley", "Sun Nov 04 20:16:57 ": "RT @Danielledeniese: Had the most amazing concert last night in Prague @ National Theater!\n3 standing ovations, it was so moving!\n#impac ...", "Fri Mar 01 09:13:20 ": "@Robinwindsor Good morning to you!  Although it is cold gloomy and damp here in Sussex, it is officially the first day of spring!", "Wed Dec 12 07:55:49 ": "RT @vilsrip: Fell in love with this &gt; three decades ago: Mendelssohn String Octet, 4th mvmt. http://t.co/D6kGq7lX (faster than I Musi ...", "Fri Sep 07 17:01:27 ": "Off to the Paralympics again tomorrow morning then straight to Cardiff for a very special celebration. It is Rhoda &amp; Geoff's Silver Wedding", "Mon Nov 12 22:26:32 ": "@egdeshong I love that opera! Enjoy!", "Thu Sep 06 20:49:25 ": "Wow, Dave and Jonnie!", "Wed Dec 12 07:54:55 ": "@vilsrip I have always been in love with the whole octet. It is just magnificent, and very satisfying to listen to. Also fun to play!", "Wed Feb 20 14:03:35 ": "@MatthewStadlen Hello Matt!  Your interview with Michael McIntyre was a wonderfully uplifting five minutes", "Sun Mar 03 16:39:45 ": "@zebsoanes Yes it is good to hear you on R 4 again Zeb", "Thu Apr 18 21:11:00 ": "Back from a wonderful holiday on the Scottish Canal System including visits to Glasgow, &amp; Edinburgh which has the feel of a foreign city!", "Sat Oct 06 21:08:59 ": "@JBlissClarinet Oh wow that is gorgeous", "Mon Nov 12 22:20:42 ": "RT @NeilKBrand: Don't dismantle the BBC over human error, alongside the NHS its one of the most precious public resources we have! http: ...", "Fri Sep 14 18:26:17 ": "@Schafernaker Thanks for the fine weather Tomasz. You are a star!", "Sun Mar 03 16:32:27 ": "@andrewCDmcg wow - that was quite an experience", "Wed Aug 29 10:26:08 ": "@houghhough It's not you Stephen!", "Sat Dec 15 20:25:44 ": "@vilsrip Love Supertramp", "Wed Dec 19 09:39:52 ": "@Robinwindsor Such energy!", "Sun Nov 11 17:14:53 ": "Why do some couples dance the Viennese waltz to music in 4/4 time on Strictly? It is just not right!", "Wed Feb 13 20:05:04 ": "@NeilKBrand Excellent Neil", "Mon Nov 26 11:08:25 ": "Today I am defrosting my fridge/freezer.  Not a nice job!", "Fri Dec 21 15:20:34 ": "@JBlissClarinet Sounds like an excellent gig", "Wed Aug 29 20:57:55 ": "@PetrocTrelawny Sleep well Petroc", "Wed Dec 19 09:59:12 ": "@andrewCDmcg @BBCRadio3 Thank you Andrew - I enjoyed my moment of fame. Elder/Halle Apostles and Kingdom are on my Christmas wish list!", "Fri Sep 07 16:58:43 ": "@JBlissClarinet Have a great time in the windy city.  Appropriate - as a string player I don't think there is a stringy city!", "Sat Dec 15 20:23:55 ": "@MatthewStadlen That is such a shame Matt. I just love your understated style of presentation and interview technique. Shame on auntie!", "Sat Oct 27 14:32:57 ": "@MatthewStadlen I think very civilized", "Mon Feb 11 12:00:16 ": "@MatthewStadlen Get well soon mate and I hope that you do not suffer bad pain", "Mon Dec 03 20:42:13 ": "@Schafernaker nah, I put mine up today. Let's make the most of this magical season!", "Sat Oct 13 18:15:04 ": "Darcey, okay? Yah!", "Wed Dec 19 09:37:35 ": "@andrewCDmcg @BBCRadio3 Hi Andrew Well done covering for Rob. Is the year 1906?  Delius Sea Drift; Elgar The Kingdom; Mahler Symph 6", "Sun Nov 04 20:12:06 ": "RT @ssomusic: What a great rehearsal today - looking forward to next weekend's concert at St Bart's #brighton. http://t.co/Q7Sx0k9d", "Mon Nov 12 22:21:06 ": "@NeilKBrand yes I do agree", "Fri Dec 21 09:00:03 ": "Glad to see the sun is shining for this shortest day of the year!", "Sun Mar 03 16:36:28 ": "@MatthewStadlen I slept for 10 hours last night! I needed that so much after minor surgery on Friday", "Mon Nov 12 22:23:43 ": "@tenorbenjohnson He sure is scary, Paganini comes to mind!", "Sat Feb 23 20:16:56 ": "@StephenMulhern Terrible - but quite funny!", "Sat Sep 15 17:15:50 ": "It's official! Christmas is coming. Strictly starts its run", "Sat Dec 15 20:28:45 ": "RT @Iamweezweez: How can u live the dream when the dream won't come true #ItSucks", "Sat Nov 17 14:08:52 ": "@cellojohnston Which airline? I love the humour!", "Wed Feb 20 13:45:25 ": "RT @Mayorsmusic: @JBlissClarinet Please RT! Founder Patron Boris Johnson on how important it is to support the Mayor's Music Fund: http: ...", "Sat Oct 27 14:40:23 ": "@Schafernaker I will be watching, and you finish just in time for Strictly!", "Wed Feb 13 20:07:11 ": "@MatthewStadlen Beethoven's sonatas are always so satisfying to play.  Well done", "Mon Dec 17 08:19:56 ": "@tenorbenjohnson Hi Ben - you must have been watching Strictly? She does seem to able to dance though!", "Sun Mar 03 16:37:43 ": "@vilsrip Yes what would work", "Sat Oct 13 19:00:48 ": "@RevRichardColes Ooh yes", "Wed Feb 20 13:43:49 ": "@RevRichardColes Yep - right at the centre of things", "Fri Dec 21 15:27:35 ": "@MrGeorgeClarke I did and it was most entertaining. I love those old converted toilets especially.", "Sat Sep 01 18:17:31 ": "Wow, Jason Smyth", "Sat Dec 15 20:19:34 ": "@zebsoanes So good!", "Mon Dec 03 22:42:44 ": "@MrGeorgeClarke Snow?", "Thu Aug 30 20:50:19 ": "@Fitclinic excellent", "Sat Oct 13 18:50:34 ": "@MatthewStadlen Oops", "Wed Feb 20 13:52:44 ": "RT @BBCRadio4: @NeilKBrand 's adaptation 'captures the magic of the book'. Listen to the cast of The #WindintheWillows: http://t.co/UsZ2v3Jc", "Wed Dec 19 09:48:37 ": "@andrewCDmcg @BBCRadio3 Sadly not...but sometimes the honour of having your name read out if you are correct!", "Wed Dec 12 08:00:14 ": "@RevRichardColes WhenI first watched colour TV I was amazed because I then saw the world as a more colourful place!", "Thu Jan 17 20:31:10 ": "I think we have SNOW on the way folks!", "Sat Sep 01 19:42:49 ": "Oscar P is a legend!", "Wed Aug 29 10:27:20 ": "@houghhough That is so true in many ways", "Mon Dec 17 08:09:14 ": "@PetrocTrelawny @BBCRadio3 Morning Petroc. Good to hear you, and pleased that you are not suffering with a cold like poor Ian and Rob!", "Fri Dec 21 15:30:04 ": "@RevRichardColes Oops"}