{"Fri Mar 18 15:23:05 ": "Te amo sem saber seu cheiro, te amo sem condição, apenas te amo e te espero a cada segundo de minha vida.", "Wed Mar 23 01:47:54 ": "Mas foi compensador o dia, coisas boas acontecendo mesmo em meio tempestades. O sol ainda existe mesmo apagado pelas nuvens. Boa noite.", "Wed Mar 23 01:43:23 ": "Oi @agltgo", "Sun Mar 27 16:33:29 ": "Estou parecendo peixe fora dagua... \nAguenta Frann, são so mais uns dias. Boa tarde galera!", "Fri Mar 18 15:06:38 ": "Que bom que pelo menos eu posso escolher a hora e como acontecer. E se fosse assim do nada, ficasse gravida, não tivesse condições?", "Sun Mar 20 06:33:23 ": "Super feliz pela noite. Satisfeita de estar em um ambiente de trabalho tão especial e com pessoas especiais. E amanhã encerramento oficial.", "Thu Mar 24 04:53:25 ": "Era bem legal quando agente conversava, ela se confidenciava a mim. Pois ñ sei oq tem em mim, que adolescentes gostam de conversar comigo.", "Tue Mar 15 20:23:16 ": "Como eu queria ter minha disposição de quando chequei em Goiânia! Nossa, estou cada dia pior, será que existe remedio pra isso??", "Tue Mar 15 18:55:24 ": "Ando com vontade de dar minha vida pra alguém! De cuidar de alguém, de viver por ela. Só nao quero criar expectativas pra nao sofrer depois.", "Thu Mar 24 04:54:03 ": "Ia na minha casa, desabafava, dizia todas as suas revoltas, suas tristezas e tbm alegrias, seus amores escondidos. Dizia mta coisa.", "Wed Mar 23 12:22:12 ": "Mas estou bastante animada. Muito mesmo. Ah, esqueci de dizer que o Acapulco fechou oficialmente no domingo. Foi emocionante.", "Wed Mar 23 12:19:38 ": "Formatação mesmo. Pensa se eu fosse depender de técnicos de informática... com certeza já teria falido. Ainda bem que eu mesmo faço isso.", "Sun Mar 20 06:38:12 ": "Ah! Pensei em vc a noite toda. Evito até de falar de vc pq mtas vezes vai ficando chato, mas só pra dizer, te gosto mto...sempre (mamãe!)", "Thu Mar 24 04:58:55 ": "Boa noite. Ir pra cama com a insônia e a angustia me acompanhando. Será longa esta noite. Afundada nos pensamentos.", "Thu Mar 24 04:52:46 ": "É amigos. Era que conheci com 13 anos, te acompanhei até os 15, mas dpois tive que me mudar de casa, de setor, e nossa amizade ficou atraz.", "Wed Mar 23 14:36:58 ": "@riigribeiro E eu por vc, pronto, ja esta adicionada...bjus", "Fri Mar 18 15:03:29 ": "Quando minha mãe tinha 30 anos, ela já tinha 3 filhos, e a vida rolava normalmente. E eu este ano vou completar 30 anos e me axam infantil.", "Sun Mar 27 02:49:05 ": "Uma coisa foi bem legal hj, tive praticamente a certeza que estou fazendo a coisa certa \"siga seu coração\"... que bom, fico bem aliviada.", "Thu Mar 24 04:51:31 ": "Quantas vezes ensaiei pra te ligar, mas ñ tinha coragem por achar que nao seria conveniente. Droga... arrependimentos. Pq se foi assim?", "Wed Mar 23 12:24:08 ": "Pela primeira vez na vida encerro um trabalho com tamanha alegria. Foi divertido, foi otimo esses um ano e meio de Acapulco. Aprendi mto.", "Thu Mar 24 04:58:06 ": "Chatiada mesmo. Mas que Deus proteja nossos adolescentes, proteja nossos pais, proteja nossas vidas. Amanha estarei melhor e falerei disto.", "Wed Mar 23 12:21:17 ": "São raros os dias em que acordamos dispostas e logo tão cedo. Mas daqui em breve, isso será rotina, já que o nosso anjo está chegando.", "Fri Mar 18 03:43:17 ": "Estou bem querendo expor algumas coisas por aqui, contar minhas emoções, minha agonia e tbm minhas lagrinas. Escolhas que são mais fortes.", "Fri Mar 18 15:17:59 ": "Até me emociono só de pensar no assunto, falar então as palavras fogem, mas já estou me sentindo uma mãe.", "Wed Mar 23 12:23:31 ": "A Jolly saiu distribuido balinhas, pirulitos, sem falar que nós os funcionários saímos bebados de lá. Dançamos horrores tbm, foi otimo.", "Fri Mar 18 15:07:15 ": "Mas não, eu e meu Zimzim podemos sim concretizar nossa familia, e vai ser agora, é nosso desejo e pronto. Não somos mais crianças. Bom Dia.", "Fri Mar 18 15:16:14 ": "Aprendendo e sendo obrigadas a fazer coisas erradas. Agora pq eu e meu Zimzim não podemos fazer isso? Oq nos impedem? Nada!", "Thu Mar 24 04:46:16 ": "Estou chatiada! Não sei mto oq dizer, as palavras simplesmente sumiram, é um silêncio dolorido, querendo fazer algo que nao se pode mais.", "Mon Mar 28 02:36:34 ": "Passam-se tantos filmes legais na Oitv durante a semana que estamos ralando, aí quando estamos de folga, nada presta na televisão. Chato.", "Wed Mar 23 01:45:58 ": "To cansada pra caramba. Acordei 7hras da manha e já fomos pra rua resolver um monte de coisas, xegamos agora pouco e uma xuca que nao para.", "Fri Mar 18 15:22:10 ": "E não há ninguem nesta terra com a capacidade de me fazer parar e mudar de idéia, vc é meu e nós somos de você. Te amo sem te conhecer.", "Sun Mar 27 16:31:40 ": "E minha raiva é que meu Zimzim só quer ficar enfurnado dentro de casa vendo televisão. E agora, oq fazer pra curar esse tédio todo?", "Fri Mar 18 03:45:43 ": "Ai dúvidas... certeza que ainda não é hora de falar tanto. Mas como eu gostaria de gritar pro mundo e contar tudo de a cada segundo!", "Tue Jul 06 03:06:20 ": "Sabem pq nao tenho mais paciencia pra Twitter? Pq meu PC já nao da conta mais dele. Não sei oq ocorre, mto pesado! Travando dmais.", "Wed Mar 23 01:46:51 ": "E mta colica, mas colica mesmo. Aff ser mulher é bom, mas quando vem esse raio todo mês é um saco. Perco toda paciencia e fico agitada.", "Fri Mar 18 15:16:54 ": "No fundo ainda existem pessoas que tem preconceito de pegar crianças desconhecidas, tem medo do que possa vir nos genes. Bobeira.", "Thu Mar 24 04:46:59 ": "As lágrimas estão barradas, querem e nao querem sair, um nó na garganta, uma agonia no peito... só agora entendo minha aflição.", "Sun Mar 20 06:34:22 ": "Vai ser um prazer tocar p/ todos! Estou ansiosa, ansiosa pelo recomeço de tudo, pois Reliquia, tá nascendo pra todos nós. Obrigada Acapulco.", "Sat Mar 26 04:05:35 ": "Ou quando estou no meio da farra. To chata mesmo, vontade de fazer outras coisas. Mas o jeito é me concentrar em outras coisas. Mal humor.", "Wed Mar 23 12:19:02 ": "Eu já fiz minha parte, mas continua dpois que a Celia for embora. Estou iniciando o processo de cirurgia do notbook do meu Zimzim.", "Sat Mar 26 04:07:37 ": "Perdi dois de trabalho em vão. Poderia ter feito outra coisa sabe, trabalhado em minhas coisas e ñ em coisas que nem sei fazer direito.", "Thu Mar 24 04:49:57 ": "Será que adiantaria ter dito algo no tempo em que se passou? Sinto um pouco de culpa tbm... ai to engasgada demais. Não acredito nisso.", "Sat Mar 26 04:13:36 ": "E detalhe, o vizinho é meu cunhado... tadinho. Minha falta de paciencia tá demais mesmo. Amo meu cunhado, é só que hj ñ to num bom dia.", "Sun Mar 20 06:35:27 ": "Agora vou finalizar minha noite c/ um miojo e meu Zimzim aqui ligadona. Vai ser dificil dormir esta noite. Melhor, dificil dormir as noites.", "Mon Mar 28 23:16:43 ": "Feliz! Adoro estar com meus sogros. Claro que fiz manha, e eles nos levaram pra jantar fora, e amanha vamos sair de novo, todos juntos.", "Sat Mar 26 04:09:10 ": "Só pra agradar mesmo, aff, preciso aprender a falar \"NÃO\", pq tem coisas que não é mesmo o nosso talento. Mas é isso, aprendendo mais hj.", "Wed Mar 23 12:24:35 ": "Fiz mtos amigos, e mtos aprenderam a me respeitar, reconhecer meu trabalho. Foi perfeito, e a felicidade foi bem mais pq vem algo melhor.", "Fri Mar 18 15:04:12 ": "Mas afirmo uma coisa \"só estou comunicando e não pedindo opinião\", eu vou ser mãe, vou ter um filho e vou fazer de tudo pra isso.", "Sun Mar 27 18:29:27 ": "E nem escutar som to podendo pq meu zimzim ta assistindo TV e detesto escutar musica com fones de ouvido. Mas tá lascado mesmo esse domingo.", "Sat Mar 26 04:15:51 ": "E é melhor eu deixar meu BOA NOITE. Amanhã será um novo dia, nova história, novo recomeço. Confiança que tudo dá certo. Até mais galera!", "Sun Mar 20 06:31:56 ": "Último sábado com chave de ouro. Vai deixar saudades esse Acapulco, e o maior prazer foi a presença de todos, agradeceços mesmo de coração.", "Fri Mar 18 15:15:26 ": "Se todo mundo na face da terra pensasse na possibilidade de adotar uma criança, mtas por aí não estariam jogadas nas ruas, sofrendo.", "Mon Mar 28 14:24:11 ": "Por isso que amo segunda feira, é uma revitalização, uma lavagem na alma. Vou continuar com minha fachina na casa, mta coisa a se fazer.", "Fri Mar 18 15:06:06 ": "Direito de ter uma familia, de amar, de ser mãe, quero sim correr o risco da maternidade. Em outros casos talvez isso ja tivesse acontecido.", "Mon Mar 28 23:19:22 ": "Vou ali fazer um pouco de bicicleta, aproveitar que estou animada, e quem sabe arrumar dentro da estante. Engraçado, comi pouco hj, OTIMO.", "Thu Mar 24 04:56:40 ": "Suicidio! Nem gosto desta palavra, mas quero falar mais sobre isto e tbm de grandes erros das pessoas que provocam isto. Não agora.", "Sun Mar 27 02:39:21 ": "Cabeça doendo horrores. Hoje o dia foi tenso, pela primeira vez, as lágrimas caíram por causa dela que se foi. Acho que a ficha caiu.", "Mon Mar 28 02:35:27 ": "Ainda bem que esse Domingo chato está acabado. Aff, segundona, tem 04 anos que aprendi apreciar uma boa segunda feira, amo segundas.", "Mon Mar 28 02:34:19 ": "Se tem uma coisa que me irrita é quando meu Zimzim dorme cedo desse jeito. Odeio e odeio, parecendo que tem 70 anos gente, to so agora.", "Tue Mar 29 18:35:58 ": "E hoje acordei bem cedo, tudo por ele e tbm por ela. São meus dois \"nenens\". Queria criar os dois, mas nem posso, mas feliz assim mesmo.", "Fri Mar 18 15:20:06 ": "Eu quero ser pra você\nBraços abertos a te envolver\nE a cada novo sorriso teu\nSerei feliz por amar você\"", "Thu Mar 24 04:57:22 ": "Sem palavras. Estaria agora com 17 anos, mas decidiu nao esperar por sua independencia. Erros dos pais? Só Deus e ela sabia do que passava.", "Sun Mar 27 18:21:19 ": "oi @adaoneri", "Mon Mar 28 02:37:28 ": "Eita acabou de trovejar, e dos fortes. Jazinho desligam a internet, é compartilhada neh, e o modem nao fica aqui. Melhor eu sair, BOA NOITE.", "Sun Mar 27 16:29:00 ": "Domingão de sol, todo mundo em casa, aff, eu deveria ta achando bom, mas não, pq desde 2009 trabalho aos domingos, tocando no Acapulco.", "Sun Mar 20 06:29:47 ": "Noite no Acapulco foi perfeita. Carina Duarte e seu companheiro arrazaram no som. Pessoas animadas, disposição, perfeito. E os meninos então", "Thu Mar 24 04:55:55 ": "Talvez dramas de adolescente... mas ela cumpriu a promessa! Não vai contar o final, resolveu escolher o pior caminho.", "Fri Apr 01 17:59:33 ": "Vivendo 9 em 2. E estudando pra caramba novos estilos e novas músicas.", "Wed Mar 23 12:18:28 ": "Acordei foi cedo hj, mas tbm dormi tarde ontem. Estamos aqui faxinando a casa, meu Zimzim cuidando do quintal, a Celinha limpando moveis.", "Thu Mar 24 04:50:47 ": "Não pode ser real. Agora vc me vêem em meus pensamentos em lembranças tão boas. Teu sorriso, tua alegria, teus olhos tristes.", "Wed Mar 23 12:25:18 ": "Na verdade é um recomeço, que jamais terá ponto final, mas diversos paragrafos. Pois a vida sempre continua. Estou bem feliz hj, satisfeita.", "Fri Mar 18 15:02:31 ": "As vezea os pais se esquecem que eles ja tiveram nossas idades, ja formalizaram grande parte de sua vida e axa que vc é uma criança.", "Fri Mar 18 15:21:02 ": "Eu já te amo mto meu filho, mto mesmo, sem explicação pra este amor descontrolado, louco, te amo dmais. Eu canto e toco pra você pra sempre.", "Sat Mar 26 04:11:40 ": "Ainda faço uma festa só com musicas que gosto, anem, tudo tem que ser sertanejo, forro, funk, axé, fala sério. Gosto de tocar em trabalho.", "Sun Mar 27 16:32:42 ": "Eu gosto de trabalhar sabe, gosto do que faço, amo dmais a minha profissão, e me faz tanta falta, que estou totalmente perdida nesse dia.", "Thu Mar 31 23:12:03 ": "Caramba, estou super cansada. To chatiada com umas coisas que andam acontecendo com uma amiga minha, cada dia é uma coisa, fico triste.", "Wed Mar 23 14:39:54 ": "E o almoço que ainda tenho que fazer! Jazinho meu Zimzim me olha com aquela cara e fala assim \"to fome zaaaaaaaaaaooo\".. é desse naipe.", "Fri Mar 18 03:40:24 ": "Algué sabe o que é se sentir como pai ou mãe por aqui? Aquela sensação que o mundo gira em um segundo em sua cabeça. Ah como vc é especial.", "Fri Mar 18 15:05:04 ": "Seja lá como for, vou dar um jeito, não quero saber raça, cor, se eh normal ou especial, minha decisão já está tomada. Tenho o direito tbm.", "Fri Mar 18 15:19:09 ": "E você linda criança, pequenino ser estranho que está vindo de outro mundo \"eu quero ser pra você a lua iluminando o sol\"", "Mon Mar 28 14:22:08 ": "Não sei oque sonhei, mas acordei perfeitamente bem e disposta. Adoro acordar assim, apesar que ontem fikei emburrada o dia inteiro.", "Sat Mar 26 04:12:39 ": "Ver as pessoas curtindo e tals, mas ter que ficar escutando isso casa, quando vc quer ficar em silêncio, é dmais. Festas de vizinhos, aff.", "Sun Mar 27 16:30:56 ": "Será que vou aguentar ficar em casa? To doida pra tomar uma cerveja, agonia e agonia. Deveria tá achando bom neh, ter folga.", "Thu Mar 24 04:55:13 ": "E tinha me avisado tbm que talvez ñ fosse viver pra contar o resto da história, que preferia viver em outro mundo do que neste.", "Sun Mar 27 16:29:52 ": "Mas o Acapulco fechou para iniciação de novos trabalhos, local novo, tudo novo, e para isso, recesso de 2 semanas. Tédio, sentindo falta ja.", "Fri Mar 18 15:17:30 ": "Sou confiante dmais em Deus, e acho que se Ele permite tais casos é pq sabe mto bem oq tá fazendo. E estamos preparadas pra esta benção.", "Sat Mar 26 04:03:03 ": "Terei duas sextas feiras de folga. Ah como eu queria curti elas do meu jeito, em silêncio, só vendo TV, pois dpois do dia 07 acabou folga.", "Wed Mar 23 12:22:51 ": "Apesar da chuva, foi bem legal. O final coloquei várias musicas dos anos 80, jovem guarda, foi emocionante. Quem ñ era da epoca divertiu.", "Sun Mar 13 00:51:51 ": "tanto tempo. saudades daki.", "Wed Mar 23 14:38:21 ": "Estou aqui a 50hras esperando esse office acabar de instalar, to achando que está com defeito. Aff, e ainda tenho mais 2 pcs pra consertar.", "Sun Mar 27 18:24:57 ": "Como o zimzim nao que sair mesmo, o jeito ta sendo tomar uma pinga que ganhei com refri... \"nao gosto de pinga, mas é oq temos pra hoje!\"", "Sun Mar 20 06:30:56 ": "Lucas e Diogo, maravilhosos. Obrigada pela demonstração de talento e carisma. Certeza é mto futuro pela frente. Me senti super orgulhosa hj.", "Sat Nov 19 13:16:24 ": "Conheça e vote no Anthony Valentim, o fofinho que está próximo de ser o Bebê Hipoglós Amêndoas 2011. http://t.co/d6XKtRtT #bbhipoglos2011", "Sat Mar 26 04:04:22 ": "Estou super sem paciência hoje e chatiada com algumas coisas. E vão me desculpar, ñ suporto certos tipos de musicas quando ñ to trabalhando.", "Fri Mar 18 15:23:45 ": "É pra vc que quero entregar a minha vida! Estou te esperando (ass.: mamães!)", "Sun Mar 27 02:50:53 ": "Vou caçar jeito de deitar, tomar algum remedio, tá doendo dmais minha cabeça. Queria dizer mtas coisas por aqui, mas melhor não. Boa noite.", "Sun Apr 11 02:54:29 ": "Me tire desse tronco, a #antartica se faz soberana, mas vc eh maior aki!", "Tue Mar 29 18:34:22 ": "Tá chegando a hora! Breve e bem breve vou me realizar numa das coisas mais esperada por mtas pessoas. Estamos felizes e to com sono.", "Sun Mar 20 06:36:25 ": "É complicado pra quem trabalha a noite, agente troca tudo, eu mesmo funciono melhor anoite. Tudo trocado mesmo. Mas já acostumei. Boa noite.", "Sat Mar 26 04:10:15 ": "Odeio perder tempo com coisas sem nenhuma destinação. Ser virginiano é um saco. Melhor eu sair daqui, to falando demais. Amanhã melhora.", "Sun Apr 11 02:55:29 ": "#CABOCLO EU SOU TUA FILHA, ñ me surre, EU VOLTEI PRA TE SALVAR... EU TE PERDOO! FICA COM DEUS!"}