{"Wed Mar 23 18:08:15 ": "RT @narcisaoficial: Chocada com a morte da Elizabeth Taylor. Hoje vou passar o dia inteiro vestida de cleopatra", "Thu Sep 08 20:30:22 ": "Filme inédito na Sessão da Tarde.", "Fri Apr 08 12:50:52 ": "RT @jotaerreduran: Você sabe que é sexta-feira quando tem pessoas que aparecem dando #FF nelas mesmas. Pode Arnaldo?", "Thu Apr 14 19:35:42 ": "Boa tarde a todos! Fiquei desempregado há dois dias, mas nem deu tempo de ficar sem trabalho. Obrigado Deus!", "Wed Mar 23 18:10:16 ": "RT @FilhoDoOCriador: Nas missas de hoje em dia tem tanta música, que deveriam cobrar couvert ao invés de dízimo. Palavras do Senhor. #Amem.", "Fri Aug 19 22:18:03 ": "Hoje lembrei que ainda possuo twitter. Ainda bem que lembrei a senha.", "Thu Mar 31 12:29:47 ": "RT @novaboatecandy: Só lembrando que amanhã temos a nossa #SextaSonora com o novo Dj e residente Dj Klinger que vai tocar todas ao lado  ...", "Wed Apr 13 12:47:01 ": "Bom dia a todos! Desempregado! Trabalhando em casa agora.", "Thu Sep 08 20:03:33 ": "Boa tarde a todos!", "Fri Mar 25 13:19:45 ": "RT @crisarcangeli: @alvaresromulo depois 4 claras cozidas temperadas c azeite e salsinha e 1 batata doce cozida", "Fri Apr 08 13:00:10 ": "@miacaradegato Quero uma boneca sua da Estrela pra mim. Quando vai lançar? É pra por aqui no escritório, ta tudo amarrado!", "Fri Mar 25 18:06:27 ": "RT @Altomir: A cada hora, minuto, segundo é uma #oportunidade de mudar sua vida. #ESCOLHAS", "Mon Apr 04 12:47:30 ": "RT @SuperMateus: @alvaresromulo @RickMoreno_ Sempre uma ótima opção!", "Sat Apr 09 12:10:56 ": "Bom dia a todos! Já no escritório, depois de ter chegado as 6h00 em casa, da noite!", "Fri Apr 08 13:17:30 ": "@miacaradegato Hidraulica é a chegada que vende roupa usada na Feira da Vila Embratel.", "Sat Apr 09 12:11:14 ": "Mais uma noite para recordação.", "Wed Mar 30 13:48:29 ": "RT @AlessandroEURO: José de Alencar morreu, Maria ganhou o BBB, a Record está a caminho da liderança e Sarney não larga o osso...", "Fri Apr 08 12:49:05 ": "Bom dia a todos! Já no escritório.", "Wed Mar 30 13:37:10 ": "RT @Altomir: Quanto ao #futuro, a sua tarefa não é de prever, mas de ativá-lo.", "Sat Aug 20 00:25:13 ": "RT @Davis_Reimberg: Odeio esse povo q liga na hora da novela, #ultimocapitulo , semancol mandou lembranças!", "Fri Aug 19 22:17:41 ": "Boa noie a todos! Muito tempo sem vir por aqui.", "Sat Apr 02 12:40:32 ": "@RickMoreno_ Traga macarronés de maracujá pra mim do @SuperMateus", "Thu Mar 31 12:52:49 ": "RT @novaboatecandy: RT:: Esta #SextaSonora será imperdível com o novo DJ e residente Dj Klinger que vai tocar todas junto com o @djmacau ...", "Mon Mar 28 14:26:07 ": "Chovendo muuuito! Já estou com medo de perder o horário do meu treino. :-(", "Wed Apr 13 19:08:48 ": "Boa tarde a todos!", "Sat Apr 02 12:11:58 ": "Bom dia a todos!!!", "Fri Mar 25 17:11:29 ": "RT @ofofao: Se Teresina é o c* do mundo, aqui é o períneo, né?", "Thu Sep 08 20:27:04 ": "RT @pauloorion: Acho que Sao Luis inteira teve a mesma ideia que eu: ver o por-do-sol aqui do espigão. #Lotaaadooo!! http://t.co/cfqZezf", "Mon Mar 28 14:15:21 ": "Bom dia a todos!!! Alguém tem dicas da dieta de clara de ovos pra musculação?", "Wed Apr 13 12:52:06 ": "RT @novaboatecandy: Hoje já e quarta, e cada hora que passa chega mais perto de acontecer nossa #SextaSONORA", "Fri Apr 08 13:10:40 ": "@miacaradegato É uma língua! Tu estudou no CEUMA foi?", "Fri Apr 08 13:31:49 ": "@miacaradegato To te esperando pra almoçar aqui no Luzeiros comigo!", "Fri Apr 08 13:07:46 ": "@miacaradegato To precisando de uma assistente pra carregar meus quatro celulares, to quer? Mas tem que atender em Madarim. Tu fala?", "Fri Apr 08 13:05:58 ": "@CarlosTufvesson É bom Tufvesson para refletimos sobre o que há dentro de nós também. A mudança do mundo, começa pela gente.", "Thu Apr 14 20:18:27 ": "@JESUS404 Buenas tardes hijo!", "Fri Mar 25 18:12:21 ": "RT @abranca_: #FF para o Fashionista @alvaresromulo", "Tue Apr 12 11:50:48 ": "Bom dia a todos! Hoje tem teste pra comercial.", "Thu Apr 14 19:49:56 ": "@novaboatecandy Como há muitas sexta-feiras, amanhã estarei novamente na @novaboatecandy", "Mon Apr 04 12:47:24 ": "RT @RickMoreno_: @alvaresromulo Eu não sábia que tinha macarrones no @SuperMateus desculpa vi teu reply agora da próxima vez q eu for te ...", "Mon Apr 11 18:00:20 ": "Boa tarde a todos!", "Wed Mar 23 18:09:06 ": "RT @FilhoDoOCriador: Na Índia a vaca é sagrada, na Europa a vaca é louca, no Brasil a vaca é qualquer amiga do seu namorado. #Amem.", "Fri Apr 08 18:00:03 ": "De volta ao escritório!", "Fri Mar 25 17:01:44 ": "@ofofao Se bem que no Itareque ainda era R$1,00 a cueca. Hoje só se encontra coisas de R$1,99. Ficou caro!", "Sat Apr 02 12:57:10 ": "RT @Altomir: Não julgue as pessoas por seus #talentos e qualificações, mas sim com o q eles fazem com isso!", "Mon Apr 04 12:51:36 ": "Bom dia a todos!!!", "Sat Apr 09 12:34:24 ": "@yaracastroSLZ Também estava la! Foi mágica!!! (@novaboatecandy)", "Thu Mar 24 13:07:06 ": "Bom dia a todos!!!", "Wed Mar 30 13:57:21 ": "@JESUS404 Bom dia querido!", "Thu Mar 31 12:48:32 ": "RT @novaboatecandy: RT: Esta #SextaSonora será imperdível  com o novo DJ e residente Dj Klinger que vai tocar todas junto com o @djmacau ...", "Fri Mar 25 13:20:20 ": "@crisarcangeli Faz alguma diferença se eu não por sal Cris? Obrigado pelas dicas!", "Thu Apr 14 13:56:30 ": "@JESUS404 Bom dia querido! Como está?", "Fri Mar 25 16:42:50 ": "@abranca_ Vou ver pra ver se ela não vai mandar nem um #FF for me.", "Fri Mar 25 13:42:22 ": "RT @andrevaladao: Nossos olhos enxergam aquilo q nosso coração permite focar. Nossos valores estão diretamente ligados àquilo q + invest ...", "Thu Mar 31 13:59:22 ": "RT @PrinceAlvez: Nao vejo a hora de Sabado chegar pra eu ir ferveeeer na @novaboatecandy E nem tentem esconder as vodkas de mim. u.u", "Wed Apr 13 19:22:09 ": "Trabalhando em casa, a gora. Boa tarde a todos!", "Fri Apr 08 12:58:47 ": "@ahickmann Time is money! Time is life!", "Tue Mar 29 13:16:24 ": "Bom dia a todos!!! _entrada no escritório", "Fri Apr 08 13:08:24 ": "@miacaradegato Compra um bikelanche, vai dar menos despesa.", "Thu Apr 14 13:34:22 ": "Bom dia a todos!", "Fri Apr 08 13:21:29 ": "@miacaradegato É peixeira! Faca, é coisa de margina fino!", "Tue May 03 12:40:02 ": "Bom dia a todos! Muita LUZ!", "Thu Apr 07 13:01:36 ": "Bom dia a todos!!!", "Wed Mar 30 13:31:26 ": "Bom dia a todos!!!", "Sat Apr 09 13:01:17 ": "RT @novaboatecandy: RT: #SextaSonora e #Let’sGlam ! Vou me garantir nos 2 ao som dos deejays @vmc @djmacau @klinger e @esteverson =) htt ...", "Mon Mar 28 13:58:14 ": "@crisarcangeli Cris? Qual melhor horário pra ingerir as claras de ovos?", "Fri Mar 25 18:03:26 ": "@raf_albuquerque Te vendo uma sala no São Francisco, conjugada, 25m² cada, por 120. 2º andar!", "Thu Apr 14 20:11:19 ": "O mundo nunca fecha uma porta sem que Deus esteja construindo outra saída pra você!", "Fri Apr 15 18:21:29 ": "Boa tarde a todos! Chegando de reunião e indo pro treino. Depois volto com mais calma. Balada a noite e tenho que está esbelto.", "Thu Apr 14 20:20:18 ": "Vou fazer umas compras, pegar a prima no shopping e jantar em familia... Até a  próxima!", "Fri Apr 08 13:04:57 ": "@miacaradegato hahaha... Nada! Te amo piquena!", "Thu Apr 14 14:13:31 ": "@JESUS404 Pra você também!!! Abraços!", "Fri Mar 25 17:00:59 ": "@ofofao hahahaha, e saudades da prostituição do Colonial? Alguém tem?", "Fri Apr 08 18:09:21 ": "Uma posta de peixe cozido com uma pequena porção de arroz no almoço. 2 bananas no lanche, e 10 claras de ovos no jantar. Pronto p/ night.", "Fri Apr 15 14:37:45 ": "Bom dia a todos!!! Hj não é dia de trabalho. Hoje é sexta, e es tou me arrumando desde cedo pra hj à noite! Hj à noite promete!", "Fri Apr 08 13:11:33 ": "@miacaradegato Vai daqueles \"carrinhos\" que tem la na no Gapara. É R$1,00", "Sat Apr 09 14:54:07 ": "Vou descendo pra casa, mas uma semana sem dormir depois da farra. Até mais! Boa tarde a todos!", "Sat Apr 09 12:57:28 ": "@novaboatecandy #SextaSonora perfeita mais uma vez! Macau, Klinger e gente linda! Tudo de bom!", "Fri Mar 25 13:46:57 ": "RT @narcisaoficial: NY Times me elegeu como a mais ryca do twitter. Amei", "Thu Mar 31 13:57:17 ": "RT @thalesreis: TODOS ANSIOSOS PELO FDS NA @novaboatecandy", "Fri Mar 25 13:19:37 ": "RT @crisarcangeli: @alvaresromulo antes um shake e umas orrdas c queijo branco e peito de peru e um suco", "Fri Apr 08 13:24:15 ": "@miacaradegato Tu já bloqueou o teu da MESBLA?", "Mon Apr 25 13:30:07 ": "Bom dia a todos! Mais uma semana começando toda animada!", "Sat Aug 20 00:25:21 ": "RT @bchateaubriand: Como uma mulher como vitoria drumond nao tem seguro contra sequestro?? Soh novela...", "Fri Apr 08 13:20:22 ": "@miacaradegato Compra no CredShop. Tu começa a pagar só no dia das crianças.", "Sat Apr 02 12:46:15 ": "@abranca_ Mulher forte! Mulher guerreira! Primeira governadora brasileiraaa...", "Sat Apr 02 12:40:01 ": "RT @Altomir: \"A preguiça nada mais é do q o hábito de descansar antes de estar cansado!\"", "Sat Sep 03 20:35:14 ": "Boa tarde!!!", "Fri Mar 25 13:27:12 ": "RT @Altomir: Só pq vc pode, não #significa q vc deve!", "Thu Mar 31 12:30:25 ": "Bom dia a todos!!!", "Wed Apr 20 17:57:55 ": "Boa tarde a todos! Mais um dia de muito trabalho. Resultado: Três dias sem treino.", "Fri Mar 25 12:56:14 ": "@crisarcangeli E o que come antes e depois? Da a dica Cris!!!", "Fri Apr 08 13:19:22 ": "@miacaradegato Flex, é Flecha em inglês. Vem como adcional para se defender quando tu tiver passando com teu carro pelo São Francisco.", "Thu Apr 14 14:18:32 ": "@JESUS404 Qual seu email?", "Fri Apr 08 13:16:33 ": "@miacaradegato Da doida chegada! No ônibus é R$2,10. Faz isso mais barato! Faz promoção de quarta-feira.", "Fri Mar 25 16:42:12 ": "RT @FilhoDoOCriador: Mais vale um passarinho na mão que oito segurando a baleia do twitter. #ProvérbiosModernos. #Amem.", "Fri Mar 25 16:36:56 ": "RT @Altomir: kkkkkkkkk CAMPANHA: dá uma risada p/ deixar #odiabocomraiva - Da RT!", "Sat Apr 02 12:54:49 ": "@novaboatecandy Foi 1000!!! #SextaSonora Klinger e Macau deram show!", "Sat Sep 03 20:35:31 ": "Muito bom o programa do Huck hoje!", "Fri Mar 25 16:56:00 ": "@ofofao Agora é Varejão do Sul besta!!! #MaranhaoNostalgia", "Thu Sep 08 20:20:49 ": "@raynonbala Buenas Tardes!", "Fri Mar 25 12:55:14 ": "Bom dia a todos!!!"}