{"Sun Apr 14 05:43:11 ": "RT @UNoticias: Venezolanos acudieron a votar en Rusia http://t.co/KOLE4JMMwP #14A #TuVoto", "Wed Jan 02 05:19:25 ": "@LoidyFlores feliiiiiz añoooooo 2013 alla vamos!!!", "Sun Apr 14 19:07:01 ": "RT @hcapriles: Mis queridos Estudiantes,es la hora de ustedes,tal como hablamos y acordamos en todo el país #AVALANCHA y #YosoyMovilizador", "Mon Apr 15 02:34:15 ": "RT @estebangerbasi: 1Rectora dCNE tienen un acta de resultados elaborada hace horas donde da a Maduro con diferencia irreversible de 10. ...", "Wed Apr 10 16:40:37 ": "RT @hcapriles: Mérida,ya estamos acá,ya nos vemos!Arriba Mérida!Me dicen que son miles y miles!El 14 seremos millones para construir una ...", "Mon Feb 11 00:39:03 ": "Se le fue.. bendito es el señor! se le fue la mujer pa alla pa nueva york", "Thu Oct 11 16:39:25 ": "@LoidyFlores el sabado jajaja tu no opinas como siempre... Negra inscripciones on! Y yo ready!", "Mon Dec 17 00:57:37 ": "@LoidyFlores @cannoboll @Vane_maldonadoo eso me recuerda es a una gran acidezzz", "Sat Mar 02 22:31:18 ": "@LoidyFlores exito para todos con el favor de dios saldremos excelente!", "Fri Apr 12 04:17:04 ": "Y mientras tanto en la #Hojilla video de la estupida caravana de maduro con la cancion de patria querida.. Por deoooss #HayunCamino.. #14-A", "Sun Apr 14 02:15:52 ": "RT @UNoticias: Se roban 5 toneladas cúbicas de Nutella http://t.co/reF2Tmheaa", "Sat Dec 15 01:36:38 ": "RT @liliantintori: Mi esposo Leopoldo dice que vienen 2 niños en camino 1 el niño Jesus, 2 nuestro bebe @Maternny", "Sun Apr 14 22:13:29 ": "@VoluntadPopular @hcapriles  @MaryJoGFPLiceo manuel antonio carreÑo cerrado,n la fundacion mendoza d maracay, no dejan entrar a los votantes", "Sun Feb 10 03:12:19 ": "@LoidyFlores es que tu sabes ella no se le quiere salir la tierrua bolivariana q lleva por dentro!!!xD", "Mon Feb 25 02:38:15 ": "@LoidyFlores yes!", "Sun Feb 03 02:49:50 ": "@LoidyFlores daleeee sivaa!! Jejeje", "Sun Dec 09 13:57:30 ": "RT @YordanoOficial: El castigo del embustero es no ser creído aún cuando diga la verdad. Aristóteles", "Wed Mar 06 01:08:51 ": "@LoidyFlores marik q rataaaaAa xD!", "Mon Dec 17 13:04:45 ": "RT @alfonsoleon10: Regalo para Geminis ojos turcos, Símbolo de CHi Lín. Y el OM MANI PADME HUM", "Fri Mar 08 23:38:56 ": "@LoidyFlores se murio chavez xD!", "Wed Apr 03 18:26:49 ": "@LoidyFlores yo quiero recuperarme de la vistaaaa aaaah :'(", "Wed Feb 27 03:01:52 ": "RT @LuisChataing: Mujer intentó sacar a un preso de Yare metido en una maleta, no sabía que Lalo había caído preso, Carlos Donoso no qui ...", "Sun Apr 14 20:49:55 ": "RT @JMBergoglioF: Dios esta cubriendo con su manto sagrado hoy a toda venezuela, que atraviesa un proceso electoral, No tengan miedo con ...", "Mon Apr 08 03:33:20 ": "Interesante reportaje ---&gt;\"@UNoticias: Vea cuál es el perfil del que mata \"por nada\" http://t.co/vPmSdOYhIX\"", "Sun Jan 06 17:21:00 ": "RT @DoctorKilo: #EresVenezolanoSi llevaste la arepa envuelta en papel aluminio al colegio.", "Sun Feb 03 02:14:58 ": "@LoidyFlores yo tambieen quiero ver esa pero la ley y el desorden es muy buena no pare de reir!!!!", "Wed Mar 06 01:10:02 ": "@LoidyFlores jajajjajaja q incertidumbreeee!", "Tue Feb 26 02:55:20 ": "A olvidar todo lo q dije ayer..............", "Wed Jan 02 05:23:12 ": "#DiganLaVerdadSobreChavez diganlaaaa", "Mon Feb 25 02:41:32 ": "@LoidyFlores jajaja xD!", "Fri Apr 12 03:42:38 ": "RT @Pedrovenezuela: @carlorozco1 En una hipotética victoria de tu burro candidato, tu vas a ser el primer inscrito en la escuela de mong ...", "Wed Feb 13 00:18:07 ": "Mañana el gran opening del 6,30", "Mon Dec 10 11:08:10 ": "Buenos dias sol...", "Mon Feb 25 02:33:07 ": "#mana primera vez q una de sus canciones se parecen a mi vida!!!", "Mon Dec 31 03:29:12 ": "RT @niTanConde: Hay personas que lo único inteligente que tienen es el teléfono.", "Sun Mar 10 15:56:42 ": "RT @VVperiodistas: Para la reflexión: Parodia es cargar un féretro 7 horas por Caracas sin nada adentro", "Mon Feb 11 18:27:27 ": "Van a seguir picando con ese cuchillo e cartón!--&gt; Ministro Arreaza asegura que Chávez analizó imágenes del satélite Miranda", "Sun Dec 16 22:51:27 ": "Porque sera tan irresistible???", "Sun Apr 14 23:49:52 ": "@LoidyFlores menos mal q tengo megas!", "Sun Oct 14 18:30:37 ": "RT @zodiacohoy: Que barbaridad lo que uno logra bebiendo un Red Bull a #FelixBaumgartner si le DIO ALAS Impresionante", "Sun Apr 14 05:32:55 ": "RT @cannoboll: \"camiIacanabaI: RT si tienes #InsomnioElectoral\" @GIBELLI_VIVlANA @LoidyFlores @Vane_maldonadoo @camiIacanabaI", "Fri Apr 12 17:32:23 ": "RT @pedrocastillo: Inclusión es: Incluir bombas lacrimógenas en una sala de teatro repleta de gente. Bombas rellenas con amor revolucion ...", "Sun Apr 14 16:56:11 ": "#yoyavote http://t.co/UQwFNltHDO", "Wed Mar 06 01:15:04 ": "@LoidyFlores estoy q colapso jajajajajja", "Sun Apr 14 05:40:06 ": "RT @camiIacanabaI: Ya votando en Australia, Malasia y Japón... Y no Nicolás, no es trampa imperialista, es que la tierra es redonda y al ...", "Wed Apr 10 20:41:35 ": "RT @laureanomar: ...tenemos que construir un país diferente...más seguro y justo que el que tenemos", "Sun Mar 03 02:47:38 ": "Hahahaha se botaron con ese #HarlemShake de sabado en la noche!!", "Fri Apr 12 03:40:45 ": "Mongolico? Mongolico tu nicolas! #respetavale !", "Mon Feb 25 04:01:05 ": "Ya termino el de los chistes malos??? O un poquito mas???", "Sun Dec 30 12:55:50 ": "RT @liliantintori: Deseo para el 2013: trabajar por el medio ambiente, Cuidar nuestros parques naturales. ECOLOGÍA!", "Mon Feb 11 02:47:04 ": "Uyyy no engavetamos la esperanza de la gente!! No fue conmigo y me dolio!", "Wed Jan 02 15:23:59 ": "RT @liliantintori: Felizzzzzzzz día!!! Ordena tus ideas y tareas!", "Thu Oct 11 02:24:39 ": "de vez en cuando de cuando en vez", "Sun Feb 10 03:15:34 ": "Ojala q al decir q soy chavista mejoren mis ofertas d trabajo, pero no c retractaron 2 y ya no stare n 2 obras! Igual pongo rodilla n tierra", "Wed Mar 06 01:09:32 ": "@ManuelBustama11 y yo en conta! Q incertidumbre!!", "Wed Feb 20 21:53:13 ": "Estoy enamorada y tu amor me hace grande! xD! Jajajajaja", "Wed Mar 06 01:12:11 ": "Me encanto ese estuche jajajajaja", "Wed Feb 20 21:51:12 ": "@Vane_maldonadoo parfavaaaar como nos vas hacer esa pregunta xD!", "Sun Feb 17 03:31:28 ": "Wow! Jeremy evans!! Le echó! Jajajaj", "Sun Apr 07 03:02:46 ": "RT @globovision: #ServicioPúblico Solicitan donantes de sangre de cualquier tipo para triatleta en Barcelona http://t.co/v91YOGzBt1", "Mon Dec 17 01:58:28 ": "@LoidyFlores creo que a todos nos sorprendio fue un golpe que nadie lo esperaba", "Tue Feb 26 23:23:31 ": "RT @Lacelis: Que Argo ni que nada...mujer trata de sacar en una maleta a un preso de Yare 2 ...esta no es una historia perfecta para hol ...", "Fri Apr 05 18:08:14 ": "Primero Voto luego existo #YoSoyVenezolano", "Mon Feb 25 02:35:25 ": "@LoidyFlores Hahahahah!!! No es precisamente la loca de muelle xD!!", "Sun Mar 03 23:27:21 ": "RT @Rociohiguera: Por si aún no lo han visto, aquí está RT @sabadoenlanoche: Harlem Shake Sábado en la Noche: http://t.co/iEhPmlH8Oo vía ...", "Wed Mar 06 00:49:51 ": "@LoidyFlores siiiii por dios mi pruebaa cuando podre saber mi nota dios santoooo!!!", "Mon Feb 25 02:31:31 ": "@LoidyFlores upa calorrr!! Uff", "Mon Feb 25 02:54:01 ": "@LoidyFlores nei nei jajajaja", "Sun Apr 14 05:36:27 ": "RT @GIBELLI_VIVlANA: #ElVotoesMasSecretoQue el verdadero día en que murió Chávez!", "Thu Oct 11 16:32:01 ": "@Vane_maldonadoo el lunes nooo yo me voy de vieje express :'(", "Sun Feb 10 03:06:33 ": "No entiendo el chavismo de susej!!!", "Wed Mar 06 01:22:23 ": "@LoidyFlores jajajajaja ratona verdad q si!", "Mon Dec 17 00:59:51 ": "te lo agradezco pero no!", "Fri Apr 12 05:58:29 ": "Xq la gente no se despedira cuando va a descansar en twitter???. Bueno yo si!, buenos dias voy a dormir..! :)", "Mon Dec 17 00:56:43 ": "@LoidyFlores @cannoboll @Vane_maldonadoo jajajaja mil años despues respondo! eso me recuerda es a una gran acidez", "Sun Feb 10 03:22:22 ": "Ayy susej tu no querias hablar de eso pero bueh! Quien te manda a poner rodilla en tierra!!", "Wed Jan 02 23:22:11 ": "RT @UNoticias: Estos son los feriados laborales y bancarios de 2013 http://t.co/ICh4m8TR http://t.co/9JaMun8z", "Mon Feb 25 02:29:48 ": "!!Me encantaria poder vivir sin ti.. Pero no puedo!! ---Uff---", "Mon Feb 11 02:39:13 ": "Que linda la nueva familia del kino tachira!", "Wed Dec 19 03:59:54 ": "RT @CiudadBizarra: Persigue tus sueños así como los cobradores que te siguen cuando les debes dinero.", "Sun Oct 14 17:51:34 ": "Como hace Felix Baumgartner si le pica la nariz???", "Sun Feb 10 03:16:29 ": "@LoidyFlores obvio tienen cara de miedo como que si siguen hablando la van es a esmoñar!! Jajaja", "Tue Dec 18 12:04:01 ": "RT @ElNacionalWeb: La ola de frío mata a 37 personas en Ucrania http://t.co/sjkjUqYI", "Sun Apr 14 02:16:52 ": "Una d esas noticias locas como para romper con l estres electoral @UNoticias: Se roban 5 toneladas cúbicas de Nutella http://t.co/A7nTfM31LZ", "Tue Feb 26 02:56:40 ": "#Viña2013 \"@niTanConde: Esta vaina es como una orquídea pero como si la patrocinara PDVSA.\"", "Thu Mar 21 02:01:48 ": "Es facil echarle la culpa a un muerto!...", "Fri Apr 12 16:50:45 ": "Muy sabios y buenos consejos jeje -----&gt;\"@CNNEE: 10 tips para parecer un verdadero neoyorquino en Nueva York: http://t.co/F6UdqS4SY1\"", "Mon Jan 07 19:05:53 ": "@LoidyFlores en tu casa?", "Sun Apr 07 15:28:01 ": "RT @niTanConde: El gobierno cree que con apagones en el metro y obstáculos por todos lados nos van a detener. Llegamos COMO SEA a la Bol ...", "Sun Mar 03 23:18:10 ": "@MariacaSemprun cuando maracay con LaLupe?? quiero llevar a mi mama :)", "Thu Oct 11 16:35:59 ": "@LoidyFlores jajaja repito viaje express ni yo misma sabia que voy a viajar xD", "Sun Apr 14 16:57:31 ": "#YaVoté http://t.co/7tlZKPoZiN", "Tue Feb 26 18:02:43 ": "Tu y yo no somos culpables... Pero somos vulnerables, son las cosas de la vida.. Que me quedan por vivir... Duele el amor!! *music*", "Wed Mar 20 11:30:35 ": "RT @VitaStoreCcs: ¿Por qué cantan los gallos al amanecer? Y los ritmos circadianos http://t.co/yceWelzzX7", "Mon Dec 17 01:03:16 ": "algo no muy usual en mi... escuchando rancheras mientras espero los resultados electorales!", "Thu Mar 21 02:02:19 ": "RT @leopoldolopez: Las medidas economicas q ha tomado en estos 100 dias y q quiere tomar el mentiroso, cobarde y canalla de Nicolas, son ...", "Sun Feb 03 01:42:33 ": "@LoidyFlores esa tambien la quiero veeer!! Pero la ley es demas de buena no pare de reirme!!!!", "Sun Feb 17 03:20:40 ": "A kerly no la quiere es nadie!", "Sun Feb 03 00:55:34 ": "@LoidyFlores todo finoo mientras viendo una peliculita venezolana!!! La ley y el orden y el desorden se las recomiendooo!!!", "Tue Feb 19 00:47:24 ": "@LoidyFlores llorar negra definitivamente umju!! :'(", "Fri Mar 08 23:59:06 ": "@LoidyFlores jajaja la noticia fue igual de debastadora :'("}