{"Wed Apr 17 16:08:59 ": "@RandyBagas gwe..ga nanya haha. cm dibilang titip servis..", "Thu Apr 04 04:21:15 ": "RT @venustweets ya ampun jam 11? belum tidur dari kemaren. ampun :(", "Fri Mar 29 09:46:22 ": "RT @deritamahasiswa: sebagian orang harus belajar sabar buat nggak mencet2 klakson di lampu merah sebelum lampu hijaunya nyala.", "Thu Apr 04 04:21:39 ": "RT @RandyBagas punya temen kok baik semua ya? #hiks terima kasih Gusti Yesus. #terharu", "Wed Apr 17 11:19:52 ": "@Tyasfebiani haha mungkin krn dy yg di promote jd artis ato mgkn emg director wgm nya maunya dy XD i prefer naeun tho~", "Tue Apr 02 04:40:59 ": "I'm at Summarecon Mal Serpong 2 (Tangerang, Banten) w/ 3 others http://t.co/8ULMaLhLyo", "Tue Apr 16 16:23:07 ": "@cicicind kyaaa cindy", "Fri Mar 29 09:49:17 ": "croissant yg abis dipanggang itu.............enak bgt TT__TT", "Sat Apr 13 11:11:07 ": "@ygschiffer drama korea itu ending nya slalu gantung ato ga jelas, emg males..haha sama lg nyari tontonan jg, susah nemu show bagus", "Tue Apr 09 03:40:57 ": "#pfft RT @deritamahasiswa Kisi-kisi UTS nya apa aja pak? | Pelajari semua materi pertemuan 1 sampai pertemuan hari ini. | ....", "Tue Apr 16 10:54:36 ": "@astarianadya aku cm foto aj koq, ga smpe wawancara private gtu haha. klo konsernya gd ntn dong?", "Fri Apr 12 15:02:34 ": "@thereciaonion followback bsa kali kak :(", "Wed Apr 17 15:25:53 ": "@stareve21 eru di lapangan D senayan", "Wed Mar 27 07:29:26 ": "RT @wilzkanadi: Never trust your negative thoughts. They just want to destroy you.", "Sat Mar 30 14:34:16 ": "RT @autocorrects Bad guys in movies: \"But before I kill you, I want to tell you this really long story so you can be saved.\"", "Fri Apr 12 11:56:32 ": "opening act di event kpop itu emg bner2 prlu ato buat menuh2in aj ya shenernya?", "Wed Apr 17 15:29:55 ": "@cicicind mggu ini doang cin? D:", "Wed Apr 17 15:30:49 ": "@jsscanatasha emgnya lemon bsa dijadiin toner? O__o ga trlalu keras jes kandungannya?", "Sat Apr 13 10:37:47 ": "@ygschiffer mau disatuin tp bingung haha tp abis season 2 break lg kan lama?", "Sun Mar 31 14:58:33 ": "RT @ilmukesehatan: Biasakan olahraga seminggu 2x untuk menjaga jarak dg penyakit :) 30 menit cukup kok.", "Wed Mar 27 10:02:52 ": "looks yummy RT @tangerangnow Nyamm,,, Kombinasi Menu Asian-Western di Satu Restoran http://t.co/rx5GdboLB5", "Wed Apr 17 13:59:50 ": "fanmeet sih ya pfft RT KakaoTalkINA Untuk yg bertanya mengenai kamera, kami sarankan bw kamera pocket saja, tp jg tdk melarang kamera SLR", "Fri Mar 29 09:45:00 ": "RT @sepatumerah: Lo cerita ke satu orang, cerita lo bisa berubah pas dia nyeritain ke org lain. Kalo lo cerita ke timeline? Ya versinya  ...", "Tue Apr 16 00:02:54 ": "RT @TraxFMJKT: #MorningZone | Video Guitar Tutorial ALDY DERY --&gt; Cuma dgn kunci G &amp; C, lo bisa mainin banyak lagu! http://t.co/d ...", "Tue Apr 16 16:03:30 ": "@escajessica lampu tidur gwe jg rusak! haha gwe smpe ber hari2 ga bsa tdur langsung", "Wed Apr 17 14:37:20 ": "@stareve21 di claim deh coba haha drpd ga dpt. bilangin yg dpt emailnya. klo jd ntn kasi tau aku vi", "Fri Apr 12 11:58:05 ": "kan ya misalkan 1 jam buat opening act, jd acara sbenernya jd cm 1 jam klo acaranya 2 jam? haha", "Wed Apr 17 08:16:07 ": "@RandyBagas kyny pnh kepentok, trus jd ga mo fokus gtu, geter n bunyi pas mau fokus. beh mahal ya haha =__=", "Tue Apr 16 15:11:49 ": "@astarianadya kmarin2 ad lowongan di detik buat photo journalis kyny kak? hehe aku di media online ga full time jd blom dpt fee", "Mon Apr 08 19:05:26 ": "RT @JakartaVenue: Gempa Mag:5.5 SR 9 April 2013 01:53:42 WIB, 10 Km (84 km Tenggara PANDEGLANG-BANTEN ) http://t.co/On9y5J3kqc via @infoBMKG", "Fri Mar 29 07:30:59 ": "RT @officialdwike Si @claraleonita kalo bbman itu suka menghilang dadakan ya...? ('́_'̀)", "Fri Mar 29 09:45:25 ": "RT @sepatumerah: Kalo ada yg bilang 'kayak gini doang sih gue bisa bikin!', ga perlu nungguin dia bikin beneran, ga bakal. :))", "Sun Mar 31 14:58:18 ": "RT @ilmukesehatan: Apabila anda biasanya makan 3x sehari, selama program penggemukan badan, anda harus meningkatkan intensitas tersebut  ...", "Thu Mar 28 10:24:30 ": "I'm at Tous Les Jours (Tangerang, Banten) http://t.co/dpa4qBh8NP", "Wed Apr 17 13:56:45 ": "@jsscanatasha @stareve21 yg bawa ksini yg promotor mubank kmaren itu sii. haha ga heran nekat", "Tue Apr 16 13:55:34 ": "@ygschiffer bb 10 sebagus itu kah?", "Mon Apr 15 15:59:54 ": "RT @v_raffleyn: Teman yang mau diajak bercakap-cakap walaupun isinya meaningless, biasanya adalah orang yang hatinya tulus.. Tulus u/ me ...", "Tue Apr 16 10:46:31 ": "@astarianadya mungkin kak. klo dsuruh ksana aku kesana. hehe. utk ngeliput. kakak dateng? free gtu agak susah", "Tue Apr 16 13:42:53 ": "RT @social_junkee: Migrating to android from blackberry is now a life achievement?", "Fri Apr 12 14:56:42 ": "duo ganteng RT @flickmagazine Penasaran liat aksi Ryan Gosling &amp; Bradley Cooper di 'The Place Beyond the Pines'? - http://t.co/1pW7dY1yTS", "Tue Apr 09 03:41:17 ": "RT @nithatan Ga senyum sama rude itu berbeda...", "Tue Apr 16 10:55:13 ": "@astarianadya oya blom kenalan kak, aku jessica, masih kuliah..hehe. kakak sering backpacking kemana aj?", "Wed Apr 17 10:47:18 ": "@Tyasfebiani karena eunji lg hot2 nya. lol", "Mon Apr 08 09:50:02 ": "RT @kompascom: Kini, Uang Denda Tilang Tak Lagi Dititipkan ke Polisi  http://t.co/9btzkSbdI4", "Tue Apr 02 13:08:37 ": "RT @shitlicious: Kalo ada motor tabrakan ama mobil, pasti yg disalahin mobil. Walaupun motornya ngeduluin dr kiri &amp; mendadak belok k ...", "Tue Apr 02 04:36:32 ": "I'm at Carl's Jr. (Tangerang, Banten) http://t.co/p2LTuMPk6b", "Wed Apr 17 13:57:18 ": "@stareve21 dikasih terus prgi ga vi? oya dikasih drmn haha bukannya daftar pake email gtu ya? gwe dpt 2 malah", "Tue Apr 16 15:33:07 ": "@EugeniaEmily gweee? haha ga deh, kursus foto aj boleh?", "Sat Apr 13 10:45:38 ": "@ygschiffer haha iya followers nya uda beda2. lagian rata2 org bukannya pny 2 acf gtuvya buat spazz? lol twd jg oktober baru mulai lg", "Wed Apr 17 15:54:21 ": "@stareve21 yowda kita ktemu hari mggu aja apa? aku jg mo liad korean festival nya haha", "Fri Apr 12 10:58:54 ": "@danshellia ahh nonton dmana project runway?", "Wed Apr 17 01:34:35 ": "@EugeniaEmily haha oh yg itu gwe tau haha iya emg jarang kursus gtu n jg mahal biasanya. paling workshop yg byk", "Sat Apr 13 10:10:09 ": "RT @_joaru: Kemarin-kemarin Silk Air dari Singapore ke Solo juga mendaratnya jadi telat karena \"ada pendaratan darurat oleh Lion Air\". H ...", "Thu Mar 28 10:29:07 ": "I'm at Summarecon Mal Serpong 2 (Tangerang, Banten) w/ 5 others http://t.co/V0Pa5Nbknf", "Tue Apr 16 15:04:47 ": "mau nonton lenka ;__;", "Thu Mar 28 07:01:55 ": "@pendekarlagi fani itu fotokopi kwn ada sama gwe, mau gmana ngambil nya ya gwe bingung. blom difotokopi. tau contactnya ktua kelas?", "Thu Apr 04 17:23:09 ": "jadi walking dea season baru nya cm muncul tiap oktober? oh man", "Mon Apr 15 15:59:41 ": "RT @MerryRiana: Jangan sampai sebuah hubungan merusak persahabatan. Juga jangan sampai persahabatan merusak sebuah hubungan. ", "Wed Apr 17 10:44:10 ": "RT @deritamahasiswa: berterimakasihlah kepada penemu colokan, tanpa mereka smartphone kita takkan ada artinya.", "Wed Apr 17 10:27:27 ": "@bliblidotcom saya kemarin ada kirim email ke customer service menanyakan ttg stock hp LG, knp belum dibalas ya?", "Tue Apr 16 06:22:01 ": "@arbainrambey abis di service, klo shutter rusak, bsa dipakai lg dgn kamera yg sama? biaya service nya semahal lensa kah?", "Sun Mar 31 14:59:21 ": "RT @ilmukesehatan: Guys! Orang yg terlalu sering begadang memiliki performa otak sperti 3-5 tahun lebih tua dri aslinya :( siapa yg suka ...", "Sun Mar 31 14:55:44 ": "RT @blogdokter: Tidur siang itu cukup 30 menit dan ini harus dibiasakan. Manfaat tidur siang bagi kesehatan sangat besar. #KonKes @Fisca ...", "Mon Apr 01 18:57:06 ": "@nithatan you're meeting the script this week?! *envy* lolol", "Sun Apr 14 18:19:24 ": "@astarianadya mungkin bln agustus :) abis ied kak ktny", "Wed Apr 17 10:23:58 ": "@RandyBagas gwe bukan 2-2nya. pake sony. haha. lensa nya pake sigma", "Wed Apr 17 13:23:41 ": "@RandyBagas klo garansi sih bsa ke gunung sahari. gwe titip service di tmpat gwe bli lensanya di tangcity,cengga tau dbawa kmana. haha", "Sat Apr 06 14:16:54 ": "RT @infojakarta: http://t.co/WrSkwlODhk Penasaran sama tampilan BB10? Ini dia caranya mencoba BB10 dari Android dan iPhone kamu..", "Wed Apr 17 07:52:03 ": "benerin lensa yg gear nya rusak itu mahal..huhu padahal kebenturnya jg ga jelas kpn, ga kenceng jg kyny", "Sat Apr 06 06:39:36 ": "RT @missciccone: Shit happens. Just flush it afterwards.", "Wed Apr 17 14:36:46 ": "@stareve21 iya emg ditunggu email e-ticket nya dr tgl 19-21 april, aku jg masi nunggu haha. tgl 20 april vi", "Mon Apr 08 19:06:01 ": "beberapa org merasakan gempa dan gwe engga. mesti lbh peka deh", "Fri Apr 12 14:52:55 ": "mau roppan RT @deLclaire Pengen ropang :s", "Thu Apr 04 16:51:06 ": "RT @OMGFacts: In a room of 23 people, there is a 50/50 chance that two of them share a birthday! Details here ----&gt; http://t.co/bTRIFsZi", "Sun Mar 31 13:11:04 ": "ini yg rusak autofokus di body SLR nya ato lensa tele nya sih..huhu ㅠㅠ", "Tue Apr 16 12:19:54 ": "@astarianadya aku ga freelance tp jd foto-jurnalis di media kak. hehe. aku justru blom pnh backpacking :( pngen tau ky gmana", "Fri Apr 12 11:31:47 ": "woop RT @CentralParkMall Buy 1 Get 1 Free Pancake every weekday (Monday-Friday) at @nannyspavillon (SOGO Central Park - Ground floor).", "Wed Apr 17 14:35:02 ": "RT @GNFI: Management Terminal 2 Juanda Sby nantinya bekerjasama dgn Incheon Airport (Korsel), termsk dlm design interior http://t.co/5PY ...", "Tue Apr 02 10:49:30 ": "@nithatan bungkusin danny bsa kali..bahaha", "Wed Apr 17 15:25:36 ": "@stareve21 hari sabtu vi pokoknya..haha km mo ntn jinjo tgl brp? uda liad jadwal dy tampil? http://t.co/j2yeKjb4aO aku si mo dtg eru", "Fri Apr 12 14:48:31 ": "RT @GNFI: Thn 2011,  rendang ada di\nno I, Nasi Goreng No 2, \"World's 50 Most Delicious Foods/50 makanan terlezat di dunia\" versi CNNGo", "Tue Apr 16 13:42:17 ": "@EugeniaEmily woww emil mau class catwalk?", "Tue Apr 16 08:51:20 ": "@astarianadya haha mungkin krn event kpop di bulan lain uda penuh kak", "Wed Apr 17 07:59:50 ": "@RandyBagas meskipun mainin lagu yg sama2 simple?", "Tue Apr 16 15:02:25 ": "@EugeniaEmily belomm! hoho baguss biar ntar tambah jago jd model ya mil *kedip-kedip* hahaha", "Mon Apr 15 15:02:54 ": "@layla_christina kyny agustus, blom ad tanggal pastinya sih :)", "Wed Apr 17 13:34:03 ": "@stareve21 @jsscanatasha eru bukan ke TA vi, itu beda acara. haha eru dateng bawa ailee gwe mo nonton gratisan", "Mon Apr 01 05:44:45 ": "gawat mer! @MerlinChandra RT SMS_Serpong Hanya Rp 18.000 dengan 2 Ayam+Nasi &amp; Minum Sepuasnya di Carl's Jr. http://t.co/nZFww2AUUC", "Wed Apr 17 08:11:19 ": "@RandyBagas oya btw lhuw pnh service gear lensa ga? bsa smpe kena 600k ya? *baru kejadian*", "Thu Apr 11 14:49:41 ": "joong ki bakal dtg indo bntar lagiiii hahhhh", "Tue Apr 16 16:02:44 ": "RT @beesherly need me time, do some stuff. make something, not only assignment projects.", "Tue Apr 09 03:58:39 ": "RT @umn_serpong: UMNICTUpdate : RT @kompastekno: Mana Paling Tidak Aman, Android atau iPhone? http://t.co/wPEsFem54v", "Wed Apr 17 13:27:47 ": "@jsscanatasha @stareve21 di TA 19-21 april ada korea festival jes, yg bawa mrk KTO. jinjo crew itu yg mana gwe lupa. ingetnya jump. haha", "Tue Apr 16 16:21:05 ": "@escajessica klo ga gelap gwe susah tidur :( klo trlalu gelap ga ad lampu kecil jg ga bsa. haha", "Thu Apr 04 16:51:40 ": "@ayuooz halo cici ayu. hahaha", "Sun Apr 14 09:01:43 ": "RT @oktiyahaniarti Kulit saya makin coklat.....coklat..coklat haaaa -.-", "Wed Apr 17 08:39:14 ": "@RandyBagas gwe jg masi ad garansi cm ga bsa dipake gara2 bon nya uda ga ada..huhu", "Wed Apr 17 16:09:54 ": "@jsscanatasha itu bneran boleh jes? haha setau gwe itu buat di oles dikit bukan buat toner", "Fri Mar 29 08:17:29 ": "path sama pinterest itu logonya mirip bgt. 1 produk kah?", "Sat Mar 30 10:04:50 ": "RT @infojakarta http://t.co/YuSGhxv30K Jakarta-Tangerang akan kebagian pemadaman bergilir dr tgl 1-5 April 2013. Berikut jadwalnya..", "Thu Apr 04 06:44:24 ": "RT @fotografidesain: Baseline Progressive akan menampilkan image di web browser sembari didownload (seperti download progress indicator)"}